[
    {
        "year": "2021",
        "name": "ANCS 2021",
        "info": "Layfette, IN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2021",
                "sub_name": "ANCS '21: Symposium on Architectures for Networking and Communications Systems, Layfette, IN, USA, December 13 - 16, 2021.",
                "count": 24,
                "papers": [
                    "Improving the Resilience of Fast Failover Routing: TREE (Tree Routing to Extend Edge disjoint paths).",
                    "Macchiato: Importing Cache Side Channels to SDNs.",
                    "Shortcutting Fast Failover Routes in the Data Plane.",
                    "KickTree: A Recursive Algorithmic Scheme for Packet Classification with Bounded Worst-Case Performance.",
                    "Enhancements for Hardware-based IEEE802.1CB embedded in Automotive Gateway System-on-Chip.",
                    "On Efficient Oblivious Wavelength Assignments for Programmable Wide-Area Topologies.",
                    "Mahjong: A Generic Framework for Network Data Plane Verification.",
                    "A Framework for Reproducible Data Plane Performance Modeling.",
                    "ExRec: Experimental Framework for Reconfigurable Networks Based on Off-the-Shelf Hardware.",
                    "The Cost of Stateless Network Functions in 5G.",
                    "No-hop: In-network Distributed Hash Tables.",
                    "Invenio: Communication Affinity Computation for Low-Latency Microservices.",
                    "High-Performance Match-Action Table Updates from within Programmable Software Data Planes.",
                    "Writing P4 compiler backend for packet processing engines.",
                    "Generic change detection (almost entirely) in the dataplane.",
                    "Heavy Hitter Detection on Multi-Pipeline Switches.",
                    "Realizing Zenoh with programmable dataplanes.",
                    "Towards a Framework for One-sided RDMA Multicast.",
                    "Kubernetes Load-balancing and related network functions using P4.",
                    "Towards a more programmable and performance-optimized Virtual Switch: Introducing P4 programmability within OVS.",
                    "Achieving End-to-End Network Visibility with Host-INT.",
                    "Mitigation of IPv6 Router Spoofing Attacks with P4.",
                    "Building an Internet Router with P4Pi.",
                    "Networked Answer to \"Life, The Universe, and Everything\"."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ANCS 2019",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2019",
                "sub_name": "2019 ACM/IEEE Symposium on Architectures for Networking and Communications Systems, ANCS 2019, Cambridge, United Kingdom, September 24-25, 2019.",
                "count": 29,
                "papers": [
                    "P4MT: Multi-Tenant Support Prototype for International P4 Testbed.",
                    "Multivariate Time-Series Prediction for Traffic in Large WAN Topology.",
                    "How to measure the speed of light with programmable data plane hardware?",
                    "A Feature-based Video Transmission Framework for Visual IoT in Fog Computing Systems.",
                    "Graph-To-P4: A P4 boilerplate code generator for parse graphs.",
                    "The Impact of Thread-Per-Core Architecture on Application Tail Latency.",
                    "Asynchronous Extern Functions in Programmable Software Data Planes.",
                    "Towards A Marketplace for Multi-domain Cloud Network Slicing: Use Cases.",
                    "INetCEP: In-Network Complex Event Processing for Information-Centric Networking.",
                    "Empirical Predictability Study of SDN Switches.",
                    "BPFHV: Adaptive Network Paravirtualization for Continuous Cloud Provider Evolution.",
                    "A Service-Agnostic Software Framework for Fast and Efficient in-Kernel Network Services.",
                    "Towards Understanding the Performance of P4 Programmable Hardware.",
                    "Accelerated DDoS Attacks Mitigation using Programmable Data Plane.",
                    "Random Linear Network Coding on Programmable Switches.",
                    "TabTree: A TSS-assisted Bit-selecting Tree Scheme for Packet Classification with Balanced Rule Mapping.",
                    "Using P4 on Fixed-Pipeline and Programmable Stratum Switches.",
                    "Cryptographic Hashing in P4 Data Planes.",
                    "Perfect is the Enemy of Good: Lloyd-Max Quantization for Rate Allocation in Congestion Control Plane.",
                    "Sketch-based Entropy Estimation for Network Traffic Analysis using Programmable Data Plane ASICs.",
                    "P4-NetFPGA-based network slicing solution for 5G MEC architectures.",
                    "A Low-Cost and Energy-Efficient NoC Architecture for GPGPUs.",
                    "Cuckoo Counter: A Novel Framework for Accurate Per-Flow Frequency Estimation in Network Measurement.",
                    "The Case for Writing Network Drivers in High-Level Programming Languages.",
                    "daPIPE a Data Plane Incremental Programming Environment.",
                    "User Space Network Drivers.",
                    "Offloading data plane functions to the multi-tenant Cloud Infrastructure using P4.",
                    "P4DNS: In-Network DNS.",
                    "A Traffic Anomaly Detection Method based on Multi-scale Decomposition and Multi-Channel Detector."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ANCS 2018",
        "info": "Ithaca, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2018",
                "sub_name": "Proceedings of the 2018 Symposium on Architectures for Networking and Communications Systems, ANCS 2018, Ithaca, NY, USA, July 23-24, 2018.",
                "count": 25,
                "papers": [
                    "Dark packets and the end of network scaling.",
                    "Grafting sockets for fast container networking.",
                    "Bayesian factor analysis and performance measurement of the Linux forwarding architecture.",
                    "Cuckoo++ hash tables: high-performance hash tables for networking applications.",
                    "Scalable high-speed NDN name lookup.",
                    "Network-wide routing-oblivious heavy hitters.",
                    "Evaluating the performance of software NICs for 100-gb/s datacenter traffic control.",
                    "Characterizing the algorithmic complexity of reconfigurable data center architectures.",
                    "PFCA: a programmable FIB caching architecture.",
                    "Regular expression matching with pipelined delayed input DFAs for high-speed networks.",
                    "Data-driven resource flexing for network functions visualization.",
                    "VNF chain allocation and management at data center scale.",
                    "FTvNF: fault tolerant virtual network functions.",
                    "Umbrella: a unified software defined development framework.",
                    "Position-aware cuckoo filters.",
                    "Towards a highly scalable network tester.",
                    "Network traffic adaptive S-MAC protocol for wireless sensor network.",
                    "LAMP: prompt layer 7 attack mitigation with programmable data planes.",
                    "Toward incremental FIB aggregation with quick selections (FAQS).",
                    "Query language for large-scale P4 network debugging.",
                    "VNF chain abstraction for cloud service providers.",
                    "Evaluating the benefits of caching and stateless forwarding in mobile information-centric networks.",
                    "Multi-core HTB for bandwidth sharing.",
                    "APF: fast network all-pair reachability calculation.",
                    "Application-transparent scheduling of socket system calls on many-core systems."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ANCS 2017",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2017",
                "sub_name": "ACM/IEEE Symposium on Architectures for Networking and Communications Systems, ANCS 2017, Beijing, China, May 18-19, 2017.",
                "count": 24,
                "papers": [
                    "Improving Backpressure-based Adaptive Routing via Incremental Expansion of Routing Choices.",
                    "Using Indirect Routing to Recover from Network Traffic Scheduling Estimation Error.",
                    "ZeroSDN: A Highly Flexible and Modular Architecture for Full-Range Network Control Distribution.",
                    "BPFabric: Data Plane Programmability for Software Defined Networks.",
                    "Designing Virtual Network Functions for 100 GbE Network Using Multicore Processors.",
                    "Enhancing Scalable Name-Based Forwarding.",
                    "Controlling Strategy Retransmissions in Named Data Networking.",
                    "On Incremental Deployment of Named Data Networking in Local Area Networks.",
                    "OpenSched: Programmable Packet Queuing and Scheduling for Centralized QoS Control.",
                    "Rule Compilation in Multi-Tenant Networks.",
                    "Virtual Network Embedding in Hybrid Data Centers.",
                    "Building Fast but Flexible Software Routers.",
                    "CODIS: A New Compression Scheme for Bitmap Indexes.",
                    "On the Latency Benefits of Edge NFV.",
                    "P5: Programmable Parsers with Packet-level Parallel Processing for FPGA-based Switches.",
                    "An Attack-Resilient Source Authentication Protocol in Controller Area Network.",
                    "Time Pattern Analysis of Malware by Circular Statistics.",
                    "Detecting Remote Access Trojans through External Control at Area Network Borders.",
                    "RwHash: Rewritable Hash Table for Fast Network Processing with Dynamic Membership Updates.",
                    "Statistical Optimal Hash-Based Longest Prefix Match.",
                    "SLIM: Enabling Transparent Extensibility and Dynamic Configuration via Session-Layer Abstractions.",
                    "Life on the Edge: Unraveling Policies into Configurations.",
                    "Mind the Gap - A Comparison of Software Packet Generators.",
                    "ClassBench-ng: Recasting ClassBench after a Decade of Network Evolution."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ANCS 2016",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2016",
                "sub_name": "Proceedings of the 2016 Symposium on Architectures for Networking and Communications Systems, ANCS 2016, Santa Clara, CA, USA, March 17-18, 2016.",
                "count": 26,
                "papers": [
                    "O3FA: A Scalable Finite Automata-based Pattern-Matching Engine for Out-of-Order Deep Packet Inspection.",
                    "Many-Field Packet Classification for Software-Defined Networking Switches.",
                    "HyPaFilter: A Versatile Hybrid FPGA Packet Filter.",
                    "Memory-Efficient String Matching for Intrusion Detection Systems using a High-Precision Pattern Grouping Algorithm.",
                    "High Throughput Forwarding for ICN with Descriptors and Locators.",
                    "PFPSim: A Programmable Forwarding Plane Simulator.",
                    "A Study of Speed Mismatches Between Communicating Virtual Machines.",
                    "BASEL (Buffer mAnagement SpEcification Language).",
                    "Is Memory Disaggregation Feasible?: A Case Study with Spark SQL.",
                    "Stick to the Script: Monitoring The Policy Compliance of SDN Data Plane.",
                    "Links as a Service (LaaS): Guaranteed Tenant Isolation in the Shared Cloud.",
                    "Optimizing VM live migration strategy based on migration time cost modeling.",
                    "Forwarding Strategies for Applications in Named Data Networking.",
                    "ParaRegex: Towards Fast Regular Expression Matching in Parallel.",
                    "Minflate: Combining Rule Set Minimization with Jump-based Expansion for Fast Packet Classification.",
                    "Toward Fabric: A Middleware Implementing High-level Description Languages on a Fabric-like Network.",
                    "Virtual Network Functions Instantiation on SDN Switches for Policy-Aware Traffic Steering.",
                    "Node configuration for the Aho-Corasick algorithm in Intrusion Detection Systems.",
                    "A One-Way Proof-of-Work Protocol to Protect Controllers in Software-Defined Networks.",
                    "P4GPU: Accelerate Packet Processing of a P4 Program with a CPU-GPU Heterogeneous Architecture.",
                    "Cache Sharing Using a Bloom Filter in Named Data Networking.",
                    "Software Defined Networks-on-Chip for Multi/Many-Core Systems: A Performance Evaluation.",
                    "NI + Router Microarchitecture for NoC-based Communication Systems.",
                    "On Data Plane Latency and Pseudo-TCP Congestion in Software-Defined Networking.",
                    "Evaluating Information-Centric Networks in Disconnected, Intermittent, and Low-Bandwidth Environments.",
                    "Enterprise LTE and WiFi Interworking System and A Proposed Network Selection Solution."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ANCS 2015",
        "info": "Oakland, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2015",
                "sub_name": "Proceedings of the Eleventh ACM/IEEE Symposium on Architectures for networking and communications systems, ANCS 2015, Oakland, CA, USA, May 7-8, 2015.",
                "count": 31,
                "papers": [
                    "Disaggregation: The New Way to Build Mega (and Micro) Data Centers.",
                    "Recent Trends in Virtual Network Functions Acceleration for Carrier Clouds.",
                    "Fast Userspace Packet Processing.",
                    "Blueswitch: Enabling Provably Consistent Configuration of Network Switches.",
                    "Comparison of Frameworks for High-Performance Packet IO.",
                    "Lossy Compression of Packet Classifiers.",
                    "Parsing Application Layer Protocol with Commodity Hardware for SDN.",
                    "ORange: Multi Field OpenFlow based Range Classifier.",
                    "Dynamic Optical Switching for Latency Sensitive Applications.",
                    "Optimizing Many-field Packet Classification on FPGA, Multi-core General Purpose Processor, and GPU.",
                    "Virtual Device Passthrough for High Speed VM Networking.",
                    "Reliably Scalable Name Prefix Lookup.",
                    "Synchronizing Namespaces with Invertible Bloom Filters.",
                    "Enabling Correct Interest Forwarding and Retransmissions in a Content Centric Network.",
                    "Linux XIA: An Interoperable Meta Network Architecture to Crowdsource the Future Internet.",
                    "A Systematic Evaluation of Emerging Mesh-like CMP NoCs.",
                    "Caesar: High-Speed and Memory-Efficient Forwarding Engine for Future Internet Architecture.",
                    "Packet Classification Using a Bloom Filter in a Leaf-Pushing Area-based Quad-Trie.",
                    "Distributed Control Plane For High Performance Switch-based VXLAN Overlays.",
                    "Scalable Many-Field Packet Classification using Multidimensional-Cutting Via Selective Bit-Concatenation.",
                    "State Abstraction and Management in Software-Defined Networks.",
                    "Scaling the Performance of Network Intrusion Detection with Many-core Processors.",
                    "Resistance Against Brute-Force Attacks on Stateless Forwarding in Information Centric Networking.",
                    "qSDS: A QoS-Aware I/O Scheduling Framework towards Software Defined Storage.",
                    "A Software Defined Sketch System for Traffic Monitoring.",
                    "An Interest Control Protocol for Named Data Networking Based on Explicit Feedback.",
                    "Transparent Cloud Access Performance Augmentation via an MPTCP-LISP Connection Proxy.",
                    "Name Prefix Matching Using Bloom Filter Pre-Searching.",
                    "FlowShadow: a Fast Path for Uninterrupted Packet Processing in SDN Switches.",
                    "Cloud Customers' Historical Record Based On-Demand Resource Reservation.",
                    "Graph Measures of Network Content-Delivery Energy."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ANCS 2014",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2014",
                "sub_name": "Proceedings of the tenth ACM/IEEE symposium on Architectures for networking and communications systems, ANCS 2014, Los Angeles, CA, USA, October 20-21, 2014.",
                "count": 36,
                "papers": [
                    "Future networking: reconfiguration heartland, challenge and revolution.",
                    "Programmable measurement architecture.",
                    "WASP: a software-defined communication layer for hybrid wireless networks.",
                    "ElastiCon: an elastic distributed sdn controller.",
                    "A packet-in message filtering mechanism for protection of control plane in openflow networks.",
                    "Faithful reproduction of network experiments.",
                    "DiFS: distributed flow scheduling for adaptive routing in hierarchical data center networks.",
                    "Blender: upgrading tenant-based data center networking.",
                    "BCCC: an expandable network for data centers.",
                    "Efficient and programmable ethernet switching with a NoC-enhanced FPGA.",
                    "Laying out interconnects on optical printed circuit boards.",
                    "Integration and QoS of multicast traffic in a server-rack fabric with 640 100g ports.",
                    "Marlin: a memory-based rack area network.",
                    "Caesar: a content router for high-speed forwarding on content names.",
                    "Design patterns for tunable and efficient SSD-based indexes.",
                    "CoRC: coordinated routing and caching for named data networking.",
                    "Secure remote sensing and communication using digital pufs.",
                    "Thermal-aware vacation and rate adaptation for network packet processing.",
                    "Fine-grained power scaling algorithms for energy efficient routers.",
                    "Efficient software packet processing on heterogeneous and asymmetric hardware architectures.",
                    "A purely functional approach to packet processing.",
                    "A scalable routing and admission control model in sdn-based networks.",
                    "High performance multi-field packet classification using bucket filtering and GPU processing.",
                    "QoS aware dynamic power scaling algorithms for deploying energy efficient routers.",
                    "Network monitoring probe based on Xilinx Zynq.",
                    "Network service quality rank: a network selection algorithm for heterogeneous wireless networks.",
                    "Toward terabyte-scale caching with SSD in a named data networking router.",
                    "Spectral clustering based regular expression grouping.",
                    "Change-point detection method on 100 Gb/s ethernet interface.",
                    "Superspreader detection system on NetFPGA platform.",
                    "On reducing false positives of a bloom filter in trie-based algorithms.",
                    "Static power reduction in caches using deterministic naps.",
                    "Secure and efficient key management protocol (SEKMP) for wireless sensor networks.",
                    "A digital PUF-based IP protection architecture for network embedded systems.",
                    "PLWAH+: a bitmap index compressing scheme based on PLWAH.",
                    "Impact of the end-system and affinities on the throughput of high-speed flows."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ANCS 2013",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2013",
                "sub_name": "Symposium on Architecture for Networking and Communications Systems, ANCS '13, San Jose, CA, USA, October 21-22, 2013.",
                "count": 28,
                "papers": [
                    "GAMT: A fast and scalable IP lookup engine for GPU-based software routers.",
                    "Design principles for packet parsers.",
                    "Fast and flexible: Parallel packet processing with GPUs and click.",
                    "The scope for Online Social Network aided caching in web CDNs.",
                    "Speeding up packet I/O in virtual machines.",
                    "Dahu: Commodity switches for direct connect data center networks.",
                    "Scalable Ternary Content Addressable Memory implementation using FPGAs.",
                    "Scalable TCAM-based regular expression matching with compressed finite automata.",
                    "A Ternary Unification Framework for optimizing TCAM-based packet classification systems.",
                    "Re-design of path synchronization for minimal latency data vortex optical interconnection network.",
                    "Balancing authentication and location privacy in cooperative authentication.",
                    "PPI: Towards precise page identification for encrypted Web-browsing traffic.",
                    "Cyclostationary codec: A framework to enable alternative network architectures.",
                    "k-p0f: A high-throughput kernel passive OS fingerprinter.",
                    "Thermal prediction and scheduling of network applications on multicore processors.",
                    "Optimizing a network layer moving target defense for specific system architectures.",
                    "Design of credentials for high-speed access control in service-oriented networks.",
                    "Performance measurement of the CCNx Synchronization protocol.",
                    "Architecture for an open source network tester.",
                    "High-performance architecture for dynamically updatable packet classification on FPGA.",
                    "Scalable high-performance parallel design for Network Intrusion Detection Systems on many-core processors.",
                    "Automated signature extraction for high volume attacks.",
                    "Asymmetric scaling on network packet processors in the dark silicon era.",
                    "Optimal networks from error correcting codes.",
                    "FAR: A fault-avoidance routing method for data center networks with regular topology.",
                    "SWSL: SoftWare Synthesis for network Lookup.",
                    "Picking pesky parameters: Optimizing regular expression matching in practice.",
                    "Named data networking on a router: Fast and DoS-resistant forwarding with hash tables."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ANCS 2012",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2012",
                "sub_name": "Symposium on Architecture for Networking and Communications Systems, ANCS '12, Austin, TX, USA - October 29 - 30, 2012.",
                "count": 35,
                "papers": [
                    "Softly defined networking.",
                    "On the feasibility of completely wireless datacenters.",
                    "Popularity-driven coordinated caching in named data networking.",
                    "NetSlices: scalable multi-core packet processing in user-space.",
                    "Cache-aware affinitization on commodity multicores for high-speed network flows.",
                    "xOMB: extensible open middleboxes with commodity servers.",
                    "NetBump: user-extensible active queue management with bumps on the wire.",
                    "Fast longest prefix name lookup for content-centric network forwarding.",
                    "Hardware support for dynamic protocol stacks.",
                    "Low-latency modular packet header parser for FPGA.",
                    "M-DFA (multithreaded DFA): an algorithm for reduction of state transitions and acceleration of REGEXP matching.",
                    "A new embedded platform for rapid development of network applications.",
                    "Structural compression of packet classification trees.",
                    "Toward fast NDN software forwarding lookup engine based on hash tables.",
                    "Host-based multi-tenant technology for scalable data center networks.",
                    "Distributed adaptive routing for big-data applications running on data center networks.",
                    "Efficient buffering and scheduling for a single-chip crosspoint-queued switch.",
                    "Efficient traffic aware power management in multicore communications processors.",
                    "Software is the future of networking.",
                    "Attendre: mitigating ill effects of race conditions in openflow via queueing mechanism.",
                    "Dynamic frequency scaling architecture for energy efficient router.",
                    "Extensible hierarchical simulation of network systems.",
                    "FlowOS: a pure flow-based vision of network traffic.",
                    "Modular design of data vortex switch network.",
                    "PVNs: making virtualized network infrastructure usable.",
                    "Securing multi-core multi-threaded packet processors.",
                    "A hardware spinal decoder.",
                    "Fast submatch extraction using OBDDs.",
                    "LEAP: latency- energy- and area-optimized lookup pipeline.",
                    "Floating ground architecture: overcoming the one-hop boundary of current mobile internet.",
                    "ECOS: leveraging software-defined networks to support mobile application offloading.",
                    "On pending interest table in named data networking.",
                    "Coexist: integrating content oriented publish/subscribe systems with ip.",
                    "MCA2: multi-core architecture for mitigating complexity attacks.",
                    "Malacoda: towards high-level compilation of network security applications on reconfigurable hardware."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ANCS 2011",
        "info": "Brooklyn, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2011",
                "sub_name": "2011 ACM/IEEE Symposium on Architectures for Networking and Communications Systems (ANCS), Brooklyn, NY, USA, October 3-4, 2011.",
                "count": 37,
                "papers": [
                    "Ally: OS-Transparent Packet Inspection Using Sequestered Cores.",
                    "400 Gb/s Programmable Packet Parsing on a Single FPGA.",
                    "Chain-Based DFA Deflation for Fast and Scalable Regular Expression Matching Using TCAM.",
                    "AC-Suffix-Tree: Buffer Free String Matching on Out-of-Sequence Packets.",
                    "E-AHRW: An Energy-Efficient Adaptive Hash Scheduler for Stream Processing on Multi-core Servers.",
                    "Predictive Model-Based Thermal Management for Network Applications.",
                    "HPC-Mesh: A Homogeneous Parallel Concentrated Mesh for Fault-Tolerance and Energy Savings.",
                    "Accelerating Sketch-Based Computations with GPU: A Case Study for Network Traffic Change Detection.",
                    "Efficient Implementation of Dynamic Protocol Stacks.",
                    "Fast and Compact Regular Expression Matching Using Character Substitution.",
                    "Fast Content Distribution on Datacenter Networks.",
                    "Fast Path Performance of Packet Cache Router Using Multi-core Network Processor.",
                    "Inferring Packet Processing Behavior Using Input/Output Monitors.",
                    "Modeling Filtering Predicates Composition with Finite State Automata.",
                    "Netbench: Framework for Evaluation of Packet Processing Algorithms.",
                    "Routing Optimization for Ensemble Routing.",
                    "COPSS: An Efficient Content Oriented Publish/Subscribe System.",
                    "A Scalability Study of Enterprise Network Architectures.",
                    "FIFO Service with Differentiated Queueing.",
                    "A Canonical Multicore Architecture for Network Routers.",
                    "ReClick - A Modular Dataplane Design Framework for FPGA-Based Network Virtualization.",
                    "Non-crypto Hardware Hash Functions for High Performance Networking ASICs.",
                    "A Multi-dimensional Progressive Perfect Hashing for High-Speed String Matching.",
                    "SMILER: Towards Practical Online Traffic Classification.",
                    "Experiences in Co-designing a Packet Classification Algorithm and a Flexible Hardware Platform.",
                    "Split: Optimizing Space, Power, and Throughput for TCAM-Based Classification.",
                    "A Dynamically Adapting Network Programming Framework.",
                    "Encrypted Packet Forwarding in Virtualized Networks.",
                    "File-Aware P2P Traffic Classification and Management.",
                    "Hacking NetCOPE to Run on NetFPGA-10G.",
                    "Hardware Precomputation of Entropy for Anomaly Detection.",
                    "On High QoS Constraints over Shared Resource Networks.",
                    "Performance Measurement of Name-Centric Content Distribution Methods.",
                    "Virtual Network Mapping with Traffic Matrices.",
                    "Streaming Solutions for Fine-Grained Network Traffic Measurements and Analysis.",
                    "A Passive Network Appliance for Real-Time Network Monitoring.",
                    "LEISURE: A Framework for Load-Balanced Network-Wide Traffic Measurement."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ANCS 2010",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2010",
                "sub_name": "Proceedings of the 2010 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2010, San Diego, California, USA, October 25-26, 2010.",
                "count": 37,
                "papers": [
                    "Fair multithreading on packet processors for scalable network virtualization.",
                    "A folded pipeline network processor architecture for 100 Gbit/s networks.",
                    "Design of a secure packet processor.",
                    "Airblue: a system for cross-layer wireless protocol development.",
                    "An architecture for software defined cognitive radio.",
                    "End-to-end congestion management for non-blocking multi-stage switching fabrics.",
                    "High speed pattern matching algorithm based on deterministic finite automata with faulty transition table.",
                    "HELIOS: a high energy-efficiency locally-scheduled input-queued optical switch.",
                    "A traffic-aware top-N firewall ruleset approximation algorithm.",
                    "Bit-shuffled trie: a new approach for IP address lookup.",
                    "Efficient packet classification algorithm based on entropy.",
                    "Fast regular expression matching in hardware using NFA-BDD combination.",
                    "Improving PC-based OpenFlow switching performance.",
                    "NFA split architecture for fast regular expression matching.",
                    "Software-based implementations of updateable data structures for high-speed URL matching.",
                    "Throughput of random arbitration for approximate matchings.",
                    "Efficient lookahead routing and header compression for multicasting in networks-on-chip.",
                    "Energy-aware routing in hybrid optical network-on-chip for future multi-processor system-on-chip.",
                    "Destination-based adaptive routing on 2D mesh networks.",
                    "Range hash for regular expression pre-filtering.",
                    "Packet scheduling for deep packet inspection on multi-core architectures.",
                    "Axon: a flexible substrate for source-routed ethernet.",
                    "Ensemble routing for datacenter networks.",
                    "DOS: a scalable optical switch for datacenters.",
                    "A new TCB cache to efficiently manage TCP sessions for web servers.",
                    "sNICh: efficient last hop networking in the data center.",
                    "An experimental evaluation of distributed rate limiting for cloud computing applications.",
                    "TnT: transparent network tracker for P2P applications.",
                    "Power optimization for multimedia transcoding on multicore servers.",
                    "NetEx: efficient and cost-effective internet bulk content delivery.",
                    "Evolution of cache replacement policies to track heavy-hitter flows.",
                    "Load balancing packets on a tile-based massive multi-core processor with S-NUCA.",
                    "Simple two-priority, low-jitter scheduler.",
                    "TED: tool for testing and debugging uDAPL.",
                    "Galois field hardware architectures for network coding.",
                    "Chimpp: a click-based programming and simulation environment for reconfigurable networking hardware.",
                    "The case for hardware transactional memory in software packet processing."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ANCS 2009",
        "info": "Princeton, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2009",
                "sub_name": "Proceedings of the 2009 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2009, Princeton, New Jersey, USA, October 19-20, 2009.",
                "count": 44,
                "papers": [
                    "Software radio: a broad change in RF communications systems design.",
                    "Networking hardware: what drives innovation?",
                    "Revisiting the internet hourglass: core strength vs. middle-age spread.",
                    "Simplifying data path processing in next-generation routers.",
                    "Exploitation and threat analysis of open mobile devices.",
                    "Evaluating regular expression matching engines on network and general purpose processors.",
                    "LaFA: lookahead finite automata for scalable regular expression detection.",
                    "An adaptive hash-based multilayer scheduler for L7-filter on a highly threaded hierarchical multi-core server.",
                    "A NFA-based programmable regular expression match engine.",
                    "High throughput architecture for packet classification using FPGA.",
                    "A block-based reservation architecture for the implementation of large packet buffers.",
                    "OASis: towards extensible open-architecture services platforms.",
                    "EINIC: an architecture for high bandwidth network I/O on multi-core processors.",
                    "Accelerating OpenFlow switching with network processors.",
                    "Multiplexing endpoints of HCA to achieve scalability for MPI applications: design, implementation and performance evaluation with uDAPL.",
                    "Micro Secure Socket Layer (MSSL) for micro server.",
                    "A path combinational method for multiple pattern matching.",
                    "A lock-free, cache-efficient shared ring buffer for multi-core architectures.",
                    "Hash-based routing for scalable datacenters.",
                    "Theoretic analysis of finite automata for memory-based pattern matching.",
                    "Design and performance analysis of a DRAM-based statistics counter array architecture.",
                    "Motivating future interconnects: a differential measurement analysis of PCI latency.",
                    "Weighted random oblivious routing on torus networks.",
                    "Design of a scalable nanophotonic interconnect for future multicores.",
                    "A novel 3D layer-multiplexed on-chip network.",
                    "Divide and discriminate: algorithm for deterministic and fast hash lookups.",
                    "Range Tries for scalable address lookup.",
                    "Progressive hashing for packet processing using set associative memory.",
                    "SPC-FA: synergic parallel compact finite automaton to accelerate multi-string matching with low memory.",
                    "Memory optimization for packet classification algorithms.",
                    "ISP managed peer-to-peer.",
                    "Interfacing to a virtualized network infrastructure through network service abstractions.",
                    "Implementing URL-based forwarding on a network processor-based router platform.",
                    "Parallelization of Snort on a multi-core platform.",
                    "Testbed for evaluating worm containment systems.",
                    "External storage middleware for wireless devices with limited resources.",
                    "Designing high-speed packet processing tasks at arbitrary levels of abstraction: implementation and evaluation of a MIXMAP system.",
                    "SANS: a scalable architecture for network intrusion prevention with stateful frontend.",
                    "A novel hybrid SRAM/DRAM memory architecture for fast packet buffers.",
                    "Binary search on levels using a Bloom filter for IPv6 address lookup.",
                    "A mobile healthcare system using IMS and the HL7 framework.",
                    "An ultra high throughput and memory efficient pipeline architecture for multi-match packet classification without TCAMs.",
                    "Co-match: fast and efficient packet inspection for multiple flows.",
                    "Experience with high-speed automated application-identification for network-management."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ANCS 2008",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2008",
                "sub_name": "Proceedings of the 2008 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2008, San Jose, California, USA, November 6-7, 2008.",
                "count": 23,
                "papers": [
                    "Implementing an OpenFlow switch on the NetFPGA platform.",
                    "Design of a scalable network programming framework.",
                    "A remotely accessible network processor-based router for network experimentation.",
                    "Compact architecture for high-throughput regular expression matching on FPGA.",
                    "Acceleration of decision tree searching for IP traffic classification.",
                    "Efficient regular expression evaluation: theory to practice.",
                    "A scalable multithreaded L7-filter design for multi-core servers.",
                    "On runtime management in multi-core packet processing systems.",
                    "MultiLayer processing - an execution model for parallel stateful packet processing.",
                    "BRICK: a novel exact active statistics counter architecture.",
                    "Packet prediction for speculative cut-through switching.",
                    "A programmable architecture for scalable and real-time network traffic measurements.",
                    "Adaptive scheduling to maximize NIC throughput in a COTS router.",
                    "Input-queued switches with logarithmic delay: necessary conditions and a reconfigurable scheduling algorithm.",
                    "SimNP: a flexible platform for the simulation of a network processing system.",
                    "Towards effective network algorithms on multi-core network processors.",
                    "Performing time-sensitive network experiments.",
                    "Data path credentials for high-performance capabilities-based networks.",
                    "Low power architecture for high speed packet classification.",
                    "Stateful hardware decompression in networking environment.",
                    "On design of bandwidth scheduling algorithms for multiple data transfers in dedicated networks.",
                    "Software techniques to improve virtualized I/O performance on multi-core systems.",
                    "Design optimization of a highly parallel InfiniBand host channel adapter."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ANCS 2007",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2007",
                "sub_name": "Proceedings of the 2007 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2007, Orlando, Florida, USA, December 3-4, 2007.",
                "count": 25,
                "papers": [
                    "Ruler: high-speed packet matching and rewriting on NPUs.",
                    "Optimization of pattern matching algorithm for memory based architecture.",
                    "Towards high-performance flow-level packet processing on multi-core network processors.",
                    "Frame shared memory: line-rate networking on commodity hardware.",
                    "Experimental evaluation of a coarse-grained switch scheduler.",
                    "Design of a network architecture with inherent data path security.",
                    "Experimenting with buffer sizes in routers.",
                    "To CMP or not to CMP: analyzing packet classification on modern and traditional parallel architectures.",
                    "Flow-slice: a novel load-balancing scheme for multi-path switching systems.",
                    "Design of adaptive communication channel buffers for low-power area-efficient network-on-chip architecture.",
                    "Performance scalability of a multi-core web server.",
                    "Automated task distribution in multicore network processors using statistical analysis.",
                    "Optimal packet scheduling in output-buffered optical switches with limited-range wavelength conversion.",
                    "Low-latency scheduling in large switches.",
                    "On LID assignment in infiniBand networks.",
                    "Frame-aggregated concurrent matching switch.",
                    "Congestion management for non-blocking clos networks.",
                    "Compiling PCRE to FPGA for accelerating SNORT IDS.",
                    "High-speed packet classification using binary search on length.",
                    "An improved algorithm to accelerate regular expression evaluation.",
                    "Curing regular expressions matching algorithms from insomnia, amnesia, and acalculia.",
                    "Enhancing interoperability and stateful analysis of cooperative network intrusion detection systems.",
                    "High-speed detection of unsolicited bulk emails.",
                    "A programmable message classification engine for session initiation protocol (SIP).",
                    "DPICO: a high speed deep packet inspection engine using compact finite automata."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ANCS 2006",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2006",
                "sub_name": "Proceedings of the 2006 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2006, San Jose, California, USA, December 3-5, 2006.",
                "count": 19,
                "papers": [
                    "A proposed architecture for the GENI backbone platform.",
                    "Towards an efficient switch architecture for high-radix switches.",
                    "A practical fast parallel routing architecture for Clos networks.",
                    "Design of a web switch in a reconfigurable platform.",
                    "Packet classification using coarse-grained tuple spaces.",
                    "CAMP: fast and efficient IP lookup architecture.",
                    "Fast packet classification using bloom filters.",
                    "Efficient memory utilization on network processors for deep packet inspection.",
                    "Advanced algorithms for fast and scalable deep packet inspection.",
                    "Fast and memory-efficient regular expression matching for deep packet inspection.",
                    "An effective network processor design framework: using multi-objective evolutionary algorithms and object oriented techniques to optimise the intel IXP1200 network processor.",
                    "A methodology for evaluating runtime support in network processors.",
                    "High-throughput sketch update on a low-power stream processor.",
                    "Symerton--using virtualization to accelerate packet processing.",
                    "Sequence-preserving adaptive load balancers.",
                    "Localized asynchronous packet scheduling for buffered crossbar switches.",
                    "Scalable network-based buffer overflow attack detection.",
                    "WormTerminator: an effective containment of unknown and polymorphic fast spreading worms.",
                    "Packet pre-filtering for network intrusion detection."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ANCS 2005",
        "info": "Princeton, New Jersey, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ancs/2005",
                "sub_name": "Proceedings of the 2005 ACM/IEEE Symposium on Architecture for Networking and Communications Systems, ANCS 2005, Princeton, New Jersey, USA, October 16-18, 2005.",
                "count": 22,
                "papers": [
                    "Overcoming the memory wall in packet processing: hammers or ladders?",
                    "Architectural impact of stateful networking applications.",
                    "Resource mapping and scheduling for heterogeneous network processor systems.",
                    "Group round robin: improving the fairness and complexity of packet scheduling.",
                    "Pipelined two step iterative matching algorithms for CIOQ crossbar switches.",
                    "Gigabit routing on a software-exposed tiled-microprocessor.",
                    "An operating system architecture for network processors.",
                    "Design considerations for network processor operating systems.",
                    "A novel reconfigurable hardware architecture for IP address lookup.",
                    "Segmented hash: an efficient hash table implementation for high performance networking subsystems.",
                    "SSA: a power and memory efficient scheme to multi-match packet classification.",
                    "Network processor acceleration for a Linux* netfilter firewall.",
                    "Addressing data compatibility on programmable network platforms.",
                    "SpliceNP: a TCP splicer using a network processor.",
                    "A scalable load balancer for forwarding internet traffic: exploiting flow-level burstiness.",
                    "Minimizing the overhead in implementing flow-aware networking.",
                    "Framework for supporting multi-service edge packet processing on network processors.",
                    "Design and analysis of an NoC architecture from performance, reliability and energy perspective.",
                    "Fast and scalable pattern matching for content filtering.",
                    "High-throughput linked-pattern matching for intrusion detection systems.",
                    "Optimal XOR hashing for a linearly distributed address lookup in computer networks.",
                    "Fast payload-based flow estimation for traffic monitoring and network security."
                ]
            }
        ]
    }
]