[
    {
        "year": "2021",
        "name": "22nd APNOMS 2021",
        "info": "Tainan, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2021",
                "sub_name": "22nd Asia-Pacific Network Operations and Management Symposium, APNOMS 2021, Tainan, Taiwan, September 8-10, 2021.",
                "count": 85,
                "papers": [
                    "Enhanced Quality of Service Measurement Mechanism of Container-based Cloud Network Architecture.",
                    "NFV-Enabled Vertical Scalability for IoT Slices.",
                    "New Multi-Access Network Transmission Technology to Enhance Edge Computing.",
                    "A Road-aware Approach for Hierarchical Routing in IoV based on Intents and Q-values.",
                    "Measurement-based IoT Server Selection for Mobile Edge Computing.",
                    "Model-based anomaly detection in response delay in communication through LTE network.",
                    "BRAS syslog pattern generation method: a preliminary experiment on clustering algorithms.",
                    "Relation between Warning Error and Vehicle Speed in Vehicle-to-Pedestrian Warning System.",
                    "Design and analysis of a real-time multicast routing algorithm in Inter-Blockchain networks.",
                    "Lightweight blockchain to solve forgery and privacy issues of vehicle image data.",
                    "A Dynamic Selection Algorithm of Tor Relay Based on Client Bias.",
                    "Design and Implementation of Automatic Generation Method for API Adapter Test Code.",
                    "Docker Container Networking Based Apache Storm and Flink Benchmark Test.",
                    "Performance Analysis of Applying Deep Learning for Virtual Background of WebRTC-based Video Conferencing System.",
                    "A survey on public blockchain-based networks: structural differences and address clustering methods.",
                    "Efficient Path and Charge (P&C) Scheduling for a Mobile Charger to Improve Survivability and Throughput of Sensors with Adaptive Sensing Rates.",
                    "Friendly Jamming in Wireless Networks: A Stackelberg Game.",
                    "Secrecy Outage Probability of Reconfigurable Intelligent Surface-Aided Cooperative Underlay Cognitive Radio Network Communications.",
                    "SSAE - DeepCNN Model for Network Intrusion Detection.",
                    "Radio Resource Allocation for RIS-aided D2D Communication Based on Greedy Hypergraph-with-weight Coloring.",
                    "Joint Power Control and Passive Beamforming in Intelligent Reflecting Surface Assisted Multi-Cell Uplink Communications.",
                    "Power Control and Evolutionary Strategy Based Slicing Resource Allocation for V2V Communication.",
                    "Cognitive Collision Resolution for Enhanced Performance in C-V2X Sidelink Mode 4.",
                    "Edge Computing and Networking Resource Management for Decomposable Deep Learning: An Auction-Based Approach.",
                    "Text-to-Speech with Model Compression on Edge Devices.",
                    "Business Demand-Oriented Intelligent Orchestration of Network Slices Based on Core-Edge Collaboration.",
                    "Incentive-Stable Matching Protocol for Service Chain Placement in Multi-Operator Edge System.",
                    "Robotic Assistance Operation for Effective On-site Network Maintenance Works.",
                    "Design of a Network Management System for 5G Open RAN.",
                    "Cost-effective Policy for Deployment of Dense 5G RAN with Fiber and Wireless Backhaul Link.",
                    "Network Data Analytics Function for IBN-based Network Slice Lifecycle Management.",
                    "History Data Management Method of API Request Order using Bitemporal Data Model for Application Layer Recovery.",
                    "Multiple-Layer-Topology Discovery Method Using Traffic Information.",
                    "Orchestrator for Automating Failure Response in Telecom Carriers.",
                    "Bayesian network equipped workflow engine to coordinate Artificial Intelligence for automating network operation.",
                    "Detection of Hypergiants in AS-Level Topology Using Machine Learning.",
                    "Automating Web-based Infrastructure Management via Contextual Imitation Learning.",
                    "Time-Aware Stream Reservation for Distributed TSN.",
                    "Distilling Knowledge in Federated Learning.",
                    "An SDN Controller Enabled Architecture for 5G Backhaul Networks.",
                    "Study of Contention Window Adjustment for CSMA/CA by Using Machine Learning.",
                    "Development of Reference Model for Enterprise Architecture Leveraging TM Forum Assets.",
                    "Method of Constructing Petri Net Service Model Using Distributed Trace Data of Microservices.",
                    "An API-based In-Service Surveillance Approach for Enterprise PBX.",
                    "Learning for Prediction of Maritime Collision Avoidance Behavior from AIS Network.",
                    "A Multi-Objective Approach for Optimizing Content Delivery Network System Configuration.",
                    "SPENT+: A Category- and Region-aware Successive POI Recommendation Model.",
                    "The Design and Implementation of a Blockchain-Based Logistics Platform for International Trade.",
                    "Encrypted Network Traffic Identification Based on 2D-CNN Model.",
                    "Dynamic Network Provisioning with Reinforcement Learning based on Link Stability.",
                    "Graph Convolutional Network based Link State Prediction.",
                    "Machine Learning-based Cache Optimization on MEC Platform.",
                    "Applying RouteNet and LSTM to Achieve Network Automation: An Intent-based Networking Approach.",
                    "A Flexible P4-Based Pin-Point In-Band Network Monitoring.",
                    "Proposal and Evaluation of Automatic Registration Method of Service Information by Distribution from Deployment System to Maintenance System.",
                    "P4MT: Designing and Evaluating Multi-Tenant Services for P4 Switches.",
                    "Design of a Network Scan Defense Method by Combining an SDN-based MTD and IPS.",
                    "Virtual Machine Failure Prediction using Log Analysis.",
                    "A Resilient Mechanism for Multi-Controller Failure in Hybrid SDN-based Networks.",
                    "An Intelligent Fault Location Approach Using Fuzzy Logic for Improving Autonomous Network.",
                    "Evaluation of Resource Sharing Framework for Heterogeneous Network Services.",
                    "Cos-CBDC: Design and Implementation of CBDC on Cosmos Blockchain.",
                    "Discovery of Ethereum Topology Through Active Probing Approach.",
                    "Analysis of Compact Block Propagation Delay in Bitcoin Network.",
                    "FullSight: a Deep Learning based Collaborated Failure Detection Framework of Service Function Chain.",
                    "Performance Evaluation of Ethereum Private and Testnet Networks Using Hyperledger Caliper.",
                    "Security-Oriented Network Slice Backup Method.",
                    "On-Demand Service Function Chain Based on IPv6 Segment Routing.",
                    "A Flexible vCPE Framework to Enable Dynamic Service Function Chaining Using P4 Switches.",
                    "Energy-Efficient VNF Deployment for Graph-Structured SFC Based on Graph Neural Network and Constrained Deep Reinforcement Learning.",
                    "In-band Network Telemetry Task Orchestration based on Multi-objective Optimization.",
                    "On Detecting Cloud Container Failures from Computing Utility Sequences.",
                    "On The Performance of NOMA with Bi-directional in Weibull-Channel.",
                    "5G Radio Frequency Conformance Test Based on Polymorphic Adaptation.",
                    "Design and implementation of a DNS server with Geolocation capability.",
                    "Mitigating SYN Flooding and UDP Flooding in P4-based SDN.",
                    "Real-Time License Plate Recognition and Vehicle Tracking System Based on Deep Learning.",
                    "An Association Control Method in LAA/Wi-Fi Coexistent Networks Considering Uplink/Downlink Communications.",
                    "On-Demand MEC Empowered UAV Deployment for 6G Time-Sensitive Maritime Internet of Things.",
                    "An Efficient Resource Sharing Model for Multi-UAV-Assisted Wireless Networks.",
                    "Decentralized Collaborative Caching-based Virtual Reality for 5G and Beyond.",
                    "Intelligent Grid Shepherd: Towards a Resilient Distributed Energy Resources Control System.",
                    "Study on the Online Charging System in B5G Era.",
                    "WITSE: A Testbed for Performance Evaluation of TaiSEIA 101 over Wireless Protocols.",
                    "Adaptive Wireless Multi-hop Routing Less Affected by Processing Delay."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st APNOMS 2020",
        "info": "Daegu, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2020",
                "sub_name": "21st Asia-Pacific Network Operations and Management Symposium, APNOMS 2020, Daegu, South Korea, September 22-25, 2020.",
                "count": 88,
                "papers": [
                    "A Study on Automation of Network Maintenance in Telecom Carriers for Zero-Touch Operations.",
                    "Graph Neural Network based Service Function Chaining for Automatic Network Control.",
                    "Graph Neural Network-based Virtual Network Function Management.",
                    "IBNSlicing: Intent-Based Network Slicing Framework for 5G Networks using Deep Learning.",
                    "Distributed SDN Based Network State Aware Architecture for Flying Ad-hoc Network.",
                    "A Load Balancing Approach for Distributed SDN Architecture Based on Sharing Data Store.",
                    "Dynamic Control Method of Explicit Address Mapping Table in IPv6 Single-Stack Network.",
                    "An Automatic Protocol Reverse Engineering Approach from the Viewpoint of the TCP/IP Reference Model.",
                    "Generic Intent-based Networking Platform for E2E Network Slice Orchestration & Lifecycle Management.",
                    "Deep Multi-Agent Reinforcement Learning for Resource Allocation in D2D Communication Underlaying Cellular Networks.",
                    "Structural deterioration determination system for improving the efficiency of utility pole inspection.",
                    "Machine Learning-based Optimal VNF Deployment.",
                    "Entropy-based IoT Devices Identification.",
                    "Event-aware Hierarchical Routing with Differential Compression to Extend WSN Lifetime.",
                    "Topic-based Allocation of Distributed Message Processors on Edge-Servers for Real-time Notification Service.",
                    "JBRC: Jointly Balanced Routing and Charging Scheme for RF Energy Harvesting Wireless Sensor Networks.",
                    "Channel Assignment and Access System Selection in Heterogeneous Wireless Network with Unlicensed Bands.",
                    "Optimized Deployment of Multi-UAV based on Machine Learning in UAV-HST Networking.",
                    "Energy-Efficient Offloading and User Association in UAV-assisted Vehicular Ad Hoc Network.",
                    "Mitigating SYN flooding Attack and ARP Spoofing in SDN Data Plane.",
                    "A Design of Port Scan Detection Method Based on the Characteristics of Packet-In Messages in OpenFlow Networks.",
                    "Improving Scanner Data Collection in P4-based SDN.",
                    "A Light-weight Mitigation Scheme on the Mole Content Poisoning Attack in NDN.",
                    "Real-time Monitoring of Packet Processing Time for Virtual Network Functions.",
                    "An Evaluation of Network Service Monitoring Method Using User Traffic Information.",
                    "Optimized Quantization for Convolutional Deep Neural Networks in Federated Learning.",
                    "A Self-Adaptive Measurement Rate Control Method for an Agent-based Service Monitoring System.",
                    "Real-time Monitoring System for Container Networks in the Era of Microservices.",
                    "IWApriori: An Association Rule Mining and Self-updating Method Based on Weighted Increment.",
                    "Exploiting Interference-aware GPU Container Concurrency Learning from Resource Usage of Application Execution.",
                    "Asocial: Adaptive Task Re-Allocation in Distributed Computing Systems with Node Failures.",
                    "Smart Self-Checkout Carts Based on Deep Learning for Shopping Activity Recognition.",
                    "Friend Recommendation Based on Mobile Crowdsensing in Social Networks.",
                    "Information Diffusion Within a Limited Budget Using Node Centralities and Community Detection.",
                    "Analysis of Ethereum Network Properties and Behavior of Influential Nodes.",
                    "Distributed Profitable Deployment of Network Services to Geo-distributed Edge Systems.",
                    "Deployment of Facial Recognition Models at the Edge: A Feasibility Study.",
                    "Q-Learning based SFC deployment on Edge Computing Environment.",
                    "Event-Triggered Media Stream Bandwidth Adjustment in IoT-Based Home Networks.",
                    "Joint Analysis of Port and Protocol via Endpoint Measurement: An Empirical Study.",
                    "Utilization of the Blockchain Network in The Public Community Health Center Medicine Supply Chain.",
                    "Improving Performance of Collaborative Source-Side DDoS Attack Detection.",
                    "TCP-PPCC: Online-Learning Proximal Policy for Congestion Control.",
                    "Task Scheduling System Based on Consensus Algorithm in P2P Network.",
                    "FingerTalk: Real-time Fingertip Trajectories Tracking Service based on IoTtalk.",
                    "Co-Channel Interference Cancellation in OFDMA System.",
                    "A Study On Performance Improvement Of Hyperledger Fabric Through Batched Chaincode Message.",
                    "IPv6 DoS Attacks Detection Using Machine Learning Enhanced IDS in SDN/NFV Environment.",
                    "Comparison of Distance Measurement in Time Series Clustering for Predicting Bitcoin Prices.",
                    "Dynamic Network Provisioning with AI-enabled Path Planning.",
                    "Design and Implementation of Comprehensive Test Automation Method for API Adapter in C-Plane and U-Plane.",
                    "Q-learning based Service Function Chaining using VNF Resource-aware Reward Model.",
                    "Topology Discovery for Telecommunications-carrier Networks using Equipment Alarms.",
                    "Examining Bitcoin mempools Resemblance Using Jaccard Similarity Index.",
                    "Hierarchical Identifier (HID)-based 5G Architecture with Backup Slice.",
                    "Dynamic reverse proxy chain generation for networks in data centers.",
                    "VM Allocation in Data Center Subject to CPU Percentile Constraints.",
                    "Effect of Packet Loss and Delay on V2X Data Fusion.",
                    "End-to-end Service Assurance in 5G Crosshaul Networks.",
                    "Design and Performance Evaluation of Hexagonal Topology Networks with Novel Routing Algorithms.",
                    "Switched Digital Video Using Convergence Transmission of Broadcasting and Communication on Cable TV Network.",
                    "Towards Blockchain-based Stainless Steel Tracking.",
                    "Docker environment based Apache Storm and Spark Benchmark Test.",
                    "Load Balancing Algorithm with Programmable Switch.",
                    "Oversampling Techniques for Detecting Bitcoin Illegal Transactions.",
                    "An autonomous Mobile Robot System based on Serverless Computing and Edge Computing.",
                    "An Integrated Monitoring System for 5G Crosshaul Network.",
                    "Estimating wallets and bitcoins owned by Satoshi using Hash-rate and Transactions analysis.",
                    "A Measurement Study on Evaluating Container Network Performance for Edge Computing.",
                    "Reliability Evaluation and Optimization Method in Power Communication Network Based on Environmental Factors and Controlled Hybrid Stochastic Petri Net.",
                    "Mobile agents' dynamic small-world network based on attention mechanism.",
                    "Design and simulation of self-organizing network routing algorithm based on Q-learning.",
                    "Design and Implementation of IEEE 802.11ah (HaLow) Dongle for IoT Wireless Networking.",
                    "Automatic Mobile App Speed Measurement with Robot.",
                    "A Framework for a Multisensory IoT System Based on Service-oriented Architecture.",
                    "Mobility Performance Enhancement in Small Cells Cluster of 5G Network: A Handover Overhead Reduction Approach.",
                    "Experimental Comparison of Machine Learning Models in Malware Packing Detection.",
                    "Video Communication Optimization Using Distributed Edge Computing.",
                    "G-PFC: A Packet-Priority Aware PFC Scheme for the Datacenter.",
                    "Cross-Silo Horizontal Federated Learning for Flow-based Time-related-Features Oriented Traffic Classification.",
                    "Service Chaining Offloading Decision in the EdgeAI: A Deep Reinforcement Learning Approach.",
                    "Intelligent Management System: Deep Convolutional Neural Networks for Automatic Attribute Recognition in IP Surveillance Networks.",
                    "Evaluating NFV-enabled Network Slicing for 5G Core.",
                    "Federated Learning for Cellular Networks: Joint User Association and Resource Allocation.",
                    "Double-Lead Content Search Scheme for Producer Mobility in Named Data Networking.",
                    "Joint Deployment and Task Computation of UAVs in UAV-assisted Edge Computing Network.",
                    "Prequalification of VDSL2 copper customers for G.fast services with artificial intelligence technology.",
                    "A beam-based eICIC algorithm."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th APNOMS 2019",
        "info": "Matsue, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2019",
                "sub_name": "20th Asia-Pacific Network Operations and Management Symposium, APNOMS 2019, Matsue, Japan, September 18-20, 2019.",
                "count": 113,
                "papers": [
                    "Dynamic Auto-scaling of VNFs based on Task Execution Patterns.",
                    "DDoS Attack Detection on Bitcoin Ecosystem using Deep-Learning.",
                    "A V2X Task Offloading Method Considering Automobiles' Behavior in Urban Area.",
                    "An Integrated Network Monitoring System for SDN VPN.",
                    "IT Resource Trend Analysis by Component Decomposition Based on Non-negative Matrix Factorization.",
                    "FLchain: Federated Learning via MEC-enabled Blockchain Network.",
                    "Evaluaion of assurance closed loop PoC for achieving scheduled maintenance in telecommunication carrier networks.",
                    "Unmanned Aerial Vehicle Waypoint Guidance with Energy Efficient Path Planning in Smart Factory.",
                    "Location-based Flooding Area Restriction for Mobile-assisted Ad Hoc Networks.",
                    "Effective Uplink Data Transmission Scheme for MTCDs in LTE-A Networks.",
                    "Building a V2X Simulation Framework for Future Autonomous Driving.",
                    "Optimal Task-UAV-Edge Matching for Computation Offloading in UAV Assisted Mobile Edge Computing.",
                    "Comparison of NVA and RLOWESS Algorithms in Indoor Positioning System.",
                    "Deep Learning Based Anomaly Detection Scheme in Software-Defined Networking.",
                    "Mobility Support for Networks on Trains Using Commercial Off-the-shelf Routers.",
                    "Store-and-Forward Data Transfer using Optimized Intermediate Node.",
                    "Support Method to Generate Catalogs for Orchestrator using Catalog Definition Templates.",
                    "Predicting malfunction of mobile network base station using machine learning approach.",
                    "Best Feature Selection using Correlation Analysis for Prediction of Bitcoin Transaction Count.",
                    "Automatic parameter tuning framework for performance diagnosis report.",
                    "A Framework for Maritime Anti-Collision Pattern Discovery from AIS Network.",
                    "Detecting Road Conditions in Front of The Vehicle Using Off-The-Shelf Camera.",
                    "A Comprehensive Multisensor Dataset Employing RGBD Camera, Inertial Sensor and Web Camera.",
                    "An Improved Genetic Algorithm for the Scheduling of Virtual Network Functions.",
                    "P4-Enabled Bandwidth Management.",
                    "DB-Kmeans: An Intrusion Detection Algorithm Based on DBSCAN and K-means.",
                    "Design and Implementation of IPv4 and IPv6 Provisioning Technologies for VPC Architecture.",
                    "Path Selection with Joint Latency and Packet Loss for Edge Computing in SDN.",
                    "A Content-Centric Platform for Home Networks.",
                    "ROS-based Robot Development Toward Fully Automated Network Management.",
                    "Smart Control for Energy Efficient Networking of IEEE 802.11ah-based IoT.",
                    "A QoS-based Opportunistic Routing Mechanism in Social Internet of Vehicle.",
                    "A Hopfield Neural Networks Based Mechanism for Coexistence of LTE-U and WiFi Networks in Unlicensed Spectrum.",
                    "Locating Delay Fluctuation-Prone Links by Packet Arrival Intervals in OpenFlow Networks.",
                    "Energy Efficient Resource Allocation in UAV-based Heterogeneous Networks.",
                    "Block Analysis in Bitcoin System Using Clustering with Dimension Reduction.",
                    "Reactive Controller Assignment for Failure Resilience in Software Defined Networks.",
                    "Web Server for Analysis and Visualization of Bitcoin Data.",
                    "Detecting Wireless LAN Bottlenecks Using TCP Connection Measurement at Traffic Aggregation Point.",
                    "A Collaborative DDoS Mitigation Solution Based on Ethereum Smart Contract and RNN-LSTM.",
                    "P2PTV Traffic Classification and Its Characteristic Analysis Using Machine Learning.",
                    "Method for Estimating the Damping Coefficient of Oscillation Dynamics in Networks.",
                    "QoS-guaranteed User Association and Resource Allocation with CoMP JT in Ultra-Dense Networks.",
                    "DTCluster: A CFSFDP Improved Algorithm for RFID Trajectory Clustering Under Digital-twin Driven.",
                    "Reliable Design Method for Service Function Chaining.",
                    "Multi-UAVs Collaboration System based on Machine Learning for Throughput Maximization.",
                    "A Monitorable Peer-to-Peer File Sharing Mechanism.",
                    "Design and Implementation of Storage System for Real-time Blockchain Network Monitoring System.",
                    "Network design system recommending similar configurations characterized by manual knowledges.",
                    "SLA Driven Operation - optimizing telecom operation based on SLA -.",
                    "Susceptible-Infection-based Cost-effective Seed Mining in Social Networks.",
                    "Energy Efficient Multi-Tenant Resource Slicing in Virtualized Multi-Access Edge Computing.",
                    "NFVMP: An Architecture for NFV Applications from Multiple Providers.",
                    "Evaluation of the Zero Rating System for MVNO in the New Mobile Network Era.",
                    "Artificial Intelligence-based Service Aggregation for Mobile-Agent in Edge Computing.",
                    "PDMAC-SIC: Priority-based Distributed Low Delay MAC with Successive Interference Cancellation for Industrial Wireless Networks.",
                    "Heterogeneous Data Ensemble Learning in End-to-End Diagnosis for IPTV.",
                    "Long-Term Span Traffic Prediction Model Based on STL Decomposition and LSTM.",
                    "A practical approach with big data analysis for customer-driven network optimization.",
                    "A Data-Over-Sound Application: Attendance Book.",
                    "Data Provenance for Experiment Management of Scientific Applications on GPU.",
                    "Space Weather Data Management System and Monitoring in Decentralized Storage Environment.",
                    "Design of a Data Collection System with Data Compression for Small Manufacturers in Industrial IoT Environments.",
                    "Distributed Approach to Adaptive VNF Manager Placement Problem.",
                    "An SDN-based NAT Traversal Mechanism for End-to-end IoT Networking.",
                    "Flexible Network Resource-Allocation Architecture Using Specification Injection.",
                    "Trajectory Protection Scheme Based on Fog Computing and K-anonymity in IoT.",
                    "A Low-cost Enterprise Application Integration Architecture for Large-scale Environment.",
                    "Visualizing User Action Data to Discover Business Process.",
                    "Hybrid Controller for Securing SDN from Switched DDoS and ARP Poisoning Attacks.",
                    "A Search Approach Based on Query Similarity in Content-Centric Networks.",
                    "A Study on Utilization of Hybrid Blockchain for Energy Sharing in Micro-Grid.",
                    "A Machine Learning Based Smart Irrigation System with LoRa P2P Networks.",
                    "Machine Learning based Link State Aware Service Function Chaining.",
                    "A Method for Extracting Static Fields in Private Protocol Using Entropy and Statistical Analysis.",
                    "CoachAI: A Project for Microscopic Badminton Match Data Collection and Tactical Analysis.",
                    "Enabling Inference Inside Software Switches.",
                    "eVNF - Hybrid Virtual Network Functions with Linux eXpress Data Path.",
                    "Ant-inspired Backoff-based Opportunistic Routing for Ad Hoc Networks.",
                    "Understanding Intelligent RAN Slicing for Future Mobile Networks Through Field Test.",
                    "Joint User Association and Server Scaling in Multi-access Edge Computing.",
                    "RSP Consensus Algorithm for Blockchain.",
                    "Auction Based Resource Trading Using Relation Between Telecommunication Network Failure Rate and Users' Utility.",
                    "Improved Secure Computation over Real Numbers and Its Application to Reliability Engineering.",
                    "Machine Learning-based Prediction of VNF Deployment Decisions in Dynamic Networks.",
                    "Multicast Routing Model to Minimize Number of Flow Entries in Software-Defined Network.",
                    "An Architecture for Managing IoT Device Object in Information Gateway.",
                    "Fault Location Prediction Based on Customer Complaint Amount.",
                    "Research On Routing Incentive Strategy Based On Virtual Credit In VANET.",
                    "Contents Delivery for Autonomous Driving Cars in Conjunction with Car Navigation System.",
                    "A Case Study of Captive-Portal Detection for Web Authentication on Wired LAN in a Campus Network.",
                    "Network Slice Selection Function for Data Plane Slicing in a Mobile Network.",
                    "Inter-Session Network Coding with Clustering Routing in Wireless Delay Tolerant Networks.",
                    "Cache-Decision Policy using User Tastes.",
                    "Bluetooth Mesh Networking: An Enabler of Smart Factory Connectivity and Management.",
                    "Survival Traffic Ratio Analysis for Cascading Failure in Interdependent Networks.",
                    "A New Lossless Compression Scheme for WSNs Using RLE Algorithm.",
                    "Network Security Situation Prediction Based on Long Short-Term Memory Network.",
                    "Artificial Intelligence based Edge Caching in Vehicular Mobile Networks: Architecture, Opportunities, and Research Issues.",
                    "The Design and Simulation of Service Recovery Strategy Based on Recovery Node in Clustering Network.",
                    "A Fault Prediction Method Based on Load-capacity Model in the Communication Network.",
                    "BDD Method for Evaluating Reliability of Traffic-Path-Based Network Model.",
                    "Design and Performance Evaluation of Very Large-scale Optical Frame Switching Networks based on WSS for Future Data Centers.",
                    "Blockchain-based Node-aware Dynamic Weighting Methods for Improving Federated Learning Performance.",
                    "Machine Learning Approach for Automatic Configuration and Management of 5G Platforms.",
                    "Ethereum Behavior Analysis with NetFlow Data.",
                    "Quality of Service Measurement Mechanism of Cloud-Based Network Architecture.",
                    "Implementation and Evaluation of a Multi-Factor Web Authentication System with Individual Number Card and WebUSB.",
                    "Measurement and Analysis of Adult Websites in IPv6 Networks.",
                    "IPDAC: An Integrated IP Address Management Framework for Telecommunication Management Networks.",
                    "Design and Implementation of Container-based M-CORD Monitoring System.",
                    "A SDN Controller Enabled Architecture for the IMS.",
                    "Charging Factors for Enabling SDN/NFV Accounting Management."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "19th APNOMS 2017",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2017",
                "sub_name": "19th Asia-Pacific Network Operations and Management Symposium, APNOMS 2017, Seoul, Korea (South), September 27-29, 2017.",
                "count": 86,
                "papers": [
                    "Keynotes: Keynote 1: SKT's vision and plan for next-gen OSS in 5G era.",
                    "A framework for discovering maritime traffic conflict from AIS network.",
                    "Adaptive shipborne base station sleeping control for dynamic broadband maritime communications.",
                    "Scalable TDMA cluster-based MAC (STCM) for multichannel vehicular networks.",
                    "Collaborative security attack detection in software-defined vehicular networks.",
                    "A QoS-based ONU Group planning algorithm for smart grid communication network.",
                    "Emerging network technologies and network neutrality conformance.",
                    "Building IP geolocation database from online used market articles.",
                    "Identification of user behavior from flow statistics.",
                    "Regional fault tolerant recovery mechanism for multilayer networks.",
                    "Knowledge-defined networking using in-band network telemetry.",
                    "Enabling network function virtualization over heterogeneous resources.",
                    "A novel vCPE framework for enabling virtual network functions with multiple flow tables architecture in SDN switches.",
                    "Service failure diagnosis in service function chain.",
                    "Towards ONOS-based SDN monitoring using in-band network telemetry.",
                    "Towards comprehensive protection for OpenFlow controllers.",
                    "Design of optical aggregation network with carrier edge functions virtualization.",
                    "OpenAPI-based message router for mashup service development.",
                    "A survivability-based backup approach for controllers in multi-controller SDN against failures.",
                    "Enforcing users' constraints in dynamic, software-defined networks of devices.",
                    "IO visor-based packet tracing and collection over distributed SmartX server-switch boxes.",
                    "An integrated security monitoring system for digital service network devices.",
                    "Firmware over the air for home cybersecurity in the Internet of Things.",
                    "Design and implementation of security system for cloud storage.",
                    "Threshold estimation in self-destructing scheme using regression analysis.",
                    "Multi-stage stackelberg game approach for colocation datacenter demand response.",
                    "Distributed analytics in fog computing platforms using tensorflow and kubernetes.",
                    "Queueing theoretic approach to job assignment strategy considering various inter-arrival of job in fog computing.",
                    "iSDF: An integrated software-defined computing framework for scientific experiments.",
                    "Traffic management using value function-based regulation.",
                    "Backhaul virtualization for multiple services in public WLANs.",
                    "Ruin theory based modeling of fair spectrum management in LTE-U.",
                    "A hybrid pull-push protocol in hybrid CDN-P2P mesh-based architecture for live video streaming.",
                    "D2D communications under LTE-U system: QoS and co-existence issues are incorporated.",
                    "Layered video communication in ICN enabled cellular network with D2D communication.",
                    "Performance measurements of 360° video streaming to head-mounted displays over live 4G cellular networks.",
                    "The exploration of machine learning for abnormal prediction model of telecom business support system.",
                    "Using kernel density estimation to target customer complaint handling service.",
                    "Orchestration of NFV virtual applications based on TOSCA data models.",
                    "Effect of the penalty on the QoS received by multihomed clients.",
                    "Load balancing for multiple controllers in SDN based on switches group.",
                    "A classification-based elephant flow detection method using application round on SDN environments.",
                    "Design and implement a mobile badminton stroke classification system.",
                    "Location-aware dynamic network provisioning.",
                    "Suspicious traffic detection based on edge gateway sampling method.",
                    "Could we beat a new mimicking attack?",
                    "File transfer framework with multipath transfer in heterogeneous networks for disaster recovery.",
                    "Evaluating scheduling strategies in LOD based application.",
                    "Sky-Scope : Skype application traffic identification system.",
                    "High-reliable WDM optical access network expanding by double fiber-tangent-ring topology.",
                    "Experimental evaluation of a path switching function to avoid delay spikes in wireless LANs.",
                    "Survey on network protocol reverse engineering approaches, methods and tools.",
                    "Feasibility study for simulating community based content caching on CCN network using ndnSIM simulator.",
                    "Design and implementation of a service-oriented network provisioning system for network as a service.",
                    "Topology design for multihop cellular network.",
                    "Dynamic reordering bloom filter.",
                    "Sliced NFV service chaining in mobile edge clouds.",
                    "Forwarding path discovery with software defined networking.",
                    "FERA: A caching scheme in CCN using file-extension and regression analysis.",
                    "iToy: A LEGO-like solution for small scale IoT applications.",
                    "A3N: Agile application-awareness in software-defined networks.",
                    "Application-aware traffic engineering in software-defined network.",
                    "Reliable vehicle selection algorithm with dynamic mobility of vehicle in vehicular cloud system.",
                    "Performance analysis of H.264, H.265, VP9 and AV1 video encoders.",
                    "Structured whitelist generation in SCADA network using PrefixSpan algorithm.",
                    "Enhancing service resiliency in the next generation EPC system.",
                    "Parallel and local diagnostic algorithm for wireless sensor networks.",
                    "A hybrid live streaming mode for a reliable service.",
                    "User clustering based on correlation in 5G using semidefinite programming.",
                    "DownlinK power allocation in virtualized wireless networks.",
                    "SigManager: Automatic payload signature management system for the classification of dynamically changing internet applications.",
                    "An approach of cost optimized influence maximization in social networks.",
                    "Browser's \"search form\" issues and countermeasures.",
                    "Access point selection algorithm for providing optimal AP in SDN-based wireless network.",
                    "Collaborative cache allocation and computation offloading in mobile edge computing.",
                    "Infrastructure-assisted hybrid road-aware routing and QoS provisioning in VANETs.",
                    "Mobile charger billing system using lightweight Blockchain.",
                    "Reliable smart energy IoT-cloud service operation with container orchestration.",
                    "Probabilistic k-weighted coverage placement in wireless sensor networks.",
                    "A traffic grouping method using the correlation model of network flow.",
                    "Classification of application traffic using tensorflow machine learning.",
                    "Power allocation games for cooperative coordinated multipoint transmission scheme.",
                    "Information fusion based agile streaming telemetry for intelligent traffic analytics of softwarized network.",
                    "An ontology-based hybrid approach for accurate context reasoning.",
                    "Application identification system for SDN QoS based on machine learning and DNS responses.",
                    "The unique reliable identity system of enabling lightweight device management in NMS mechanism for the U-IoT."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "18th APNOMS 2016",
        "info": "Kanazawa, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2016",
                "sub_name": "18th Asia-Pacific Network Operations and Management Symposium, APNOMS 2016, Kanazawa, Japan, October 5-7, 2016.",
                "count": 98,
                "papers": [
                    "Small cells placement scheme in metropolitan area environment.",
                    "Joint base station association and power control for uplink cognitive small cell network.",
                    "Pricing and revenue optimization strategy in macro-femto heterogeneous networks.",
                    "QoS aware collaborative communications with incentives in the downlink of cellular network: A matching approach.",
                    "Charging models for M2M communications.",
                    "Enhanced registration procedure with NAV for mitigated contentions in M2M communications.",
                    "Decentralized spectrum allocation in D2D underlying cellular networks.",
                    "Design and implementation of a Cluster-based Channel Assignment in high density 802.11 WLANs.",
                    "ICBMS SM: A Smart Mediator for mashup service development.",
                    "Dynamic module deployment in a fog computing platform.",
                    "A reinforcement learning approach for cost- and energy-aware mobile data offloading.",
                    "Mobile malware detection in sandbox with live event feeding and log pattern analysis.",
                    "A PSO-based wireless network virtual mapping algorithm in smart grid.",
                    "A load-balancing-based fault-tolerant mapping method in smart grid virtual networks.",
                    "An adaptive load monitoring solution for logically centralized SDN controller.",
                    "Dynamic application load balancing in distributed SDN controller.",
                    "GreSDN: Toward a green software defined network.",
                    "Failure detection service with low mistake rates for SDN controllers.",
                    "Backup-resource based failure recovery approach in SDN data plane.",
                    "Application-aware Traffic Management for OpenFlow networks.",
                    "Impact of item popularity and chunk popularity in CCN caching management.",
                    "Packet cache network function for peer-to-peer traffic management with Bloom-filter based flow classification.",
                    "P2PTV multi-channel peers analysis.",
                    "Interference-aware video streaming over crowded unlicensed spectrum.",
                    "Network-aware service function chaining placement in a data center.",
                    "High speed Optical Flow Switch architecture design and IDC application based on SDN technologies.",
                    "Equation-based Multicast Congestion control in Data Center networks.",
                    "Forwarding mechanism using prioritized forwarders for opportunistic routing.",
                    "Context-Aware Routing for hovering information in Vehicular Ad-Hoc Networks.",
                    "Discovering Maritime Traffic Route from AIS network.",
                    "Modified Controlling Queue Delay for TCP fairness improvement.",
                    "Finding the highly efficient application signature through payload signature quality evaluation.",
                    "Adaptive mobile application identification through in-network machine learning.",
                    "A new fusion structure model for real-time urban traffic state estimation by multisource traffic data fusion.",
                    "Delay-insensitive traffic detection and transfer on network edges.",
                    "Evidence-based context-aware log data management for integrated monitoring system.",
                    "An HMM-based performance diagnosis approach for Hadoop clusters.",
                    "Yang Data Model for SFC Control Plane.",
                    "Auto scaling of containerized ACSs for CPE management.",
                    "Design of service abstraction model for enhancing network provision in future network.",
                    "SFS: A massive small file processing middleware in Hadoop.",
                    "Crowdsourcing platform for collaboration management in vulnerability verification.",
                    "Computational time complexity of allocation problem for distributed servers in real-time applications.",
                    "Primary reference time clocks performance monitoring using GNSS common-view technique in telecommunication networks.",
                    "An integrated security testing framework for Secure Software Development Life Cycle.",
                    "The monitoring system of Business support system with emergency prediction based on machine learning approach.",
                    "Towards task scheduling in a cloud-fog computing system.",
                    "sFlow-based resource utilization monitoring in clouds.",
                    "A SLA-based Spark cluster scaling method in cloud environment.",
                    "The effect of audiovisual cross-modality on QoE of Multi-View Video and Audio IP transmission.",
                    "A crowdsourcing-based road anomaly classification system.",
                    "Development of QoE initiated wireless LAN base station with DPI based QoS control.",
                    "Congestion field detection for Service Quality improvement using Kernel density estimation.",
                    "Distributed resource allocation for interference management and QoS guarantee in underlay cognitive femtocell networks.",
                    "Policy-based verification method for configurations of large network with header-space analyses.",
                    "Improving quality of experience in P2P IPTV.",
                    "An optimized solution of application layer protocol identification based on regular expressions.",
                    "Whitelist representation for FTP service in SCADA system by using structured ACL model.",
                    "Mitigating DDoS attacks towards Top Level Domain name service.",
                    "Security analysis of a NTRU-based mutual authentication scheme.",
                    "Power modeling of BSs based on energy storage monitoring.",
                    "Efficient data collection for participatory sensing using smartphones.",
                    "A Multi-Applications Comprehensive Traffic Prediction model for the electric power data network.",
                    "LM-BP based operation quality assessment method for OTN in Smart grid.",
                    "RTagCare: Deep human activity recognition powered by passive computational RFID sensors.",
                    "A two-layer hierarchical framework for activity sequence recognition by wearable sensors.",
                    "An efficient and reliable Green Light Optimal Speed Advisory system for autonomous cars.",
                    "Volume and irregularity effects on massively multicore packet processors.",
                    "Double ended Spectrum Defragmentation on Software Defined optical Networks.",
                    "A proposal of SDN based mobility management in multiple domain networks.",
                    "Resources management in virtualized Information Centric Wireless Network.",
                    "Scalable aggregation-based packet forwarding in Content Centric Networking.",
                    "A Shapley value-based forwarding strategy in Information-Centric Networking.",
                    "Propose of the dynamic route switching method in Information-Centric Networking-based wireless sensor network.",
                    "Delivering Scalable Video Streaming in ICN enabled Long Term Evolution networks.",
                    "Online learning-based clustering approach for news recommendation systems.",
                    "Anonyropy: An efficient anonymization scheme using entropy in smart mediator for mashup service.",
                    "Support path with time constraint in wireless sensor networks.",
                    "A novel approach of mobility management for the D2D communications in 5G mobile cellular network system.",
                    "Performance analysis of indoor-outdoor wireless caching relay system.",
                    "A method for reducing TCP latency due to consecutive packet losses in mobile networks.",
                    "Estimating available bandwidth in mobile networks by correlation coefficient.",
                    "Mobile bandwidth sharing: Pricing analysis under buffet plans.",
                    "An experimental study of reliable wireless communications in vehicles.",
                    "User matching game in virtualized 5G cellular networks.",
                    "A Double-Auction mechanism for wireless charging networks.",
                    "A new method to evaluate flow classified one-to-all reliability.",
                    "DNS recursive server health evaluation model.",
                    "TOCA: A Tenant-Oriented Control Architecture for multi-domain Cloud Networks.",
                    "A load balancing mechanism for multiple SDN controllers based on load informing strategy.",
                    "A converged network architecture for ICT and IoT combined applications.",
                    "Propose of the dynamic routing methods using available bandwidth and degree for congestion avoidance.",
                    "Bandwidth distribution for applications in slicing network toward SDN on vCPE framework.",
                    "Payload signature structure for accurate application traffic classification.",
                    "Finding realistic shortest path in road networks with lane changing and turn restriction.",
                    "Routing discovery mechanism based on fault tolerance in container yard environment.",
                    "Application performance improvement with application aware DPN switches.",
                    "Improvement of WMNs routing method for the purpose of reduction of control communications."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "17th APNOMS 2015",
        "info": "Busan, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2015",
                "sub_name": "17th Asia-Pacific Network Operations and Management Symposium, APNOMS 2015, Busan, South Korea, August 19-21, 2015.",
                "count": 106,
                "papers": [
                    "Towards consistent software defined networking with logic programming.",
                    "Ryuo: Using high level northbound API for control messages in software defined network.",
                    "A telco's perspectives: Open and flexible transport SDN.",
                    "Towards a detailed OpenFlow emulator.",
                    "Road aware QoS routing in VANETs.",
                    "Performance evaluation of time slot based QoS aware ad hoc network scheme for CBR and TCP flows.",
                    "IPv4 and IPv6 performance comparison in IPv6 LTE network.",
                    "Load-sharing based on relay-aided cooperative modeling in uplink two-tier cellular networks.",
                    "Location selection with user behavior analysis for telecom operator's service halls.",
                    "Energy-efficient method of data transmission in the mobile network.",
                    "Data offloading in heterogeneous cellular networks: Stackelberg game based approach.",
                    "A simple real-time handover management in the mobile satellite communication networks.",
                    "Efficient payload signature structure for performance improvement of traffic identification.",
                    "A metric-correlation-based distributed fault detection approach in wireless sensor networks.",
                    "Signature management system to cope with traffic changes in application and service.",
                    "Android malware detection using multivariate time-series technique.",
                    "Hybrid caching and requests forwarding in information centric networking.",
                    "Routing for content oriented networks using dynamic ant colony optimization.",
                    "Dynamic lightpath establishment for achieving low power all-optical networks.",
                    "Adaptive multipath routing for large-scale layered networks.",
                    "A media distribution tree construction method using a maximum spanning tree for mobile smart devices.",
                    "Effective resource multiplexing for scientific workflows.",
                    "A real-time stream recovery scheme for recording IPTV programs.",
                    "Web performance acceleration by caching rendering results.",
                    "Probabilistic modeling for IPTV network diagnosis and troubleshooting.",
                    "Providing flexible authorization for shared group spaces by the attribute registration system.",
                    "MOE-A framework integrating network performance monitoring, optimization and evaluation.",
                    "An hourly day-ahead Paris Metro Pricing scheme for mobile data networks.",
                    "Oligopoly competition in time-dependent pricing for improving revenue of network service providers considering different QoS functions.",
                    "A distributed bandwidth assignment method for large file transfer with time constraints.",
                    "The new architecture of FC storage network based on controller.",
                    "Networking agent for overlay L2 routing and overlay to underlay external networks L3 routing using OpenFlow and Open vSwitch.",
                    "PID-based adaptive control plane management method for software-defined networks.",
                    "Minimizing flow initialization latency in Software Defined Networks.",
                    "A Fog based system model for cooperative IoT node pairing using matching theory.",
                    "Universal fault detection for NFV using SOM-based clustering.",
                    "A shared parking model in vehicular network using fog and cloud environment.",
                    "Smart home web of objects-based IoT management model and methods for home data mining.",
                    "Tele-cardiotocograph enabled by mobile technology.",
                    "A preliminary study on SPC-crowd pavement indexing.",
                    "Group mobility based clustering algorithm for mobile ad hoc networks.",
                    "Router offload strategies with an optical flow switch based on LCoS technologies.",
                    "Cloud service enabling architecture for multi-vendor environment.",
                    "Delay insertion based P2PTV traffic localization considering available bandwidth of logical link.",
                    "Weighted routing in hierarchical multi-domain SDN controllers.",
                    "An efficient scheme of bulk traffic statistics collection for software-defined networks.",
                    "Integrating machine-to-machine measurement framework into oneM2M architecture.",
                    "A comprehensive composite digital services quality assurance application on intelligent transportation system.",
                    "Optimal location of electric vehicle charging stations using genetic algorithm.",
                    "Design of a media stream relay engine on the Android OS.",
                    "A robust group synchronization approach to network congestion based on control events for media streaming.",
                    "A model of SDN controllers supporting for processing of flows based on the IMS.",
                    "Crowdsourced QoE evaluation of mobile device usage with consideration on user dependence.",
                    "A max-flow/min-cut theory based multi-domain virtual network splitting mechanism.",
                    "The implementation of domain routing protocol in hierarchical domain network model.",
                    "Network operation simulation platform for network virtualization environment.",
                    "Detecting network neutrality violations through packet loss statistics.",
                    "Traffic analysis of a social mobile game.",
                    "The evaluation of next-generation copper-wire technology.",
                    "HiLiCLoud: High performance and lightweight mobile cloud infrastructure for monitor and benchmark services.",
                    "Scalable and elastic cloud data center for self-organizing dense small cell networks.",
                    "Framework for multi-level application traffic identification.",
                    "Research on automatic header-signature naming system for Internet service identification.",
                    "A new method for constructing dynamic VPN cooperating with OpenFlow control technology and healthcare PKI.",
                    "Traffic offloading under outage QoS constraint in heterogeneous cellular networks.",
                    "Resource management in dense heterogeneous networks.",
                    "Visualization of elephant flows and QoS provisioning in SDN-based networks.",
                    "Web server performance enhancement by suppressing network traffic for high performance client.",
                    "A fault diagnosis method for smart home services.",
                    "Management of IoT traffic using a virtualized IMS platform.",
                    "IPlug and dSocket: A new network API for decoupling identifier and locator.",
                    "Network-assisted congestion control for information centric networking.",
                    "Adaptive flow monitoring in SDN architecture.",
                    "Automatic detection of vulnerabilities for advanced security analytics.",
                    "Architectural perspective on collaborative multipath TCP in mobile environment.",
                    "Towards selecting optimal features for flow statistical based network traffic classification.",
                    "A study on shared and non-shared billing for mobile service.",
                    "A method for service identification of SSL/TLS encrypted traffic with the relation of session ID and Server IP.",
                    "High performance payload signature-based Internet traffic classification system.",
                    "A testing-based approach to SLA evaluation on cloud environment.",
                    "User satisfaction fairness based optimal charging algorithm for multiple devices.",
                    "Is container-based technology a winner for high performance scientific applications?",
                    "Optimal middlebox function placement in virtualized evolved packet core systems.",
                    "The study of document filter for smart device.",
                    "Reduced-reference video QoE assessment method based on image feature information.",
                    "A light-weight application monitoring and statistical debugging for a black-box application.",
                    "Inter-vessel traffic service data exchange format protocol security enhancement of user authentication scheme in mobile VTS middleware platform.",
                    "The upcoming new standard HTTP/2 and its impact on multi-domain websites.",
                    "Network information sharing system with peer-to-peer network applications.",
                    "Power consumption modeling of base stations based on dynamic factors.",
                    "Fault location algorithm based on probe in Electric Power Data Network.",
                    "Virtualized traffic monitoring function and resource auto-scaling in software-defined networks.",
                    "Time-based DDoS detection and mitigation for SDN controller.",
                    "Security analysis based on Trusted Environment (TRE) of M2M/IoT.",
                    "Semantic resource classification using statistical analysis for application characteristics in intercloud environment.",
                    "Lightweight service discovery protocols for constrained environment.",
                    "Cooperative content delivery for cost minimization in wireless networks.",
                    "Single-sided quality measuring method for Giga Internet.",
                    "Improved user mobility management scheme for supporting fast data transmission.",
                    "Mobile application access design for user-defined network infrastructure.",
                    "SDN based optimal user association and resource allocation in heterogeneous cognitive networks.",
                    "OF@TEIN resource-level visibility for SDN-enabled distributed cloud testbed.",
                    "Network and system management object modeling for smart grid infrastructure.",
                    "Defense technique against spoofing attacks using reliable ARP table in cloud computing environment.",
                    "A procedure to achieve cost and performance optimization for recovery in cloud computing.",
                    "SDN and NFV benchmarking for performance and reliability."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "16th APNOMS 2014",
        "info": "Hsinchu, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2014",
                "sub_name": "The 16th Asia-Pacific Network Operations and Management Symposium, APNOMS 2014, Hsinchu, Taiwan, September 17-19, 2014.",
                "count": 107,
                "papers": [
                    "Multi-objective optimization-based traffic engineering for data center networks.",
                    "Assessing the quality of experience of HTTP video streaming considering the effects of pause position.",
                    "Distributed object storage toward storage and usage of packet data in a high-speed network.",
                    "A framework of code reuse in open source software.",
                    "Application traffic classification in Hadoop distributed computing environment.",
                    "Software-defined QoE measurement architecture.",
                    "User experience optimization for personal services.",
                    "Application dependency tracing for message oriented middleware.",
                    "Analysis of ICMP policy for edge firewalls using active probing.",
                    "Opportunistic resource allocation via stochastic network optimization in cognitive radio networks.",
                    "QoE-driven bandwidth allocation method based on user characteristics.",
                    "IPv6 operations and deployment scenarios over SDN.",
                    "A flexible architecture of real-time audio transmission to heterogeneous devices for surveillance system.",
                    "The strategy of probe station selection of active probing in WSNs.",
                    "Reliability-oriented clustering algorithm for service search in ubiquitous stub environments.",
                    "SDN-based architecture for end-to-end path provisioning in the mixed circuit and packet network environment.",
                    "A best practice of Java-based applications migration with variety of software solutions.",
                    "Network operational method by using software-defined networking for improvement of communication quality at disasters.",
                    "SQUARE: FF on CUBIC TCP over Links with Different RTT.",
                    "Collaboration of IMS and SDN to enable new ICT service creation.",
                    "Multi-layer fault diagnosis method in the Network Virtualization Environment.",
                    "Mobile ticket dispenser system with waiting time prediction.",
                    "A comparison of 4G telecommunications tariff plans in Asia countries.",
                    "Building a CDR analytics platform for real-time services.",
                    "An efficient provisioning mechanism for in-service migration in access network.",
                    "Evolution of network configurations: High-level analysis of an operational IP backbone network.",
                    "Supporting groupware communication with topology-enhanced content-based network.",
                    "Quality management and network faults diagnosis for IPTV service.",
                    "SRP: A routing protocol for data center networks.",
                    "Auto-scaling method in hybrid cloud for scientific applications.",
                    "Big data processing framework of road traffic collision using distributed CEP.",
                    "Adaptive decision making for improving trust establishment in VANET.",
                    "A high-speed method for evaluating one-to-all reliability.",
                    "Path capacity estimation by passive measurement for the constant monitoring of every network path.",
                    "On the resilience of software defined routing platform.",
                    "Sales process management of project-based telecom services.",
                    "Software defined networking-based traffic engineering for data center networks.",
                    "Multiple features for image retrieval in distributed datacenter.",
                    "Active packet dropping for improving performance fairness among modern TCPs.",
                    "An implementation model and solutions for stepwise introduction of SDN.",
                    "Autonomous retransmission control with neighbour terminals for ad hoc networks.",
                    "Consistent hashing based cooperative caching and forwarding in content centric network.",
                    "e-VeMAC: An enhanced vehicular MAC protocol to mitigate the exposed terminal problem.",
                    "QoE-oriented resource management strategy by considering user preference for video content.",
                    "Network dimensioning methodology in packet-optical transport network.",
                    "A VoLTE traffic classification method in LTE network.",
                    "A flexible public cloud based testing service for heterogeneous testing targets.",
                    "Linux kernel-based feature selection for Android malware detection.",
                    "Dynamic internet pricing and bandwidth guarantees with nash equilibrium.",
                    "A QoS supporting ad hoc network protocol combing admission based TDMA and 802.11 DCF.",
                    "In-network guide performance in wireless multi-hop cache networks.",
                    "Performance analysis and validation of high QoS route navigation for mobile users.",
                    "Time and frequency transfer system for synchronization applications.",
                    "BP neural network-based web service selection algorithm in the smart distribution grid.",
                    "Energy efficient virtual network embedding for path splitting.",
                    "Price competition in a duopoly IaaS cloud market.",
                    "Opportunistic resource sharing in mobile cloud computing: The single-copy case.",
                    "A mobility clustering-based roadside units deployment for VANET.",
                    "Packet out-of-order and retransmission in statistics-based traffic analysis.",
                    "CHT cloud orchestration: An integrated cloud system of virtualization platform.",
                    "Model for cost evaluation of OSS data integration.",
                    "A novel 3D beamforming scheme for LTE-Advanced system.",
                    "Quality of service test mechanism and management of broadband access network.",
                    "A load balance algorithm based on nodes performance in Hadoop cluster.",
                    "A context-aware content delivery framework for QoS in mobile cloud.",
                    "A scalable flow rule translation implementation for software defined security.",
                    "Efficient model checking of OpenFlow networks using SDPOR-DS.",
                    "PowerGuide: Accurate Wi-Fi power estimator for smartphones.",
                    "Hawkeye: Finding spamming accounts.",
                    "A dynamic taint tracking based method to detect sensitive information leaking.",
                    "Managing syslog.",
                    "Applying NetInf for the M2M service platform.",
                    "Evaluation of information-centric networking in mobile and distributed environment using wide-area test bed.",
                    "Aggregation management design for user-defined network infrastructure.",
                    "Challenges from voice-over-LTE to video-over-LTE.",
                    "A random switching traffic scheduling algorithm for data collection in wireless mesh network.",
                    "UDP traffic classification using most distinguished port.",
                    "An on-line anomaly detection method based on LMS algorithm.",
                    "Mobile network configuration for large-scale multimedia delivery on a single WLAN.",
                    "The mathematic model for site selection of central office consolidation.",
                    "A vehicle speed estimation method based on using voice call signals.",
                    "Optimal resource allocation for multimedia application in single and multiple cloud computing service providers.",
                    "A traffic load balancing method for component-based service platform with heterogeneous wireless access networks.",
                    "Location-aware services based on Wi-Fi network.",
                    "An intelligent image-based customer analysis service.",
                    "Synergy-aware selection mechanism for high quality and sustainability of ubiquitous services.",
                    "Performance study of downlink scheduling for video streaming in LTE network.",
                    "Priority control using multi-buffer for DTN.",
                    "A novel traffic information estimation method based on mobile network signaling.",
                    "Sensor failure detection and recovery mechanism based on support vector and genetic algorithm.",
                    "Self-optimized cloud RAN based smart zone.",
                    "MORSA: A multi-objective resource scheduling algorithm for NFV infrastructure.",
                    "The design and performance of the hybrid access network for FTTH bottleneck areas.",
                    "Enhancing OpenFlow actions to offload packet-in processing.",
                    "Extending Dijkstra's shortest path algorithm for software defined networking.",
                    "A pipe-assisted mobility management in named data networking networks.",
                    "An energy-saving mechanism for mobile terminals based on LTE-A uplink CoMP.",
                    "Mediating between OpenFlow and legacy transport networks for bandwidth on-demand Services.",
                    "DCP: An efficient and distributed data center cache protocol with Fat-Tree topology.",
                    "Utilizing group prediction by users' interests to improve the performance of web proxy servers.",
                    "vConductor: An NFV management solution for realizing end-to-end virtual network services.",
                    "A performance comparison of in-memory Virtual Desktop Environment.",
                    "Implementation of a distributed web community crawler.",
                    "Network-wide traffic visibility in OF@TEIN SDN testbed using sFlow.",
                    "Routing algorithm of smart grid data collection based on data balance measurement model.",
                    "Design of handover self-optimization using big data analytics.",
                    "A reliable multi-hop safety message broadcast in Vehicular Ad hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "15th APNOMS 2013",
        "info": "Hiroshima, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2013",
                "sub_name": "15th Asia-Pacific Network Operations and Management Symposium, APNOMS 2013, Hiroshima, Japan, September 25-27, 2013.",
                "count": 83,
                "papers": [
                    "Service rate test mechanism and management of broadband access network.",
                    "Bandwidth guaranteed method to relocate virtual machines for edge cloud architecture.",
                    "The design of integrated mobile SNS gateway structure.",
                    "Virtual machine placement algorithms to minimize physical machine count.",
                    "Integrating legacy forwarding environment to OpenFlow/SDN control plane.",
                    "Topology construction method for multi-overlay sensor networks.",
                    "Analysis of peer cluster layers selection criteria for P2P contents distribution systems.",
                    "A successful application of big data storage techniques implemented to criminal investigation for telecom.",
                    "Towards automatic signature generation for identification of HTTP-based applications.",
                    "IDS for detecting malicious non-executable files using dynamic analysis.",
                    "Topology-aware remapping to survive virtual networks against substrate node failures.",
                    "Error analysis of an estimation method using RTT for available bandwidth of a bottleneck link.",
                    "Distributed connection admission control integrated with pricing for QoS provisioning and revenue maximization in wireless random access networks.",
                    "Short Message Service for Internet-Mobile platform.",
                    "The improvement of auto-scaling mechanism for distributed database - A case study for MongoDB.",
                    "Cognitive rate adaptation for high throughput IEEE 802.11n WLANs.",
                    "Randomized interconnection networks in clouds.",
                    "A shortest path based automatic composition method of Semantic Web services.",
                    "Incoming traffic modeling of heterogeneous Public Safety Network.",
                    "Efficiently scheduling Cloud resources for peak or urgent events in telecom system.",
                    "A cost-effective approach to evaluating security vulnerability scanner.",
                    "An energy efficient user context collection method for smartphones.",
                    "A workload prediction-based multi-VM provisioning mechanism in cloud computing.",
                    "Application traffic classification using statistic signature.",
                    "A tiering architecture for integrated network management system.",
                    "Time-dependent pricing for revenue maximization of network service providers considering users preference.",
                    "Control scenario based Energy Savings Scheme on SG-BEMS.",
                    "Application layer flow classification in SDN.",
                    "A distributed energy saving mechanism in wireless access network.",
                    "Korea Micro Energy Grid Technology.",
                    "Reception cycle-aware resource block allocation for real time video traffic in 3GPP LTE system.",
                    "An efficient and reliable MAC for Vehicular Ad Hoc Networks.",
                    "Multi-cloud service fulfillment architecture for enabling digital rain forest.",
                    "Implementation of a novel management development platform for virtual networks.",
                    "A prototype of service platform uniting network control in multiple OpenFlow domains.",
                    "Managing distributed storage system through network redesign.",
                    "Psychic: An autonomic inference engine for M2M management in Future Internet.",
                    "A ripple form RSRP based algorithm for load balancing in downlink LTE self-optimizing network.",
                    "Transformation of PSTN to Next Generation Network.",
                    "NA-LAR: NAV based load aware routing protocol for wireless mesh networks.",
                    "Application of Synchronized Multi-Hop Protocol to time-variable multi-rate and multi-hop wireless network.",
                    "Resource relation map based fault diagnosis and fault tolerance methods for home network environments.",
                    "A dynamic network access control mechanism for virtual desktop environment.",
                    "Comparisons of power-saving efficiency for QoS traffics in LTE network by burst scheduling.",
                    "Design and develop an OpenFlow Testbed within virtualized architecture.",
                    "Method for visualizing information from large-scale carrier networks.",
                    "Maximum entropy based randomized routing in data-centric networks.",
                    "Business impact analysis of a mediator between the network management systems of the IP/MPLS network and the transport network.",
                    "Load distribution of an OpenFlow controller for role-based network access control.",
                    "Deployment scheduling of Contingency Cellular Network for disaster relief operations.",
                    "Correlation analysis between inference accuracy and inference parameters for stateless firewall policy.",
                    "Self-organizing Energy-Saving mechanism with base stations cooperation for heterogeneous cellular networks.",
                    "An IPv6-enabled Software-Defined Networking architecture.",
                    "A novel network-centric infrastructure for social networking services using a messaging network.",
                    "Performance improvement of payload signature-based traffic classification system using application traffic temporal locality.",
                    "A SLA driven VM auto-scaling method in hybrid cloud environment.",
                    "Services paths planning for Electric Power Communication Network based on improved Ant Colony Optimization.",
                    "A server-assisted provisioning method for machine-to-machine gateway.",
                    "Experiments with practical on-demand multi-core packet capture.",
                    "Fast Overlapping Algebraic Traceback.",
                    "An efficient method to maintain the header signatures for internet traffic identification.",
                    "Analysis and performance evaluation of data transport methods in Content-Centric Networking.",
                    "A no-reference hybrid objective QoE evaluation for MPEG-4 encoded video.",
                    "OSS data integration using virtual database.",
                    "Dynamic cooperating set planning for Coordinated Multi-Point (CoMP) in LTE/LTE-advanced systems.",
                    "Calibration of DNS delegation misleading.",
                    "Theil-Equilibrium based Cooperation Mechanism for multi-services in ubiquitous stub enironments.",
                    "A new digital convergence technique in BSS - A case study of integrated telecom order system.",
                    "An improvement of OLSR using fuzzy logic based MPR selection.",
                    "Designing temporally and spatially integrated social mobility models for wireless network researches.",
                    "Hierarchical resource management system on network virtualization platform for reduction of virtual network embedding calculation.",
                    "Effectiveness of performance flag selection for enhancing Tor circuits.",
                    "A MAC address based authentication system applicable to campus-scale network.",
                    "A cell outage compensation scheme based on immune algorithm in LTE networks.",
                    "Pricing reserved and On-Demand Schemes of cloud computing based on option pricing model.",
                    "Routing information management for content oriented networks using Bloom Filters.",
                    "Graph clustering based provisioning algorithm for optimal inter-cloud service brokering.",
                    "A design of energy-efficient resource sharing overlay network in Mobile Cloud Computing.",
                    "A best practice of enterprise information integration platform in telecom industry.",
                    "A M2M horizontal services platform implementation over IP multimedia subsystem (IMS).",
                    "End-to-end path loss inference algorithm with network tomography.",
                    "Improved processing speed of traffic classification based on payload signature hierarchy.",
                    "A risk recommendation approach for information security risk assessment."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "14th APNOMS 2012",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2012",
                "sub_name": "14th Asia-Pacific Network Operations and Management Symposium, APNOMS 2012, Seoul, Korea (South), September 25-27, 2012.",
                "count": 61,
                "papers": [
                    "An improved network performance anomaly detection and localization algorithm.",
                    "QoS-aware service selection in virtualization-based Cloud computing.",
                    "Optimization of energy saving in celluar networks using ant colony algorithm.",
                    "An enhanced multi-channel MAC protocol for wireless ad hoc networks.",
                    "Pricing control for hybrid overlay/underlay spectrum access in Cognitive Radio networks.",
                    "Context management for user-centric context-aware services over pervasive networks.",
                    "A threat model for security specification in security evaluation by ISO/IEC 19791.",
                    "Application-centric Wi-Fi energy management on smart phone.",
                    "Integrated hybrid MAC and topology control scheme for M2M area networks.",
                    "Web application virtualization for IPTV.",
                    "DDoS attack forecasting system architecture using Honeynet.",
                    "Integrated analysis method on HTTP traffic.",
                    "Applicaion-level traffic analysis of smartphone users using embedded agents.",
                    "UM3 data exchange model and encoding rules.",
                    "A seamless content delivery scheme for flow mobility in Content Centric Network.",
                    "Event-based estimation of user experience for network video streaming.",
                    "A load balancing algorithm with QoS support over heterogeneous wireless networks.",
                    "A cooperative MAC providing alternate path for the poor link.",
                    "Customer energy management platform in the Smart Grid.",
                    "Towards smart phone traffic classification.",
                    "Performance analysis of multi-layered protection switching with control-forwarding separation.",
                    "Application traffic identification based on remote subnet grouping.",
                    "Intelligent M2M network using healthcare sensors.",
                    "Applying Tesseract-OCR to detection of image spam mails.",
                    "Carrier-grade distributed open cloud computing for telecom operators.",
                    "Data aggregation for Vehicular Ad-hoc Network using particle swarm optimization.",
                    "Smart moving: A SPaT-based advanced driving-assistance system.",
                    "Misconfiguration detection for cloud datacenters using decision tree analysis.",
                    "A game-theoretic analysis of interaction between overlay routing and multihoming.",
                    "Design of Contingency Cellular Network.",
                    "Challenges of system virtualization.",
                    "An architecture on proactive detecting, quarantining, and terminating resource leakage of Java-based applications.",
                    "A dynamic resource allocation method in IaaS based on deadline time.",
                    "Dynamic bandwidth reallocation for NG-SDH networks based on Real-time Traffic Flow Analysis.",
                    "A light-weight periodic data collection approach of TR-069 managed CPEs.",
                    "Flattening and preferential attachment in the internet evolution.",
                    "MDA-based network management information model transformation from UML to Web Services.",
                    "An image-based annotation technique to overlay users' knowledge on existing systems.",
                    "Energy reducing dynamic multi-dimensional resource allocation in cloud data center.",
                    "Data allocation method considering server performance and data access frequency with consistent hashing.",
                    "Design and implementation of Group Accounting System based on 3GPP Policy and Charging Control.",
                    "An energy efficient resource management method in virtualized cloud environment.",
                    "Proposed IMS Architectures for evaluation QoE of the IPTV service.",
                    "Problems and feasibility consideration of service-forcused monitoring OSS over mobile networks.",
                    "Distributed GMPLS optical control in translucent wavelength convertible WDM networks.",
                    "Design and implementation of database schema evolution for service continuity of web-based internet applications.",
                    "A bandwidth management method using available wavelength resources in backend servers for network services based on distributed components.",
                    "Two-phase online memory leak detection.",
                    "An efficient robust header compression mechanism for Long Term Evolution Advanced relay architecture.",
                    "Implementation of virtual network management system with SLA on NetFPGA.",
                    "Displaying network topology by hierarchical layout with interest level.",
                    "Design of the mitigation information network in urban area.",
                    "A novel navigation system using augmented reality technology for distribution work at optical connector panels.",
                    "Application of fuzzy TOPSIS for weighting the system attributes in overlay networks.",
                    "OPERAS': Generating and improving network operational workflows on-the-fly.",
                    "Peer-to-Peer contents distribution system using multiple peer clusters.",
                    "A scientific workflow supported environment over hybrid infrastructure for aerodynamics design.",
                    "Mobility-aware charger deployment for wireless rechargeable sensor networks.",
                    "Test tool for equivalence of access control list.",
                    "Energy/carbon management network for IT equipments.",
                    "Study on traffic classification taxonomy for multilateral and hierarchical traffic classification."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "13th APNOMS 2011",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2011",
                "sub_name": "13th Asia-Pacific Network Operations and Management Symposium, APNOMS 2011, Taipei, Taiwan, September 21-23, 2011.",
                "count": 91,
                "papers": [
                    "Smart browser: Network measurement system based on perfSONAR framework.",
                    "Effective DNS server fingerprinting method.",
                    "An innovative ICT service creation approach based on IMS and Android collaboration.",
                    "A management for the deployment of presence service using a dynamic routing algoritm in the IMS nodes.",
                    "Modified adaptive resonance theory for alarm correlation based on distance hierarchy in mobile networks.",
                    "Cloud BOSS: Cloud-centric BSS/OSS for enterprise cloud service operations.",
                    "Evaluation of development optimization of LTE base station OSS by product test automation.",
                    "OPERAS: Operation record analysis system for continual improvement of operating workflows.",
                    "Hierarchical management system of virtual networks on NetFPGA.",
                    "Implementation of the management of an Optical Distribution Network in a Geographic Information System.",
                    "A simplified cloud computing network architecture using future internet technologies.",
                    "Improving bandwidth utilization of NG-SDH by dynamic bandwidth management.",
                    "Design and implementation of dynamic charging plan for IMS-based multicast services.",
                    "A policy based management framework for machine to machine networks and services.",
                    "Design and evaluation of integrated monitoring software for SaaS-based systems.",
                    "A multi-domain fault localization model for submarine cable system.",
                    "Online test framework for IPv6 SNMPv3 agent.",
                    "Pinpointing patch impact test targets of web server systems.",
                    "Mobile network diagnosis and location services via stream-based signalling.",
                    "A channel monitoring scheme in multiple-antenna wireless communications.",
                    "A study identifying the connection type of an end-host to the network using Round-Trip-Time.",
                    "NetFlow-based network traffic monitoring.",
                    "A cooperative network measurement platform: Design and implementation.",
                    "Measurement analysis of mobile traffic in enterprise networks.",
                    "Self-powered wireless communication platform for disaster relief.",
                    "Configuration of WSN using application-aware virtual networks.",
                    "Fuzzy based joint radio resource management in heterogeneous wireless networks.",
                    "Single-ended PMD measuring technology for metropolitan network.",
                    "Utility-based fuzzy wavelength assignment in OBS network.",
                    "Integrated monitoring mechanism to enhance the management of value-added services in mobile communication network.",
                    "Combining sFlow and Tracker traffic analysis: A novel estimation approach for network-wide BitTorrent distribution.",
                    "Content searching scheme using interesting keyword based overlay network.",
                    "When social networking meets the next generation network.",
                    "End-to-End QoS performance management across LTE networks.",
                    "Study of load balance in 3GPP femto-cell network.",
                    "Research on traffic taxonomy for Internet traffic classification.",
                    "Peer-to-Peer contents delivery system considering network distance.",
                    "A practical Chinese wall security model in cloud computing.",
                    "Designing an IPTV execution tool independent on service deployment.",
                    "An event-based POI service from microblogs.",
                    "The research and analysis of worm scanning strategies in IPv6 network.",
                    "A normalize score for evaluating customer perceived quality.",
                    "A mechanism for building Ad-hoc social network based on user's interest.",
                    "On the security of password-based pairing protocol in Bluetooth.",
                    "Parasitic communication system via relaying.",
                    "STUN-based connection sequence through symmetric NATs for TCP connection.",
                    "Beacon-based trust management for location privacy enhancement VANETs.",
                    "Network selection delay comparison of network selection techniques for safety applications on VANET.",
                    "An Adaptable Mobility-Aware Clustering Algorithm in vehicular networks.",
                    "A distributed collaboration scheme of region detection based on service management of Location Based Services - Take a commercial vehicle operations system as an example.",
                    "A middleware approach for migration of legacy telecom Operational Support Systems into NGOSS-compliant.",
                    "ISP-friendly peer selection mechanism with ALTO-like server.",
                    "Dynamic resource allocation mechanism for managed self-organization.",
                    "Building an intelligent provisioning engine for IaaS cloud computing services.",
                    "SNMP-based monitoring of heterogeneous virtual infrastructure in clouds.",
                    "Autonomic management framework for cloud-based virtual networks.",
                    "A flexible and feasible anomaly diagnosis system for Internet firewall rules.",
                    "Policy based traffic offload management mechanism in H(e)NB subsystem.",
                    "IP prefix hijacking detection using the collection of as characteristics.",
                    "Efficient method for inferring a firewall policy.",
                    "Multipath creation algorithm optimizing traffic dispersion on networks.",
                    "Real-time measurement of flows classified according to their application.",
                    "MCST: Anomaly detection using feature stability for packet-level traffic.",
                    "FlowInfra: A fault-resilient scalable infrastructure for network-wide flow level measurement.",
                    "Negotiation-based service self-management mechanism in the MANETs.",
                    "An interference management scheme for heterogeneous network with cell range extension.",
                    "Management of multiplexed ATM connection over WiMax network.",
                    "Real-time data broadcast in K-covered wireless sensor networks.",
                    "Evaluation of network fault-detection method based on anomaly detection with matrix eigenvector.",
                    "An efficient and secure group key management scheme supporting frequent key updates on Pay-TV systems.",
                    "An effective weighted matrix algorithm for determining connection status of alarm emitting routes.",
                    "Distributed IDS for efficient resource management in wireless sensor network.",
                    "Automatic attack detection and correction system development.",
                    "A method for side splitting of packet traces.",
                    "Usage pattern analysis of smartphones.",
                    "Combining density-based clustering and wavelet methods for internal systems anomaly detection.",
                    "Remote time and frequency calibration system for telecommunication synchronization applications.",
                    "A study on Smart-phone traffic analysis.",
                    "Adaptive priority scheduling integrated with B-DBA for revenue optimization with QoS and CoS guarantees in GPON.",
                    "Translation of probabilistic QoS in hierarchical and decentralized settings.",
                    "User-friendly bottleneck detection algorithm.",
                    "Investigating the efficiency of fine granularity source address validation in IPv6 networks.",
                    "Adaptive tuning of operation parameters for automatically learned filter table.",
                    "An innovative application over communications-asa-service: Network-based multicast IPTV audience measurement.",
                    "Towards management of machine to machine networks.",
                    "From barren to beautiful: A pattern-matching localization scheme integrating heterogeneous network data.",
                    "Low-complexity motion estimation algorithm using edge feature for video compression on wireless video sensor networks.",
                    "Proposal on eco-friendly operation scheme for reducing energy consumption of data center.",
                    "The proposal of geographically distributed OSS against a great earthquake - A study on macroscale disaster recovery.",
                    "Supporting an interactive scientific workflow in aerodynamics analysis over e-Science environment.",
                    "Seamless on-line service upgrade for telecommunication web-services."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th APNOMS 2009",
        "info": "Jeju, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2009",
                "sub_name": "Management Enabling the Future Internet for Changing Business and New Computing Services, 12th Asia-Pacific Network Operations and Management Symposium, APNOMS 2009, Jeju, South Korea, September 23-25, 2009, Proceedings.",
                "count": 73,
                "papers": [
                    "Traffic Trace Engineering.",
                    "Understanding Web Hosting Utility of Chinese ISPs.",
                    "Internet Application Traffic Classification Using Fixed IP-Port.",
                    "Accuracy Improvement of CoMPACT Monitor by Using New Probing Method.",
                    "Proposal and Evaluation of Data Reduction Method for Tracing Based Pre-patch Impact Analysis.",
                    "High-Speed Traceroute Method for Large Scale Network.",
                    "Fault Diagnosis for High-Level Applications Based on Dynamic Bayesian Network.",
                    "Novel Optical-Fiber Network Management System in Central Office Using RFID and LED Navigation Technologies.",
                    "Mobility Management Using Virtual Multi-parent Tree in Infrastructure Incorporated Mobile Ad Hoc Networks.",
                    "Lightweight Traffic Monitoring and Analysis Using Video Compression Techniques.",
                    "NETCONF-Based Network Management System Collaborating with Aggregated Flow Mining.",
                    "Policy-Based Monitoring and High Precision Control for Converged Multi-gigabit IP Networks.",
                    "The Design of an Autonomic Communication Element to Manage Future Internet Services.",
                    "Adaptive Grid Resource Selection Based on Job History Analysis Using Plackett-Burman Designs.",
                    "Automated and Distributed Network Service Monitoring.",
                    "Network Partitioning and Self-sizing Methods for QoS Management with Autonomic Characteristics.",
                    "A Scheme for Supporting Optimal Path in 6LoWPAN Based MANEMO Networks.",
                    "Bypassing Routing Holes in WSNs with a Predictive Geographic Greedy Forwarding.",
                    "Analysis of Time-Dependent Query Trends in P2P File Sharing Systems.",
                    "An Implementation of P2P System for Sharing Sensory Information.",
                    "The Proposal of Service Delivery Platform Built on Distributed Data Driven Architecture.",
                    "LCGT: A Low-Cost Continuous Ground Truth Generation Method for Traffic Classification.",
                    "Adaptive Coverage Adjustment for Femtocell Management in a Residential Scenario.",
                    "New Modeling for Traffic Engineering in FMC Environment.",
                    "Experience in Developing a Prototype for WiBro Service Quality Management System.",
                    "BDIM-Based Optimal Design of Videoconferencing Service Infrastructure in Multi-SLA Environments.",
                    "Contention Window Size Control for QoS Support in Multi-hop Wireless Ad Hoc Networks.",
                    "Tackling the Delay-Cost and Time-Cost Trade-Offs in Computation of Node-Protected Multicast Tree Pairs.",
                    "An Algorithm for the Measure Station Selection and Measure Assignment in the Active IP Network Measurement.",
                    "Volume Traffic Anomaly Detection Using Hierarchical Clustering.",
                    "Memory-Efficient IP Filtering for Countering DDoS Attacks.",
                    "Framework Design and Performance Analysis on Pairwise Key Establishment.",
                    "MIH-Assisted PFMIPv6 Predictive Handover with Selective Channel Scanning, Fast Re-association and Efficient Tunneling Management.",
                    "Forecasting WiMAX System Earnings: A Case Study on Mass Rapid Transit System.",
                    "Triangular Tiling-Based Efficient Flooding Scheme in Wireless Ad Hoc Networks.",
                    "Modeling Directional Communication in IEEE 802.15.3c WPAN Based on Hybrid Multiple Access of CSMA/CA and TDMA.",
                    "Management of Upstreaming Profiles for WiMAX.",
                    "Architecture of Context-Aware Workflow Authorization Management Systems for Workflow-Based Systems.",
                    "Baseline Traffic Modeling for Anomalous Traffic Detection on Network Transit Points.",
                    "IP Prefix Hijacking Detection Using Idle Scan.",
                    "A PKI Based Mesh Router Authentication Scheme to Protect from Malicious Node in Wireless Mesh Network.",
                    "A Personalization Service in the IMS Networks.",
                    "Dimensioning of IPTV VoD Service in Heterogeneous Broadband Access Networks.",
                    "Remote Configuration Mechanism for IP Based Ubiquitous Sensor Networks.",
                    "Asymmetric DHT Based on Performance of Peers.",
                    "Load Balance Based on Path Energy and Self-maintenance Routing Protocol in Wireless Sensor Networks.",
                    "Performance Evaluation of VoIP QoE Monitoring Using RTCP XR.",
                    "Research on Service Abstract and Integration Method in Heterogeneous Network Platform.",
                    "Security and Reliability Design of Olympic Games Network.",
                    "An Implementation of the SDP Using Common Service Enablers.",
                    "Decreasing Access Control List Processed in Hardware.",
                    "A Novel DNS Accelerator Design and Implementation.",
                    "Service Fault Localization Using Functional Events Separation and Modeling of Service Resources.",
                    "Towards Fault Isolation in WDM Mesh Networks.",
                    "Factors Influencing Adoption for Activating Mobile VoIP.",
                    "A Study on SDH/OTN Integrated Network Management Method.",
                    "Group P2P Network Organization in Mobile Ad-Hoc Network.",
                    "Dynamic Reconstruction of Multiple Overlay Network for Next Generation Network Services with Distributed Components.",
                    "EECHE: An Energy-Efficient Cluster Head Election Algorithm in Sensor Networks.",
                    "Boundary-Aware Topology Discovery for Distributed Management of Large Enterprise Networks.",
                    "Channel Management Protocol for Wireless Body Area Networks.",
                    "Experimental Evaluation of End-to-End Available Bandwidth Measurement Tools.",
                    "A Routing Management among CSCFs Using Management Technology.",
                    "The Network Management Scheme for Effective Consolidation of RFID-Tag Standards.",
                    "ROA Based Web Service Provisioning Methodology for Telco and Its Implementation.",
                    "Attack Model and Detection Scheme for Botnet on 6LoWPAN.",
                    "An Efficient Strategy for Achieving Concurrency Control in Mobile Environments.",
                    "Design of Intersection Switches for the Vehicular Network.",
                    "Exploiting Network Distance Based Euclidean Coordinates for the One Hop Relay Selection.",
                    "Architecture of IP Based Future Heterogeneous Mobile Network Using Network Discovery for Seamless Handoff.",
                    "Analytical Model of the Iub Interface Carrying HSDPA Traffic in the UMTS Network.",
                    "Packet Loss Estimation of TCP Flows Based on the Delayed ACK Mechanism.",
                    "A QoS Based Migration Scheme for Virtual Machines in Data Center Environments."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th APNOMS 2008",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2008",
                "sub_name": "Challenges for Next Generation Network Operations and Service Management, 11th Asia-Pacific Network Operations and Management Symposium, APNOMS 2008, Beijing, China, October 22-24, 2008. Proceedings.",
                "count": 77,
                "papers": [
                    "E-Scheme in Delay-Tolerant Networks.",
                    "Layer 1 VPN NMS Based on Each VPN Customer.",
                    "Algorithms to Managing Unicast, Multicast and Broadcast Transmission for Optical Switches.",
                    "Network Planning and Adaptive Routing for Multimedia Traffic.",
                    "Network-Wide Rollback Scheme for Fast Recovery from Operator Errors Toward Dependable Network.",
                    "An Efficient Failure Recovery Scheme for Next Generation Network Services Based on Distributed Components.",
                    "A Novel Fault Diagnosis Approach to Path-Protected WDM Mesh Networks.",
                    "Active Diagnosis of High-Level Faults in Distributed Internet Services.",
                    "Fault Localization for Heterogeneous Networks Using Alarm Correlation on Consolidated Inventory Database.",
                    "Probing Based Topology Inference for Large Scale Community Networks.",
                    "Indexing through Querying in Unstructured Peer-to-Peer Overlay Networks.",
                    "TrustRRep: An Improved Reputation Management Scheme for Reliable Resource Sharing in Peer-to-Peer Networks.",
                    "Group Key Locking Scheme in Mobile Multicast Environments with Modified MLDs.",
                    "The Best Practice and Evaluation of Processes to Develop OSSs Using XML-Based Interfaces.",
                    "Review of Knowledge Engineering Requirements for Semantic Reasoning in Autonomic Networks.",
                    "Towards Management Requirements of Future Internet.",
                    "Considerations on NETCONF-Based Data Modeling.",
                    "A Hop by Hop Rate Control Based QoS Management for Real Time Traffic in Wireless Sensor Networks.",
                    "Extended Concentric-Clustering Routing Scheme Adapted to Various Environments of Sensor Networks.",
                    "Towards Cluster Based Wireless Sensor Network Deployment Management and Network Coverage Verification.",
                    "A Logical Group Formation and Management Mechanism Using RSSI for Wireless Sensor Networks.",
                    "OD Count Estimation Based on Link Count Data.",
                    "An Efficient Approach for Analyzing Multidimensional Network Traffic.",
                    "The Measurement of User's Subjective Assessment on Throughput Degradation in Bulk Data Transmission.",
                    "A Space-Efficient Fair Packet Sampling Algorithm.",
                    "Understanding IPv6 Usage: Communities and Behaviors.",
                    "DTPD: Data Transfer Tool Performance Diagnosis System in High Speed Networks.",
                    "QoS-Aware Customer Network Management (Q-CNM) System for Efficient Handovers with PMIPv6 and MIH.",
                    "Dynamic Multi-stream Transport Protocol.",
                    "A Study on the Service Quality Management Process and Its Realization Strategy for Capturing Customer Value.",
                    "A Novel Integrated Supporting System for Mesh-Pull Based P2P IPTV.",
                    "BPEL Driven Policy Management of Virtualized Network Resources for IMS Environments.",
                    "Research on the Associated Pricing Strategy in Telecom Industry.",
                    "A Semantic Description Approach for Telecommunications Network Capability Services.",
                    "Low Latency Proactive Handover Scheme for Proxy MIPv6 with MIH.",
                    "Simple Modeling for QoS Management of IEEE 802.11 DCF.",
                    "Take the Challenge of IP Evolution and OAM Solution.",
                    "Performance Evaluation of Heartbeat-Style Failure Detector over Proactive and Reactive Routing Protocols for Mobile Ad Hoc Network.",
                    "Design and Implementation of an SNMP-Based Traffic Flooding Attack Detection System.",
                    "A Method to Detect Prefix Hijacking by Using Ping Tests.",
                    "Application of Data Mining to Network Intrusion Detection: Classifier Selection Model.",
                    "Detection of Leaps/sLumps in Traffic Volume of Internet Backbone.",
                    "A Sampling Method for Intrusion Detection System.",
                    "Fast Traffic Classification in High Speed Networks.",
                    "Service Impact Analysis Framework Using Service Model for Integrated Service Resource Management of NGN Services.",
                    "A Trusted Quality of Web Services Management Framework Based on Six Dimensional QoWS Model and End-to-End Monitoring.",
                    "Least Interference Optimization Based Dynamic Multi-path Routing Algorithm in ASON.",
                    "QoS-Aware Scheduling in Emerging Novel Optical Wireless Integrated Networks.",
                    "An Energy-Efficiency Route Protocol for MIMO-Based Wireless Sensor Networks.",
                    "Service Oriented T-MPLS Resilience Algorithm with Multi-QoS Constrained.",
                    "Network Stability Analysis Techniques Using the Virtual Articulation Node.",
                    "A Channel Management Framework to Construct User Preferred Fast Channel Change Stream in IPTV.",
                    "A Fair Mobile Payment Protocol.",
                    "Statistical Analysis of Slow Portsweep.",
                    "Empirical Analysis of Application-Level Traffic Classification Using Supervised Machine Learning.",
                    "Virtualization-Based Operation Support Systems: Performance Evaluation and Systems Design.",
                    "A Management Framework for IMS Using Service Managed Objects.",
                    "Evaluating Open Service Access with an Abstract Model of NGN Functions.",
                    "Methods for Rapidly Testing Node Reachability with Congestion Control and Evaluation.",
                    "The Design of an Open and Integrated Sensor Network Management Platform.",
                    "Self-organized Cluster Based Multi-hop Routing for Wireless Sensor Networks.",
                    "An Adaptable Method of E-Workflow Composition Based on Distributed Awareness.",
                    "An Adaptive Control Scheme of Reserved Bandwidth for RPR in Steering Mode.",
                    "Estimating Half-Path RTT in Backbone Network.",
                    "A Radio Network Co-design System for Planning, Operation, and Customer Relations Divisions.",
                    "Traffic Matrix Estimation Using Square Root Filtering/Smoothing Algorithm.",
                    "A Knowledge-Based Tool to Support Clear Relationship between Threats and Countermeasures Based on International Standards.",
                    "Incentives for Cooperative Relay in Heterogeneous Networks: A Dynamic Reputation-Based Approach.",
                    "User-Centric Prediction for Battery Lifetime of Mobile Devices.",
                    "A Study on the Reliable and Flexible Implementation of Workforce Management Using Business Process Management.",
                    "Enterprise Management System with Web-Crawler.",
                    "A Construction Process for Small-Scale Network Systems.",
                    "Design, Implementation and Evaluation of a Network Management System for a High Quality IP-Based Video Transmission Service.",
                    "Availability in Peer to Peer Management Networks.",
                    "Field Operations Management and Unmanned Operations Management toward NOM 2.0.",
                    "The IMS/SDP Structure and Implementation of Presence Service.",
                    "Detection and Handling of TRUNK Congestion in the ATM Network."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th APNOMS 2007",
        "info": "Sapporo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2007",
                "sub_name": "Managing Next Generation Networks and Services, 10th Asia-Pacific Network Operations and Management Symposium, APNOMS 2007, Sapporo, Japan, October 10-12, 2007, Proceedings.",
                "count": 78,
                "papers": [
                    "Design of a Digital Home Service Delivery and Management System for OSGi Framework.",
                    "A Self-managing SIP-Based IP Telephony System Based on a P2P Approach Using Kademlia.",
                    "A Collective User Preference Management System for U-Commerce.",
                    "Distributed Cache Management for Context-Aware Services in Large-Scale Networks.",
                    "Towards Low-Latency Model-Oriented Distributed Systems Management.",
                    "OMA DM Based Remote Software Debugging of Mobile Devices.",
                    "Process Control Technique Using Planning and Constraint Satisfaction.",
                    "A Mechanism of KEDB-Centric Fault Management to Optimize the Realization of ITIL Based ITSM.",
                    "Automatic NE-adapter Generation by Interface Blending/Diagnosis Methods.",
                    "Server Support Approach to Zero Configuration of Power Line Communication Modems and Coaxial Cable Modems.",
                    "Architecture of Context-Aware Integrated Security Management Systems for Smart Home Environment.",
                    "Self-adaptability and Vulnerability Assessment of Secure Autonomic Communication Networks.",
                    "Integrated OTP-Based User Authentication and Access Control Scheme in Home Networks.",
                    "New Access Control on DACS Scheme.",
                    "Design and Analysis of Hybrid On-Demand Multipath Routing Protocol with Multimedia Application on MANETs.",
                    "A Routing Scheme for Supporting Network Mobility of Sensor Network Based on 6LoWPAN.",
                    "Cross Layer Based PBNM for Mobile Ad Hoc Networks with Vector Information in XML.",
                    "FECP Protocol for Energy Balanced Data Propagation in Smart Home Sensor Networks.",
                    "Real-Time Multicast Network Monitoring.",
                    "Monitoring SIP Service Availability in IPv4/IPv6 Hybrid Networks.",
                    "Point of Reference in Perception of Network Performance by Active Probing.",
                    "Real-Time Identification of Different TCP Versions.",
                    "End-to-End Flow Monitoring with IPFIX.",
                    "Advanced Scheme to Reduce IPTV Channel Zapping Time.",
                    "XML-Based Policy Engineering Framework for Heterogeneous Network Management.",
                    "Autonomic Network Resource Management Using Virtual Network Concept.",
                    "A New Heuristics/GA-Based Algorithm for the Management of the S-DRWA in IP/WDM Networks.",
                    "Providing Consistent Service Levels in IP Networks.",
                    "A Visual Component Framework for Building Network Management Systems.",
                    "The Primary Path Selection Algorithm for Ubiquitous Multi-homing Environments.",
                    "Design of Location Management for Heterogeneous Wireless Networks.",
                    "Network Architecture and Fast Handover Scheme Using Mobility Anchor for UMTS-WLAN Interworking.",
                    "Implementation of 802.21 for Seamless Handover Across Heterogeneous Networks.",
                    "FPGA-Based Cuckoo Hashing for Pattern Matching in NIDS/NIPS.",
                    "ATPS - Adaptive Threat Prevention System for High-Performance Intrusion Detection and Response.",
                    "A Practical Approach for Detecting Executable Codes in Network Traffic.",
                    "A Visualized Internet Firewall Rule Validation System.",
                    "A Secure Web Services Providing Framework Based on Lock-Keeper.",
                    "Measurement Analysis of IP-Based Process Control Networks.",
                    "On the Use of Anonymized Trace Data for Performance Evaluation in IP Routers.",
                    "10Gbps Scalable Flow Generation and Per-flow Control with Hierarchical Flow Aggregation & Decomposition Using IXP2800 Network Processors.",
                    "Quantitative Analysis of Temporal Patterns in Loosely Coupled Active Measurement Results.",
                    "Constella: A Complete IP Network Topology Discovery Solution.",
                    "What Are Possible Security Threats in Ubiquitous Sensor Network Environment?",
                    "Security and Handover Designs for VoWLAN System.",
                    "An Effective Secure Routing for False Data Injection Attack in Wireless Sensor Network.",
                    "On a Low Security Overhead Mechanism for Secure Multi-path Routing Protocol in Wireless Mesh Network.",
                    "Performance Evaluation of a Mobile Agent Based Framework for Security Event Management in IP Networks.",
                    "Design and Implementation of User-Oriented Handoff Framework with VoIP Service.",
                    "A Study on Low-Cost RFID System Management with Mutual Authentication Scheme in Ubiquitous.",
                    "Security Management in Wireless Sensor Networks with a Public Key Based Scheme.",
                    "Scheduling Management in Wireless Mesh Networks.",
                    "Evolution of Broadband Network Management System Using an AOP.",
                    "Standby Power Control Architecture in Context-Aware Home Networks.",
                    "End-to-End Soft QoS Scheme in Heterogeneous Networks.",
                    "A Multi-objective Genetic Algorithmic Approach for QoS-Based Energy-Efficient Sensor Routing Protocol.",
                    "A Density Based Clustering for Node Management in Wireless Sensor Network.",
                    "Multimedia Service Management for Home Networks with End to End Quality of Service.",
                    "An OSGI-Based Model for Remote Management of Residential Gateways.",
                    "Design and Implementation of TPEG Based RFID Application Service.",
                    "Energy-Efficient Distance Based Clustering Routing Scheme for Long-Term Lifetime of Multi-hop Wireless Sensor Networks.",
                    "Single Sign on System Architecture Based on SAML in Web Service Environment Using ENUM System.",
                    "Providing Seamless Services with Satellite and Terrestrial Network in Mobile Two Way Satellite Environments.",
                    "Evaluation of Processing Load in the Network with DACS Scheme.",
                    "Empirical Testing Activities for NeOSS Maintenance.",
                    "A Study on Service Problem Management and Resource Trouble Management on a Telecommunication Network.",
                    "Distributed and Scalable Event Correlation Based on Causality Graph.",
                    "Detection and Identification of Neptune Attacks and Flash Crowds.",
                    "Deploying Application Services Using Service Delivery Platform (SDP).",
                    "A Study of Recovering from Communication Failure Caused by Route Hijacking.",
                    "Multi-agent Learning and Control System Using Ants Colony for Packet Scheduling in Routers.",
                    "A Framework for an Integrated Network Management System Base on Enhanced Telecom Operation Map (eTOM).",
                    "High Performance Session State Management Scheme for Stateful Packet Inspection.",
                    "A Parallel Architecture for IGP Weights Optimization.",
                    "Internet Management Network.",
                    "A Hybrid Staggered Broadcasting Protocol for Popular Video Service.",
                    "Efficient Congestion Control Based on Awareness of Multistage Resources (CC-AMR).",
                    "Segment Based Caching Replacement Algorithm in Streaming Media Transcoding Proxy."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th APNOMS 2006",
        "info": "Busan, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/apnoms/2006",
                "sub_name": "Management of Convergence Networks and Services, 9th Asia-Pacific Network Operations and Management Symposium, APNOMS 2006 Busan, Korea, September 27-29, 2006, Proceedings.",
                "count": 75,
                "papers": [
                    "QoS-Aware Fair Scheduling in Wireless Ad Hoc Networks with Link Errors.",
                    "Performance Analysis of Service Differentiation for IEEE 802.15.4 Slotted CSMA/CA.",
                    "Information-Driven Task Routing for Network Management in Wireless Sensor Networks.",
                    "Autonomic Management of Scalable Load-Balancing for Ubiquitous Networks.",
                    "A Policy-Based Management Framework for Self-managed Wireless Sensor Networks.",
                    "A Proposal of Large-Scale Traffic Monitoring System Using Flow Concentrators.",
                    "Novel Traffic Measurement Methodology for High Precision Applications Awareness in Multi-gigabit Networks.",
                    "Rate-Based and Gap-Based Available Bandwidth Estimation Techniques in Cross-Traffic Context.",
                    "Signature-Aware Traffic Monitoring with IPFIX.",
                    "Temporal Patterns and Properties in Multiple-Flow Interactions.",
                    "A Profile Based Vertical Handoff Scheme for Ubiquitous Computing Environment.",
                    "The Soft Bound Admission Control Algorithm for Vertical Handover in Ubiquitous Environment.",
                    "Improving Handoff Performance by Using Distance-Based Dynamic Hysteresis Value.",
                    "A Seamless Service Management with Context-Aware Handoff Scheme in Ubiquitous Computing Environment.",
                    "Performance Analysis of an Adaptive Soft Handoff Algorithm for Mobile Cellular Systems.",
                    "An Admission Control and Traffic Engineering Model for Diffserv-MPLS Networks.",
                    "An Admission Control and TXOP Duration of VBR Traffics in IEEE 802.11e HCCA with Guaranteed Delay and Loss.",
                    "NETSAQ: Network State Adaptive QoS Provisioning for MANETs.",
                    "End-to-End QoS Guaranteed Service in WLAN and 3GPP Interworking Network.",
                    "Network-Adaptive QoS Routing Using Local Information.",
                    "Configuration Management Policy in QoS-Constrained Grid Networks.",
                    "A Proposal of Requirement Definition Method with Patterns for Element / Network Management.",
                    "Distributed Fault Management in WBEM-Based Inter-AS TE for QoS Guaranteed DiffServ-over-MPLS.",
                    "A Framework Supporting Quality of Service for SOA-Based Applications.",
                    "Performance Improvement Methods for NETCONF-Based Configuration Management.",
                    "Zone-Based Clustering for Intrusion Detection Architecture in Ad-Hoc Networks.",
                    "Tracing the True Source of an IPv6 Datagram Using Policy Based Management System.",
                    "An Efficient Authentication and Simplified Certificate Status Management for Personal Area Networks.",
                    "A Novel Rekey Management Scheme in Digital Broadcasting Network.",
                    "A New Encoding Approach Realizing High Security and High Performance Based on Double Common Encryption Using Static Keys and Dynamic Keys.",
                    "GMPLS-Based VPN Service to Realize End-to-End QoS and Resilient Paths.",
                    "WBEM-Based SLA Management Across Multi-domain Networks for QoS-Guaranteed DiffServ-over-MPLS Provisioning.",
                    "Network Support for TCP Version Migration.",
                    "End-to-End QoS Monitoring Tool Development and Performance Analysis for NGN.",
                    "\"P4L\": A Four Layers P2P Model for Optimizing Resources Discovery and Localization.",
                    "A Zeroconf Approach to Secure and Easy-to-Use Remote Access to Networked Appliances.",
                    "A Test Method for Base Before Service (BS) of Customer Problems for the NeOSS System.",
                    "Self-management System Based on Self-healing Mechanism.",
                    "Experiences in End-to-End Performance Monitoring on KOREN.",
                    "SOA-Based Next Generation OSS Architecture.",
                    "Performance Analysis of a Centralized Resource Allocation Mechanism for Time-Slotted OBS Networks.",
                    "Efficient Performance Management of Subcarrier-Allocation Systems in Orthogonal Frequency-Division Multiple Access Networks.",
                    "Convergence Services Through NGN-CTE on the Multiple Service Provider Environments in NGN.",
                    "Proposal of Operation Method for Application Servers on NGN Using Unified Management Environment.",
                    "IP/WDM Optical Network Testbed: Design and Implementation.",
                    "Voice Quality Management for IP Networks Based on Automatic Change Detection of Monitoring Data.",
                    "Parameter Design for Diffusion-Type Autonomous Decentralized Flow Control.",
                    "Bandwidth Management for Smooth Playback of Video Streaming Services.",
                    "An Enhanced RED-Based Scheme for Differentiated Loss Guarantees.",
                    "Dynamic Location Management Scheme Using Agent in a Ubiquitous IP-Based Network.",
                    "Detecting and Identifying Network Anomalies by Component Analysis.",
                    "Preventive Congestion Control Mechanisms in ATM Based MPLS on BcN: Detection and Control Mechanisms for a Slim Chance of Label Switched Path.",
                    "Scalable DiffServ-over-MPLS Traffic Engineering with Per-flow Traffic Policing.",
                    "On the Dynamic Management of Information in Ubiquitous Systems Using Evolvable Software Components.",
                    "A Shared-Memory Packet Buffer Management in a Network Interface Card.",
                    "An Adaptive Online Network Management Algorithm for QoS Sensitive Multimedia Services.",
                    "Improved Handoff Performance Based on Pre-binding Update in HMIPv6.",
                    "On the Security of Attribute Certificate Structuring for Highly Distributed Computing Environments.",
                    "Performance Analysis of Single Rate Two Level Traffic Conditioner for VoIP Service.",
                    "An Architectural Framework for Network Convergence Through Application Level Presence Signaling.",
                    "Security Approaches for Cluster Interconnection in a Wireless Sensor Network.",
                    "A Resource-Optimal Key Pre-distribution Scheme with Enhanced Security for Wireless Sensor Networks.",
                    "Intelligent Home Network Service Management Platform Design Based on OSGi Framework.",
                    "COPS-Based Dynamic QoS Support for SIP Applications in DSL Networks.",
                    "IP Traceback Algorithm for DoS/DDoS Attack.",
                    "An Open Service Platform at Network Edge.",
                    "Hybrid Inference Architecture and Model for Self-healing System.",
                    "A Node Management Tool for Dynamic Reconfiguration of Application Modules in Sensor Networks.",
                    "Path Hopping Based on Reverse AODV for Security.",
                    "Mixing Heterogeneous Address Spaces in a Single Edge Network.",
                    "Delivery and Storage Architecture for Sensed Information Using SNMP.",
                    "GISness System for Fast TSP Solving and Supporting Decision Making.",
                    "A DNS Based New Route Optimization Scheme with Fast Neighbor Discovery in Mobile IPv6 Networks.",
                    "Performance Analysis of Group Handoff in Multihop Mesh Relay System.",
                    "DSMRouter: A DiffServ-Based Multicast Router."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8th APNOMS 2005",
        "info": "Okinawa, Japan",
        "venues": []
    },
    {
        "year": "2003",
        "name": "7th APNOMS 2003",
        "info": "Fukuoka, Japan",
        "venues": []
    },
    {
        "year": "2002",
        "name": "6th APNOMS 2002",
        "info": "Jeju Island, Korea",
        "venues": []
    },
    {
        "year": "2001",
        "name": "5th APNOMS 2001",
        "info": "Sydney, NSW, Australia",
        "venues": []
    },
    {
        "year": "2000",
        "name": "4th APNOMS 2000",
        "info": "Nara, Japan",
        "venues": []
    },
    {
        "year": "1999",
        "name": "3rd APNOMS 1999",
        "info": "Kyongju, Korea",
        "venues": []
    },
    {
        "year": "1998",
        "name": "2nd APNOMS 1998",
        "info": "Sendai, Japan",
        "venues": []
    },
    {
        "year": "1997",
        "name": "1st APNOMS 1997",
        "info": "Seoul, Korea",
        "venues": []
    }
]