[
    {
        "year": "2021",
        "name": "17th CoNEXT 2021",
        "info": "Virtual Event / Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2021",
                "sub_name": "CoNEXT '21: The 17th International Conference on emerging Networking EXperiments and Technologies, Virtual Event, Munich, Germany, December 7 - 10, 2021.",
                "count": 50,
                "papers": [
                    "Burst-tolerant datacenter networks with Vertigo.",
                    "SOAR: minimizing network utilization with bounded in-network computing.",
                    "Floodgate: taming incast in datacenter networks.",
                    "TCPLS: modern transport services with TCP and TLS.",
                    "SmartWatch: accurate traffic analysis and flow-state tracking for intrusion prevention using SmartNICs.",
                    "DarkVec: automatic analysis of darknet traffic with word embeddings.",
                    "Compact-index: an efficient index algorithm for network traffic.",
                    "Colibri: a cooperative lightweight inter-domain bandwidth-reservation infrastructure.",
                    "Next-generation internet at terabit speed: SCION in P4.",
                    "Deployment and scalability of an inter-domain multi-path routing infrastructure.",
                    "OnSlicing: online end-to-end network slicing with reinforcement learning.",
                    "GRAF: a graph neural network based proactive resource allocation framework for SLO-oriented microservices.",
                    "Co-locating containerized workload using service mesh telemetry.",
                    "P4Update: fast and locally verifiable consistent network updates in the P4 data plane.",
                    "Load balancing with JET: just enough tracking for connection consistency.",
                    "Perfect cuckoo filters.",
                    "User profiling by network observers.",
                    "Alternative to third-party cookies: investigating persistent PII leakage-based web tracking.",
                    "Measuring email sender validation in the wild.",
                    "SpectraGAN: spectrum based generation of city scale spatiotemporal mobile network traffic data.",
                    "The pos framework: a methodology and toolchain for reproducible network experiments.",
                    "Determination of throughput guarantees for processor-based SmartNICs.",
                    "A unified congestion control framework for diverse application preferences and network conditions.",
                    "Boosting bandwidth availability over inter-DC WAN.",
                    "Traffic engineering with joint link weight and segment optimization.",
                    "Exploring content moderation in the decentralised web: the pleroma case.",
                    "dcSR: practical video quality enhancement using data-centric super resolution.",
                    "Learning from optimal caching for content delivery.",
                    "VOXEL: cross-layer optimization for video streaming with imperfect transmission.",
                    "Talaria: in-engine synchronisation for seamless migration of mobile edge gaming instances.",
                    "Mind the gap: multi-hop IPv6 over BLE in the IoT.",
                    "EdgeBOL: automating energy-savings for mobile edge AI.",
                    "FlexRIC: an SDK for next-generation SD-RANs.",
                    "Discovering obscure looking glass sites on the web to facilitate internet measurement research.",
                    "Learning to extract geographic information from internet router hostnames.",
                    "Transparent forwarders: an unnoticed component of the open DNS infrastructure.",
                    "Congestion avoidance in data communication networks using software defined networking.",
                    "BGP traffic volume forecasting using LSTM framework.",
                    "A high-resolution study of data center traffic at its origin.",
                    "Shedding light into the darknet: scanning characterization and detection of temporal changes.",
                    "Online RL in the programmable dataplane with OPaL.",
                    "ReactNet: self-adjusting architecture for networked systems.",
                    "The case for network functions decomposition.",
                    "Accelerate and secure serverless networks with QUIC.",
                    "A fast, scalable, and energy-efficient edge acceleration architecture based on FPGA cluster.",
                    "Assessing the performance of XDP and AF_XDP based NFs in edge data center scenarios.",
                    "FIAT: frictionless authentication of IoT traffic.",
                    "Raptor: rapid prototyping of distributed stream processing applications at scale.",
                    "Towards highly scalable multicast via explicit path definition.",
                    "Precise real-time monitoring of time-critical flows."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2021sw",
                "sub_name": "CoNEXT-SW '21: Proceedings of the CoNEXT Student Workshop, Virtual Event / Munich, Germany, 7 December 2021.",
                "count": 11,
                "papers": [
                    "The impact of Capitol Hill on Pleroma: the case for decentralised moderation.",
                    "Augmenting phishing squatting detection with GANs.",
                    "Towards a generic deep learning pipeline for traffic measurements.",
                    "An analysis of privacy leakage in DoQ traffic.",
                    "Towards generic traffic change detection in the data plane.",
                    "Securing name resolution in the IoT: DNS over CoAP.",
                    "Large scale outage visibility on the control plane.",
                    "Using proof-of-work to mitigate spoofing-based denial of service attacks.",
                    "Leveraging node heterogeneity to improve content discovery and content retrieval in peer-to-peer networks.",
                    "Quantum scheduling optimization for UAV-enabled IoT networks.",
                    "ML-based data classification and data aggregation on the edge."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2021iwci",
                "sub_name": "IWCI'21: Proceedings of the Interdisciplinary Workshop on (de) Centralization in the Internet, Virtual Event, Germany, 7 December 2021.",
                "count": 6,
                "papers": [
                    "Centralization is about Control, not Protocols: Position Paper.",
                    "Designing Hydra with Centralized versus Decentralized Control: A Comparative Study.",
                    "Internet flattening and consolidation considered useful (for deploying new Internet architecture).",
                    "Is a \"Decentralized Autonomous Organization\" a Panopticon?: Algorithmic governance as creating and mitigating vulnerabilities in DAOs.",
                    "Distributed Ledgers for Distributed Edge: Are we there yet?",
                    "Decentralizing Computation with Edge Computing: Potential and Challenges."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2021dml",
                "sub_name": "DistributedML '21: Proceedings of the 2nd ACM International Workshop on Distributed Machine Learning, Virtual Event / Munich, Germany, 7 December 2021.",
                "count": 5,
                "papers": [
                    "FL_PyTorch: optimization research simulator for federated learning.",
                    "Secure aggregation for federated learning in flower.",
                    "Doing more by doing less: how structured partial backpropagation improves deep learning clusters.",
                    "Rapid IoT device identification at the edge.",
                    "Image reconstruction attacks on distributed machine learning models."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2021epiq",
                "sub_name": "EPIQ '21: Proceedings of the 2021 Workshop on Evolution, Performance and Interoperability of QUIC, Virtual Event / Munich, Germany, 7 December 2021.",
                "count": 6,
                "papers": [
                    "Congestion control for real-time media over QUIC.",
                    "Days of future past: an optimization-based adaptive bitrate algorithm over HTTP/3.",
                    "Tracking the QUIC spin bit on Tofino.",
                    "The search of the path MTU with QUIC.",
                    "Evaluation of QUIC-based MASQUE proxying.",
                    "Verifying QUIC implementations using Ivy."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2021daisnac",
                "sub_name": "DAI-SNAC@CoNEXT 2021: Proceedings of the 2021 Workshop on Descriptive Approaches to IoT Security, Network, and Application Configuration, Virtual Event, Munich, Germany, 7 December 2021.",
                "count": 6,
                "papers": [
                    "Discovery and capabilities of guard proxies for CoRE networks.",
                    "Towards a behavioral description of cyber-physical systems using the thing description.",
                    "PARVP: passively assessing risk of vulnerable passwords for HTTP authentication in networked cameras.",
                    "IPC evolution thru declarative interface generation.",
                    "Operating large-scale IoT systems through declarative configuration APIs.",
                    "Trustworthy things."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "16th CoNEXT 2020",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2020",
                "sub_name": "CoNEXT '20: The 16th International Conference on emerging Networking EXperiments and Technologies, Barcelona, Spain, December, 2020.",
                "count": 63,
                "papers": [
                    "Designing a quantum network protocol.",
                    "RoCC: robust congestion control for RDMA.",
                    "Near-optimal multihop scheduling in general circuit-switched networks.",
                    "When wells run dry: the 2020 IPv4 address market.",
                    "DynamIPs: analyzing address assignment practices in IPv4 and IPv6.",
                    "Drop the packets: using coarse-grained data to detect video performance issues.",
                    "FCM-sketch: generic network measurements with data plane support.",
                    "Optimizing distributed training deployment in heterogeneous GPU clusters.",
                    "Job scheduling for large-scale machine learning clusters.",
                    "MPCC: online learning multipath transport.",
                    "CEFS: compute-efficient flow scheduling for iterative synchronous applications.",
                    "Assessing the overhead of post-quantum cryptography in TLS 1.3 and SSH.",
                    "Return of version downgrade attack in the era of TLS 1.3.",
                    "RIoTMAN: a systematic analysis of IoT malware behavior.",
                    "You do (not) belong here: detecting DPI evasion attacks with context learning.",
                    "A modular compiler for network programming languages.",
                    "Testing compilers for programmable switches through switch hardware simulation.",
                    "Finding hard-to-find data plane bugs with a PTA.",
                    "Agora: Real-time massive MIMO baseband processing in software.",
                    "LiBRA: learning-based link adaptation leveraging PHY layer information in 60 GHz WLANs.",
                    "Multiprotocol backscatter for personal IoT sensors.",
                    "Parking packet payload with P4.",
                    "Forwarding and routing with packet subscriptions.",
                    "Newton: intent-driven network traffic monitoring.",
                    "Optimal approximations for traffic distribution in bounded switch memories.",
                    "Palmtrie: a ternary key matching algorithm for IP packet filtering rules.",
                    "DeepMatch: practical deep packet inspection in the data plane using network processors.",
                    "Domino: using network measurements to reduce state machine replication latency in WANs.",
                    "Mind the delay: the adverse effects of delay-based TCP on HTTP.",
                    "Judicious QoS using cloud overlays.",
                    "Multi-user augmented reality with communication efficient and spatially consistent virtual objects.",
                    "ZipLine: in-network compression at line speed.",
                    "Metronome: adaptive and precise intermittent packet retrieval in DPDK.",
                    "IntSight: diagnosing SLO violations with in-band network telemetry.",
                    "When filtering is not possible caching negatives with fingerprints comes to the rescue.",
                    "Keep your communities clean: exploring the routing message impact of BGP communities.",
                    "Chameleon: predictable latency and high utilization with queue-aware and adaptive source routing.",
                    "Detecting routing loops in the data plane.",
                    "AalWiNes: a fast and quantitative what-if analysis tool for MPLS networks.",
                    "AED: incrementally synthesizing policy-compliant and manageable configurations.",
                    "SD-access: practical experiences in designing and deploying software defined enterprise networks.",
                    "Meeting SLOs in cross-platform NFV.",
                    "FDP: a teaching and demo platform for SDN.",
                    "OpenQUIC: software-defined transmission like building blocks.",
                    "Performance penalties of resilient SDN infrastructures.",
                    "Evaluating RPKI ROV identification methodologies in automatically generated mininet topologies.",
                    "Realistic testing of RTC applications under mobile networks.",
                    "Slicing 5G fronthaul networks using programmable switches.",
                    "DISCOvering the heavy hitters with disaggregated sketches.",
                    "A faster and more efficient q-MAX algorithm.",
                    "Popularity-based transcoding workload allocation for improving video quality in live streaming systems.",
                    "Cross-layer metrics sharing for QUICker video streaming.",
                    "Delay-aware distributed caching scheme in edge network.",
                    "A distributed reinforcement learning approach for energy and congestion-aware edge networks.",
                    "Stateless CPU-aware datacenter load-balancing.",
                    "Multi-directional CPU resource control in edge computing.",
                    "PANGU: a cloud-edge collaborative resource management platform centered on supercomputing.",
                    "Auto-tuning of large-scale iterative operations on modern streaming platforms.",
                    "Distributing deep learning inference on edge devices.",
                    "Towards explainable artificial intelligence for network function virtualization.",
                    "Estimation of traffic matrices via super-resolution and federated learning.",
                    "Combining split and federated architectures for efficiency and privacy in deep learning.",
                    "Black-box caches fingerprinting."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2020dml",
                "sub_name": "DistributedML@CoNEXT 2020: Proceedings of the 1st Workshop on Distributed Machine Learning, Barcelona, Spain, December 1, 2020.",
                "count": 6,
                "papers": [
                    "FEWER: Federated Weight Recovery.",
                    "FLaaS: Federated Learning as a Service.",
                    "Accelerating Intra-Party Communication in Vertical Federated Learning with RDMA.",
                    "Huffman Coding Based Encoding Techniques for Fast Distributed Deep Learning.",
                    "Maggy: Scalable Asynchronous Parallel Hyperparameter Search.",
                    "Neural Enhancement in Content Delivery Systems: The State-of-the-Art and Future Directions."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2020sw",
                "sub_name": "CoNEXT'20: Proceedings of the Student Workshop, Barcelona, Spain, December 1, 2020.",
                "count": 15,
                "papers": [
                    "BlockJack: Blocking IP Prefix Hijacker in Inter-Domain Routing.",
                    "Mobile and Delay Tolerant Network for LoRa at Sea.",
                    "Future Factories: Safe Human-Robot Collaboration.",
                    "Which one should I pick?: Helping operators choosing their inbound traffic engineering techniques.",
                    "WebOpt Profiler: Providing performance clarity for Web Optimizations.",
                    "Decentralization, Privacy and Performance for DNS.",
                    "Birdwatching: False Negatives In Cuckoo Filters.",
                    "A Low Latency Congestion Control That Can Compete.",
                    "On packet classification using a decision-tree ensemble.",
                    "Suture: Stitching Safety onto Kubernetes Operators.",
                    "Quickly Testing NIC and Driver Interactions by a Software-based NIC.",
                    "aFabric: Towards a Holistic View for Managing Hardware Accelerators in the Cloud.",
                    "Leveraging Demand Data as a Proxy for Understanding Large-scale Events.",
                    "The Case for More Flexible Distributed Tracing.",
                    "Lighting Extra Data via OWC Dimming."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2020europ4",
                "sub_name": "EuroP4@CoNEXT 2020: Proceedings of the 3rd P4 Workshop in Europe, Barcelona, Spain, December 1, 2020.",
                "count": 13,
                "papers": [
                    "Comparative Evaluation of IP Address Anti-Spoofing Mechanisms using a P4/NetFPGA-based Switch.",
                    "Falcon: Low Latency, Network-Accelerated Scheduling.",
                    "SYN Flood Defense in Programmable Data Planes.",
                    "P4-Protect: 1+1 Path Protection for P4.",
                    "Compiling Packet Programs to Reconfigurable Switches: Theory and Algorithms.",
                    "Leveraging P4 Flexibility to Expose Target-specific Features.",
                    "MTPSA: Multi-Tenant Programmable Switches.",
                    "A P4 Data Plane for the Quantum Internet.",
                    "Developing EFSM-based stateful applications with FlowBlaze.p4 and ONOS.",
                    "Unleashing the performance of virtual BNG by offloading data plane to a programmable ASIC.",
                    "Towards a Hybrid Next Generation NodeB.",
                    "A perspective on P4-based data and control plane modularity for network automation.",
                    "Pushing Network Programmability to the limits with SRv6 uSIDs and P4."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "15th CoNEXT 2019",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2019",
                "sub_name": "Proceedings of the 15th International Conference on Emerging Networking Experiments And Technologies, CoNEXT 2019, Orlando, FL, USA, December 09-12, 2019.",
                "count": 32,
                "papers": [
                    "PURR: a primitive for reconfigurable fast reroute: hope for the best and program for the worst.",
                    "Fine-grained queue measurement in the data plane.",
                    "HyperTester: high-performance network testing driven by programmable switches.",
                    "Normal forms for match-action programs.",
                    "PEERING: virtualizing BGP at the edge for research.",
                    "Comparing the performance of state-of-the-art software switches for NFV.",
                    "Steering hyper-giants' traffic at scale.",
                    "Challenges in inferring spoofed traffic at IXPs.",
                    "Beyond content analysis: detecting targeted ads via distributed counting.",
                    "An investigation on information leakage of DNS over TLS.",
                    "DNS privacy in practice and preparation.",
                    "Perceiving QUIC: do users notice or even care?",
                    "Q-Tag: a transparent solution to measure ads viewability rate in online advertising campaigns.",
                    "ABR streaming with separate audio and video tracks: measurements and best practices.",
                    "Analyzing viewport prediction under different VR interactions.",
                    "Veni Vidi Dixi: reliable wireless communication with depth images.",
                    "EasyPass: combating IoT delay with multiple access wireless side channels.",
                    "Smartphone positioning with radio measurements from a single wifi access point.",
                    "ADS: accurate decoding of RFID tags at scale.",
                    "zD: a scalable zero-drop network stack at end hosts.",
                    "Enabling ECN for datacenter networks with RTT variations.",
                    "Reducing tail latency using duplication: a multi-layered approach.",
                    "Sift: resource-efficient consensus with RDMA.",
                    "UNARI: an <u>un</u>certainty-aware approach to <u>a</u>s <u>r</u>elationships <u>i</u>nference.",
                    "QPipe: quantiles sketch fully in the data plane.",
                    "Tuple space explosion: a denial-of-service attack against a software packet classifier.",
                    "AViC: a cache for adaptive bitrate video.",
                    "RSS++: load and state-aware receive side scaling.",
                    "Egret: simplifying traffic management for physical and virtual network functions.",
                    "Network topology design at 27, 000 km/hour.",
                    "Loko: predictable latency in small networks.",
                    "Flash: efficient dynamic routing for offchain networks."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2019c",
                "sub_name": "Proceedings of the 15th International Conference on emerging Networking EXperiments and Technologies, CoNEXT 2019, Companion Volume, Orlando, FL, USA, December 9-12, 2019.",
                "count": 34,
                "papers": [
                    "CLEO: Machine Learning for ECMP.",
                    "A first look into Alexa's interaction security.",
                    "PKN: Improving Survivability of LEO Satellite Network through Protecting Key Nodes.",
                    "Mobility profiling: Identifying scouters in the crowd.",
                    "Transparent Coded Blockchain.",
                    "Towards more realistic network models based on Graph Neural Networks.",
                    "iLoad: In-network Load Balancing with Programmable Data Plane.",
                    "Network in the Air.",
                    "On the Learnability of Software Router Performance via CPU Measurements.",
                    "Asynchronous LOS Discovery Algorithm for Aerial Nodes Using In-band Full-Duplex Transceivers.",
                    "When Network Slicing meets Deep Reinforcement Learning.",
                    "Adversarial Network Algorithm Benchmarking.",
                    "Ward: Implementing Arbitrary Hierarchical Policies using Packet Resubmit in Programmable Switches.",
                    "Exploiting content similarity to address cold start in container deployments.",
                    "Dynamically Sharing Memory between Memcached Tenants using Tingo.",
                    "Preliminary Study on Indoor Localization using Smartphone-Based IEEE 802.11mc.",
                    "Investigating DNS Manipulation by Open DNS Resolvers.",
                    "Improving Survivability of LEO Satellite Network with guaranteed based approach.",
                    "Examining the Security of DDoS Detection Systems in Software Defined Networks.",
                    "Tracking Down Sources of Spoofed IP Packets.",
                    "One Pixel Image and RF Signal Based Split Learning for mmWave Received Power Prediction.",
                    "EBS: Electric Burst Scheduling system that supports future large bandwidth applications in scale.",
                    "In-network P4-based Low Latency Robot Arm Control.",
                    "IoT Resource-aware Orchestration Framework for Edge Computing.",
                    "Efficient Microservices with Elastic Containers.",
                    "Towards a Scalable, Flexible and High Performance NFV Execution Model.",
                    "Stateless TCP.",
                    "An SVM Based DDoS Attack Detection Method for Ryu SDN Controller.",
                    "Fast Multi-string Pattern Matching using PISA.",
                    "Clé: Enhancing Security with Programmable Dataplane Enabled Hybrid SDN.",
                    "A Hybrid ICN Caching Strategy Based on Region Division.",
                    "ML-Pushback: Machine Learning Based Pushback Defense Against DDoS.",
                    "Demo Proposal - Distrinet: a Mininet implementation for the Cloud.",
                    "PI2 for P4: An Active Queue Management Scheme for Programmable Data Planes."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2019encp",
                "sub_name": "Proceedings of the 1st ACM CoNEXT Workshop on Emerging in-Network Computing Paradigms, ENCP@CoNEXT 2019, Orlando, FL, USA, December 9, 2019.",
                "count": 9,
                "papers": [
                    "Online Reprogrammable Multi Tenant Switches.",
                    "Offloading Virtual Evolved Packet Gateway User Plane Functions to a Programmable ASIC.",
                    "Towards Executing Computer Vision Functionality on Programmable Network Devices.",
                    "P4-InTel: Bridging the Gap between iCF Diagnosis and Functionality.",
                    "Partition-Aware Packet Steering Using XDP and eBPF for Improving Application-Level Parallelism.",
                    "Execution Plans for Serverless Computing in Information Centric Networking.",
                    "Edge Data Repositories - The design of a store-process-send system at the Edge.",
                    "Trigger-Action Computing in Local Broadcast Beaconing Networks.",
                    "INCA: An Architecture for In-Network Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2019bigdama",
                "sub_name": "Proceedings of the 3rd ACM CoNEXT Workshop on Big DAta, Machine Learning and Artificial Intelligence for Data Communication Networks, Big-DAMA@CoNEXT 2019, Orlando, FL, USA, December 9, 2019.",
                "count": 7,
                "papers": [
                    "Identifying threats in a large company's inbox.",
                    "Walling up Backdoors in Intrusion Detection Systems.",
                    "Towards Evaluation of NIDSs in Adversarial Setting.",
                    "EXPLAIN-IT: Towards Explainable AI for Unsupervised Network Traffic Analysis.",
                    "Explaining Class-of-Service Oriented Network Traffic Classification with Superfeatures.",
                    "Comparing Machine Learning Algorithms for BGP Anomaly Detection using Graph Features.",
                    "Unsupervised machine learning for network-centric anomaly detection in IoT."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "14th CoNEXT 2018",
        "info": "Heraklion, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2018",
                "sub_name": "Proceedings of the 14th International Conference on emerging Networking EXperiments and Technologies, CoNEXT 2018, Heraklion, Greece, December 04-07, 2018.",
                "count": 32,
                "papers": [
                    "Five years at the edge: watching internet from the ISP network.",
                    "Is the web ready for HTTP/2 server push?",
                    "Don't repeat yourself: seamless execution and analysis of extensive network experiments.",
                    "APPx: an automated app acceleration framework for low latency mobile app.",
                    "REINFORCE: achieving efficient failure resiliency for network function virtualization based services.",
                    "The eXpress data path: fast programmable packet processing in the operating system kernel.",
                    "Leveraging eBPF for programmable network functions with IPv6 segment routing.",
                    "Verification of P4 programs in feasible time using assertions.",
                    "Intent-driven composition of resource-management SDN applications.",
                    "P4Visor: lightweight virtualization and composition primitives for building and testing modular programs.",
                    "Wireless CSI-based head tracking in the driver seat.",
                    "BLoc: CSI-based accurate localization for BLE tags.",
                    "Boosting fine-grained activity sensing by embracing wireless multipath effects.",
                    "Stellar: network attack mitigation using advanced blackholing.",
                    "Mining the web with webcoin.",
                    "Blockchain-based real-time cheat prevention and robustness for multi-player online games.",
                    "IotSan: fortifying the safety of IoT systems.",
                    "Robustly disjoint paths with segment routing.",
                    "P-Rex: fast verification of MPLS networks with multiple link failures.",
                    "Dynam-IX: a dynamic interconnection eXchange.",
                    "Workload adaptive flow scheduling.",
                    "Memento: making sliding windows efficient for heavy hitters.",
                    "Bohr: similarity aware geo-distributed data analytics.",
                    "SkyRAN: a self-organizing LTE RAN in the sky.",
                    "MobileStream: a scalable, programmable and evolvable mobile core control plane platform.",
                    "ExLL: an extremely low-latency congestion control for mobile cellular networks.",
                    "DenseVLC: a cell-free massive MIMO system with distributed LEDs.",
                    "Interference management for unlicensed users in shared CBRS spectrum.",
                    "Scylla: interleaving multiple IoT stacks on a single radio.",
                    "Overbooking network slices through yield-driven end-to-end orchestration.",
                    "ABR streaming of VBR-encoded videos: characterization, challenges, and solutions.",
                    "Proteus: network-aware web browsing on heterogeneous mobile systems."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2018em5g",
                "sub_name": "EM-5G'18: Proceedings of the Workshop on Experimentation and Measurements in 5G, EM-5G@CoNEXT 2018, Heraklion, Greece, December 4, 2018.",
                "count": 4,
                "papers": [
                    "A Black Box Measurement Method for Reliability of Wireless Communication.",
                    "Enhancing Edge robotics through the use of context information.",
                    "Experience Building a Prototype 5G Testbed.",
                    "A Framework for Orchestration and Federation of 5G Services in a Multi-Domain Scenario."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2018epiq",
                "sub_name": "Proceedings of the Workshop on the Evolution, Performance, and Interoperability of QUIC, EPIQ@CoNEXT 2018, Heraklion, Greece, December 4, 2018.",
                "count": 7,
                "papers": [
                    "Towards QUIC debuggability.",
                    "Observing the Evolution of QUIC Implementations.",
                    "Interoperability-Guided Testing of QUIC Implementations using Symbolic Execution.",
                    "nQUIC: Noise-Based QUIC Packet Protection.",
                    "A Stream-Aware Multipath QUIC Scheduler for Heterogeneous Paths: Paper # XXX, XXX pages.",
                    "Real-time Audio-Visual Media Transport over QUIC.",
                    "The QUIC Fix for Optimal Video Streaming."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "13th CoNEXT 2017",
        "info": "Incheon, Republic of Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2017",
                "sub_name": "Proceedings of the 13th International Conference on emerging Networking EXperiments and Technologies, CoNEXT 2017, Incheon, Republic of Korea, December 12 - 15, 2017.",
                "count": 41,
                "papers": [
                    "Fast and Smart Network Resource Management for Datacenters and Beyond.",
                    "Towards unlicensed cellular networks in TV white spaces.",
                    "BLU: Blue-printing Interference for Robust LTE Access in Unlicensed Spectrum.",
                    "Dissecting DNS Stakeholders in Mobile Networks.",
                    "Identifying and Analyzing Broadband Internet Reverse DNS Names.",
                    "Drongo: Speeding Up CDNs with Subnet Assimilation from the Client.",
                    "Footprint Descriptors: Theory and Practice of Cache Provisioning in a Global CDN.",
                    "Redesigning CDN-Broker Interactions for Improved Content Delivery.",
                    "A Churn for the Better: Localizing Censorship using Network-level Path Churn and Network Tomography.",
                    "And Then There Were More: Secure Communication for More Than Two Parties.",
                    "MaxLength Considered Harmful to the RPKI.",
                    "On the Necessity of a Prescribed Block Validity Consensus: Analyzing Bitcoin Unlimited Mining Protocol.",
                    "SIXPACK: Securing Internet eXchange Points Against Curious onlooKers.",
                    "Jaal: Towards Network Intrusion Detection at ISP Scale.",
                    "ECF: An MPTCP Path Scheduler to Manage Heterogeneous Paths.",
                    "Multipath QUIC: Design and Evaluation.",
                    "TCP Congestion Control Beyond Bandwidth-Delay Product for Mobile Cellular Networks.",
                    "Not All Apps Are Created Equal: Analysis of Spatiotemporal Heterogeneity in Nationwide Mobile Service Usage.",
                    "Follow that Light: Leveraging LEDs for Relative Two-Dimensional Localization.",
                    "Revisiting Reading Rate with Mobility: Rate-Adaptive Reading in COTS RFID Systems.",
                    "SmartVLC: When Smart Lighting Meets VLC.",
                    "Zero Overhead Device Tracking in 60 GHz Wireless Networks using Multi-Lobe Beam Patterns.",
                    "AWL: Turning Spatial Aliasing From Foe to Friend for Accurate WiFi Localization.",
                    "Localizing Low-power Backscatter Tags Using Commodity WiFi.",
                    "Locating and Tracking BLE Beacons with Smartphones.",
                    "Catalyst: Unlocking the Power of Choice to Speed up Network Updates.",
                    "Hermes: Providing Tight Control over High-Performance SDN Switches.",
                    "Supporting Diverse Dynamic Intent-based Policies using Janus.",
                    "Typhoon: An SDN Enhanced Real-Time Big Data Streaming Framework.",
                    "Clove: Congestion-Aware Load Balancing at the Virtual Edge.",
                    "POI360: Panoramic Mobile Video Telephony over LTE Cellular Networks.",
                    "Studying TLS Usage in Android Apps.",
                    "ZipNet-GAN: Inferring Fine-grained Mobile Traffic Patterns via a Generative Adversarial Neural Network.",
                    "Informed Bandwidth Adaptation in Wi-Fi Networks using Ping-Pair.",
                    "FreeRider: Backscatter Communication Using Commodity Radios.",
                    "Channel Spoofer: Defeating Channel Variability and Unpredictability.",
                    "Compressive Millimeter-Wave Sector Selection in Off-the-Shelf IEEE 802.1 lad Devices.",
                    "Canopus: A Scalable and Massively Parallel Consensus Protocol.",
                    "Saath: Speeding up CoFlows by Exploiting the Spatial Dimension.",
                    "Tagger: Practical PFC Deadlock Prevention in Data Center Networks.",
                    "Towards Reliable Application Deployment in the Cloud."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2017can",
                "sub_name": "Proceedings of the 2nd Workshop on Cloud-Assisted Networking, CAN@CoNEXT 2017, Incheon, Republic of Korea, December 12, 2017.",
                "count": 12,
                "papers": [
                    "Considerations on deploying high-performance container-based NFV.",
                    "Towards optimal adaptation of NFV packet processing to modern CPU memory architectures.",
                    "Unveiling performance of NFV software dataplanes.",
                    "SDN on ACIDs.",
                    "Switch-visor: towards infrastructure-level virtualization of SDN switches.",
                    "Cloud assisted home networks.",
                    "MISE: MIddleboxes SElection for multi-domain service function chains.",
                    "DeepFlow: a deep learning framework for software-defined measurement.",
                    "Controlling migration performance of virtual machines according to user's requirements.",
                    "Semantic virtualization for Edge-IoT cloud: issues and challenges.",
                    "Cloud-assisted trajectory data management and analysis: a case study.",
                    "Fending off IoT-hunting attacks at home networks."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2017itender",
                "sub_name": "Proceedings of the First CoNEXT Workshop on ICT Tools for Emergency Networks and DisastEr Relief, I-TENDER@CoNEXT 2017, Incheon, Republic of Korea, December 12, 2017.",
                "count": 9,
                "papers": [
                    "Filtering informative tweets during emergencies: a machine learning approach.",
                    "Co-design of a crowdsourcing solution for disaster risk reduction.",
                    "Effects of partial infrastructure on indoor positioning for emergency rescue evacuation support system.",
                    "Positioning integrity computation for consumer grade GNSS receivers.",
                    "Localization of emergency first responders using UWB/GNSS with cloud-based augmentation: short paper.",
                    "Quantifying and minimizing the impact of disasters on wireless communications.",
                    "Network-aware user association in public safety oriented mobile networks.",
                    "Dynamic cost-effective emergency network provision.",
                    "mmWave for future public safety communications."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "12th CoNEXT 2016",
        "info": "Irvine, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2016",
                "sub_name": "Proceedings of the 12th International on Conference on emerging Networking EXperiments and Technologies, CoNEXT 2016, Irvine, California, USA, December 12-15, 2016.",
                "count": 38,
                "papers": [
                    "Enabling Software-Defined Network Security for Next-Generation Networks.",
                    "Flurries: Countless Fine-Grained NFs for Flexible Per-Flow Customization.",
                    "Mind the Gap: Monitoring the Control-Data Plane Consistency in Software Defined Networks.",
                    "HyPer4: Using P4 to Virtualize the Programmable Data Plane.",
                    "EMPoWER Hybrid Networks: Exploiting Multiple Paths over Wireless and ElectRical Mediums.",
                    "CPRecycle: Recycling Cyclic Prefix for Versatile Interference Mitigation in OFDM based Wireless Systems.",
                    "Mudra: User-friendly Fine-grained Gesture Recognition using WiFi Signals.",
                    "Passive Communication with Ambient Light.",
                    "PI2: A Linearized AQM for both Classic and Scalable TCP.",
                    "SMig: Stream Migration Extension for HTTP/2.",
                    "MP-DASH: Adaptive Video Streaming Over Preference-Aware Multipath.",
                    "ExBox: Experience Management Middlebox for Wireless Networks.",
                    "AmorFi: Amorphous WiFi Networks for High-density Deployments.",
                    "SlickFi: A Service Differentiation Scheme for High-Speed WLANs using Dual Radio APs.",
                    "Enabling ECN over Generic Packet Scheduling.",
                    "Xpander: Towards Optimal-Performance Datacenters.",
                    "Network Scheduling Aware Task Placement in Datacenters.",
                    "Low Bandwidth Offload for Mobile AR.",
                    "D-Watch: Embracing \"bad\" Multipaths for Device-Free Localization with COTS RFID Devices.",
                    "RT-OPEX: Flexible Scheduling for Cloud-RAN Processing.",
                    "Enabling Automatic Protocol Behavior Analysis for Android Applications.",
                    "Sunflow: Efficient Optical Circuit Scheduling for Coflows.",
                    "ECN or Delay: Lessons Learnt from Analysis of DCQCN and TIMELY.",
                    "Composite-Path Switching.",
                    "Source Accountability with Domain-brokered Privacy.",
                    "A NEaT Design for Reliable and Scalable Network Stacks.",
                    "ACACIA: Context-aware Edge Computing for Continuous Interactive Applications over Mobile Networks.",
                    "Lying Your Way to Better Traffic Engineering.",
                    "EYEORG: A Platform For Crowdsourcing Web Quality Of Experience Measurements.",
                    "GRETEL: Lightweight Fault Localization for OpenStack.",
                    "FlexRAN: A Flexible and Programmable Platform for Software-Defined Radio Access Networks.",
                    "Leveraging Electromagnetic Polarization in a Two-Antenna Whiteboard in the Air.",
                    "Maximizing Broadcast Throughput Under Ultra-Low-Power Constraints.",
                    "Measuring Latency Variation in the Internet.",
                    "LossRadar: Fast Detection of Lost Packets in Data Center Networks.",
                    "Demystifying and Puncturing the Inflated Delay in Smartphone-based WiFi Network Measurement.",
                    "Network Innovators Community Event (GENI NICE 2016).",
                    "ACM CoNEXT 2016 Student Workshop."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2016can",
                "sub_name": "Proceedings of the 2016 ACM Workshop on Cloud-Assisted Networking, CAN@CoNEXT 2016, Irvine, California, USA, December 12, 2016.",
                "count": 12,
                "papers": [
                    "AggFlow: Scalable and Efficient Network Address Virtualization on Software Defined Networking.",
                    "Understanding the Performance and Bottlenecks of Cloud-Routed Overlay Networks: A Case Study.",
                    "Architecting Multimedia Conferencing Service using SDN.",
                    "A Dynamic Programming Algorithm for Joint VNF Placement and Chaining.",
                    "Hybrid Cloud Integration of Routing Control & Data Planes.",
                    "CleanG: A Clean-Slate EPC Architecture and ControlPlane Protocol for Next Generation Cellular Networks.",
                    "How Close to the Edge?: Delay/Utilization Trends in MEC.",
                    "Profiling and Grouping Users to Edge Resources According to User Interest Similarity.",
                    "Personal Data Management with the Databox: What's Inside the Box?",
                    "Securebox: Toward Safer and Smarter IoT Networks.",
                    "SecuSpot: Toward Cloud-Assisted Secure Multi-Tenant WiFi HotSpot Infrastructures.",
                    "A First Look at Bugs in OpenStack."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "11th CoNEXT 2015",
        "info": "Heidelberg, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2015",
                "sub_name": "Proceedings of the 11th ACM Conference on Emerging Networking Experiments and Technologies, CoNEXT 2015, Heidelberg, Germany, December 1-4, 2015.",
                "count": 41,
                "papers": [
                    "pHost: distributed near-optimal datacenter transport over commodity network fabric.",
                    "Rapid and robust impact assessment of software changes in large internet-based services.",
                    "TM3: flexible <u>t</u>ransport-layer <u>m</u>ulti-pipe <u>m</u>ultiplexing <u>m</u>iddlebox without head-of-line blocking.",
                    "Powering the next billion devices with wi-fi.",
                    "An anatomy of mobile web performance over multipath TCP.",
                    "Efficient traffic splitting on commodity switches.",
                    "Alpaca: compact network policies with attribute-carrying addresses.",
                    "Cashing in on caching: on-demand contract design with linear pricing.",
                    "Demystifying and mitigating TCP stalls at the server side.",
                    "Practical network-wide packet behavior identification by AP classifier.",
                    "Jamming mitigation by randomized bandwidth hopping.",
                    "ColorBars: increasing data rate of LED-to-camera communication using color shift keying.",
                    "I always feel like somebody's watching me: measuring online behavioural advertising.",
                    "SCREAM: sketch resource allocation for software-defined measurement.",
                    "UMON: flexible and fine grained traffic monitoring in open vSwitch.",
                    "Characterizing IPv4 anycast adoption and deployment.",
                    "Boon and bane of 60 GHz networks: practical insights into beamforming, interference, and frame level operation.",
                    "COPA: cooperative power allocation for interfering wireless networks.",
                    "Scaling the LTE control-plane for future mobile access.",
                    "Pulsar: improving throughput estimation in enterprise LTE small cells.",
                    "Magus: minimizing cellular service disruption during network upgrades.",
                    "Halfback: running short flows quickly and safely.",
                    "Hansel: diagnosing faults in openStack.",
                    "Identifying the root cause of video streaming issues on mobile devices.",
                    "Realistic packet reordering for network emulation and simulation.",
                    "Hiding mobile traffic fingerprints with GLOVE.",
                    "Subways: a case for redundant, inexpensive data center edge links.",
                    "SMAPP: towards smart multipath TCP-enabled applications.",
                    "Non-altering time scales for aggregation of dynamic networks into series of graphs.",
                    "Design, implementation, and evaluation of energy-aware multi-path TCP.",
                    "Look who's talking: a practical approach for achieving scheduled wifi in a single collision domain.",
                    "Monocle: dynamic, fine-grained data plane monitoring.",
                    "QProbe: locating the bottleneck in cellular communication.",
                    "Scenario-based programming for SDN policies.",
                    "DiversiFi: robust multi-link interactive streaming.",
                    "Path switching: reduced-state flow handling in SDN using path information.",
                    "Mapping peering interconnections to a facility.",
                    "On robust neighbor discovery in mobile wireless networks.",
                    "BOLT: realizing high throughput power line communication networks.",
                    "A server-to-server view of the internet.",
                    "Scheduling techniques for hybrid circuit/packet networks."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2015ccdwn",
                "sub_name": "Proceedings of the 1st Workshop on Content Caching and Delivery in Wireless Networks, CCDWN@CoNEXT 2015, Heidelberg, Germany, December 1-4, 2015.",
                "count": 8,
                "papers": [
                    "Long-term country-scale opportunistic network coded data dissemination.",
                    "Cache-enabled erasure broadcast channels with feedback: asymmetric user memory case.",
                    "On energy-efficient caching at the wireless edge.",
                    "Enhancing multi-source content delivery in content-centric networks with fountain coding.",
                    "Analysis of latency-aware caching strategies in information-centric networking.",
                    "Collaborative content caching in wireless edge with SDN.",
                    "Stochastic content-centric multicast scheduling for cache-enabled heterogeneous cellular networks.",
                    "DSCA: a data stream caching algorithm."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "10th CoNEXT 2014",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2014",
                "sub_name": "Proceedings of the 10th ACM International on Conference on emerging Networking Experiments and Technologies, CoNEXT 2014, Sydney, Australia, December 2-5, 2014.",
                "count": 37,
                "papers": [
                    "Analyzing and Boosting the Performance of Power-Line Communication Networks.",
                    "Filtering Noisy 802.11 Time-of-Flight Ranging Measurements.",
                    "Communication Networks of Visible Light Emitting Diodes with Intra-Frame Bidirectional Transmission.",
                    "MIDAS: Empowering 802.11ac Networks with Multiple-Input Distributed Antenna Systems.",
                    "MoFA: Mobility-aware Frame Aggregation in Wi-Fi.",
                    "Bringing Mobility-Awareness to WLANs using PHY Layer Information.",
                    "Measurement-Augmented Spectrum Databases for White Space Spectrum.",
                    "Cuckoo Filter: Practically Better Than Bloom.",
                    "Sprinklers: A Randomized Variable-Size Striping Approach to Reordering-Free Load-Balanced Switching.",
                    "Trees in the List: Accelerating List-based Packet Classification Through Controlled Rule Set Expansion.",
                    "Multi-Layer Packet Classification with Graphics Processing Units.",
                    "From Cells to Streets: Estimating Mobile Paths with Cellular-Side Data.",
                    "The Cost of the \"S\" in HTTPS.",
                    "A Tangled Mass: The Android Root Certificate Stores.",
                    "FlowBender: Flow-level Adaptive Routing for Improved Latency and Throughput in Datacenter Networks.",
                    "Distributed Route Aggregation on the Global Network.",
                    "COLD: PoP-level Network Topology Synthesis.",
                    "Remote Peering: More Peering without Internet Flattening.",
                    "Tango: Simplifying SDN Control with Automatic Switch Property Inference, Abstraction, and Optimization.",
                    "Merlin: A Language for Provisioning Network Resources.",
                    "Controller-agnostic SDN Debugging.",
                    "On the Fairness-Efficiency Tradeoff for Packet Processing with Multiple Resources.",
                    "NetAgg: Using Middleboxes for Application-specific On-path Aggregation in Data Centres.",
                    "MSPlayer: Multi-Source and multi-Path LeverAged YoutubER.",
                    "Deep Packet Inspection as a Service.",
                    "Subsidization Competition: Vitalizing the Neutral Internet.",
                    "Pricing The Last Mile: Data Capping For Residential Broadband.",
                    "Collaborative Consumption for Mobile Broadband: A Quantitative Study.",
                    "User Behavior and Change: File-sharers and Copyright Laws.",
                    "PARCEL: Proxy Assisted BRowsing in Cellular networks for Energy and Latency reduction.",
                    "Using Cooperation for Low Power Low Latency Cellular Connectivity.",
                    "Managing Redundant Content in Bandwidth Constrained Wireless Networks.",
                    "Trace-Driven Analysis of ICN Caching Algorithms on Video-on-Demand Workloads.",
                    "SoftMoW: Recursive and Reconfigurable Cellular WAN Architecture.",
                    "Democratic Resolution of Resource Conflicts Between SDN Control Programs.",
                    "Scotch: Elastically Scaling up SDN Control-Plane using vSwitch based Overlay.",
                    "Providing Reliable FIB Update Acknowledgments in SDN."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2014sw",
                "sub_name": "Proceedings of the 2014 CoNEXT on Student Workshop, CoNEXT Student Workshop '14, Sydney, Australia, December 2, 2014.",
                "count": 17,
                "papers": [
                    "Expeditus: Distributed Load Balancing with Global Congestion Information in Data Center Networks.",
                    "Minimizing Transient Congestion during Network Update in Data Centers.",
                    "A Bandwidth Allocation Scheme to Improve Fairness in Data Center Networks.",
                    "Performance and Fairness Issues in Big Data Transfers.",
                    "A Novel Strategy for Link Prediction in Social Networks.",
                    "Profiling Energy Consumption in a Residential Campus.",
                    "Diagnosing Device-Specific Anomalies in Cellular Networks.",
                    "Location-Based Adaptation for DASH in Vehicular Environment.",
                    "Towards the Era of Wearable Computing?",
                    "How Interface ID Allocation Mechanisms are Performed in IPv6.",
                    "Lightweight Approach to Detect Drive-by Download Attacks Based on File Type Transition.",
                    "On the Intrusiveness of JavaScript on the Web.",
                    "Towards Classifying Third-Party Web Services at Scale.",
                    "Model Based Black-Box Testing of SDN Applications.",
                    "MalwareMonitor: An SDN-based Framework for Securing Large Networks.",
                    "Building Blocks for an Elastic Mobile Core.",
                    "Active Interest Management for Improving Flow Completion Time in Named-Data Networking."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2014vn",
                "sub_name": "Proceedings of the 2014 Workshop on Design, Quality and Deployment of Adaptive Video Streaming, VideoNext@CoNEXT 2014, Sydney, Australia, December 2, 2014.",
                "count": 12,
                "papers": [
                    "TAPAS: A Tool for rApid Prototyping of Adaptive Streaming algorithms.",
                    "A Control Architecture for Massive Adaptive Video Streaming Delivery.",
                    "DASH in Twitch: Adaptive Bitrate Streaming in Live Game Streaming Platforms.",
                    "Quality of Experience of Web-based Adaptive HTTP Streaming Clients in Real-World Environments using Crowdsourcing.",
                    "Using In-Network Adaptation to Tackle Inefficiencies Caused by DASH in Information-Centric Networks.",
                    "The Impact of Adaptation Strategies on Perceived Quality of HTTP Adaptive Streaming.",
                    "Transitions in Live Video Streaming Services.",
                    "A Geo-Adaptive JavaScript DASH Player.",
                    "Efficient HEVC Scheme Using Motion Type Categorization.",
                    "Video Ferrying: A Low Cost Video Streaming Approach for Cellular Networks.",
                    "Empirical Evaluation of Real-Time Video Foveation.",
                    "An SDN-based Framework for Detection of Illegal Rebroadcasting of Channels in P2PTV."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "9th CoNEXT 2013",
        "info": "Santa Barbara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2013",
                "sub_name": "Conference on emerging Networking Experiments and Technologies, CoNEXT '13, Santa Barbara, CA, USA, December 9-12, 2013.",
                "count": 45,
                "papers": [
                    "Crowd-assisted search for price discrimination in e-commerce: first results.",
                    "A first look at IPv4 transfer markets.",
                    "Optimizing the \"one big switch\" abstraction in software-defined networks.",
                    "An adaptive flow counting method for anomaly detection in SDN.",
                    "Virtualizing the access network via open APIs.",
                    "Distributed resource control using shadowed subgraphs.",
                    "Per-packet load-balanced, low-latency routing for clos-based data center networks.",
                    "Scaling IP multicast on datacenter topologies.",
                    "Explicit multipath congestion control for data center networks.",
                    "Aspen trees: balancing data center fault tolerance, scalability and cost.",
                    "Scalable, high performance ethernet forwarding with CuckooSwitch.",
                    "Scheduling packets over multiple interfaces while respecting user preferences.",
                    "On limitations of network acceleration.",
                    "Now or later?: delaying data transfer in time-critical aerial communication.",
                    "Bullet trains: a study of NIC burst behavior at microsecond timescales.",
                    "FasTrak: enabling express lanes in multi-tenant data centers.",
                    "Scalable, optimal flow routing in datacenters via local link balancing.",
                    "SoftCell: scalable and flexible cellular core network architecture.",
                    "Robust assessment of changes in cellular networks.",
                    "3GOL: power-boosting ADSL using 3G onloading.",
                    "Capturing mobile experience in the wild: a tale of two apps.",
                    "Silent TCP connection closure for cellular networks.",
                    "Direct code execution: revisiting library OS architecture for reproducible network experiments.",
                    "Pythia: yet another active probing technique for alias resolution.",
                    "An automated system for emulated network experimentation.",
                    "Inferring multilateral peering.",
                    "Minimizing network complexity through integrated top-down design.",
                    "Understanding tradeoffs in incremental deployment of new network architectures.",
                    "Low latency via redundancy.",
                    "Socket intents: leveraging application awareness for multi-access connectivity.",
                    "Full duplex radios: from impossibility to practice.",
                    "Towards a SPDY'ier mobile web?",
                    "Staying online while mobile: the hidden costs.",
                    "Is there a case for mobile phone content pre-staging?",
                    "RFID shakables: pairing radio-frequency identification tags with the help of gesture recognition.",
                    "Resource thrifty secure mobile video transfers on open WiFi networks.",
                    "Enhancing video accessibility and availability using information-bound references.",
                    "Shedding light on the structure of internet video quality problems in the wild.",
                    "Geography matters: building an efficient transport network for a better video conferencing experience.",
                    "DOMINO: relative scheduling in enterprise wireless LANs.",
                    "On the benefits of applying experimental design to improve multipath TCP.",
                    "DomainFlow: practical flow management method using multiple flow tables in commodity switches.",
                    "RiskRoute: a framework for mitigating network outage threats.",
                    "CoDef: collaborative defense against large-scale link-flooding attacks.",
                    "Federated flow-based approach for privacy preserving connectivity tracking."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2013sw",
                "sub_name": "Proceedings of the 2013 workshop on Student workhop, CoNEXT Student Workhop '13, Santa Barbara, California, USA, December 9, 2013.",
                "count": 18,
                "papers": [
                    "ndn||mem: an architecture to alleviate the memory bottleneck for named data networking.",
                    "Don't trust traceroute (completely).",
                    "Leveraging diversity to optimize performance in mobile networks.",
                    "Exposing and mitigating privacy loss in crowdsourced survey platforms.",
                    "A base station congestion-dependent pricing scheme for cellular data network.",
                    "Linearly scalable crowdsourced media broadcasting in the mobile cloud.",
                    "Traffic pattern based virtual network embedding.",
                    "Virtualizing national broadband access infrastructure.",
                    "Towards impactful routing research: running your own (Emulated) as on the (Real) internet.",
                    "Parallel routing on multi-core routers for big data transfers.",
                    "A study on cache suppression control according to content popularity for in-network guidance.",
                    "Content and buffer aware scheduling for video delivery over LTE.",
                    "A selective caching scheme based on request history in content-centric networks.",
                    "A push-enabling scheme for live streaming system in content-centric networking.",
                    "Dissecting Bufferbloat: measurement and per-application breakdown of queueing delay.",
                    "Real-time diagnosis of TCP performance in clouds.",
                    "Diagnosing slow web page access at the client side.",
                    "MARS: measurement-based allocation of vm resources for cloud data centers."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2013hotmiddlebox",
                "sub_name": "Proceedings of the 2013 workshop on Hot topics in middleboxes and network function virtualization, HotMiddlebox 2013, Santa Barbara, California, USA, December 9, 2013.",
                "count": 8,
                "papers": [
                    "Multipath in the middle(box).",
                    "Evolving the internet with connection acrobatics.",
                    "Towards minimalistic, virtualized content caches with minicache.",
                    "FlowOS: a flow-based platform for middleboxes.",
                    "Verifiable network function outsourcing: requirements, challenges, and roadmap.",
                    "SymNet: static checking for stateful networks.",
                    "Are TCP extensions middlebox-proof?",
                    "Analysis and topology-based traversal of cascaded large scale NATs."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "8th CoNEXT 2012",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2012",
                "sub_name": "Conference on emerging Networking Experiments and Technologies, CoNEXT '12, Nice, France - December 10 - 13, 2012.",
                "count": 31,
                "papers": [
                    "MPTCP is not pareto-optimal: performance issues and a possible solution.",
                    "Architecting for edge diversity: supporting rich services over an unbundled transport.",
                    "Tuning ECN for data center networks.",
                    "Datacast: a scalable and efficient reliable group data delivery service for data centers.",
                    "PAST: scalable ethernet for data centers.",
                    "VALE, a switched ethernet for virtual machines.",
                    "Towards TCAM-based scalable virtual routers.",
                    "Modeling complexity of enterprise routing design.",
                    "Improving fairness, efficiency, and stability in HTTP-based adaptive video streaming with FESTIVE.",
                    "Towards agile and smooth video adaptation in dynamic HTTP streaming.",
                    "QAVA: quota aware video adaptation.",
                    "Orchestrating massively distributed CDNs.",
                    "Tradeoffs in CDN designs for throughput oriented traffic.",
                    "Dealer: application-aware request splitting for interactive cloud applications.",
                    "Energy consumption anatomy of 802.11 devices and its implication on modeling and design.",
                    "Traffic-aware techniques to reduce 3G/LTE wireless energy consumption.",
                    "Computing while charging: building a distributed computing infrastructure using smartphones.",
                    "Weeble: enabling low-power nodes to coexist with high-power nodes in white space networks.",
                    "WiFox: scaling WiFi performance for large audience environments.",
                    "MAClets: active MAC protocols over hard-coded devices.",
                    "Automatic test packet generation.",
                    "Reproducible network experiments using container-based emulation.",
                    "A SOFT way for openflow switch interoperability testing.",
                    "FindAll: a local search engine for mobile phones.",
                    "VMTorrent: scalable P2P virtual machine streaming.",
                    "Cloud-based social application deployment using local processing and global distribution.",
                    "FRAppE: detecting malicious facebook applications.",
                    "Defending against large-scale crawls in online social networks.",
                    "Cachet: a decentralized architecture for privacy preserving social networking with caching.",
                    "BotFinder: finding bots in network traffic without deep packet inspection.",
                    "New opportunities for load balancing in network-wide intrusion detection systems."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2012sw",
                "sub_name": "Proceedings of the 2012 ACM conference on CoNEXT student workshop, CoNEXT Student '12, Nice, France, December 10, 2012.",
                "count": 34,
                "papers": [
                    "10 years in the making: a retrospective to a research career.",
                    "AutoSlice: automated and scalable slicing for software-defined networks.",
                    "Toward fast and efficient IP-level network topology capture.",
                    "QoS-driven channel selection for heterogeneous cognitive radio networks.",
                    "AFR: automatic multi-stage forensic data retrieval.",
                    "Implications of source routing.",
                    "Inferring networked system models from behavior traces.",
                    "OpenCache: exploring efficient and transparent content delivery mechanisms for video-on-demand.",
                    "From your routine to hotspot deployment for data offloading.",
                    "The complete picture of the Twitter social graph.",
                    "Dissecting foursquare venue popularity via random region sampling.",
                    "Diverse routing in networks with star SRLGs.",
                    "Interaction or interference: can AQM and low priority congestion control successfully collaborate?",
                    "Enabling energy-aware mobile data offloading for smartphones through vertical collaboration.",
                    "How to prevent AS hijacking attacks.",
                    "Reactions on advice given by others on the business of becoming a researcher.",
                    "Xcast6 treemap islands: revisiting multicast model.",
                    "Evolving TCP.: how hard can it be?",
                    "A multi-platform event-driven controller for network experiments.",
                    "Distributed k-core decomposition of dynamic graphs.",
                    "Who is more reliable?: an evaluation method for distributed-memory aggregation in the internet.",
                    "Source routed forwarding with software defined control, considerations and implications.",
                    "Specification and composition of network services in future internet architectures.",
                    "Decoupling BGP policy from routing with programmable reactive policy control.",
                    "Exploring reachability via settlement-free peering.",
                    "Smooth transmission over unsychronized VLC links.",
                    "Actors and publish/subscribe: an efficient approach to scalable distribution in data centers.",
                    "Deadline-aware data plane for internet video.",
                    "Chkdiff: checking traffic differentiation at internet access.",
                    "The case for software-defined networking in heterogeneous networked environments.",
                    "Automated home network troubleshooting with device collaboration.",
                    "Gaining insight into AS-level outages through analysis of internet background radiation.",
                    "Meddle: middleboxes for increased transparency and control of mobile traffic.",
                    "Optimal storage allocation for road side unit aided vehicular mobile content dissemination."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2012urbane",
                "sub_name": "Proceedings of the first workshop on Urban networking, UrbaNe@CoNEXT 2012, Nice, France, December 10, 2012.",
                "count": 8,
                "papers": [
                    "Optimal deployment of charging stations for electric vehicular networks.",
                    "Harvesting heat in an urban greenhouse.",
                    "A distributed algorithm for multiple intersections adaptive traffic lights control using a wireless sensor networks.",
                    "On optimal service directory selection in urban vehicular networks.",
                    "Capillary networks: a novel networking paradigm for urban environments.",
                    "Citywide mobile internet access using dense urban WiFi coverage.",
                    "Analyzing the workload dynamics of a mobile phone network in large scale events.",
                    "Content consumption cartography of the paris urban region using cellular probe data."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2012csws",
                "sub_name": "Proceedings of the 2012 ACM workshop on Capacity sharing, CSWS@CoNEXT 2012, Nice, France, December 10, 2012.",
                "count": 11,
                "papers": [
                    "Applying abstraction for a more efficient and fair network usage.",
                    "Mercado: using market principles to drive alternative network service abstractions.",
                    "A first look at multi-access connectivity for mobile networking.",
                    "On flow concurrency in the internet and its implications for capacity sharing.",
                    "AIMD and CCN: past and novel acronyms working together in the future internet.",
                    "ConEx based QoE feedback to enhance QoE.",
                    "Reducing server and network load with shared buffering.",
                    "Enhancing TCP to support rate-limited traffic.",
                    "Can congestion-controlled interactive multimedia traffic co-exist with TCP?",
                    "Resource allocation in underprovisioned multioverlay live video sharing services.",
                    "Demand-aware flow allocation in data center networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "7th CoNEXT 2011",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2011",
                "sub_name": "Proceedings of the 2011 Conference on Emerging Networking Experiments and Technologies, Co-NEXT '11, Tokyo, Japan, December 6-9, 2011.",
                "count": 30,
                "papers": [
                    "Reclaiming the white spaces: spectrum efficient coexistence with primary users.",
                    "Dynamic channel, rate selection and scheduling for white spaces.",
                    "WiGEM: a learning-based approach for indoor localization.",
                    "Concurrent Wi-Fi for mobile users: analysis and measurements.",
                    "Address-based route reflection.",
                    "On route aggregation.",
                    "On the interaction of multiple routing algorithms.",
                    "MicroTE: fine grained traffic engineering for data centers.",
                    "Anticipatory wireless bitrate control for blocks.",
                    "CAESAR: carrier sense-based ranging in off-the-shelf 802.11 wireless LAN.",
                    "The impact of channel bonding on 802.11n network management.",
                    "Snooze: energy management in 802.11n WLANs.",
                    "Rapid detection of maintenance induced changes in service performance.",
                    "Decentralized prediction of end-to-end network performance classes.",
                    "TRIO: measuring asymmetric capacity with three minimum round-trip times.",
                    "The public option: a non-regulatory alternative to network neutrality.",
                    "CIPT: using tuangou to reduce IP transit costs.",
                    "Identifying and using energy-critical paths.",
                    "Adapting router buffers for energy efficiency.",
                    "ASAP: a low-latency transport layer.",
                    "TCP fast open.",
                    "Refector: heuristic header error recovery for error-tolerant transmissions.",
                    "Pangolin: speeding up concurrent messaging for cloud-based social gaming.",
                    "Shifting network tomography toward a practical goal.",
                    "Network characteristics of video streaming traffic.",
                    "Assessing IPv6 through web access a measurement study and its findings.",
                    "TreeCAM: decoupling updates and lookups in packet classification.",
                    "Deja vu: fingerprinting network problems.",
                    "SMALTA: practical and near-optimal FIB aggregation.",
                    "Verifying and enforcing network paths with icing."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2011sw",
                "sub_name": "Proceedings of The ACM CoNEXT Student Workshop, CoNEXT '11 Student, Tokyo, Japan, December 6-9, 2011.",
                "count": 25,
                "papers": [
                    "Source address filtering in large scale network: a cooperative software mechanism design.",
                    "MALAWI: aggregated longitudinal analysis of the MAWI dataset.",
                    "The pattern of information diffusion in microblog.",
                    "An integrative multi-level analysis of internet path changes.",
                    "CANA: one step from IP networking toward content networking.",
                    "Green the power grid with stochastic network calculus.",
                    "Detecting DDoS attacks with Hadoop.",
                    "A Stackelberg game for spectrum investment and pricing in cooperative cognitive radio networks.",
                    "A viable upload acceleration service for mobile devices.",
                    "Distributed channel adaptation using instantaneous clusters in energy-constrained multi-hop wireless networks.",
                    "Interference-aware opportunistic relay selection.",
                    "Towards a scalable routing architecture for dynamic substrates.",
                    "Grainflow: a per-bit customizable scheme for data plane innovation on programmable hardware.",
                    "TCP-friendly rate control for non-TCP multipath flows.",
                    "Distinguishing collisions from low signal strength in static 802.11n wireless LANs.",
                    "Revisiting IP-to-AS mapping for AS-level traceroute.",
                    "Edge-Markovian dynamic graph based information dissemination model for mobile social networks.",
                    "Is your OpenFlow application correct?",
                    "Mesh slicing: improving robustness of a mesh network via multiple slices.",
                    "A step toward practical deployment of the content-centric networking architecture.",
                    "End-to-end quality of service in pseudo-wire networks.",
                    "Multi-rate aware partition and cooperation in WLANs.",
                    "Does one size fit all?: the impact of policy on multicast mechanism for future network.",
                    "In-network processing of the GPU-based real-time DXT compression.",
                    "Torii HLMAC: distributed, fault-tolerant, zero configuration data center architecture with multiple tree-based addressing and forwarding."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2011swid",
                "sub_name": "Proceedings of the Special Workshop on Internet and Disasters, SWID@CoNEXT 2011, Tokyo, Japan, December 6-9, 2011.",
                "count": 9,
                "papers": [
                    "Impact of Tohoku earthquake on R&E network in Japan.",
                    "The Japan earthquake: the impact on traffic and routing observed by a local ISP.",
                    "Tweet trend analysis in an emergency situation.",
                    "Distributed systems and natural disasters: BitTorrent as a global witness.",
                    "Disasters seen through Flickr cameras.",
                    "Electronic triage tag and opportunistic networks in disasters.",
                    "Twitter in disaster mode: security architecture.",
                    "Great east Japan earthquake viewed from a URL shortener.",
                    "How geeks responded to a catastrophic disaster of a high-tech country: rapid development of counter-disaster systems for the great east Japan earthquake of March 2011."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2011iotsp",
                "sub_name": "Proceedings of the workshop on Internet of Things and Service Platforms, IoTSP@CoNEXT 2011, Tokyo, Japan, December 6-9, 2011.",
                "count": 6,
                "papers": [
                    "Bridging UPnP and ZigBee with CoAP: protocol and its performance evaluation.",
                    "INOX: a managed service platform for inter-connected smart objects.",
                    "Identifying and verifying clock synchronization protocol parameters.",
                    "Opportunities and challenges of wireless sensor networks using cloud services.",
                    "An integration method for wireless location using mobile phone built-in sensors and TDOA landmarks.",
                    "On-demand numerosity reduction for object learning."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "6th CoNEXT 2010",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2010",
                "sub_name": "Proceedings of the 2010 ACM Conference on Emerging Networking Experiments and Technology, CoNEXT 2010, Philadelphia, PA, USA, November 30 - December 03, 2010.",
                "count": 28,
                "papers": [
                    "Verifiable network-performance measurements.",
                    "Profiling-By-Association: a resilient traffic profiling solution for the internet backbone.",
                    "Spatio-temporal patterns in network events.",
                    "Optimal content placement for a large-scale VoD system.",
                    "G-RCA: a generic root cause analysis platform for service quality management in large IP networks.",
                    "Declarative configuration management for complex and dynamic networks.",
                    "NEVERMIND, the problem is already fixed: proactively detecting and troubleshooting customer DSL problems.",
                    "MAWILab: combining diverse anomaly detectors for automated anomaly labeling and performance benchmarking.",
                    "Internet traffic classification demystified: on the sources of the discriminative power.",
                    "Balancing throughput, robustness, and in-order delivery in P2P VoD.",
                    "Is content publishing in BitTorrent altruistic or profit-driven?",
                    "Federation of virtualized infrastructures: sharing the value of diversity.",
                    "ICTCP: Incast Congestion Control for TCP in data center networks.",
                    "LEGUP: using heterogeneity to reduce the cost of data center network upgrades.",
                    "SecondNet: a data center network virtualization architecture with bandwidth guarantees.",
                    "A cost comparison of datacenter network architectures.",
                    "Personal data vaults: a locus of control for personal data streams.",
                    "Network-wide deployment of intrusion detection and prevention systems.",
                    "Strengthening forensic investigations of child pornography on P2P networks.",
                    "Scalable routing on flat names.",
                    "The Internet is flat: modeling the transition from a transit hierarchy to a peering mesh.",
                    "Inferring invisible traffic.",
                    "Enabling high-bandwidth vehicular content distribution.",
                    "Assessing the vulnerability of replicated network services.",
                    "Exploiting locality of interest in online social networks.",
                    "Mobile data offloading: how much can WiFi deliver?",
                    "Auto-configuration of 802.11n WLANs.",
                    "Simple yet efficient, transparent airtime allocation for TCP in wireless mesh networks."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2010sw",
                "sub_name": "Proceedings of the ACM CoNEXT Student Workshop, CoNEXT '10 Student Workshop, Philadelphia, Pennsylvania, USA, November 30, 2010.",
                "count": 24,
                "papers": [
                    "Towards characterization of wireless traffic in coexisting 802.11a/g and 802.11n network.",
                    "Towards hardware accelerated software routers.",
                    "Characterizing the file hosting service ecosystem.",
                    "Tracking of mobile devices through Bluetooth contacts.",
                    "Multipath transport protocol for heterogeneous multi-homing networks.",
                    "Reducing TIV interference in network coordinate systems.",
                    "Towards a nation-centric understanding of the internet.",
                    "Experience level agreements in wireless metropolitan area sharing networks.",
                    "Power scaling in network devices.",
                    "Robust traffic anomaly detection with principal component pursuit.",
                    "Inferring router statistics with IP timestamps.",
                    "Exploring potential vulnerabilities in data center network.",
                    "CommonCode: a code reuse platform for co-simulation and experimentation.",
                    "An interactive visualization framework for next generation networks.",
                    "A framework for nation-centric classification and observation of the internet.",
                    "Have your cake and eat it too!: enabling frequency diversity through opportunism.",
                    "Towards joint routing and spread-spectrum channelization in cognitive ad hoc networks.",
                    "Understanding the impact of internet exchange points on internet topology and routing performance.",
                    "On the interaction between ISP revenue sharing and network neutrality.",
                    "Spectrum handoff strategies for multiple channels cognitive radio network.",
                    "The peer-to-peer trace archive: design and comparative trace analysis.",
                    "Prefetching Bloom filters to control flooding in content-centric networks.",
                    "NetQuery: a knowledge plane for reasoning about network properties.",
                    "Understanding data-center driven content distribution."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2010rearch",
                "sub_name": "Proceedings of the Re-Architecting the Internet Workshop, ReARCH@CoNEXT 2010, Philadelphia, Pennsylvania, USA, November 30, 2010.",
                "count": 12,
                "papers": [
                    "Not paying the truck driver: differentiated pricing for the future internet.",
                    "Controlling the growth of internet routing tables through market mechanisms.",
                    "A mutualistic resource pooling architecture.",
                    "Investigating the deployment and adoption of re-ECN.",
                    "On content-centric router design and implications.",
                    "A routing architecture for scheduled dynamic circuit services.",
                    "Taming the triangle inequality violations with network coordinate system on real internet.",
                    "NAT traversal for LISP mobile node.",
                    "Application neutrality and a paradox of side payments.",
                    "Should specific values be embedded in the internet architecture?",
                    "The problem isn't attribution: it's multi-stage attacks.",
                    "Secure naming in information-centric networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "5th CoNEXT 2009",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2009",
                "sub_name": "Proceedings of the 2009 ACM Conference on Emerging Networking Experiments and Technology, CoNEXT 2009, Rome, Italy, December 1-4, 2009.",
                "count": 29,
                "papers": [
                    "Networking named content.",
                    "Virtually eliminating router bugs.",
                    "MDCube: a high performance network structure for modular data center interconnection.",
                    "Greening the internet with nano data centers.",
                    "SWARM: the power of structure in community wireless mesh networks.",
                    "Online optimization of 802.11 mesh networks.",
                    "EZ-Flow: removing turbulence in IEEE 802.11 wireless mesh networks without message passing.",
                    "The age of impatience: optimal replication schemes for opportunistic networks.",
                    "Feasibility of content dissemination between devices in moving vehicles.",
                    "Cool-Tether: energy efficient on-the-fly wifi hot-spots using mobile phones.",
                    "Content availability and bundling in swarming systems.",
                    "FairTorrent: bringing fairness to peer-to-peer systems.",
                    "Scaling all-pairs overlay routing.",
                    "StarClique: guaranteeing user privacy in social networks against intersection attacks.",
                    "Lockr: better privacy for social networks.",
                    "ARES: an anti-jamming reinforcement system for 802.11 networks.",
                    "ThunderDome: discovering upload constraints using decentralized bandwidth tournaments.",
                    "A minimum-delay-difference method for mitigating cross-traffic impact on capacity measurement.",
                    "Where the sidewalk ends: extending the internet as graph using traceroutes from P2P users.",
                    "Macroscope: end-point approach to networked application dependency discovery.",
                    "Exploiting dynamicity in graph-based traffic analysis: techniques and applications.",
                    "RFDump: an architecture for monitoring the wireless ether.",
                    "Traffic management and resource allocation in small wired/wireless networks.",
                    "PACMAN: a platform for automated and controlled network operations and configuration management.",
                    "Detecting network neutrality violations with causal inference.",
                    "SafeGuard: safe forwarding during route changes.",
                    "BUFFALO: bloom filter forwarding architecture for large organizations.",
                    "Improving internet-wide routing protocols convergence with MRPC timers.",
                    "On effectively exploiting multiple wireless interfaces in mobile hosts."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2009sw",
                "sub_name": "Proceedings of the 5th international student workshop on Emerging networking experiments and technologies, Co-Next Student Workshop '09, Rome, Italy, December 1, 2009.",
                "count": 29,
                "papers": [
                    "Scalable landmark flooding: a scalable routing protocol for WSNs.",
                    "An adaptive three-party accounting protocol.",
                    "On the characterization of multi-channel applications.",
                    "Deep diving into BitTorrent locality.",
                    "Deterministic, reduced-visibility inter-domain forwarding.",
                    "A spectrum assignment method based on genetic algorithm in WiMAX/WiFi integrated network.",
                    "What can P2P do for traffic control in P2P networks?",
                    "Towards systematic traffic annotation.",
                    "Improving roamer retention by exposing weak locations in GSM networks.",
                    "An a priori estimator for the delay distribution in global hybrid multicast.",
                    "What level of estimating accuracy does TCP need and can TCP achieve.",
                    "Netflow based system for NAT detection.",
                    "A robust pair-wise rekeying protocol in hierarchical wireless sensor networks.",
                    "Random key pre-distribution with transitory master key for wireless sensor networks.",
                    "Investigating the relationship between QoS and QoE in a mixed desktop/handheld gaming setting.",
                    "Self-propagating worms in wireless sensor networks.",
                    "Is it me?: understanding the impact of the home network on end-to-end measurements.",
                    "Maximizing streaming quality in heterogeneous overlays through incentives.",
                    "Secure interference reporting for dense Wi-Fi deployments.",
                    "LT network codes: low complexity network codes.",
                    "Adding emulation to planetlab nodes.",
                    "Bloom filters and overlays for routing in pocket switched networks.",
                    "Peer the peers: an overlay id assignment service at internet exchange points.",
                    "Practical DHT-based location service for wireless mesh networks.",
                    "Relative delay estimator for multipath transport.",
                    "When stochastic rate-delay services meet stochastic network calculus.",
                    "On the utility of rate adaptation for broadcast/multicast media traffic in 802.11 networks.",
                    "Reliable asymmetric path capacity measurement.",
                    "Behavior rule based intrusion detection."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2009unet",
                "sub_name": "Proceedings of the 1st ACM workshop on User-provided networking: challenges and opportunities, U-NET@CoNEXT 2009, Rome, Italy, December 1, 2009.",
                "count": 8,
                "papers": [
                    "On incentives in global wireless communities.",
                    "Enhanced wireless roaming security using three-party authentication and tunnels.",
                    "SimBetAge: utilizing temporal changes in social networks for pocket switched networks.",
                    "Reconciling community resource requirements in U-Nets.",
                    "A system for peer-to-peer video streaming in resource constrained mobile environments.",
                    "Cloud computing for the masses.",
                    "GridDL: an HTTP bandwidth sharing framework.",
                    "User-provided networking: challenges and opportunities."
                ]
            },
            {
                "sub_name_abbr": "conf/conext/2009rearch",
                "sub_name": "Proceedings of the 2009 workshop on Re-architecting the internet, ReArch@CoNEXT 2009, Rome, Italy, December 1, 2009.",
                "count": 13,
                "papers": [
                    "VoCCN: voice-over content-centric networks.",
                    "Securing web content.",
                    "Classifying network complexity.",
                    "IP version 10.0: a strawman design beyond IPv6.",
                    "Discrimination, liberty, and innovation: some thoughts on the invariable trade-offs of normative purposes and technical means in the internet.",
                    "mPlane: an architecture for scalable fault localization.",
                    "NetServ: dynamically deploying in-network services.",
                    "HAIR: hierarchical architecture for internet routing.",
                    "Understanding incentives for prefix aggregation in BGP.",
                    "LANES: an inter-domain data-oriented routing architecture.",
                    "Co-design patterns for embedded network management.",
                    "An architecture for network management.",
                    "Shared versus separate networks: the impact of reprovisioning."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "4th CoNEXT 2008",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2008",
                "sub_name": "Proceedings of the 2008 ACM Conference on Emerging Network Experiment and Technology, CoNEXT 2008, Madrid, Spain, December 9-12, 2008.",
                "count": 77,
                "papers": [
                    "Is there life in Second Life?",
                    "Troubleshooting chronic conditions in large IP networks.",
                    "Packet doppler: network monitoring using packet shift detection.",
                    "Online estimation of RF interference.",
                    "MOSAIC: unified declarative platform for dynamic overlay composition.",
                    "EGOIST: overlay routing using selfish neighbor selection.",
                    "On cooperative settlement between content, transit and eyeball internet service providers.",
                    "On the scalability of BGP: the roles of topology growth and update rate-limiting.",
                    "Instability free routing: beyond one protocol instance.",
                    "Balancing performance, robustness and flexibility in routing systems.",
                    "Internet traffic classification demystified: myths, caveats, and the best practices.",
                    "Observing slow crustal movement in residential user traffic.",
                    "Capacity estimation of ADSL links.",
                    "A priority-layered approach to transport for high bandwidth-delay product networks.",
                    "DaVinci: dynamically adaptive virtual networks for a customized internet.",
                    "Implementation of end-to-end abstractions in a network service architecture.",
                    "Peer-assisted content distribution with prices.",
                    "Uplink allocation beyond choke/unchoke: or how to divide and conquer best.",
                    "Maintaining replicas in unstructured P2P systems.",
                    "Towards high performance virtual routers on commodity hardware.",
                    "Efficient IP-address lookup with a shared forwarding table for multiple virtual routers.",
                    "Towards systematic design of enterprise networks.",
                    "ALPHA: an adaptive and lightweight protocol for hop-by-hop authentication.",
                    "Packet-dropping adversary identification for data plane security.",
                    "Extending finite automata to efficiently match Perl-compatible regular expressions.",
                    "Quality of monitoring of stochastic events by periodic & proportional-share scheduling of sensor coverage.",
                    "Improving the performance of multi-hop wireless networks using frame aggregation and broadcast for TCP ACKs.",
                    "TDM MAC protocol design and implementation for wireless mesh networks.",
                    "Opportunistic use of client repeaters to improve performance of WLANs.",
                    "Distributed event delivery model for collaborative virtual simulations.",
                    "Nonlinear modeling of the internet delay structure.",
                    "TCP improvement in multi-radio multi-channel multi-hop networks.",
                    "A probabilistic model of k-coverage in minimum cost wireless sensor networks.",
                    "High-throughput, reliable multicast without \"crying babies\" in wireless mesh networks.",
                    "Social DTN routing.",
                    "Inter-domain routing using topology information.",
                    "Adapting TFRC to mobile networks with frequent disconnections.",
                    "Distributed detection of large-scale attacks in the internet.",
                    "Power-law chord architecture in P2P overlays.",
                    "OnMove: a protocol for content distribution in wireless delay tolerant networks based on social information.",
                    "High performance traffic shaping for DDoS mitigation.",
                    "Overlay routing using coordinate systems.",
                    "Voronoi models for distributed virtual environments.",
                    "Toward low cost and highly reliable sensor networks deployment.",
                    "A security plane for publish/subscribe based content oriented networks.",
                    "Advantages of a PCE-based control plane for LISP.",
                    "Experimental approach to adaptive carrier sensing in IEEE 802.15.4 wireless networks.",
                    "Auto-protection of 802.11 networks from TCP ACK division.",
                    "Supporting delay-intolerant applications.",
                    "Distinguishing persistent failures from transient losses.",
                    "Detection and mitigation of abnormal traffic behaviour in autonomic networked environments.",
                    "ConnectionWatch: passive monitoring of round-trip times at end-hosts.",
                    "Distributed scheduling in large scale monitoring infrastructures.",
                    "Internet Sibilla: utilizing DNS for delay estimation service.",
                    "Achieving high-bandwidth peer-to-peer file distribution.",
                    "Waiting-line auction for WiFi pricing.",
                    "Exploiting multi-flow diversity for mitigating intra-flow interference in wireless mesh networks.",
                    "On seamless connectivity over multi-radio and multi-channel wireless mesh networks.",
                    "Understanding the characteristics of online commenting.",
                    "Recursive temporal namespaces.",
                    "LISP-DHT: towards a DHT to map identifiers onto locators.",
                    "Incentive-compatible caching and peering in data-oriented networks.",
                    "Flexible arrays of inexpensive network (FAIN): toward global parallelism in the internet to satisfy future traffic growth.",
                    "Cabernet: connectivity architecture for better network services.",
                    "Towards a new generation of information-oriented internetworking architectures.",
                    "Design considerations for a network of information.",
                    "Networking is IPC: a guiding principle to a better internet.",
                    "Reliable interdomain routing through multiple complementary routing processes.",
                    "Path brokering for end-host path selection: toward a path-centric billing method for a multipath internet.",
                    "MINT: a Market for INternet Transit.",
                    "Policing freedom to use the internet resource pool.",
                    "Trellis: a platform for building flexible, fast virtual networks on commodity hardware.",
                    "CoreLab: an emerging network testbed employing hosted virtual machine monitor.",
                    "Providing UMTS connectivity to PlanetLab nodes.",
                    "ISP-friendly peer matching without ISP collaboration.",
                    "AS alliance: cooperatively improving resilience of intra-alliance communication.",
                    "Distributed content delivery using load-aware network coordinates."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "3rd CoNEXT 2007",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2007",
                "sub_name": "Proceedings of the 2007 ACM Conference on Emerging Network Experiment and Technology, CoNEXT 2007, New York, NY, USA, December 10-13, 2007.",
                "count": 78,
                "papers": [
                    "A hybrid finite automaton for practical deep packet inspection.",
                    "Detecting worm variants using machine learning.",
                    "Practical defenses against BGP prefix hijacking.",
                    "Identifying dynamic IP address blocks serendipitously through background scanning traffic.",
                    "Modeling the adoption of new network architectures.",
                    "Internet economics: the use of Shapley value for ISP settlement.",
                    "On the cost of caching locator/ID mappings.",
                    "ER: efficient retransmission scheme for wireless LANs.",
                    "Near-optimal co-ordinated coding in wireless multihop networks.",
                    "Multipath code casting for wireless mesh networks.",
                    "Multipath live streaming via TCP: scheme, performance and benefits.",
                    "The diameter of opportunistic mobile networks.",
                    "Fair and efficient scheduling in data ferrying networks.",
                    "Otiy: locators tracking nodes.",
                    "Router buffer sizing revisited: the role of the output/input capacity ratio.",
                    "Improving service differentiation in IP networks through dual topology routing.",
                    "Rethinking internet traffic management: from multiple decompositions to a practical protocol.",
                    "NetDiagnoser: troubleshooting network unreachabilities using end-to-end probes and routing data.",
                    "Joint MAC-aware routing and load balancing in mesh networks.",
                    "Scalable real-time gateway assignment in mobile mesh networks.",
                    "Practical service provisioning for wireless meshes.",
                    "An energy-conscious transport protocol for multi-hop wireless networks.",
                    "Backpressure multicast congestion control in mobile ad-hoc networks.",
                    "Experience with an implementation of the Idle Sense wireless access method.",
                    "Internet routing resilience to failures: analysis and implications.",
                    "On improving the efficiency and manageability of NotVia.",
                    "Proactive replication in distributed storage systems using machine availability estimation.",
                    "Building a reliable P2P system out of unreliable P2P clients: the case of KAD.",
                    "Promoting fluidity in the flow of packets of 802.11 wireless mesh networks.",
                    "Fairness enhancement in wireless mesh networks.",
                    "Towards the realization of a mobile grid.",
                    "Do you know what you are generating?",
                    "The BlueGame project: ad-hoc multilayer mobile game with social dimension.",
                    "Reproducing opportunistic connectivity traces using connectivity models.",
                    "An AS-level IP traceback system.",
                    "BonSwing: A GUI framework for ad-hoc applications using service discovery.",
                    "A quicker way to discover nearby peers.",
                    "Molecular architecture for autonomic wireless mesh networks.",
                    "Measuring P2P IPTV traffic on both sides of the world.",
                    "Replacing channel scanning with multiple authentication for fast handoff in IEEE 802.11 wireless networks.",
                    "Automating the iBGP organization in large IP networks.",
                    "Can active tracking of inroamer location optimise a live GSM network?",
                    "Towards next generation network requirements for next generation gaming.",
                    "Multiplexing BGP sessions with BGP-Mux.",
                    "Implementation and preliminary evaluation of an ISP-driven informed path selection.",
                    "Resource-efficient software delivery using volunteer assistance.",
                    "Can we reduce Wi-Fi energy consumption during VoIP calls?",
                    "Probabilistic inference of lossy links using end-to-end data in sensor networks.",
                    "Folksonomy-based reasoning in opportunistic networks.",
                    "Capture-aware staggering for concurrent transmissions.",
                    "Extending web browsers architectures to support HTTP session mobility.",
                    "Securing BGP incrementally.",
                    "SWARM: self-organization of community wireless mesh networks.",
                    "Fairer TCP-friendly congestion control protocol for multimedia streaming applications.",
                    "A secure role-based address allocation and distribution mechanism.",
                    "Characterizing quality of content distribution from YouTube like portals.",
                    "Towards a clustering based data diffusion protocol in delay tolerant networks.",
                    "Origin of route explosion in virtual private networks.",
                    "Characterizing network events and their impact on routing.",
                    "A gateway for wireless broadcasting.",
                    "A next generation internet architecture for mobility and multi-homing support.",
                    "A novel approach for creating trust to reduce malicious behavior in MANET.",
                    "Daily walks in Paris: a practical analysis of wi-fi access points.",
                    "Exploring the routing complexity of mobile multicast: a semi-empirical study.",
                    "Experimenting with real-life opportunistic communications using windows mobile devices.",
                    "A networked virtual environment over KAD.",
                    "Identifying statistically anomalous regions in time series of network traffic.",
                    "Bootstrapping large-scale DHT networks.",
                    "Is your IP address prefix well-served by internet routing?",
                    "Energy-efficient MAC and routing design in distributed beamforming sensor networks.",
                    "Robust routing in networks with time-varying links.",
                    "A cross-layer load-independent link cost metric for wireless mesh networks.",
                    "Enabling seamless internet mobility.",
                    "mod_kaPoW: mitigating DoS with transparent proof-of-work.",
                    "Application and desktop sharing.",
                    "Enabling session initiation in the presence of middleboxes.",
                    "A next generation internet state management framework.",
                    "Understanding the effect of P2P overlay on the AS-level underlay."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "2nd CoNEXT 2006",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2006",
                "sub_name": "Proceedings of the 2006 ACM Conference on Emerging Network Experiment and Technology, CoNEXT 2006, Lisboa, Portugal, December 4-7, 2006.",
                "count": 59,
                "papers": [
                    "REPLEX: dynamic traffic engineering based on wardrop routing policies.",
                    "Using forgetful routing to control BGP table size.",
                    "Maximizing transfer opportunities in bluetooth DTNs.",
                    "Dynamic names and private address maps: complete self-configuration for MANETs.",
                    "Reformulating the monitor placement problem: optimal network-wide sampling.",
                    "Early application identification.",
                    "Processing top k queries from samples.",
                    "Optimal design of high density 802.11 WLANs.",
                    "SMARTA: a self-managing architecture for thin access points.",
                    "Migrating home agents towards internet-scale mobility deployments.",
                    "Secure sensor network routing: a clean-slate approach.",
                    "Virtual networks under attack: disrupting internet coordinate systems.",
                    "Retouched bloom filters: allowing networked applications to trade off selected false positives against false negatives.",
                    "Modeling ping times in first person shooter games.",
                    "A study of end-to-end web access failures.",
                    "Modeling the AIADD paradigm in networks with variable delays.",
                    "Shortcuts in a virtual world.",
                    "Compositional control of IP media.",
                    "Stealth distributed hash table: a robust and flexible super-peered DHT.",
                    "HSDPA delivering MBMS video streaming.",
                    "Towards a versatile transport protocol.",
                    "Reconciling zero-conf with efficiency in enterprises.",
                    "An alternative QoS architecture for the IEEE 802.16 standard.",
                    "Resisting against aggregator compromises in sensor networks.",
                    "Performance assessment of a distributed real-time control system utilizing RDM and RDM+ protocols for communication.",
                    "Neighbor discovery analysis in wireless sensor networks.",
                    "Mobile agents based framework for routing and congestion control in mobile ad hoc networks.",
                    "Autonomic policy-based management using web services.",
                    "SNARE: sensor node attached reputation evaluator.",
                    "Non-repudiation mechanisms for peer-to-peer networks: enabling technology for peer-to-peer economic markets.",
                    "Wireless alternative best effort service: a case study of ALM.",
                    "Anomaly detection by finding feature distribution outliers.",
                    "Inferring groups of correlated failures.",
                    "How small labels create big improvements.",
                    "Quality of service routing in peer-to-peer overlays.",
                    "Learning for accurate classification of real-time traffic.",
                    "Eliminating channel scanning phase in handoff across IEEE 802.11 wireless LANs.",
                    "A comparison of token-bucket based multi-color marking techniques.",
                    "Multiple-path layer-2 based routing and load balancing approach for wireless infrastructure mesh networks.",
                    "Network coding with traffic engineering.",
                    "Synergy: blending heterogeneous measurement elements for effective network monitoring.",
                    "Correlation-based data dissemination in traffic monitoring sensor networks.",
                    "Searching for invariants in network games traffic.",
                    "On the benefits of synchronized playout in peer-to-peer streaming.",
                    "P2P IPTV measurement: a case study of TVants.",
                    "Experience-based network resource usage on mobile hosts.",
                    "Are 802.11 link quality broadcast measurements always reliable?",
                    "Pricing residential broadband internet.",
                    "Exhaustive path tracing with Paris traceroute.",
                    "Proposition of a cross-layer architecture model for the support of QoS in ad-hoc networks.",
                    "A WSN platform to support middleware development.",
                    "Dynamic service discovery and composition for ubiquitous networks applications.",
                    "Towards SLA and location-based nomadism management.",
                    "Failure diagnosis with incomplete information in cable networks.",
                    "TinySA: a security architecture for wireless sensor networks.",
                    "A modular RCP for flexible interdomain route control.",
                    "Understanding the behavior of TCP for real-time CBR workloads.",
                    "Investigating the user mobility in wireless mobile networks through real measurements.",
                    "Detail characterization of paths in pocket switched networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "1st CoNEXT 2005",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/conext/2005",
                "sub_name": "Proceedings of the 2005 ACM Conference on Emerging Network Experiment and Technology, CoNEXT 2005, Toulouse, France, October 24-27, 2005.",
                "count": 63,
                "papers": [
                    "Trajectory knowledge for improving topology control in mobile ad-hoc networks.",
                    "Entropy-based knowledge spreading and application to mobility prediction.",
                    "MRS: a simple cross-layer heuristic to improve throughput capacity in wireless mesh networks.",
                    "Achieving sub-50 milliseconds recovery upon BGP peering link failures.",
                    "Path key establishment using multiple secured paths in wireless sensor networks.",
                    "Controlling the effects of anomalous ARP behaviour on ethernet networks.",
                    "Implementation and performance measurements of a delay-bounded HPD algorithm in an ALTQ-based router.",
                    "Optimal positioning of active and passive monitoring devices.",
                    "Practical delay monitoring for ISPs.",
                    "TIE breaking: tunable interdomain egress selection.",
                    "The stability of paths in a dynamic network.",
                    "From relative to observable proportional differentiation in OBS networks.",
                    "Location based placement of whole distributed systems.",
                    "Monetary incentive with reputation for virtual market-place based P2P.",
                    "A new strategy for bidding in the network-wide progressive second price auction for bandwidth.",
                    "Dynamic adaptation of source specific distribution trees for multiparty teleconferencing.",
                    "Impacts of packet scheduling and packet loss distribution on FEC Performances: observations and recommendations.",
                    "Hybrid reliable multicast with TCP-XM.",
                    "Ranking flows from sampled traffic.",
                    "Root cause analysis for long-lived TCP connections.",
                    "Bottleneck detection in UMTS via TCP passive monitoring: a real case.",
                    "Security as a quality of service routing problem.",
                    "Comparing traffic engineering objective functions.",
                    "On Faster and fair lookup operation in content-addressable networks.",
                    "A comment on simulating LRD traffic with pareto ON/OFF sources.",
                    "Stealth distributed hash table: unleashing the real potential of peer-to-peer.",
                    "IPSense: multi-paradigm routing for wireless sensor network.",
                    "Differentiated quality of service scheme based on the use of multi-classes of ant-like mobile agents.",
                    "Increasing the determinism of network emulation to evaluate communication protocols.",
                    "Original Broadcasting Technique in Radio Networks.",
                    "The consistent web: a vision for the future.",
                    "Network middleware for large scale mobile and pervasive augmented reality games.",
                    "An evaluation of IP-based fast reroute techniques.",
                    "SFG: smart flooding by gossiping.",
                    "Janus: an architecture for flexible access to sensor networks.",
                    "Scheduling of TCP sessions in SIP over MPLS based network.",
                    "Building media overlay service paths.",
                    "Forwarding deflection in multi-area OSPF.",
                    "Modeling, simulation, and emulation of QoS oriented transport mechanisms.",
                    "On the application of dead-reckoning to position-based routing for vehicular highway scenarios.",
                    "Hierarchical architecture for managed wireless networks.",
                    "Fully polynomial approximation for survivable flow allocation with max-min fairness.",
                    "Improving mobile IP handover latency on end-to-end TCP in UMTS/WCDMA networks.",
                    "Real-time communication over switched ethernet for military applications.",
                    "Scalability issue for QoS routing algorithm with stochastic partitioning.",
                    "Adaptive layer design for video multimedia services in a mobile environment.",
                    "Experimental study of DCCP for multimedia applications.",
                    "Using virtual coordinates in the establishment of inter-domain LSPs.",
                    "Ongoing efforts on performance comparison of mobile routers.",
                    "Topology generation based on network design heuristics.",
                    "Discovering alternate internet paths to enhance end-to-end quality of service.",
                    "UML-based modeling and formal verification of security protocols.",
                    "Performance evaluation of packet capturing systems for high-speed networks.",
                    "Outage probability of cellular radio systems using MRC in spherically invariant environment.",
                    "DDC: a dynamic and distributed clustering algorithm for networked virtual environments based on P2P networks.",
                    "Dynamic load balancing for position-based routing.",
                    "Towards potential-based clustering for wireless sensor networks.",
                    "A column generation approach for IGP weight setting problem.",
                    "Triggering wireless network flashes.",
                    "Comparison of IBGP topologies.",
                    "Positioning mobile base station to prolong wireless sensor network lifetime.",
                    "Multi-hop wireless sensor networks with mobile sink.",
                    "Mechanism design for message relaying in P2P."
                ]
            }
        ]
    }
]