[
    {
        "year": "2021",
        "name": "29th ICNP 2021",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2021",
                "sub_name": "29th IEEE International Conference on Network Protocols, ICNP 2021, Dallas, TX, USA, November 1-5, 2021.",
                "count": 74,
                "papers": [
                    "End-to-End Privacy for Identity & Location with IP.",
                    "Poster: EasyTrans: Enable Fast Iteration of Transport Protocol.",
                    "pMACH: Power and Migration Aware Container scHeduling.",
                    "Antelope: A Framework for Dynamic Selection of Congestion Control Algorithms.",
                    "STIP: A new model of trusted network.",
                    "ATRIA: Autonomous Traffic-Aware Scheduling for Industrial Wireless Sensor-Actuator Networks.",
                    "Detecting Network Attacks using Federated Learning for IoT Devices.",
                    "Resource Allocation in Vehicular Networks with Multi-UAV Served Edge Computing.",
                    "Generative Ensemble Learning for Mitigating Adversarial Malware Detection in IoT.",
                    "Federated Traffic Engineering with Supervised Learning in Multi-region Networks.",
                    "OrbitCast: Exploiting Mega-Constellations for Low-Latency Earth Observation.",
                    "Poster: Private Internet: A Global End-to-End Service Model.",
                    "Hopping on Spectrum: Measuring and Boosting a Large-scale Dual-band Wireless Network.",
                    "R-AQM: Reverse ACK Active Queue Management in Multi-tenant Data Centers.",
                    "Chimera: exploiting UAS flight path information to optimize heterogeneous data transmission.",
                    "CELL: Counter Estimation for Per-flow Traffic in Streams and Sliding Windows.",
                    "OBF: A Guaranteed IP Lookup Performance Scheme for Flexible IP Using One Bloom Filter.",
                    "Reducing Block Propagation Delay in Blockchain Networks via Guarantee Verification.",
                    "Real-time Video Transmission Optimization Based on Edge Computing in IIoT.",
                    "Loom: Switch-based Cloud Load Balancer with Compressed States.",
                    "Advertising DNS Protocol Use to Mitigate DDoS Attacks.",
                    "Is Machine Learning Ready for Traffic Engineering Optimization?",
                    "Demo: SkyRoute, a Fast and Realistic UAV Cellular Simulation Framework.",
                    "Constraint-Aware Deep Reinforcement Learning for End-to-End Resource Orchestration in Mobile Networks.",
                    "StaR: Breaking the Scalability Limit for RDMA.",
                    "Partial Symbol Recovery for Interference Resilience in Low-Power Wide Area Networks.",
                    "Generalizable and Interpretable Deep Learning for Network Congestion Prediction.",
                    "Receiver-Driven RDMA Congestion Control by Differentiating Congestion Types in Datacenter Networks.",
                    "Poster : Loading Programmable Data Plane Programs to Virtual Plane.",
                    "SketchINT: Empowering INT with TowerSketch for Per-flow Per-switch Measurement.",
                    "Cooperative Connected Smart Road Infrastructure and Autonomous Vehicles for Safe Driving.",
                    "Poster: Enabling Fast Forwarding in Hybrid Software-Defined Networks.",
                    "PIPO: Efficient Programmable Scheduling for Time Sensitive Networking.",
                    "Poster: DSME-LoRa - A Flexible MAC for LoRa.",
                    "NetFC: Enabling Accurate Floating-point Arithmetic on Programmable Switches.",
                    "Poster: Data Collection for ML Classification of Encrypted Messaging Applications.",
                    "The Trapezoidal Sketch for Frequency Estimation in Network Flow.",
                    "Cooperatively Constructing Cost-Effective Content Distribution Networks upon Emerging Low Earth Orbit Satellites and Clouds.",
                    "DNSonChain: Delegating Privacy-Preserved DNS Resolution to Blockchain.",
                    "RIOT-AKA: cellular-like authentication over IoT devices.",
                    "PEP-DNA: A Performance Enhancing Proxy for Deploying Network Architectures.",
                    "Loss-freedom, Order-preservation and No-buffering: Pick Any Two During Flow Migration in Network Functions.",
                    "Long-distance Deterministic Transmission among TSN Networks: Converging CQF and DIP.",
                    "Learned FIB: Fast IP Forwarding without Longest Prefix Matching.",
                    "ISP Self-Operated BGP Anomaly Detection Based on Weakly Supervised Learning.",
                    "Achieving Deterministic Service in Mobile Edge Computing (MEC) Networks.",
                    "Poster: Connected Vehicles using Short-range (Wi-Fi & IEEE 802.11p) and Long-range Cellular Networks (LTE & 5G).",
                    "MRPGA: A Genetic-Algorithm-based In-network Caching for Information-Centric Networking.",
                    "Poster: Reverse-Path Congestion Notification: Accelerating the Congestion Control Feedback Loop.",
                    "Multi-tier Collaborative Deep Reinforcement Learning for Non-terrestrial Network Empowered Vehicular Connections.",
                    "DeltaINT: Toward General In-band Network Telemetry with Extremely Low Bandwidth Overhead.",
                    "Poster: Accelerate Cross-Device Federated Learning With Semi-Reliable Model Multicast Over The Air.",
                    "MagicTCAM: A Multiple-TCAM Scheme for Fast TCAM Update.",
                    "A Blockchain-based Trusted Testing System of Electric Power Materials.",
                    "Recycling Wasted Energy for Mobile Charging.",
                    "Digital Twin Based Trajectory Prediction for Platoons of Connected Intelligent Vehicles.",
                    "Deadline-Aware Transmission Control for Real-Time Video Streaming.",
                    "HLS: A Packet Scheduler for Hierarchical Fairness.",
                    "Demo: Simple Deep Packet Inspection with P4.",
                    "Virtual Filter for Non-duplicate Sampling.",
                    "The integration of UAVs to the C-ITS Stack.",
                    "TROD: Evolving From Electrical Data Center to Optical Data Center.",
                    "DEMO: FLARE: Federated Active Learning Assisted by Naming for Responding to Emergencies.",
                    "ISRaft Consensus Algorithm for Autonomous Units.",
                    "RPO: Receiver-driven Transport Protocol Using Opportunistic Transmission in Data Center.",
                    "A Fast-adaptive Edge Resource Allocation Strategy for Dynamic Vehicular Networks.",
                    "Exploiting WiFi AP for Simultaneous Data Dissemination among WiFi and ZigBee Devices.",
                    "Speeding Up TCP with Selective Loss Prevention.",
                    "Reconfiguring Cell Selection in 4G/5G Networks.",
                    "AlignTrack: Push the Limit of LoRa Collision Decoding.",
                    "DOVE: Diagnosis-driven SLO Violation Detection.",
                    "MPLibra: Complementing the Benefits of Classic and Learning-based Multipath Congestion Control.",
                    "FlashPass: Proactive Congestion Control for Shallow-buffered WAN.",
                    "Highway On-Ramp Merging for Mixed Traffic: Recent Advances and Future Trends."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th ICNP 2020",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2020",
                "sub_name": "28th IEEE International Conference on Network Protocols, ICNP 2020, Madrid, Spain, October 13-16, 2020.",
                "count": 62,
                "papers": [
                    "Poster: An Experimental Study of Multi-RAT Systems.",
                    "Poster: Speeding Up Network Intrusion Detection.",
                    "Poster: Network-Centric Approach Using Task Migration for Drive-by-Wire Vehicle Resilience.",
                    "Lumos: Improving Smart Home IoT Visibility and Interoperability Through Analyzing Mobile Apps.",
                    "Misconfiguration Checking for SDN: Data Structure, Theory and Algorithms.",
                    "Adaptive Addresses for Next Generation IP Protocol in Hierarchical Networks.",
                    "SCIONLAB: A Next-Generation Internet Testbed.",
                    "Automated Saturation Mitigation Controlled by Deep Reinforcement Learning.",
                    "StarPerf: Characterizing Network Performance for Emerging Mega-Constellations.",
                    "TurboNet: Faithfully Emulating Networks with Programmable Switches.",
                    "Poster: Application-Aware Load Migration Protocols for Network Controllers.",
                    "CSIscan: Learning CSI for Efficient Access Point Discovery in Dense WiFi Networks.",
                    "Machine Learning at the Edge: Efficient Utilization of Limited CPU/GPU Resources by Multiplexing.",
                    "Optimized Joint Unicast-Multicast Panoramic Video Streaming in Cellular Networks.",
                    "XFi: Cross-technology IoT Data Collection via Commodity WiFi.",
                    "CloakLoRa: A Covert Channel over LoRa PHY.",
                    "Poster: Prototype of Configurable Redfish Query Proxy Module.",
                    "LB-SciFi: Online Learning-Based Channel Feedback for MU-MIMO in Wireless LANs.",
                    "Preventing Route Leaks using a Decentralized Approach: An Experimental Evaluation.",
                    "MoGAN: GAN based Next PoA Selection for Proactive Mobility Management.",
                    "Poster: Securing IoT Through Coverage-Bounding Wireless Communication With Visible Light.",
                    "CoNICE: Consensus in Intermittently-Connected Environments by Exploiting Naming with Application to Emergency Response.",
                    "Time-efficient Range Detection in Commodity RFID Systems.",
                    "Poster: Enhancing Remote Healthiness Attestation for Constrained IoT Devices.",
                    "6Fit-A-Part: A Protocol for Physical Distancing on a Custom Wearable Device.",
                    "Long-Lived LoRa: Prolonging the Lifetime of a LoRa Network.",
                    "Geosynchronous Network Grid Addressing for Integrated Space-Terrestrial Networks.",
                    "A Constrained Reinforcement Learning Based Approach for Network Slicing.",
                    "POSTER: Accelerating Encrypted Data Stores Using Programmable Switches.",
                    "A Case for Temperature-Aware Scheduler for Millimeter-Wave Devices and Networks.",
                    "Online Cooperative Resource Allocation at the Edge: A Privacy-Preserving Approach.",
                    "Runtime Control of LoRa Spreading Factor for Campus Shuttle Monitoring.",
                    "SPEED: Resource-Efficient and High-Performance Deployment for Data Plane Programs.",
                    "Invited Paper: Perishable Data in Smart Communities.",
                    "Poster: Maintaining Training Efficiency and Accuracy for Edge-assisted Online Federated Learning with ABS.",
                    "Poster: Feasibility of Malware Traffic Analysis through TLS-Encrypted Flow Visualization.",
                    "Demo: A Blockchain Based Protocol for Federated Learning.",
                    "Demo: Visualization of Stability Monitoring for Node Selection.",
                    "A Semi-supervised Stacked Autoencoder Approach for Network Traffic Classification.",
                    "Fair Initial Access Design for mmWave Wireless.",
                    "High Speed Route Lookup for Variable-Length IP Address.",
                    "Search-tree Based SDN Candidate Selection in Hybrid IP/SDN Network.",
                    "Cooperative Network-wide Flow Selection.",
                    "RainbowRow: Fast Optical Camera Communication.",
                    "SCLoRa: Leveraging Multi-Dimensionality in Decoding Collided LoRa Transmissions.",
                    "AdapLoRa: Resource Adaptation for Maximizing Network Lifetime in LoRa networks.",
                    "Trading off Charging and Sensing for Stochastic Events Monitoring in WRSNs.",
                    "Poster: Novel Opportunities in Design of Efficient Deep Packet Inspection Engines.",
                    "Poster: Fast Scheduling for Load Migration in Distributed Network Controllers.",
                    "RACK for SCTP.",
                    "Context-Aware Clustering for SDN Enabled Network.",
                    "Real-World ADS-B signal recognition based on Radio Frequency Fingerprinting.",
                    "P4air: Increasing Fairness among Competing Congestion Control Algorithms.",
                    "Legilimens: An Agile Transport for Background Traffic in Cellular Networks.",
                    "The Impact of the Physical Layer on the Performance of Concurrent Transmissions.",
                    "Oktopus: Service Chaining for Multicast Traffic.",
                    "A Blind CSI Prediction Method Based on Deep Learning for V2I Millimeter-Wave Channel.",
                    "HOLNET: A Holistic Traffic Control Framework for Datacenter Networks.",
                    "Anomalous Model-Driven-Telemetry Network-Stream BGP Detection.",
                    "A Multi-agent Reinforcement Learning Perspective on Distributed Traffic Engineering.",
                    "ApproSync: Approximate State Synchronization for Programmable Networks.",
                    "Martini: Bridging the Gap between Network Measurement and Control Using Switching ASICs."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th ICNP 2019",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2019",
                "sub_name": "27th IEEE International Conference on Network Protocols, ICNP 2019, Chicago, IL, USA, October 8-10, 2019.",
                "count": 81,
                "papers": [
                    "Multipathing Traffic to Reduce Entry Node Exposure in Onion Routing.",
                    "Unison: Enabling Content Provider/ISP Collaboration using a vSwitch Abstraction.",
                    "Tailoring Onion Routing to the Internet of Things: Security and Privacy in Untrusted Environments.",
                    "MACS: Deep Reinforcement Learning based SDN Controller Synchronization Policy Design.",
                    "A Light-weight Trust Mechanism for Cloud-Edge Collaboration Framework.",
                    "mLoRa: A Multi-Packet Reception Protocol in LoRa networks.",
                    "Re-Architecting the Packet Core and Control Plane for Future Cellular Networks.",
                    "Congestion Control for Cross-Datacenter Networks.",
                    "Rethinking Encrypted Traffic Classification: A Multi-Attribute Associated Fingerprint Approach.",
                    "BeaconRider: Opportunistic Sharing of Beacon Air-Time in Densely Deployed WLANs.",
                    "Migration Scheduling in Distributed SDN Controllers.",
                    "Robust Distributed Monitoring of Traffic Flows.",
                    "Graph-based Namespaces and Load Sharing for Efficient Information Dissemination in Disasters.",
                    "BDAC: A Behavior-aware Dynamic Adaptive Configuration on DHCP in Wireless LANs.",
                    "Re-designing Compact-structure based Forwarding for Programmable Networks.",
                    "Forward the Collision Decomposition in ZigBee.",
                    "Exploration and Exploitation of Off-path Cached Content in Network Coding Enabled Named Data Networking.",
                    "SQR: In-network Packet Loss Recovery from Link Failures for Highly Reliable Datacenter Networks.",
                    "Virtual Network Embedding with Path-based Latency Guarantees in Elastic Optical Networks.",
                    "NETHCF: Enabling Line-rate and Adaptive Spoofed IP Traffic Filtering.",
                    "Unveil the Hidden Presence: Characterizing the Backend Interface of Content Delivery Networks.",
                    "AutoWaze: Towards Automatic Event Inference in Intelligent Transportation Systems.",
                    "Powering Hands-on Cybersecurity Practices with Cloud Computing.",
                    "On Verification of Remote Computing on Potentially Untrusted Nodes.",
                    "The Case for Pluginized Routing Protocols.",
                    "Achieving Universal Low-Power Wide-Area Networks on Existing Wireless Devices.",
                    "Chameleon: A Large-Scale, Deeply Reconfigurable Testbed for Computer Science Research.",
                    "A Study on Effective Congestion Control to Retrieve Distributed Data in ICN.",
                    "COMPaaS DLV: Composable Infrastructure for Deep Learning in an Academic Research Environment.",
                    "Multi-Cloud Performance and Security-driven Brokering for Bioinformatics Workflows.",
                    "Elastic Data Transfer Infrastructure (DTI) on the Chameleon Cloud.",
                    "When Tags 'Read' Each Other: Enabling Low-cost and Convenient Tag Mutual Identification.",
                    "AG: Adaptive Switching Granularity for Load Balancing with Asymmetric Topology in Data Center Network.",
                    "Microservice Fingerprinting and Classification using Machine Learning.",
                    "Network Intrusion Detection System as a Service on OpenStack Cloud.",
                    "Hierarchical Congestion Control (HCC): Cooperation of Uncorrelated Flows for Better Fairness and Throughput.",
                    "Towards Service Discovery and Invocation in Data-Centric Edge Networks.",
                    "Intentionality-related Deep Learning Method in Web Prefetching.",
                    "Demo: Measuring Distance Traveled by an Object using WiFi-CSI and IMU Fusion.",
                    "Local Fast Rerouting with Low Congestion: A Randomized Approach.",
                    "Extended Abstract: Coordinated Communications for Next-Generation Networks.",
                    "DyCOCo: A Dynamic Computation Offloading and Control Framework for Drone Video Analytics.",
                    "DeepRoute on Chameleon: Experimenting with Large-scale Reinforcement Learning and SDN on Chameleon Testbed.",
                    "RobustPay: Robust Payment Routing Protocol in Blockchain-based Payment Channel Networks.",
                    "Experimenting with AWS Direct Connect using Chameleon, ExoGENI, and Internet2 Cloud Connect.",
                    "A Linguistics-based Stacking Approach to Disposable Domains Detection.",
                    "Perseverance-Aware Traffic Engineering in Rate-Adaptive Networks with Reconfiguration Delay.",
                    "Towards Automated Network Management: Learning the Optimal Protocol Selection.",
                    "Measuring Student Learning On Network Testbeds.",
                    "Load Migration Protocol for SDN Controllers.",
                    "GreenEdge: Greening Edge Datacenters with Energy-Harvesting IoT Devices.",
                    "Busoni: Policy Composition and Northbound Interface for IPv6 Segment Routing Networks.",
                    "Defending Web Servers Against Flash Crowd Attacks.",
                    "A Heterogeneous Parallel Packet Processing Architecture for NFV Acceleration.",
                    "Towards Human-Robot Collaboration: An Industry 4.0 VR Platform with Clouds Under the Hood.",
                    "Programmable Optical x-Haul Network in the COSMOS Testbed.",
                    "Anomaly Noise Filtering with Logistic Regression and a New Method for Time Series Trend Computation for Monitoring Systems.",
                    "CeforeSim: Cefore Compliant NS-3-Based Network Simulator.",
                    "ReDiCom: Resilient Communication for First Responders in Disaster Management.",
                    "Container Orchestration by Kubernetes for RDMA Networking.",
                    "Data-intensive Workflow Execution using Distributed Compute Resources.",
                    "Privacy-Preserving Remote Knowledge System.",
                    "The EdgeNet System.",
                    "SAFE-ME: Scalable and Flexible Middlebox Policy Enforcement with Software Defined Networking.",
                    "Demo Abstract: LASK: A Distributed Service Discovery Platform on Edge Computing Environments.",
                    "Cooperative Connected Autonomous Vehicles (CAV): Research, Applications and Challenges.",
                    "Optimal Strategies for Live Video Streaming in the Low-latency Regime.",
                    "On Studying CPU Performance of CloudLab Hardware.",
                    "FlowShader: a Generalized Framework for GPU-accelerated VNF Flow Processing.",
                    "Poster Abstract: Physical-layer Cross-Technology Communication with Narrow-Band Decoding.",
                    "When NFV Meets ANN: Rethinking Elastic Scaling for ANN-based NFs.",
                    "Traffic Analysis Resistant Network (TARN) Anonymity Analysis.",
                    "CoRE: Non-Linear 3D Sampling for Robust 360° Video Streaming.",
                    "COMET: Distributed Metadata Service for Multi-cloud Experiments.",
                    "A (Near) Zero-cost and Universal Method to Combat Multipaths for RFID Sensing.",
                    "A Precise and Expressive Lattice-theoretical Framework for Efficient Network Verification.",
                    "LoRaBee: Cross-Technology Communication from LoRa to ZigBee via Payload Encoding.",
                    "Experimentation with Full-Duplex Wireless in the COSMOS Testbed.",
                    "Placement and Allocation of Virtual Network Functions: Multi-dimensional Case.",
                    "TagAttention: Mobile Object Tracing without Object Appearance Information by Vision-RFID Fusion.",
                    "A Reinforcement Learning Approach for Online Service Tree Placement in Edge Computing."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th ICNP 2018",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2018",
                "sub_name": "2018 IEEE 26th International Conference on Network Protocols, ICNP 2018, Cambridge, UK, September 25-27, 2018.",
                "count": 55,
                "papers": [
                    "DARE: Dynamic Adaptive Mobile Augmented Reality with Edge Computing.",
                    "IoTm: A Lightweight Framework for Fine-Grained Measurements of IoT Performance Metrics.",
                    "Dynamic Heterogeneity-Aware Coded Cooperative Computation at the Edge.",
                    "JamCloak: Reactive Jamming Attack over Cross-Technology Communication Links.",
                    "Sybil Detection in Social-Activity Networks: Modeling, Algorithms and Evaluations.",
                    "A Fair Consensus Protocol for Transaction Ordering.",
                    "QDAPS: Queueing Delay Aware Packet Spraying for Load Balancing in Data Center.",
                    "Republic: Data Multicast Meets Hybrid Rack-Level Interconnections in Data Center.",
                    "Micro-Burst in Data Centers: Observations, Analysis, and Mitigations.",
                    "DCQCN+: Taming Large-Scale Incast Congestion in RDMA over Ethernet Networks.",
                    "New Alternatives to Optimize Policy Classifiers.",
                    "Virtual Network Function Deployment in Tree-Structured Networks.",
                    "CADIA: Towards Decoupling the Congestion Control for Multipath TCP.",
                    "Grus: Enabling Latency SLOs for GPU-Accelerated NFV Systems.",
                    "HotDASH: Hotspot Aware Adaptive Video Streaming Using Deep Reinforcement Learning.",
                    "Ares: A High Performance and Fault-Tolerant Distributed Stream Processing System.",
                    "RPC: Joint Online Reducer Placement and Coflow Bandwidth Scheduling for Clusters.",
                    "Cuttlefish: Hierarchical SDN Controllers with Adaptive Offload.",
                    "On SDN-Enabled Online and Dynamic Bandwidth Allocation for Stream Analytics.",
                    "INDAGO: A New Framework For Detecting Malicious SDN Applications.",
                    "Hermes: Utility-Aware Network Update in Software-Defined WANs.",
                    "Stabilizing Chaotic Behavior of RED.",
                    "LTSM: Lightweight and Time Sliced Measurement for Link State.",
                    "Innovating at the Connected Industry: SDN and NFV Experiences and Lessons Learned.",
                    "NetVision: Towards Network Telemetry as a Service.",
                    "In Search of the Lost Nodes in BANs.",
                    "Model-Less Approach of Network Traffic for Accurate Packet Loss Simulations.",
                    "ICN Performance Enhancing Proxies for the Global Content Distribution.",
                    "Kiram and WOE: Distributed Denial of Service Attacks in Named-Data Networking.",
                    "Demo Abstract: Themis: Cross-Domain Resource Orchestration and Virtualization in Cellular Computing Networks.",
                    "Networking Support For Physical-Layer Cross-Technology Communication.",
                    "SIDE: Semi-Distributed Mechanical Equilibrium Based UAV Deployment.",
                    "ELI: Empowering LTE with Interference Awareness in Unlicensed Spectrum.",
                    "KeySight: Troubleshooting Programmable Switches via Scalable High-Coverage Behavior Tracking.",
                    "A Fast and Memory-Efficient Trie Structure for Name-Based Packet Forwarding.",
                    "Efficient Measurement on Programmable Switches Using Probabilistic Recirculation.",
                    "Quantifying Deployability & Evolvability of Future Internet Architectures via Economic Models.",
                    "Rate of Convergence of Increasing Path-Vector Routing Protocols.",
                    "Shifter: A Consistent Multicast Routing Update Scheme in Software-Defined Networks.",
                    "Canon: Exploiting Channel Diversity for Reliable Parallel Decoding in Backscatter Communication.",
                    "Distributed Spectrum Sharing for Enterprise Powerline Communication Networks.",
                    "If you can't Beat Them, Augment Them: Improving Local WiFi with Only Above-Driver Changes.",
                    "Named Data Networking with Programmable Switches.",
                    "Consensus for Non-volatile Main Memory.",
                    "Transparent Edge Gateway for Mobile Networks.",
                    "Stateless Load-Aware Load Balancing in P4.",
                    "P4LLVM: An LLVM Based P4 Compiler.",
                    "pcube: Primitives for Network Data Plane Programming.",
                    "Network Coding for Critical Infrastructure Networks.",
                    "ARP-P4: A Hybrid ARP-Path/P4Runtime Switch.",
                    "One for All, All for One: A Heterogeneous Data Plane for Flexible P4 Processing.",
                    "Using P4 to Enable Scalable Intents in Software Defined Networks.",
                    "Verification of Generated RTL from P4 Source Code.",
                    "Hardware-Accelerated Firewall for 5G Mobile Networks.",
                    "Switch ASIC Programmability in Hybrid Mode."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th ICNP 2017",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2017",
                "sub_name": "25th IEEE International Conference on Network Protocols, ICNP 2017, Toronto, ON, Canada, October 10-13, 2017.",
                "count": 68,
                "papers": [
                    "Comparing OpenFlow and NETCONF when interconnecting data centers.",
                    "Cost of not arbitrarily splitting in routing.",
                    "Performance enhancement of multipath TCP in mobile Ad Hoc networks.",
                    "Algorithm-data driven optimization of adaptive communication networks.",
                    "MDP modeling of resource provisioning in virtualized content-delivery networks.",
                    "Preferential link tomography in dynamic networks.",
                    "A programmable buffer management platform.",
                    "Making multipath TCP friendlier to load balancers and anycast.",
                    "SoftRing: Taming the reactive model for software defined networks.",
                    "General ternary bit strings on commodity longest-prefix-match infrastructures.",
                    "P4DB: On-the-fly debugging of the programmable data plane.",
                    "Peering vs. transit: Performance comparison of peering and transit interconnections.",
                    "Experimental evaluation of BBR congestion control.",
                    "Distributed Mininet placement algorithm for fat-tree topologies.",
                    "A concise forwarding information base for scalable and fast name lookups.",
                    "A multiple vehicle sensing approach for collision avoidance in progressively deployed vehicle networks.",
                    "GeneWave: Fast authentication and key agreement on commodity mobile devices.",
                    "Fast testing network data plane with RuleChecker.",
                    "Secure crowdsourced radio environment map construction.",
                    "BoLTE: Efficient network-wide LTE broadcasting.",
                    "Mrs. Z: Improving ZigBee throughput via multi-rate transmission.",
                    "Spatio-temporal analysis and prediction of cellular traffic in metropolis.",
                    "Multipath TCP traffic diversion attacks and countermeasures.",
                    "Selective HTTPS traffic manipulation at middleboxes for BYOD devices.",
                    "iMUTE: Energy-optimal update policy for perishable mobile contents.",
                    "vPROM: VSwitch enhanced programmable measurement in SDN.",
                    "A network-centric TCP for interactive video delivery networks (VDN).",
                    "A framework for anonymous routing in delay tolerant networks.",
                    "Toward a programmable FIB caching architecture.",
                    "When deep learning meets edge computing.",
                    "MSAID: Automated interference detection for multiple SDN applications.",
                    "The first experimental SDR platform for inband D2D communications in 5G.",
                    "VMS: Traffic balancing based on virtual switches in datacenter networks.",
                    "Enabling seamless WiGig/WiFi handovers in tri-band wireless systems.",
                    "SocialGate: Managing large-scale social data on home gateways.",
                    "Adaptively adjusting ECN marking thresholds for datacenter networks.",
                    "PMC: Parallel multi-protocol communication to heterogeneous IoT radios within a single WiFi channel.",
                    "Machine learning at the network edge for automated home intrusion monitoring.",
                    "Towards higher throughput rate adaptation for backscatter networks.",
                    "Experimental evaluation of two OpenFlow controllers.",
                    "Cotask scheduling in cloud computing.",
                    "Deploying default paths by joint optimization of flow table and group table in SDNs.",
                    "Analyzing public transportation mobility data for networking purposes.",
                    "Rethinking LTE network functions virtualization.",
                    "Coordinating rolling software upgrades for cellular networks.",
                    "SICS: Secure and dynamic middlebox outsourcing.",
                    "GSC: Greedy shard caching algorithm for improved I/O efficiency in GraphChi.",
                    "When creek meets river: Exploiting high-bandwidth circuit switch in scheduling multicast data.",
                    "The dynamic cuckoo filter.",
                    "SyncCoding: A compression technique exploiting references for data synchronization services.",
                    "BlueCoDE: Bluetooth coordination in dense environment for better coexistence.",
                    "Popularity-aware differentiated distributed stream processing on skewed streams.",
                    "Wireless network instabilities in the wild: Prevalence, App (non)resilience, and OS remedy.",
                    "TorPolice: Towards enforcing service-defined access policies for anonymous communication in the Tor network.",
                    "Stabilizing BGP through distributed elimination of recurrent routing loops.",
                    "A customized and cost-efficient backup scheme in software-defined networks.",
                    "An empirical model of packet processing delay of the Open vSwitch.",
                    "Investigating the impact of cache pollution attacks in heterogeneous cellular networks.",
                    "Yosemite: Efficient scheduling of weighted coflows in data centers.",
                    "NF-switch: VNFs-enabled SDN switches for high performance service function chaining.",
                    "Suffering from buffering? Detecting QoE impairments in live video streams.",
                    "Impacts of task placement and bandwidth allocation on stream analytics.",
                    "Reflection: Automated test location selection for cellular network upgrades.",
                    "On an impact of large content on packet-level caching of information centric networking.",
                    "Characterizing and optimizing background data transfers on smartwatches.",
                    "Planning in compute-aggregate problems as optimization problems on graphs.",
                    "SDN-based service automation for IoT.",
                    "The implementation of improved MPTCP in MANETs."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th ICNP 2016",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2016",
                "sub_name": "24th IEEE International Conference on Network Protocols, ICNP 2016, Singapore, November 8-11, 2016.",
                "count": 85,
                "papers": [
                    "Characterizing industrial control system devices on the Internet.",
                    "Deadline-sensitive User Recruitment for mobile crowdsensing with probabilistic collaboration.",
                    "LocP: An efficient Localized Polling Protocol for large-scale RFID systems.",
                    "Chase: Taming concurrent broadcast for flooding in asynchronous duty cycle networks.",
                    "Optimizing virtual backup allocation for middleboxes.",
                    "An efficient framework for data-plane verification with geometric windowing queries.",
                    "NSFA: Nested Scale-Free Architecture for scalable publish/subscribe over P2P networks.",
                    "Harmony: Exploiting coarse-grained received signal strength from IoT devices for human activity recognition.",
                    "Optimization-based network flow deadline scheduling.",
                    "Decentralized search in expert networks: Generic models and performance bounds.",
                    "Piggyback game: Efficient event stream dissemination in Online Social Network systems.",
                    "Measurement-based performance profiles and dynamics of UDT over dedicated connections.",
                    "Fast shortest-path queries on large-scale graphs.",
                    "Smoggy-Link: Fingerprinting interference for predictable wireless concurrency.",
                    "Scheduling dynamic wireless networks with limited operations.",
                    "RMIP: Resource management with interference precancellation in heterogeneous cellular networks.",
                    "Stream: Decentralized opportunistic inter-coflow scheduling for datacenter networks.",
                    "Bringing execution assurances of pattern matching in outsourced middleboxes.",
                    "Friends or foes: Revisiting strategy-proofness in cloud network sharing.",
                    "Rules in play: On the complexity of routing tables and firewalls.",
                    "Let's work together: Fast tag identification by interference elimination for multiple RFID readers.",
                    "CTCV: A protocol for Coordinated Transport of Correlated Video in Smart Camera Networks.",
                    "A sorted partitioning approach to high-speed and fast-update OpenFlow classification.",
                    "Models of TCP in high-BDP environments and their experimental validation.",
                    "Dynamic Service Function Chaining in SDN-enabled networks with middleboxes.",
                    "Optimizing Internet transit routing for content delivery networks.",
                    "Redactor: Reconcile network control with declarative control programs In SDN.",
                    "Maximizing container-based network isolation in parallel computing clusters.",
                    "Omnidirectional chargability with directional antennas.",
                    "Real-time update with joint optimization of route selection and update scheduling for SDNs.",
                    "Compressing backoff in CSMA networks.",
                    "On-demand video processing in wireless networks.",
                    "Efficient anonymous category-level joint Tag estimation.",
                    "FairCache: Introducing fairness to ICN caching.",
                    "Traffic-aware virtual machine migration in topology-adaptive DCN.",
                    "Enabling router-assisted congestion control on the Internet.",
                    "msocket: System support for mobile, multipath, and middlebox-agnostic applications.",
                    "R-Cloud: A cloud framework for enabling Radio-as-a-Service over a wireless substrate.",
                    "Profit maximization for viral marketing in Online Social Networks.",
                    "Transparent flow migration for NFV.",
                    "Cache contention aware Virtual Machine placement and migration in cloud datacenters.",
                    "Trading routing diversity for better network performance.",
                    "We've got you covered: Failure recovery with backup tunnels in traffic engineering.",
                    "Communication based on per-packet One-Time Addresses.",
                    "Optimal link-disjoint node-\"somewhat disjoint\" paths.",
                    "FIB efficiency in distributed platforms.",
                    "Boosting powerline communications for ubiquitous connectivity in enterprises.",
                    "ORSAP: Abstracting routing state on demand.",
                    "Luopan: Sampling based load balancing in data center networks.",
                    "Consistent replication protocol for Named Data Networking.",
                    "A communication model for stateless networked tags.",
                    "Viewing 360 degree videos: Motion prediction and bandwidth optimization.",
                    "SliM: Enabling efficient, seamless NFV state migration.",
                    "PPCU: Proportional per-packet consistent updates for Software Defined Networks.",
                    "Distributed privacy-protecting DTN routing: Concealing the information indispensable in routing.",
                    "Fit the elephant in a box - towards IP lookup at on-chip memory access speed.",
                    "OpenFunction: An extensible data plane abstraction protocol for platform-independent software-defined middleboxes.",
                    "CatCharge: Deploying wireless charging lane in metropolitan scale through categorization and clustering of vehicle mobility.",
                    "DEME: Decouple packet marking from enqueuing for multiple services in data center networks.",
                    "Towards verifiable outsourced middleboxes.",
                    "ASCEND: A search engine for online industrial control devices.",
                    "GUIDE: Graphical user interface fingerprints physical devices.",
                    "Gavel: Towards a graph database Defined Network.",
                    "A template approach to group key establishment in dynamic ad-hoc groups.",
                    "Topological ordering based iterative TCAM rule compression using bi-partite graphs.",
                    "Poster abstract: Long-term observation with passive Wi-Fi scanning.",
                    "Macroflow: A fine-grained networking abstraction for job completion time oriented scheduling in datacenters.",
                    "Considerations for re-designing the cellular infrastructure exploiting software-based networks.",
                    "Application of evolutionary mechanism to dynamic Virtual Network Function Placement.",
                    "NeSMA: Enabling network-level state-aware applications in SDN.",
                    "Role-based campus network slicing.",
                    "SDIG: Toward Software-Defined IPsec Gateway.",
                    "Reconciling task assignment and scheduling in mobile edge clouds.",
                    "How sustainable is social based mobile crowdsensing? An experimental study.",
                    "Exploring mobile users and their effects in online social networks: A Twitter case study.",
                    "Towards rapid and cost-effective prototyping of IoT platforms.",
                    "Name-based geographical routing/forwarding support for location-based IoT services.",
                    "Limitations of IEC62351-3's public key management.",
                    "Anomaly detection in diurnal CPS monitoring data using a local density approach.",
                    "Online flow size prediction for improved network routing.",
                    "Enhanced telemetry for encrypted threat analytics.",
                    "MS-LSTM: A multi-scale LSTM model for BGP anomaly detection.",
                    "Machine Learning in Software Defined Networks: Data collection and traffic classification.",
                    "Predicting future traffic using Hidden Markov Models.",
                    "Estimating the rumor source with anti-rumor in social networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd ICNP 2015",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2015",
                "sub_name": "23rd IEEE International Conference on Network Protocols, ICNP 2015, San Francisco, CA, USA, November 10-13, 2015.",
                "count": 50,
                "papers": [
                    "Minimizing Transient Congestion during Network Update in Data Centers.",
                    "How Hard Can It Be?: Understanding the Complexity of Replica Aware Virtual Cluster Embeddings.",
                    "Packet Slicing for Highly Concurrent TCPs in Data Center Networks with COTS Switches.",
                    "COF: Exploiting Concurrency for Low Power Opportunistic Forwarding.",
                    "Wi-FM: Resolving Neighborhood Wireless Network Affairs by Listening to Music.",
                    "Smart Retransmission and Rate Adaptation in WiFi.",
                    "Embracing Distributed MIMO in Wireless Mesh Networks.",
                    "SHEAR: A Highly Available and Flexible Network Architecture Marrying Distributed and Logically Centralized Control Planes.",
                    "GeoTopo: A PoP-level Topology Generator for Evaluation of Future Internet Architectures.",
                    "On the DNS Deployment of Modern Web Services.",
                    "Counter Tree: A Scalable Counter Architecture for Per-Flow Traffic Measurement.",
                    "Searching for Widespread Events in Large Networked Systems by Cooperative Monitoring.",
                    "Rethinking Robust and Accurate Application Protocol Identification: A Nonparametric Approach.",
                    "Energy-Efficient Computation Offloading in Cellular Networks.",
                    "Streaming Lower Quality Video over LTE: How Much Energy Can You Save?",
                    "REACT: Managing Application-Induced Signaling Overhead in Cellular Data Networks.",
                    "Fine-Grained Encountering Information Collection under Neighbor Anonymity in Mobile Opportunistic Social Networks.",
                    "FAIR: Forwarding Accountability for Internet Reputability.",
                    "Privacy Leaks When You Play Games: A Novel User-Behavior-Based Covert Channel on Smartphones.",
                    "A Practical System for Guaranteed Access in the Presence of DDoS Attacks and Flash Crowds.",
                    "A Novel Metric for Opportunistic Routing in Heterogenous Duty-Cycled Wireless Sensor Networks.",
                    "CARE: Corruption-Aware Retransmission with Adaptive Coding for the Low-Power Wireless.",
                    "Minimizing Application-Level Delay of Multi-path TCP in Wireless Networks: A Receiver-Centric Approach.",
                    "CSMA/CA in Time and Frequency Domains.",
                    "ETAP: Enable Lightweight Anonymous RFID Authentication with O(1) Overhead.",
                    "Fairness Matters: Identification of Active RFID Tags with Statistically Guaranteed Fairness.",
                    "EMoD: Efficient Motion Detection of Device-Free Objects Using Passive RFID Tags.",
                    "Identifying State-Free Networked Tags.",
                    "SVirt: A Substrate-agnostic SDN Virtualization Architecture for Multi-tenant Cloud.",
                    "SDPA: Enhancing Stateful Forwarding for Software-Defined Networking.",
                    "Multi-criteria Routing in Networks with Path Choices.",
                    "Freeing the IP Internet Architecture from Fixed IP Addresses.",
                    "Privacy-Preserving Cross-Domain Routing Optimization - A Cryptographic Approach.",
                    "Overlay Topology as Random-Walk Cache.",
                    "Scalable and Efficient Multipath Routing: Complexity and Algorithms.",
                    "EMS: Efficient Multicast Streaming Scheme for Multicasting within Wi-Fi Hotspot.",
                    "Context-Centric Target Localization with Optimal Anchor Deployments.",
                    "Monitoring Routing Topology in Dynamic Wireless Sensor Network Systems.",
                    "SPIRIT: A Framework for Profiling SDN.",
                    "FlowFall: A Service Chaining Architecture with Commodity Technologies.",
                    "ÆtherFlow: Principled Wireless Support in SDN.",
                    "MLV: A Multi-dimension Routing Information Exchange Mechanism for Inter-domain SDN.",
                    "Fast Network Flow Resumption for Live Virtual Machine Migration on SDN.",
                    "Fingerprinting Software-Defined Networks.",
                    "An Integrated Transport Solution to Big Data Movement in High-Performance Networks.",
                    "SDN-PANDA: Software-Defined Network Platform for ANomaly Detection Applications.",
                    "Towards Motion-Aware Wireless LANs Using PHY Layer Information.",
                    "Towards Multi-gigabit 60 GHz Indoor WLANs.",
                    "Design and Benefits of a Hidden-Identifier Network Architecture.",
                    "QoS Aware Component-Based Routing in Resource-Constrained Wireless Multi-hop Networks."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd ICNP 2014",
        "info": "Raleigh, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2014",
                "sub_name": "22nd IEEE International Conference on Network Protocols, ICNP 2014, Raleigh, NC, USA, October 21-24, 2014.",
                "count": 83,
                "papers": [
                    "On Exploiting Dynamic Execution Patterns for Workload Offloading in Mobile Cloud Applications.",
                    "Space Shuffle: A Scalable, Flexible, and High-Bandwidth Data Center Network.",
                    "Cross-VM Covert Channel Risk Assessment for Cloud Computing: An Automated Capacity Profiler.",
                    "On Design and Performance of Cloud-Based Distributed Interactive Applications.",
                    "CBID: A Customer Behavior Identification System Using Passive Tags.",
                    "Fast Counting the Key Tags in Anonymous RFID Systems.",
                    "Scalable Data Access Control in RFID-Enabled Supply Chain.",
                    "Cost-Minimizing Mobile Access Point Deployment in Workflow-Based Mobile Sensor Networks.",
                    "Every Packet Counts: Fine-Grained Delay and Loss Measurement with Reordering.",
                    "Can Bandwidth Estimation Tackle Noise at Ultra-high Speeds?",
                    "Network Path Capacity Comparison without Accurate Packet Time Information.",
                    "Estimating the Persistent Spreads in High-Speed Networks.",
                    "Multipath Routing from a Traffic Engineering Perspective: How Beneficial Is It?",
                    "Routing to Multi-instantiated Destinations: Principles and Applications.",
                    "Preferential Link Tomography: Monitor Assignment for Inferring Interesting Link Metrics.",
                    "Formal Modeling and Systematic Black-Box Testing of SDN Data Plane.",
                    "SensCrypt: A Secure Protocol for Managing Low Power Fitness Trackers.",
                    "Polylogarithmic Competitive Algorithm for Energy Minimization in Optical WDM Networks.",
                    "On Measuring One-Way Path Metrics from a Web Server.",
                    "Semi-synchronous Channel Access for Full-Duplex Wireless Networks.",
                    "Secgras: Security Group Analysis as a Cloud Service.",
                    "You Are How You Touch: User Verification on Smartphones via Tapping Behaviors.",
                    "OrthCredential: A New Network Capability Design for High-Performance Access Control.",
                    "Fair Pricing in the Sky: Truthful Frequency Allocation with Dynamic Spectrum Supply.",
                    "Pay-as-You-Go Pricing and Competition in Congested Network Service Markets.",
                    "Deconstructing MPTCP Performance.",
                    "Multi-path TCP: Boosting Fairness in Cellular Networks.",
                    "TCP Performance over Mobile Networks in High-Speed Mobility Scenarios.",
                    "Composing Heterogeneous SDN Controllers with Flowbricks.",
                    "Optimizing Mobile Prefetching by Leveraging Usage Patterns and Social Information.",
                    "Rethinking Packet Classification for Global Network View of Software-Defined Networking.",
                    "Meta-algorithms for Software-Based Packet Classification.",
                    "Collaborative Verification of Forward and Reverse Reachability in the Internet Data Plane.",
                    "Compressing IP Forwarding Tables: Realizing Information-Theoretical Space Bounds and Fast Lookups Simultaneously.",
                    "Stochastic Planning for Content Delivery: Unveiling the Benefits of Network Functions Virtualization.",
                    "LAAR: Long-Range Radio Assisted Ad-Hoc Routing in MANETs.",
                    "In-Band Update for Network Routing Policy Migration.",
                    "Freeway: Adaptively Isolating the Elephant and Mice Flows on Different Transmission Paths.",
                    "Analysis of Topology Algorithms for Commercial Airborne Networks.",
                    "Regulating Monopolistic ISPS without Neutrality.",
                    "PAC: Taming TCP Incast Congestion Using Proactive ACK Control.",
                    "Constrained Maximum Flow in Stochastic Networks.",
                    "Wireless Rate Adaptation via Smart Pilot.",
                    "Circular Pipelining: Minimizing Round-Trip Delay in Low-Duty-Cycle Wireless Networks.",
                    "Correlated Coding: Efficient Network Coding under Correlated Unreliable Wireless Links.",
                    "Exploiting Sender-Based Link Correlation in Wireless Sensor Networks.",
                    "On the MAC for Power-Line Communications: Modeling Assumptions and Performance Tradeoffs.",
                    "Software Switch Performance Factors in Network Virtualization Environment.",
                    "Optimization Models for Congestion Mitigation in Virtual Networks.",
                    "Multi-path Solutions to Improve Network Performance.",
                    "Obstacle Shadowing Influences in VANET Safety.",
                    "Towards Resource-Efficient Application-Controlled Software Defined Networks.",
                    "A Decentralized System for Privacy-Preserving Context Exchange: Facilitating a Better Work-Life Balance.",
                    "IP45: Architecture, Design, and Implementation.",
                    "On the Variation in Web Page Download Traffic across Different Client Types.",
                    "A Study on a Routing-Based Mobility Management Architecture for IoT Devices.",
                    "Challenges with Transition and User Accounting in Next Generation Networks.",
                    "Programming Routing Policies for Video Traffic.",
                    "In-Network Compute Extensions for Rate-Adaptive Content Delivery in Mobile Networks.",
                    "Experimentation of Geometric Information Routing on Content Locators.",
                    "An OpenFlow-Based Prototype of SDN-Oriented Stateful Hardware Firewalls.",
                    "GENI Cinema: An SDN-Assisted Scalable Live Video Streaming Service.",
                    "Experience in Implementing & Deploying a Non-IP Routing Protocol VIRO in GENI.",
                    "Domain Science Applications on GENI: Presentation and Demo.",
                    "Experiments on Networking of Hadoop.",
                    "Designing a GENI Experimenter Tool to Support the Choice Net Internet Architecture.",
                    "SDN Management Layer: Design Requirements and Future Direction.",
                    "Traffic Engineering in SDN/OSPF Hybrid Network.",
                    "Orion: A Hybrid Hierarchical Control Plane of Software-Defined Networking for Large-Scale Networks.",
                    "Forwarding Programming in Protocol-Oblivious Instruction Set.",
                    "Data Plane Programmability in SDN.",
                    "Extending Openflow for Service Insertion and Payload Inspection.",
                    "Stochastic Pre-classification for SDN Data Plane Matching.",
                    "Virtual Duplex: Scaling Dense WLANS and Eliminating Contention Asymmetry.",
                    "OperationCheckpoint: SDN Application Control.",
                    "DDoS Attack Protection in the Era of Cloud Computing and Software-Defined Networking.",
                    "Disincentivizing/Incentivizing Malicious/Honest Behavior on the Internet via Privacy-Preserving Appcoins.",
                    "The Shape and Size of Threats: Defining a Networked System's Attack Surface.",
                    "Reflections on Security Options for the Real-Time Transport Protocol Framework.",
                    "Vulnerabilities of RFID Security Protocol Based on Chaotic Maps.",
                    "Delegated Authenticated Authorization for Constrained Environments.",
                    "Heisenberg Groups as Platform for the AAG Key-Exchange Protocol.",
                    "MetaCAPTCHA: A Metamorphic Throttling Service for the Web."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st ICNP 2013",
        "info": "Göttingen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2013",
                "sub_name": "2013 21st IEEE International Conference on Network Protocols, ICNP 2013, Göttingen, Germany, October 7-10, 2013.",
                "count": 107,
                "papers": [
                    "Message from the technical program chairs.",
                    "Message from general chairs.",
                    "Tailoring end-to-end IP security protocols to the Internet of Things.",
                    "A few bits are enough - ASIC friendly Regular Expression matching for high speed network security systems.",
                    "Who are you talking to? Breaching privacy in encrypted IM networks.",
                    "GenePrint: Generic and accurate physical-layer identification for UHF RFID tags.",
                    "Mitigating malicious interference via subcarrier-level radio agility in wireless networks.",
                    "Optimal multipath congestion control and request forwarding in Information-Centric Networks.",
                    "Optimal cache allocation for Content-Centric Networking.",
                    "Let's ChronoSync: Decentralized dataset state synchronization in Named Data Networking.",
                    "Joint-Family: Enabling adaptive bitrate streaming in peer-to-peer video-on-demand.",
                    "PVTCP: Towards practical and effective congestion control in virtualized datacenters.",
                    "Dynamic distributed algorithm for computing multiple next-hops on a tree.",
                    "Selective Data replication for Online Social Networks with Distributed Datacenters.",
                    "Falloc: Fair network bandwidth allocation in IaaS datacenters via a bargaining game approach.",
                    "Using routers to build logic circuits: How powerful is BGP?",
                    "Optimal link-state hop-by-hop routing.",
                    "Hop-by-hop computing for green Internet routing.",
                    "STRIP: Privacy-preserving vector-based routing.",
                    "Graceful router updates in link-state protocols.",
                    "Design and implementation of a proactive distributed authentication framework (PDAF).",
                    "L2Relay: Design and implementation of a layer 2 Wi-Fi packet relay protocol.",
                    "Scalable WiFi multicast services for very large groups.",
                    "RCTC: Rapid concurrent transmission coordination in full DuplexWireless networks.",
                    "Voice over the dins: Improving wireless channel utilization with collision tolerance.",
                    "Dynamic channel bonding in multicarrier wireless networks.",
                    "STAMP: Ad hoc spatial-temporal provenance assurance for mobile users.",
                    "Transient community detection and its application to data forwarding in delay tolerant networks.",
                    "Radio Access Network sharing in cellular networks.",
                    "Async: De-congestion and yield management in cellular data networks.",
                    "Async: De-congestion and yield management in cellular data networks.",
                    "Mitigating egregious ACK delays in cellular data networks by eliminating TCP ACK clocking.",
                    "A unified framework for line-like skeleton extraction in 2D/3D sensor networks.",
                    "DOF: Duplicate Detectable Opportunistic Forwarding in duty-cycled wireless sensor networks.",
                    "Pathfinder: Robust path reconstruction in large scale sensor networks with lossy links.",
                    "Joint Aggregation and MAC design to prolong sensor network lifetime.",
                    "Power-aware design of IP core networks under general traffic demands.",
                    "Real-time power control for dynamic optical networks - Algorithms and experimentation.",
                    "Energy efficient carrier aggregation algorithms for next generation cellular networks.",
                    "CMES: Collaborative Energy Save for MIMO 802.11 wireless networks.",
                    "Guided multiple hashing: Achieving near perfect balance for fast routing lookup.",
                    "On the forwarding paths produced by Internet routing algorithms.",
                    "Taming TCP incast throughput collapse in data center networks.",
                    "Multi-Resource Round Robin: A low complexity packet scheduler with Dominant Resource Fairness.",
                    "LOOP: Layer-based overlay and optimized polymerization for multiple virtual tables.",
                    "Skewless network clock synchronization.",
                    "Kistree: A reliable constant degree DHT.",
                    "Real-time verification of network properties using Atomic Predicates.",
                    "StEERING: A software-defined networking for inline service chaining.",
                    "OpenSession: SDN-based cross-layer multi-stream management protocol for 3D teleimmersion.",
                    "An economic perspective on traffic attraction by Internet transit providers.",
                    "The impact of large flows in Content Centric Networks.",
                    "Testing OpenFlow interaction property based on hierarchy CPN.",
                    "A two-tier Content-Centric Architecture for Wireless Sensor Networks.",
                    "Community classification on Decentralized Social Networks based on 2-hop neighbourhood information.",
                    "Redundancy control and duplicate ACK suppression methods for TCP with FEC.",
                    "On the cascading failures of multi-controllers in Software Defined Networks.",
                    "Augmented multipath TCP communications.",
                    "Modeling, identifying, and simulating Dynamic Adaptive Streaming over HTTP.",
                    "Removing content consumers from mapping system.",
                    "Multi-stream frame rate guarantee using cross-layer synergy.",
                    "Dual-NAT: dynamic multipath flow scheduling for Data Center Networks.",
                    "On the effectiveness of sybil defenses based on online social networks.",
                    "Disaster-tolerant authentication system for NDN using Hierarchical ID-Based Encryption.",
                    "vRGW: Towards network function virtualization enabled by software defined networking.",
                    "A lightweight many-to-many authentication protocol for Near Field Communications.",
                    "Enabling ICN in IP networks using SDN.",
                    "On the opportunistic connectivity of large-scale urban vehicular networks.",
                    "HTTP-CCN gateway: Adapting HTTP protocol to Content Centric Network.",
                    "Leveraging WebRTC for P2P content distribution in web browsers.",
                    "CNS: A Content-centric Notification Service.",
                    "Optimizing energy consumption and qoe on mobile devices.",
                    "Software defined live virtual machine migration.",
                    "Rethinking congestion control in virtualized datacenters.",
                    "Measurement-based TCP parameter tuning in cloud data centers.",
                    "Interference and capacity analysis in multi-hop wireless mesh networks.",
                    "Resource optimization for speculative execution in a MapReduce Cluster.",
                    "Defining a network management architecture.",
                    "Standards-based end-to-end IP security for the Internet of Things.",
                    "Formal methods to improve the identification and validation of network traffic.",
                    "Link quality aware geographical routing in hybrid cognitive radio mesh networks.",
                    "Measuring interdependencies and transitivity of end to end traffic flows by traffic correlation.",
                    "Content-centric user networks: WebRTC as a path to name-based publishing.",
                    "RLoad: Reputation-based load-balancing network selection strategy for heterogeneous wireless environments.",
                    "Collision-driven physical-layer identification of RFID UHF tags.",
                    "Efficient verification of network reachability properties.",
                    "PhD forum: Not so cooperative caching.",
                    "Evaluation of the impact of packet drops due to AQM over capacity limited paths.",
                    "DFLOW: Low latency congestion control.",
                    "Congestion-aware scalable video streaming.",
                    "Effects of capacity sharing on mobile access competition.",
                    "Stitch-n-Sync: Discreetly disclosing topology information using logically centralized controllers.",
                    "Service Boost: Towards on-demand QoS enhancements for OTT apps in LTE.",
                    "Software-defined networking based capacity sharing in hybrid networks.",
                    "Automated synthesis of reactive controllers for software-defined networks.",
                    "Eliminating network protocol vulnerabilities through abstraction and systems language design.",
                    "Multipath policy routing using destination based hop-by-hop forwarding.",
                    "Is the network capable of computation?",
                    "OpenFlow: A security analysis.",
                    "Security evaluation of a control system using Named Data Networking.",
                    "On-demand video streaming based on dynamic adaptive encrypted content chunks.",
                    "Security analysis of a future Internet architecture.",
                    "Improving traffic in urban environments applying the Wardrop equilibrium.",
                    "Experimental evaluation of 5.9 GHz link asymmetry using standards-compliant implementation.",
                    "Scalable opportunistic VANET Content Routing with encounter information.",
                    "eWARPE - Energy-efficient weather-aware route planner for electric bicycles.",
                    "An evaluation study of driver profiling fuzzy algorithms using smartphones."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th ICNP 2012",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2012",
                "sub_name": "20th IEEE International Conference on Network Protocols, ICNP 2012, Austin, TX, USA, October 30 - Nov. 2, 2012.",
                "count": 53,
                "papers": [
                    "TUNOS: A novel SDN-oriented networking operating system.",
                    "A content provider mobility solution of named data networking.",
                    "CORONET: Fault tolerance for Software Defined Networks.",
                    "Umbrella: A routing choice feedback based distributed inter-domain anti-spoofing solution.",
                    "Integration testing of protocol implementations using symbolic distributed execution.",
                    "Reduction-based security analysis of Internet routing protocols.",
                    "Towards a rigorous analysis of AODVv2 (DYMO).",
                    "A diversified and correct-by-construction broadcast service.",
                    "Verification and synthesis of firewalls using SAT and QBF.",
                    "Reducing the complexity of BGP stability analysis with hybrid combinatorial-algebraic models.",
                    "CloudWatcher: Network security monitoring using OpenFlow in dynamic cloud networks (or: How to provide security monitoring as a service in clouds?).",
                    "Assessing the security of a clean-slate Internet architecture.",
                    "Evaluating sinkhole defense techniques in RPL networks.",
                    "To cloud or not to cloud: A study of trade-offs between in-house and outsourced virtual private network.",
                    "A proactive scheme for securing ID/locator split architecture.",
                    "Key splitting for random key distribution schemes.",
                    "VCP: A virtualization cloud platform for SDN intra-domain production network.",
                    "An architecture for collaborative driving systems.",
                    "Detecting the unintended in BGP policies.",
                    "Optimal vehicles and coding decision for mobile data sharing in Vehicular Delay Tolerant Networks.",
                    "Global Resolution Service for mobility support in the internet.",
                    "Virtual routing tables polymerization for lookup and update.",
                    "AFEC: A method of aggregating forwarding equivalence classes based on overlapped paths.",
                    "Symbol-level detection: A new approach to silencing hidden terminals.",
                    "A formally-verified migration protocol for mobile, multi-homed hosts.",
                    "Buddyguard: A buddy system for fast and reliable detection of IP prefix anomalies.",
                    "A semantics aware approach to automated reverse engineering unknown protocols.",
                    "D-Fi: A diversity-aware Wi-Fi using an OFDM-based Bloom filter.",
                    "Marooned magic numbers - An adaptive congestion control architecture.",
                    "Airlift: Video conferencing as a cloud service using inter-datacenter networks.",
                    "Using DCCP: Issues and improvements.",
                    "A distributed routing protocol for predictable rates in wireless mesh networksy.",
                    "On minimum delay duty-cycling protocol in sustainable sensor network.",
                    "FAST: A channel access protocol for wireless video (and non-video) traffic.",
                    "Distortion-Resilient Routing for Video Flows in Wireless Multi-hop Networks.",
                    "Forensic analysis of packet losses in wireless networks.",
                    "Cooperative end-to-end traffic redundancy elimination for reducing cloud bandwidth cost.",
                    "Detecting unsafe BGP policies in a flexible world.",
                    "Towards the optimal caching strategies of peer-assisted VoD systems with HD channels.",
                    "Dynamic regulation of mobile 3G/HSPA uplink buffer with Receiver-side Flow Control.",
                    "Minimizing inter-server communications by exploiting self-similarity in online social networks.",
                    "Delay-based congestion control for multipath TCP.",
                    "ROME: Routing on metropolitan-scale Ethernet.",
                    "eDiscovery: Energy efficient device discovery for mobile opportunistic communications.",
                    "Practical control of transmission power for Wireless Sensor Networks.",
                    "SMART: Lightweight distributed Social Map based Routing in Delay Tolerant Networks.",
                    "Social-P2P: Social network-based P2P file sharing system.",
                    "An ultra-fast universal incremental update algorithm for trie-based routing lookup.",
                    "Efficient and privacy-preserving data aggregation in mobile sensing.",
                    "Towards bandwidth guarantee in multi-tenancy cloud computing networks.",
                    "Energy balanced data collection in Wireless Sensor Networks.",
                    "Range-free localization using grid graph extraction.",
                    "Cost optimization for Online Social Networks on geo-distributed clouds."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th ICNP 2011",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2011",
                "sub_name": "Proceedings of the 19th annual IEEE International Conference on Network Protocols, ICNP 2011, Vancouver, BC, Canada, October 17-20, 2011.",
                "count": 56,
                "papers": [
                    "Towards name-based trust and security for content-centric network.",
                    "Source address validation solution with OpenFlow/NOX architecture.",
                    "LENS: Leveraging social networking and trust to prevent spam transmission.",
                    "A deployable approach for inter-AS anti-spoofing.",
                    "Network-level characteristics of spamming: An empirical analysis.",
                    "Machine learning for implanted malicious code detection with incompletely specified system implementations.",
                    "Shield: DoS filtering using traffic deflecting.",
                    "Argus: An accurate and agile system to detecting IP prefix hijacking.",
                    "Scalable routing easy as PIE: A practical isometric embedding protocol.",
                    "Characterization and design of effective BGP AS-path prepending.",
                    "Inferring a network congestion map with zero traffic overhead.",
                    "Generalized graph products for network design and analysis.",
                    "Link quality aware code dissemination in wireless sensor networks.",
                    "Efficient and fast distributed top-k query protocol in wireless sensor networks.",
                    "Geocast for wireless sensor networks.",
                    "REPICK: Random access MAC with reversed contention and Piggy-backed ACK.",
                    "Understanding and mitigating TCP starvation in 802.11 wireless mesh networks.",
                    "IPv6 evolution, stability and deployment.",
                    "TUNIE: A virtualized platform for network experiment on programmable infrastructure.",
                    "Probabilistic verification of BGP convergence.",
                    "EasyTrace: An easily-deployable light-weight IP traceback on an AS-level overlay network.",
                    "Gaming over COPSS: A content centric communication infrastructure for gaming applications.",
                    "Real-time Netshuffle: Graph distortion for on-line anonymization.",
                    "Striking the balance between content diversity and content importance in swarm-based P2P streaming.",
                    "AIDR: Aggregation of BGP routing table with AS path stretch.",
                    "Self-organizing TDMA for multihop networks.",
                    "OpenRouter: OpenFlow extension and implementation based on a commercial router.",
                    "Network fault localization with small TCB.",
                    "Privacy-preserving cross-domain network reachability quantification.",
                    "EphPub: Toward robust Ephemeral Publishing.",
                    "Efficient data capturing for network forensics in cognitive radio networks.",
                    "What is wrong/right with IEEE 802.11n Spatial Multiplexing Power Save feature?",
                    "The case for addressing the limiting impact of interference on wireless scheduling.",
                    "Win-Coupon: An incentive framework for 3G traffic offloading.",
                    "Out-of-band sensing with ZigBee for dynamic channel assignment in on-the-move hotspots.",
                    "Global optimization of file availability through replication for efficient file sharing in MANETs.",
                    "Contact duration aware data replication in Delay Tolerant Networks.",
                    "A case for coalitions in data swarming systems.",
                    "Building mega data center from heterogeneous containers.",
                    "Scalable data center multicast using multi-class Bloom Filter.",
                    "Analysis of adaptive streaming for hybrid CDN/P2P live video systems.",
                    "Impact of mobility on user-centric routing.",
                    "Improving mobile networks based on social mobility modeling.",
                    "Internet exchange points and Internet routing.",
                    "Energy-efficient routing.",
                    "PhD Forum: On the scalability of source routing architectures.",
                    "Sidekick: AP aggregation over partially overlapping channels.",
                    "Adaptive Subcarrier Nulling: Enabling partial spectrum sharing in wireless LANs.",
                    "Video-Aware Rate Adaptation for MIMO WLANs.",
                    "A practical approach to rate adaptation for multi-antenna systems.",
                    "Dynamic Window Coupling for multipath congestion control.",
                    "Moving bits from 3G to metro-scale WiFi for vehicular network access: An integrated transport layer solution.",
                    "Fast tag searching protocol for large-scale RFID systems.",
                    "J-RoC: A Joint Routing and Charging scheme to prolong sensor network lifetime.",
                    "Correlated flooding in low-duty-cycle wireless sensor networks.",
                    "Anti-jamming communication in cognitive radio networks with unknown channel statistics."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th ICNP 2010",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2010",
                "sub_name": "Proceedings of the 18th annual IEEE International Conference on Network Protocols, ICNP 2010, Kyoto, Japan, 5-8 October, 2010.",
                "count": 33,
                "papers": [
                    "Routing in max-min fair networks: A game theoretic approach.",
                    "Impairment-aware path selection and regenerator placement in translucent optical networks.",
                    "GreenTE: Power-aware traffic engineering.",
                    "Fast routing table lookup based on deterministic multi-hashing.",
                    "Practical Virtual Coordinates for large wireless sensor networks.",
                    "Passive interference measurement in Wireless Sensor Networks.",
                    "ETOC: Obtaining robustness in component-based localization.",
                    "UVOC-MAC: A MAC protocol for outdoor ultraviolet networks.",
                    "Granting silence to avoid wireless collisions.",
                    "Network Coding aware Rate Selection in multi-rate IEEE 802.11.",
                    "Neighbor-specific BGP: An algebraic exploration.",
                    "Assigning AS relationships to satisfy the Gao-Rexford conditions.",
                    "A new VPN routing approach for large scale networks.",
                    "TowerDefense: Deployment strategies for battling against IP prefix hijacking.",
                    "Identifying suspicious activities through DNS failure graph analysis.",
                    "Identification-free batch authentication for RFID tags.",
                    "Authentication and authorization protocol security property analysis with trace inclusion transformation and online minimization.",
                    "Firewall modules and modular firewalls.",
                    "DOTS: A propagation Delay-aware Opportunistic MAC protocol for underwater sensor networks.",
                    "On exploiting transient contact patterns for data forwarding in Delay Tolerant Networks.",
                    "RELICS: In-network realization of incentives to combat selfishness in DTNs.",
                    "Optimal cache-based route repair for real-time traffic.",
                    "CodePlay: Live multimedia streaming in VANETs using symbol-level network coding.",
                    "An opportunistic relay protocol for vehicular road-side access with fading channels.",
                    "Exploring the hidden connectivity in urban vehicular networks.",
                    "Optimal distributed P2P streaming under node degree bounds.",
                    "SocialSwarm: Exploiting distance in social networks for collaborative flash file distribution.",
                    "Peer-assisted VoD prefetching in double auction markets.",
                    "TOP: Tail Optimization Protocol For Cellular Radio Resource Allocation.",
                    "Scalable video multicast with joint layer resource allocation in broadband wireless networks.",
                    "Beyond co-existence: Exploiting WiFi white space for Zigbee performance assurance.",
                    "Message from the General Co-Chairs.",
                    "Message from the technical program committee chairs."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th ICNP 2009",
        "info": "Princeton, NJ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2009",
                "sub_name": "Proceedings of the 17th annual IEEE International Conference on Network Protocols, 2009. ICNP 2009, Princeton, NJ, USA, 13-16 October 2009.",
                "count": 36,
                "papers": [
                    "Topology Control Protocol Using Sectorized Antennas in Dense 802.11 Wireless Networks.",
                    "Accurate Clock Synchronization for IEEE 802.11-Based Multi-Hop Wireless Networks.",
                    "Semi-Random Backoff: Towards Resource Reservation for Channel Access in Wireless LANs.",
                    "A Learning-based Approach for Distributed Multi-Radio Channel Assignment in Wireless Mesh Networks.",
                    "Autonomous deployment of heterogeneous mobile sensors.",
                    "ESC: Energy Synchronized Communication in Sustainable Sensor Networks.",
                    "A Location-free Prediction-based Sleep Scheduling Protocol for Object Tracking in Sensor Networks.",
                    "Scalable IP Lookups using Shape Graphs.",
                    "Better by a HAIR: Hardware-Amenable Internet Routing.",
                    "Bit Weaving: A Non-prefix Approach to Compressing Packet Classifiers in TCAMs.",
                    "Quota: Rationing Server Resources in Peer-Assisted Online Hosting Systems.",
                    "Quality of Name Resolution in the Domain Name System.",
                    "Network Configuration in A Box: Towards End-to-End Verification of Network Reachability and Security.",
                    "Linear-Time Verification of Firewalls.",
                    "Scalable Video Multicast in Multi-carrier Wireless Data Systems.",
                    "oCast: Optimal Multicast Routing Protocol for Wireless Sensor Networks.",
                    "DirCast: A Practical and Efficient Wi-Fi Multicast System.",
                    "End-to-End Versus Hop-by-Hop Soft State Refresh for Multi-hop Signaling Systems.",
                    "SyncTCP: A New Approach to High Speed Congestion Control.",
                    "CUBS: Coordinated Upload Bandwidth Sharing in Residential Networks.",
                    "Multipath load-adaptive routing: putting the emphasis on robustness and simplicity.",
                    "Resilient Routing of Variable Traffic with Performance Guarantees.",
                    "On-line Detection of Real Time Multimedia Traffic.",
                    "EMS: Encoded Multipath Streaming for Real-time Live Streaming Applications.",
                    "A Mismatch Controller for Implementing High-Speed Rate-based Transport Protocols.",
                    "Principles of Safe Policy Routing Dynamics.",
                    "A Hash-based Scalable IP lookup using Bloom and Fingerprint Filters.",
                    "Wheel + Ring = Reel: the Impact of Route Filtering on the Stability of Policy Routing.",
                    "Memory Efficient Protocols for Detecting Node Replication Attacks in Wireless Sensor Networks.",
                    "Attack-Tolerant Distributed Sensing for Dynamic Spectrum Access Networks.",
                    "RASPberry: A Stable Reader Activation Scheduling Protocol in Multi-Reader RFID Systems.",
                    "Topological Detection on Wormholes in Wireless Ad Hoc and Sensor Networks.",
                    "Achieving Efficiency and Fairness for Association Control in Vehicular Networks.",
                    "TCP-Aware Power Control in Wireless Networks.",
                    "A Unified Theory of Scheduling, Flow Control and Routing in Wireless Networks.",
                    "Declarative Policy-based Adaptive MANET Routing."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th ICNP 2008",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2008",
                "sub_name": "Proceedings of the 16th annual IEEE International Conference on Network Protocols, 2008. ICNP 2008, Orlando, Florida, USA, 19-22 October 2008.",
                "count": 33,
                "papers": [
                    "CARS: Context-Aware Rate Selection for vehicular networks.",
                    "CodeOR: Opportunistic routing in wireless mesh networks with segmented network coding.",
                    "New adaptive protocols for fine-level end-to-end rate control in wireless networks.",
                    "Protocol design for scalable and adaptive multicast for group communications.",
                    "Resource-aware video multicasting via access gateways in wireless mesh networks.",
                    "Link layer multicasting with smart antennas: No client left behind.",
                    "IMS presence server: Traffic analysis & performance modelling.",
                    "Rank-indexed hashing: A compact construction of Bloom filters and variants.",
                    "Controlling overload in networks of SIP servers.",
                    "Substream Trading: Towards an open P2P live streaming system.",
                    "Protecting anonymity in dynamic peer-to-peer networks.",
                    "A model-based approach to security flaw detection of network protocol implementations.",
                    "Efficient and accurate protocols for distributed delaunay triangulation under churn.",
                    "Load-aware spectrum distribution in Wireless LANs.",
                    "Optimization based rate allocation and scheduling in TDMA based wireless mesh networks.",
                    "Robust channel assignment for link-level resource provision in multi-radio multi-channel wireless networks.",
                    "Monitoring persistently congested Internet links.",
                    "TCP-Friendly CBR-Like Rate Control.",
                    "Non-Renegable Selective Acknowledgments (NR-SACKs) for SCTP.",
                    "Competitive analysis of buffer policies with SLA commitments.",
                    "Topology dynamics and routing for predictable mobile networks.",
                    "RelayCast: Scalable multicast routing in Delay Tolerant Networks.",
                    "Mobility-centric geocasting for mobile partitioned networks.",
                    "Incentive-aware routing in DTNs.",
                    "An interest-driven approach to integrated unicast and multicast routing in MANETs.",
                    "PRISM: Privacy-friendly routing in suspicious MANETs (and VANETs).",
                    "Byzantine resilient synchronization for content and presence updates in MANETS.",
                    "Routing in intermittently connected sensor networks.",
                    "Component based localization in sparse wireless ad hoc and sensor networks.",
                    "Experimental evaluation of MAC protocols for fairness and QoS support in wireless networks.",
                    "Where's Waldo? practical searches for stability in iBGP.",
                    "A scalable distributed routing protocol for networks with data-path services.",
                    "An approximation algorithm for QoS routing with two additive constraints."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th ICNP 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2007",
                "sub_name": "Proceedings of the IEEE International Conference on Network Protocols, ICNP 2007, October 16-19, 2007, Beijing, China.",
                "count": 42,
                "papers": [
                    "Multicast Algorithms for Multi-Channel Wireless Mesh Networks.",
                    "Throughput Maximization in Multi-channel Wireless Mesh Access Networks.",
                    "Identifying High Throughput Paths in 802.11 Mesh Networks: a Model-based Approach.",
                    "Cooperation Between Stations in Wireless Networks.",
                    "A Probabilistic Coverage Protocol for Wireless Sensor Networks.",
                    "Coverage Without Location Information.",
                    "Slotted Scheduled Tag Access in Multi-Reader RFID Systems.",
                    "Greedy Virtual Coordinates for Geographic Routing.",
                    "Understanding Route Redistribution.",
                    "Inferring the Origin of Routing Changes using Link Weights.",
                    "Geographically Informed Inter-Domain Routing.",
                    "Lexicographic products in metarouting.",
                    "PSM-throttling: Minimizing Energy Consumption for Bulk Data Communications in WLANs.",
                    "Traffic-Aware Channel Assignment in Enterprise Wireless LANs.",
                    "Adaptive Optimization of Rate Adaptation Algorithms in Multi-Rate WLANs.",
                    "Scheduled PSM for Minimizing Energy in Wireless LANs.",
                    "Network-based and Attack-resilient Length Signature Generation for Zero-day Polymorphic Worms.",
                    "A Poisoning-Resilient TCP Stack.",
                    "Routing amid Colluding Attackers.",
                    "Loss and Delay Accountability for the Internet.",
                    "Improving the Convergence and Stability of Congestion Control Algorithm.",
                    "TFRC Veno: An Enhancement of TCP Friendly Rate Control over Wired/Wireless Networks.",
                    "A Simple Model for Analyzing P2P Streaming Protocols.",
                    "Best Effort Session-Level Congestion Control.",
                    "HEXA: Compact Data Structures for Faster Packet Processing.",
                    "A Performance Study of Loss Detection/Recovery in Real-world TCP Implementations.",
                    "TCAM Razor: A Systematic Approach Towards Minimizing Packet Classifiers in TCAMs.",
                    "Source Address Validation: Architecture and Protocol Design.",
                    "Design and Implementation of Cross-Domain Cooperative Firewall.",
                    "FireCracker: A Framework for Inferring Firewall Policies using Smart Probing.",
                    "ALARM: Anonymous Location-Aided Routing in Suspicious MANETs.",
                    "Location Privacy in Sensor Networks Against a Global Eavesdropper.",
                    "PL-Gossip: Area Hierarchy Maintenance in Large-Scale Wireless Sensor Networks.",
                    "Towards Coding-Efficient Link-Scheduling and Coding-Aware Routing in Wireless Networks.",
                    "Supporting VCR in Peer-to-Peer Video-On-Demand.",
                    "FRASA: Feedback Retransmission Approximation for the Stability Region of Finite-User Slotted ALOHA.",
                    "Price of Asynchrony: Queuing under Ideally Smooth Congestion Control.",
                    "Distributed Delay Estimation and Call Admission Control in IEEE 802.11 WLANs.",
                    "Network Court Protocol and Malicious Node Conviction.",
                    "A Game Theoretic Framework of Distributed Power and Rate Control in IEEE 802.11 WLANs.",
                    "A Lightweight Online Network Anomaly Detection Scheme Based on Data Mining Methods.",
                    "An Entropy-Based Throughput Metric for Fairly Evaluating WSN Routing Protocols."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th ICNP 2006",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2006",
                "sub_name": "Proceedings of the 14th IEEE International Conference on Network Protocols, ICNP 2006, November 12-15, 2006, Santa Barbara, California, USA.",
                "count": 33,
                "papers": [
                    "Chunkyspread: Heterogeneous Unstructured Tree-Based Peer-to-Peer Multicast.",
                    "DPTree: A Balanced Tree Based Indexing Framework for Peer-to-Peer Systems.",
                    "Rumor Riding: Anonymizing Unstructured Peer-to-Peer Systems.",
                    "Modeling Heterogeneous User Churn and Local Resilience of Unstructured P2P Networks.",
                    "Forensic Analysis for Epidemic Attacks in Federated Networks.",
                    "Internet Cache Pollution Attacks and Countermeasures.",
                    "Mitigating Attacks Against Measurement-Based Adaptation Mechanisms in Unstructured Multicast Overlay Networks.",
                    "TrueLink: A Practical Countermeasure to the Wormhole Attack in Wireless Networks.",
                    "Impact of Routing Metrics on Path Capacity in Multirate and Multihop Wireless Ad Hoc Networks.",
                    "Reducing Congestion Effects in Wireless Networks by Multipath Routing.",
                    "Orthogonal Rendezvous Routing Protocol for Wireless Mesh Networks.",
                    "Rigorous Protocol Design in Practice: An Optical Packet-Switch MAC in HOL.",
                    "Heterogeneous Congestion Control: Efficiency, Fairness and Design.",
                    "Throughput Guaranteed Restorable Routing Without Traffic Prediction.",
                    "Scaling IP Routing with the Core Router-Integrated Overlay.",
                    "On the Practical and Security Issues of Batch Content Distribution Via Network Coding.",
                    "Vault: A Secure Binding Service.",
                    "Key Grids: A Protocol Family for Assigning Symmetric Keys.",
                    "High Speed Pattern Matching for Network IDS/IPS.",
                    "Virtual Surrounding Face Geocasting with Guaranteed Message Delivery for Ad Hoc and Sensor Networks.",
                    "Benefit-based Data Caching in Ad Hoc Networks.",
                    "A Distributed Algorithm for Joint Sensing and Routing in Wireless Networks with Non-Steerable Directional Antennas.",
                    "RAIN: A Reliable Wireless Network Architecture.",
                    "The Delicate Tradeoffs in BitTorrent-like File Sharing Protocol Design.",
                    "Modeling and Caching of Peer-to-Peer Traffic.",
                    "Characterizing and Mitigating Inter-domain Policy Violations in Overlay Routes.",
                    "Robust Path-Vector Routing Despite Inconsistent Route Preferences.",
                    "Differentiated BGP Update Processing for Improved Routing Convergence.",
                    "Pretty Good BGP: Improving BGP by Cautiously Adopting Routes.",
                    "Robust Egress Interdomain Traffic Engineering.",
                    "O-MAC: A Receiver Centric Power Management Protocol.",
                    "Dynamic Conflict-free Query Scheduling for Wireless Sensor Networks.",
                    "Cross-Layer Exploitation of MAC Layer Diversity in Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th ICNP 2005",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2005",
                "sub_name": "13th IEEE International Conference on Network Protocols (ICNP 2005), 6-9 November 2005, Boston, MA, USA.",
                "count": 42,
                "papers": [
                    "Title Page.",
                    "Copyright.",
                    "Message from the General Co-chairs.",
                    "Message from the Technical Committee Co-chairs.",
                    "Committees.",
                    "External Reviewers.",
                    "Expected Convergence Properties of BGP.",
                    "Stable Egress Route Selection for Interdomain Traffic Engineering: Model and Analysis.",
                    "On Understanding of Transient Interdomain Routing Failures.",
                    "On the Stability of Rational, Heterogeneous Interdomain Route Selection.",
                    "Analyzing the Yield of ExScal, a Large-Scale Wireless Sensor Network Experiment.",
                    "Tracking Targets with Quality inWireless Sensor Networks.",
                    "The Fundamental Role of Hop Distance in IEEE802.11 Multi-Hop Ad Hoc Networks.",
                    "Routing in Ad-hoc Networks with MIMO Links.",
                    "MuON: Epidemic Based Mutual Anonymity.",
                    "Incentives to Promote Availability in Peer-to-Peer Anonymity Systems.",
                    "Exploiting Dynamic Querying like Flooding Techniques in Unstructured Peer-to-Peer Networks.",
                    "Z-Ring: Fast Prefix Routing via a Low Maintenance Membership Protocol.",
                    "Path Vector Face Routing: Geographic Routing with Local Face Information.",
                    "Simple Robotic Routing in Ad Hoc Networks.",
                    "Landmark Guided Forwarding.",
                    "Efficient Hop ID based Routing for Sparse Ad Hoc Networks.",
                    "Optimizing Event Distribution in Publish/Subscribe Systems in the Presence of Policy-Constraints and Composite Events.",
                    "Can coexisting overlays inadvertently step on each other?",
                    "Optimal Routing with Multiple Traffic Matrices Tradeoff between Average andWorst Case Performance.",
                    "Does Over-Provisioning Become More or Less Efficient as Networks Grow Larger?.",
                    "Measuring the Shared Fate of IGP Engineering and Interdomain Traffic.",
                    "Robust Multiclass Signaling Overload Control.",
                    "Modeling and Verification of IPSec and VPN Security Policies.",
                    "Efficient Node Admission for Short-lived Mobile Ad Hoc Networks.",
                    "A Family of Collusion Resistant Protocols for Instantiating Security.",
                    "Typed Abstraction of Complex Network Compositions.",
                    "TCP Connection Game: A Study on the Selfish Behavior of TCP Users.",
                    "Priority Pricing in Utility Fair Networks.",
                    "Trading Precision for Stability in Congestion Control with Probabilistic Packet Marking.",
                    "CONNET: Self-Controlled Access Links for Delay and Jitter Requirements.",
                    "On Static and Dynamic Partitioning Behavior of Large-Scale Networks.",
                    "Shape Shifting Tries for Faster IP Route Lookup.",
                    "Efficient Probabilistic Packet Marking.",
                    "Intersection Characteristics of End-to-End Internet Paths and Trees.",
                    "Adaptive Sleep Scheduling for Energy-efficient Movement-predicted Wireless Communication.",
                    "Stability and Sensitivity for Congestion Control in Wireless Networks with Time Varying Link Capacities."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th ICNP 2004",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2004",
                "sub_name": "12th IEEE International Conference on Network Protocols (ICNP 2004), 5-8 October 2004, Berlin, Germany.",
                "count": 33,
                "papers": [
                    "The Power of Tuning: A Novel Approach for the Efficient Design of Survivable Networks.",
                    "On Self Adaptive Routing in Dynamic Environments - An Evaluation and Design Using a Simple, Probabilistic Scheme.",
                    "Off-Piste QoS-aware Routing Protocol.",
                    "Trail Blazer: A Routing Algorithm Inspired by Ants.",
                    "On the Robustness of Soft State Protocols.",
                    "Implementation and Evaluation of the Cross-Application Signaling Protocol(CASP).",
                    "A Typed Model for Encoding-Based Protocol Interoperability.",
                    "Robustness of Class-Based Path-Vector Systems.",
                    "A Performance vs. Trust Perspective in the Design of End-Point Congestion Control Protocols.",
                    "Congestion Control in Resilient Packet Rings.",
                    "Differential Congestion Notification: Taming the Elephants.",
                    "MPAT: Aggregate TCP Congestion Management as a Building Block for Internet QoS.",
                    "On-Demand Loop-Free Routing with Link Vectors.",
                    "Minimum Energy Multicast Routing for Wireless Ad-hoc Networks with Adaptive Antennas.",
                    "GPER: Geographic Power Efficient Routing in Sensor Networks.",
                    "Gigabit Rate Packet Pattern-Matching Using TCAM.",
                    "Exploiting the Transients of Adaptation for RoQ Attacks on Internet Resources.",
                    "Defending Against Low-Rate TCP Attacks: Dynamic Detection and Protection.",
                    "Key Infection: Smart Trust for Smart Dust.",
                    "Trading Resiliency for Security: Model and Algorithms.",
                    "Semantic Small World: An Overlay Network for Peer-to-Peer Search.",
                    "An Adaptive Protocol for Efficient Support of Range Queries in DHT-Based Systems.",
                    "Sniffing Out the Correct Physical Layer Capture Model in 802.11b.",
                    "SDJS: Efficient Statistics in Wireless Networks.",
                    "Optimizing the Placement of Internet TAPs in Wireless Neighborhood Networks.",
                    "Deafness: A MAC Problem in Ad Hoc Networks when using Directional Antennas.",
                    "Comparing the Structure of Power-Law Graphs and the Internet AS Graph.",
                    "Exploring the Performance Benefits of End-to-End Path Switching.",
                    "Packet-Pair Bandwidth Estimation: Stochastic Analysis of a Single Congested Node.",
                    "Ethernet Topology Discovery without Network Assistance.",
                    "Real-Time Detection of Hidden Traffic Patterns.",
                    "Design and Analysis of a Leader Election Algorithm for Mobile Ad Hoc Networks.",
                    "A Feasibility Study for Power Management in LAN Switches."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th ICNP 2003",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2003",
                "sub_name": "11th IEEE International Conference on Network Protocols (ICNP 2003), 4-7 November 2003, Atlanta, GA, USA.",
                "count": 30,
                "papers": [
                    "Distributed, Self-Stabilizing Placement of Replicated Resources in Emerging Networks.",
                    "Resilient Peer-to-Peer Streaming.",
                    "A File-Centric Model for Peer-to-Peer File Sharing Systems.",
                    "Mobile Distributed Information Retrieval for Highly-Partitioned Networks.",
                    "Planned Object Duplication Strategies in Dynamic PRR Meshes.",
                    "Characterizing Overlay Multicast Networks.",
                    "Optimal Resource Allocation in Overlay Multicast.",
                    "The Impact of False Sharing on Shared Congestion Management.",
                    "RR-TCP: A Reordering-Robust TCP with DSACK.",
                    "Improving TCP Startup Performance Using Active Measurements: Algorithm and Evaluation.",
                    "Packet Classification Using Extended TCAMs.",
                    "Stress Resistant Scheduling Algorithms for CIOQ Switches.",
                    "Delay Analysis of IEEE 802.11 in Single-Hop Networks.",
                    "The AD-MIX Protocol for Encouraging Participation in Mobile Ad Hoc Networks.",
                    "Power Adaptive Broadcasting with Local Information in Ad Hoc Networks.",
                    "Reliability-Aware IBGP Route Re.ection Topology Design.",
                    "The Temporal and Topological Characteristics of BGP Path Changes.",
                    "An Efficient Algorithm for OSPF Subnet Aggregation.",
                    "Network Time Synchronization Using Clock Offset Optimization.",
                    "Matchmaker: Signaling for Dynamic Publish/Subscribe Applications.",
                    "Systematic Verification of Safety Properties of Arbitrary Network Protocol Compositions Using CHAIN.",
                    "Exploiting Routing Redundancy via Structured Peer-to-Peer Overlays.",
                    "Ulysses: A Robust, Low-Diameter, Low-Latency Peer-ti-Peer Network.",
                    "On the Cost-Quality Tradeoff in Topology-Aware Overlay Path Probing.",
                    "Dynamic Clustering for Acoustic Target Tracking in Wireless Sensor Networks.",
                    "Non-Uniform Information Dissemination for Sensor Networks.",
                    "Data Dissemination with Ring-Based Index for Wireless Sensor Networks.",
                    "A Bidding Protocol for Deploying Mobile Sensors.",
                    "Establishing Pairwise Keys for Secure Communication in Ad Hoc Networks: A Probabilistic Approach.",
                    "On the Utility of Distributed Cryptography in P2P and MANETs: The Case of Membership Control."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th ICNP 2002",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2002",
                "sub_name": "10th IEEE International Conference on Network Protocols (ICNP 2002), 12-15 November 2002, Paris, France, Proceedings.",
                "count": 43,
                "papers": [
                    "Effectiveness of Loss Labeling in Improving TCP Performance in Wired/Wireless Networks.",
                    "Half-Pipe Anchoring: An Efficient Technique for Multiple Connection Handoff.",
                    "Architecture and Design of New Multimedia Multicast Protocols.",
                    "pTCP: An End-to-End Transport Layer Protocol for Striped Connections.",
                    "A Case for Exploiting Self-Similarity of Network Traffic in TCP.",
                    "Hybrid Channel Access Scheduling in Ad Hoc Networks.",
                    "Incentive Engineering in Wireless LAN Based Access Networks.",
                    "Performance of Collision Avoidance Protocols in Single-Channel Ad Hoc Networks.",
                    "A Secure Routing Protocol for Ad Hoc Networks.",
                    "Analysis of the MED Oscillation Problem in BGP.",
                    "QoS Extension to BGP.",
                    "Routing Bandwidth Guaranteed Paths with Local Restoration in Label Switched Networks.",
                    "A Formal Approach for Passive Testing of Protocol Data Portions.",
                    "Specification and Analysis of the DCF and PCF Protocols in the 802.11 Standard Using Systems of Communicating Machines.",
                    "A Theory of Window-Based Unicast Congestion Control.",
                    "Sync-MS: Synchronized Messaging Service for Real-Time Multi-Player Distributed Games.",
                    "Clustering Web Content for Efficient Replication.",
                    "On Efficient On-Line Grouping of Flows with Shared Bottlenecks at Loaded Servers.",
                    "XCHOKE: Malicious Source Control for Congestion Avoidance at Internet Gateways.",
                    "Allocation of Protection Domains in Dynamic WDM Mesh Networks.",
                    "Optimal Stream Replication for Video Simulcasting.",
                    "Power Mode Scheduling for Ad Hoc Networks.",
                    "RED-Worcester - Traffic Sensitive Active Queue Management.",
                    "A Multicast Transport Protocol for Cooperative Media Distribution.",
                    "Auction or Tâtonnement - Finding Congestion Prices for Adaptive Applications.",
                    "PEAS: A Robust Energy Conserving Protocol for Long-lived Sensor Networks.",
                    "Key Management for Heterogeneous Ad Hoc Wireless Networks.",
                    "Using Adaptive Rate Estimation to Provide Enhanced and Robust Transport over Heterogeneous Networks.",
                    "Design and Implementation of a TCP-Friendly Transport Protocol for Ad Hoc Wireless Networks.",
                    "A Lightweight, Robust P2P System to Handle Flash Crowds.",
                    "Backup Path Allocation Based on a Correlated Link Failure Probability Model in Overlay Networks.",
                    "Mobile Adventure with Next Generations Research.",
                    "A Simple and Scalable Fair Bandwidth Sharing Mechanism for Multicast Flows.",
                    "Dynamic Routing of Bandwidth Guaranteed Multicasts with Failure Backup.",
                    "Fast and Scalable Conflict Detection for Packet Classifiers.",
                    "Prefix-Preserving IP Address Anonymization: Measurement-Based Security Evaluation and a New Cryptography-Based Scheme.",
                    "IPv4+4.",
                    "IP Traceback-Based Intelligent Packet Filtering: A Novel Technique for Defending against Internet DDoS Attacks.",
                    "Attacking DDoS at the Source.",
                    "Distributed Collaborative Key Agreement Protocols for Dynamic Peer Groups.",
                    "Service Overlay Networks: SLAs, QoS and Bandwidth Provisioning.",
                    "An Ultra-fast Shared Path Protection Scheme - Distributed Partial Information Management, Part II.",
                    "An Investigation of Inter-Domain Control Aggregation Procedures."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "9th ICNP 2001",
        "info": "Riverside, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2001",
                "sub_name": "9th International Conference on Network Protocols (ICNP 2001), 11-14 November 2001, Riverside, CA, USA.",
                "count": 36,
                "papers": [
                    "Distributed Token Circulation on Mobile Ad Hoc Networks.",
                    "On-Demand Multi Path Distance Vector Routing in Ad Hoc Networks.",
                    "Conserving Transmission Power in Wireless Ad Hoc Networks.",
                    "Recursive Position Estimation in Sensor Networks.",
                    "Adapting to Route-Demand and Mobility (ARM) in Ad Hoc Network Routing.",
                    "An Experimental Analysis of BGP Convergence Time.",
                    "Quality of Service Routing Algorithms for Bandwidth-Delay Constrained Applications.",
                    "Routing Bandwidth Guaranteed Paths with Restoration in Label Switched Networks.",
                    "Source Filtering in IP Multicast Routing.",
                    "Making QoS Aware Multicast Scalable in Terms of Link State Advertisement.",
                    "Channelization Problem in Large Scale Data Dissemination.",
                    "An Efficient QoS Routing Algorithm for Quorumcast Communication.",
                    "Dynamic Class Selection: From Relative Differentiation to Absolute QoS.",
                    "Fundamental Trade-offs in Aggregate Packet Scheduling.",
                    "A Memory-Based Approach for a TCP-Friendly Traffic Conditioner in DiffServ Networks.",
                    "Drop Strategies and Loss-Rate Differentiation.",
                    "TCP-Friendly SIMD Congestion Control and Its Convergence Behavior.",
                    "Transport Level Mechanisms for Bandwidth Aggregation on Mobile Hosts.",
                    "TCP over Load-Reactive Links.",
                    "The War between Mice and Elephants.",
                    "Controlling High-Bandwidth Flows at the Congested Router.",
                    "Optimal Admission Control Algorithms for Scheduling Burst Data in CDMA Multimedia Systems.",
                    "Providing Quality of Service Guarantees without Per-Flow State.",
                    "Comparative Evaluation of Software Implementation of Layer-4 Packet Classification Schemes.",
                    "Using Dynamic Buffer Limiting to Protect against Belligerent Flows in High-Speed Networks.",
                    "Fast Firewall Implementations for Software and Hardware-Based Routers.",
                    "Providing Robust and Ubiquitous Security Support for Mobile Ad Hoc Networks.",
                    "Scalable Secure Group Communication over IP Multicast.",
                    "Responder Anonymity and Anonymous Peer-to-Peer File Sharing.",
                    "Scalable Socket Buffer Tuning for High-Performance Web Servers.",
                    "Evaluation of a Novel Two-Step Server Selection Metric.",
                    "Finding Close Friends on the Internet.",
                    "Internet User Access via Dial-up Networks - Traffic Characterization and Statistics.",
                    "Fast and Robust Signaling Overload Control.",
                    "Robust Congestion Signaling.",
                    "Second-Order Rate-Control Based Transport Protocols."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th ICNP 2000",
        "info": "Osaka, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/2000",
                "sub_name": "Eighth Annual International Conference on Network Protocols, ICNP 2000, 14-17 November, 2000, Osaka, Japan.",
                "count": 30,
                "papers": [
                    "Hop Integrity in Computer Networks.",
                    "TCP-Probing: Towards an Error Control Schema with Energy and Throughput Performance Gains.",
                    "Robust Identification of Shared Losses Using End-to-End Unicast Probes.",
                    "A Scalable Monitoring Approach for Service Level Agreements Validation.",
                    "Differentiated Predictive Fair Service for TCP Flows.",
                    "Dynamic Internet Overlay Deployment and Management Using the X-Bone.",
                    "Coordinated Network Scheduling: A Framework for End-to-End Services.",
                    "RMCM: Reliable Multicasts for Core-based Multicast Trees.",
                    "Analysis of Internet Multicast Traffic Performance Considering Multicast Routing Protocol.",
                    "An Analysis of Multicast Forwarding State Scalability.",
                    "IP Multicast Fault Recovery in PIM over OSPF.",
                    "Optimal Partitioning of Multicast Receivers.",
                    "Monitoring Reachability in the Global Multicast Infrastructure.",
                    "An Analysis of Packet Loss Correlation in FEC-Enhanced Multicast Trees.",
                    "Time-Lined TCP for the TCP-Friendly Delivery of Streaming Media.",
                    "Analysis and Improvement of Fairness between TCP Reno and Vegas for Deployment of TCP Vegas to the Internet.",
                    "General AIMD Congestion Control.",
                    "TCP Performance Analysis on Asymmetric Networks Composed of Satellite and Terrestrial Links.",
                    "An Image Transport Protocol for the Internet.",
                    "Practical Explicit Binding Interface for Supporting Multiple Transport Protocols in a CORBA System.",
                    "Building a Programmable Multiplexing Service Using Concast.",
                    "GeoTORA: A Protocol for Geocasting in Mobile Ad Hoc Networks.",
                    "SCalable Object-tracking through Unattended Techniques (SCOUT).",
                    "Malicious Packet Dropping: How It Might Impact the TCP Performance and How We Can Detect It.",
                    "Convergent Multi-Path Routing.",
                    "A Performance Study of Multiple Access Control Protocols for Wireless Multimedia Services.",
                    "Characterization and Performance Evaluation for Proportional Delay Differentiated Services.",
                    "Generalized Load Sharing for Packet-Switching Networks.",
                    "Multidomain Load Balancing.",
                    "A Topology-Independent Fair Queueing Model in Ad Hoc Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "7th ICNP 1999",
        "info": "Toronto, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1999",
                "sub_name": "Seventh Annual International Conference on Network Protocols, ICNP 1999, 31 October - 3 November, 1999, Toronto, Canada, Proceedings.",
                "count": 36,
                "papers": [
                    "Automated Protocol Implementations Based on Activity Threads.",
                    "Dynamic Memory Model Based Framework for Optimization of IP Address Lookup Algorithms.",
                    "Policy Disputes in Path-Vector Protocols.",
                    "Fault Detection in Routing Protocols.",
                    "Receiver-Cooperative Bandwidth Management for Layered Multicast.",
                    "Receiver-Initiated Group Membership Protocol (RGMP): A New Group Management Protocol for IP Multicasting.",
                    "Centralized Multicast.",
                    "Optimal Allocation of Clients to Replicated Multicast Servers.",
                    "Scaling End-to-End Multicast Transports with a Topologically-Sensitive Group Formation Protocol.",
                    "WDM Multicasting in IP over WDM Networks.",
                    "Evaluating the Utility of FEC with Reliable Multicast.",
                    "A Logical Ring Reliable Multicast Protocol for Mobile Nodes.",
                    "ERUF: Early Regulation of Unresponsive Best-Effort Traffic.",
                    "An In-Depth Look at Flow Aggregation for Efficient Quality of Service.",
                    "NBQ: Neighbor-State Based Queuing for Adaptive Bandwidth Sharing.",
                    "Evaluation of Bandwidth Broker Signaling.",
                    "Minimum Rate Guarantee Without Per-Flow Information.",
                    "A New Proposal for RSVP Refreshes.",
                    "Effect of Unreliable Nodes on QoS Routing.",
                    "How to Make Assured Service More Assured.",
                    "Empirical TCP Profiles and Application.",
                    "On Individual and Aggregate TCP Performance.",
                    "Improving TCP Congestion Control over Internets with Heterogeneous Transmission Media.",
                    "TCP Trunking: Design, Implementation and Performance.",
                    "The Havana Framework for Supporting Application and Channel Dependent QOS in Wireless Networks.",
                    "A Distributed Scheduling Algorithm for Quality of Service Support in Multiaccess Networks.",
                    "Fluid Analysis of Delay Performance for QoS Support in Wireless Networks.",
                    "Scheduling in Wireless Networks with Multiple Transmission Channels.",
                    "Source-Tree Routing in Wireless Networks.",
                    "HAWAII: A Domain-based Approach for Supporting Mobility in Wide-Area Wireless Networks.",
                    "Analysis of Caching-Based Location Management in Personal Communication Networks.",
                    "Wave and Wait Protocol (WWP): An Energy-Saving Transport Protocol for Mobile IP-Devices.",
                    "Smoothing and Prefetching Video from Distributed Servers.",
                    "Analysis of Receiver Adaptation for Layered Video Transmission over Heterogeneous Networks: A Microscopic Perspective.",
                    "A Behavioral Model of Web Traffic.",
                    "Concast: Design and Implementation of a New Network Service."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "6th ICNP 1998",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1998",
                "sub_name": "1998 International Conference on Network Protocols (ICNP '98), October 13-16, 1998, Austin, Texas, USA.",
                "count": 36,
                "papers": [
                    "Linear Complexity Algorithms for Bandwidth Reservations and Delay Guarantees in Input-Queued Switches with No Speedup.",
                    "EtheReal: A Host-Transparent Real-Time Fast Ethernet Switch.",
                    "A Definition of General Weighted Fairness and its Support in Explicit Rate Switch Algorithms.",
                    "Reasoning About Active Network Protocols.",
                    "Evaluating the Overheads of Source-Directed Quality-of-Service Routing.",
                    "Scalable Link-State Internet Routing.",
                    "Statistical Anomaly Detection for Link-State Routing Protocols.",
                    "Maximizable Routing Metrics.",
                    "On Reducing the Processing Cost of On-Demand QoS Path Computation.",
                    "Preserving Quality of Service Guarantees in Spite of Flow Aggregation.",
                    "A Distributed Protocol for Multi-Class QoS Provision in Noncooperative Many-Switch Systems.",
                    "Adaptive Packet Marking for Providing Differentiated Services in the Internet.",
                    "Distributed Network Flow Control based on Dynamic Competitive Markets.",
                    "Flow Theory: An Enhancement.",
                    "A Class of End-to-End Congestion Control Algorithms for the Internet.",
                    "A Lossless, Minimal Latency Protocol for Gigabit ATM Networks.",
                    "Controlling Quality of Session in Adaptive Multimedia Multicast Systems.",
                    "Congestion Control Performance of a Reliable Multicast Protocol.",
                    "Darwin: Customizable Resource Management for Value-Added Network Services.",
                    "Resource Management for Quality of Service Guarantees in Multi-Party Multimedia Application.",
                    "Digital Signatures for Flows and Multicasts.",
                    "Composition of Service Specifications.",
                    "A Proof Technique for Liveness Properties of Multifunction Composite Protocols.",
                    "Formal Verification of Safety and Performance Properties of TCP Selective Acknowledgment.",
                    "OTERS: (On-Tree Efficient Recovery using Subcasting): A Reliable Multicast Protocol.",
                    "Multicasting at the Host Interface Level in Wormhole Networks.",
                    "Receiver-based Multicast Scoping: A New Cost-Conscious Join/Leave Paradigm.",
                    "On-Demand Multicast in Mobile Wireless Networks.",
                    "A State Management Protocol for IntServ, DiffServ and Label Switching.",
                    "Certificate Path Generation Protocol (CPGP) for Authenticated Signaling in ATM Networks.",
                    "Distributed Packet Rewriting and its Application to Scalable Server Architectures.",
                    "Signaling for Internet Telephony.",
                    "Applying MSTDM to Packet Voice and Data in Cellular Radio Systems.",
                    "Performance of Voice/Data Integration for Two MAC Protocols in DS-CDMA Wireless Networks.",
                    "Improving Wireless LAN Performance via Adaptive Local Error Control.",
                    "QGMA: A New MAC Protocol for Supporting QoS in Wireless Local Area Networks."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th ICNP 1997",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1997",
                "sub_name": "1997 International Conference on Network Protocols (ICNP '97), 28-31 October 1997, Atlanta, GA, USA.",
                "count": 31,
                "papers": [
                    "High speed, scalable, and accurate implementation of packet fair queueing algorithms in ATM networks.",
                    "ABR service for applications with non-linear bandwidth utility functions.",
                    "On multicasting ABR protocols for wireless ATM networks.",
                    "Optimal Feedback Control for ABR Service in ATM.",
                    "Carrier-sense protocols for packet-switched smart antenna basestations.",
                    "User Agents and Flexible Messages: A New Approach to Wireless Two-Way Messaging.",
                    "A Join--the--Shortest--Queue Prefetching Protocol for VBR Video on Demand.",
                    "Migrating Sockets for networking with quality of service guarantees.",
                    "Once-and-for all management protocol (OFMP).",
                    "Group leader election under link-state routing.",
                    "A Compositional Approach for Designing Multifunction Time-Dependent Protocols.",
                    "Passive testing and applications to network management.",
                    "On-line Dynamic Bandwidth Allocation.",
                    "Admission Control and Loss Management for an Application-Level Statistical Service.",
                    "Design and implementation of a real-time switch for segmented Ethernets.",
                    "QoS based routing algorithm in integrated services packet networks.",
                    "Routing guaranteed quality of service connections in integrated services packet networks.",
                    "Load Profiling for Efficient Route Selection in Multi-Class Networks.",
                    "On path selection for traffic with bandwidth guarantees.",
                    "TCP behavior with many flows.",
                    "Improved virtual queueing and dynamic EPD techniques for TCP over ATM.",
                    "Active networking and the end-to-end argument.",
                    "TCP-R: TCP mobility support for continuous operation.",
                    "Improving Internet multicast with routing labels.",
                    "Practical Multicasting on a Nonbroadcast Subnetwork.",
                    "A cooperative packet recovery protocol for multicast video.",
                    "Application-Layer Group Communication Server for Extending Reliable Multicast Protocols Services.",
                    "Balanced Routing.",
                    "Dynamic host routing for production use of developmental networks.",
                    "An experimental study of insider attacks for OSPF routing protocol.",
                    "Traffic Dispersion and Its Impact on ATM Protocol Functions."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "4th ICNP 1996",
        "info": "Columbus, Ohio, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1996",
                "sub_name": "1996 International Conference on Network Protocols, ICNP 1996, October 29 - November 1, 1996, Columbus, Ohio, USA.",
                "count": 30,
                "papers": [
                    "Time-Shift Scheduling: Fair Scheduling of Flows in High Speed Networks.",
                    "An Efficient Adaptive Search Algorithm for Scheduling Real-Time Traffic.",
                    "End-to-End Scheduling in Real-Time Packet-Switched Networks.",
                    "A Video Retrieval Protocol with Video Data Prefetch and Packet Retransmission Considering Play-out Dead Line.",
                    "Quality of Service Support in High Speed, Wormhole Routing Networks.",
                    "Group communication protocol for flexible distributed systems.",
                    "Protocol Portability through Module Encapsulation.",
                    "Optimization problems from feature testing of communication protocols.",
                    "Partial-Order Validation for Multi-Process Protocols Modeled as Communicating Finite State Machines.",
                    "Fault tolerant multiple observers using error control codes.",
                    "Timed Reachability Analysis Method for EFSM-based Communication Protocols and Its Experimental Evaluation.",
                    "Flow Control Techniques for Multicasting in Gigabit Networks.",
                    "Novel algorithms for multicast communication in self-routing MIN-based ATM switches.",
                    "A Comparison of Known Classes of Reliable Multicast Protocols.",
                    "A Simple Host Deflection Scheme for High-Speed LANs Using Wormhole Routing.",
                    "Dynamic Routing of Real-Time Virtual Circuits.",
                    "Setup-Trail-Avoidance Routing Algorithm.",
                    "Full Utilization, Fairness and Bounded Access Delay on High Speed Bus Networks.",
                    "Architectural Concepts in Implementation of End-system Protocols for High Performance Communications.",
                    "On the relationship between file sizes, transport protocols, and self-similar network traffic.",
                    "Performance Analysis of a CAN / CAN Bridge.",
                    "A cooperative congestion management scheme for switched high-speed networks.",
                    "Evaluation of ABR Congestion Control Protocols for ATM LAN and WAN.",
                    "Congestion Control in TCP: Performance of Binary Congestion Notification Enhanced TCP Compared to Reno and Tahoe TCP.",
                    "Protocol Specification Using Parameterized Communicating Extended Finite Stte Machines - A Case Study of The ATM ABR Rate Control Scheme.",
                    "A Protocol for Supporting the ABT/DT Capability.",
                    "The token-bank leaky bucket mechanism for group connections in ATM networks.",
                    "An efficient distributed channel allocation algorithm based on dynamic channel boundaries.",
                    "A traffic oriented pre-arbitrated slot reuse scheme in DQDB networks.",
                    "An Efficient Protocol for Call Setup and Path Migration in IEEE 802.6 Based Personal Communication Networks."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "3rd ICNP 1995",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1995",
                "sub_name": "1995 International Conference on Network Protocols, ICNP 1995, November 7-10, 1995, Tokyo, Japan.",
                "count": 42,
                "papers": [
                    "Generalized fair reachability analysis for cyclic protocols with nondeterministic and internal transitions.",
                    "Verification and diagnosis of testing equivalence and reduction relation.",
                    "Similarity for reuse of specifications in communication software development.",
                    "A dynamic bandwidth allocation scheme for multimedia data over ATM networks.",
                    "Simulation study of a run-time bandwidth assignment technique for delay sensitive traffic in high-speed network.",
                    "On guaranteed bandwidth channels.",
                    "A protocol synthesis algorithm: a relational approach.",
                    "Extension of protocol synthesis to structured entities.",
                    "Protocol synthesis from timed and structured specifications.",
                    "Design and implementation of a multicast-buffer ATM switch.",
                    "Design of ATM switch using hypercube with distributed shared input buffers and dedicated output buffers.",
                    "Performance analysis of an ATM switch with multiple paths.",
                    "Validation of distributed algorithms and protocols.",
                    "Protocol visualization using LOTOS multi-rendezvous mechanism.",
                    "Protocol synthesis using basic Lotos and global variables.",
                    "A fuzzy decision maker for source traffic control in high speed networks.",
                    "ATM admission models of stochastic high level Petri nets based on hierarchical modeling.",
                    "Using traffic regulation to meet end-to-end deadlines in ATM LANs.",
                    "A robust transport protocol for run-time fault detection.",
                    "Implementation method of high speed protocol as transport library.",
                    "The interaction between the V protocol and the Q.293I protocol for the interactive video network.",
                    "A wireless link protocol: design by refinement.",
                    "Mobile real-time communications in FDDI networks.",
                    "Multimedia transport in multihop dynamic packet radio networks.",
                    "A society of cooperative agents on the information network: towards intelligent information gathering.",
                    "A Framework for Flexible Networking.",
                    "Distributed protocol for selective intra-group communication.",
                    "Multimedia synchronization for live presentation using the N-buffer approach.",
                    "A synchronization and compensation protocol for multimedia communication systems.",
                    "Petri net models for describing multimedia synchronization requirements.",
                    "TCP/IP and the European ATM pilot.",
                    "Internetworking between OSI and TCP/IP network managements with security features.",
                    "Networking abstractions and protocols under variable length messages.",
                    "Service and connection management architecture for distributed multimedia applications.",
                    "A call model for multimedia multiuser communication platform.",
                    "Protocol architectures for delivering application specific quality of service.",
                    "A timing-based schema for stabilizing information exchange.",
                    "A neural network approach to multicast routing in real-time communication networks.",
                    "A routing protocol for finding two node-disjoint paths in computer networks.",
                    "Buffer insertion/self-token (BIST) protocol for multimedia LANs.",
                    "Nonpreemptive scheduling algorithms for multimedia communication in local area networks.",
                    "A reliable ordered delivery protocol for interconnected local area networks."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "2nd ICNP 1994",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1994",
                "sub_name": "1994 International Conference on Network Protocols, ICNP 1994, Boston, MA, USA, October 25-28, 1994, Proceedings.",
                "count": 28,
                "papers": [
                    "Multicast transport protocols for high speed networks.",
                    "DUALCAST: a scheme for reliable multicasting.",
                    "Elements of trusted multicasting.",
                    "Throughput efficiency of a link management procedure for LEO satellite systems.",
                    "An iterative approach to comprehensive performance evaluation of integrated services networks.",
                    "Automatic retransmission rather than automatic repeat request.",
                    "Stutter XOR strategies: a new class of multicopy ARQ strategies.",
                    "Test path selection based on effective domains.",
                    "Automated generation of protocol test sequences from formal specifications.",
                    "Design, verification and implementation of an authentication protocol.",
                    "The ID-based non-interactive group communication key sharing scheme using smart cards.",
                    "Generalized fair reachability analysis for cyclic protocols: decidability for logical correctness problems.",
                    "Specification and validation of communications in client/server models.",
                    "Symbolic simulation: theory and application to protocol modeling and validation.",
                    "Single-link and time communicating finite state machines.",
                    "Stepwise telecommunication software generation from service specifications in state transition model.",
                    "Automated synthesis of protocol specifications with message collisions and verification of timeliness.",
                    "On the construction of multiphase communication protocols.",
                    "A design method for communications software evolution.",
                    "The Totem protocol development environment.",
                    "Formalizations and algorithms for optimized parallel protocol implementation.",
                    "Multi-rate traffic shaping and end-to-end performance guarantees in ATM networks.",
                    "A simulation study of the impact of mobility on TCP/IP.",
                    "Distributed synchronization protocols for multimedia services on Internet.",
                    "Selective total-ordering group communication on single high-speed channel.",
                    "Fault-tolerant reconfiguration of trees and rings in networks.",
                    "Fault-tolerant convergence routing.",
                    "Dynamics of token ring protocols."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "1st ICNP 1993",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/icnp/1993",
                "sub_name": "1993 International Conference on Network Protocols, ICNP 1993, San Francisco, CA, USA, October 19-22, 1993, Proceedings.",
                "count": 42,
                "papers": [
                    "Parallel and configurable protocols: experiences with a prototype and an architectural framework.",
                    "Multiprotocol transport networking: a general internetworking solution.",
                    "A highly parallelized architecture for a DQDB node.",
                    "Verifying authentication protocols: methodology and example.",
                    "Modulo-N incarnation numbers for cache-based transport protocols.",
                    "Modularization of a specification in LOTOS.",
                    "A CLNP-based protocol for mobile end systems within an area.",
                    "An approach to hierarchical inter-domain routing with on-demand ToS and policy resolution.",
                    "An architecture for virtual circuit/QoS routing.",
                    "Beyond layering: modularity considerations for protocol architectures.",
                    "A compositional approach for designing protocols.",
                    "Modules as building blocks for protocol configuration.",
                    "The FCVC (flow-controlled virtual channels) proposal for ATM networks: a summary.",
                    "Service specific connection oriented protocol for the ATM adaptation layer.",
                    "The generic flow control (GFC) protocol: a performance assessment.",
                    "A note on communicating machines with identical symmetrical and dual processes using rewriting systems.",
                    "Decidability issues in reduced reachability analysis.",
                    "On Petri nets and self-stabilization of communication protocols.",
                    "A congestion notification technique for SMDS networks.",
                    "Adaptive rate-based congestion control versus TCP-SS: a performance comparison.",
                    "Flow theory: Verification of rate-reservation protocols.",
                    "Reverse-engineering of communication protocols.",
                    "Generating maximal fault coverage conformance test sequences of reduced length for communication protocols.",
                    "Automatic test case generation for Estelle.",
                    "Improved randomized broadcast protocols in multi-hop radio networks.",
                    "A multicast mechanism with ordering on overlapping groups.",
                    "Consistency algorithms for optimistic replication.",
                    "Galileo: A tool for simulation and analysis of real-time networks.",
                    "Mushroom: a program for the automated verification of an SCM protocol specification.",
                    "From formal specification to implementation: experience with protocol tools.",
                    "Enhancing SCI's fairness protocol for increased throughput.",
                    "On token protocols for high-speed multiple-ring networks.",
                    "An optical network interface unit for multichannel ring networks.",
                    "Hierarchy-based incremental analysis of communication protocols.",
                    "An Estelle interpreter for incremental protocol verification.",
                    "Verifying Estelle specifications: numerical Petri nets approach.",
                    "Routing and congestion control in ATM networks.",
                    "A novel neural network traffic descriptor for ATM networks.",
                    "An approach to evaluating the performance of communication protocols based on formal specifications.",
                    "Probabilistic conformance testing of protocols with unobservable transitions.",
                    "A framework for interoperability testing of network protocols.",
                    "Language-based analysis of communicating finite state machines."
                ]
            }
        ]
    }
]