[
    {
        "year": "2021",
        "name": "17th Integrated Network Management 2021",
        "info": "Bordeaux, France",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2021",
                "sub_name": "17th IFIP/IEEE International Symposium on Integrated Network Management, IM 2021, Bordeaux, France, May 17-21, 2021.",
                "count": 160,
                "papers": [
                    "PINBALL: Universal and Robust Signature Extraction for Smart Home Devices.",
                    "Recovery Process Visualization based on Automaton Construction.",
                    "StepNet: A Compositional Framework with Reduced Querying for Homing Complex Network Services.",
                    "BluePIL: a Bluetooth-based PassIve Localization Method.",
                    "Coordination between Radio and Computing Schedulers in Cloud-RAN.",
                    "Decentralized Dynamic Gate Scheduling of IEEE 802.1Qbv Time Aware Shaper and a TSN Simulator for Tactile Cyber-Physical Systems.",
                    "Divide and Conquer: Hierarchical Network and Service Coordination.",
                    "Automation and Multi-Objective Optimization of Virtual Network Embedding.",
                    "Tofino + P4: A Strong Compound for AQM on High-Speed Networks?",
                    "Efficient Modelling of ICS Communication For Anomaly Detection Using Probabilistic Automata.",
                    "MOBO-NFV: Automated Tuning of a Network Function Virtualization System using Multi-Objective Bayesian Optimization.",
                    "Towards a Novel Congestion Notification Algorithm for a Software-Defined Data Center Networks.",
                    "FEDCON: An embeddable Framework for Managing MOC Functions and Interfaces in Federated Software Networks.",
                    "ML-Assisted Latency Assignments in Time-Sensitive Networking.",
                    "Multi-time-step Segment Routing based Traffic Engineering Leveraging Traffic Prediction.",
                    "Online Learning under Resource Constraints.",
                    "Adaptive Observation of Emerging Cyber Attacks targeting Various IoT Devices.",
                    "A Workflow Management Framework for the Dynamic Generation of Workflows that is Independent of the Application Environment.",
                    "DESTIN: Detecting State Transitions in Network elements.",
                    "Path-Link Graph Neural Network for IP Network Performance Prediction.",
                    "Towards QoS-aware Provisioning of Chained Virtual Security Services in Edge Networks.",
                    "Programmable Low-End Networks: Powering Internet Connectivity for the Other Three Billion.",
                    "sfc2cpu: Operating a Service Function Chain Platform with Neural Combinatorial Optimization.",
                    "PMAKE: Physical Unclonable Function-based Mutual Authentication Key Exchange Scheme for Digital Aeronautical Communications.",
                    "Latent Semantics Approach for Network Log Analysis: Modeling and its application.",
                    "Distributed Utility Maximization From the Edge in IP Networks.",
                    "ezNL2SQL: A System for Network Devices Management with a Natural Language Interface for Databases.",
                    "Cost-efficient Placement and Scaling of 5G Core Network and MEC-enabled Application VNFs.",
                    "VNFAccel: An FPGA-based Platform for Modular VNF Components Acceleration.",
                    "High-Precision End-to-End Latency Guarantees Using Packet Wash.",
                    "On the Practical Detection of Heavy Hitter Flows.",
                    "Experimental Validation of Compute and Network Resource Abstraction and Allocation Mechanisms within an NFV Infrastructure.",
                    "QoE-Aware Container Scheduler for Co-located Cloud Environments.",
                    "Impact of wired telecommunication network latency on demand-side management in smart grids.",
                    "PhysarumSM: P2P Service Discovery and Allocation in Dynamic Edge Networks.",
                    "Bulk Transfer Scheduling with Deadline in Best-Effort SD-WANs.",
                    "Improved CRL Distribution point for Cooperative Intelligent Transportation Systems.",
                    "Delay-aware Slicing and MAC Management using MCDA in IEEE 802.11 SD-RANs.",
                    "Performance Management on Multiple Communication Paths for Portable Assisted Living.",
                    "LINT: Accuracy-adaptive and Lightweight In-band Network Telemetry.",
                    "InREC: In-network REal Number Computation.",
                    "On the Transition of Legacy Networks to SDN - An Analysis on the Impact of Deployment Time, Number, and Location of Controllers.",
                    "Encrypted Network Traffic Classification Using a Geometric Learning Model.",
                    "Deep-Quality-EON Classifier.",
                    "BUNGEE: An Adaptive Pushback Mechanism for DDoS Detection and Mitigation in P4 Data Planes.",
                    "RFT: Scalable and Fault-Tolerant Microservices for the O-RAN Control Plane.",
                    "Scalable TCP Throughput Limitation Monitoring.",
                    "Impact of Heterogeneous Neutrality Rules with Competitive Content Providers.",
                    "Network Service Embedding for Cross-Service Communication.",
                    "Resource Provisioning in Fog Computing through Deep Reinforcement Learning.",
                    "C2QoS: CPU-Cycle based Network QoS Strategy in vSwitch of Public Cloud.",
                    "Fault Detection of ICT systems with Deep Learning Model for Missing Data.",
                    "Signaling Traffic in Internet-of-Things Mobile Networks.",
                    "The Horizontal INR Conflict-Detection Algorithm: Revealing INR Reallocation and Reauthorization in RPKI.",
                    "Reinforcement Learning for value-based Placement of Fog Services.",
                    "Optimized Contextual Data Offloading in Mobile Edge Computing.",
                    "Self-sovereign Identity Management in Wireless Ad Hoc Mesh Networks.",
                    "Container-based Service State Management in Cloud Computing.",
                    "Optimal configuration determination in Cognitive Autonomous Networks.",
                    "Joint resource management and action scheduling for carrier-grade NFV.",
                    "Adversarial Exploitation of P4 Data Planes.",
                    "Application Layer Packet Classifier in Hardware.",
                    "A Distributed Congestion Control Routing Protocol Based on Traffic Classification in LEO Satellite Networks.",
                    "ITrade: A Blockchain-based, Self-Sovereign, and Scalable Marketplace for IoT Data Streams.",
                    "Contextual Bandit for Cognitive Management of Self-Organizing Networks.",
                    "Transaction Characteristics of Bitcoin.",
                    "Streaming Pattern Based Feature Extraction for Training Neural Network Classifier to Predict Quality of VOD services.",
                    "Software-based Analysis of the Security by Design in Embedded Devices.",
                    "Survivability in Lambda Grids by means of Ant Colony Optimization.",
                    "PFT: A Congestion Avoidance Method based on Proactive Flow Throttling at Endpoints.",
                    "Relational Consensus-Based Cooperative Task Allocation Management for IIoT-Health Networks.",
                    "Sextant: Enabling Automated Network-aware Application optimization in Carrier Networks.",
                    "Empirical Time Complexity of Generic Dijkstra Algorithm.",
                    "Towards Source Selection in Transfer Learning for Cloud Performance Prediction.",
                    "Time-Aware Traffic Scheduling with Virtual Queues in Time-Sensitive Networking.",
                    "ADSIM: Network Anomaly Detection via Similarity-aware Heterogeneous Ensemble Learning.",
                    "An IoT Transport Architecture for Passenger Counting: A Real Implementation.",
                    "Distributed User-centric Service Migration for Edge-Enabled Networks.",
                    "Blockchain-based Identity and Access Management in Industrial IoT Systems.",
                    "FQDN-Based Whitelist Filter on a DNS Cache Server Against the DNS Water Torture Attack.",
                    "5G Network Slicing for Wi-Fi Networks.",
                    "Availability-Aware Service Chain Provisioning with Sub-chain-enabled Coordinated Protection.",
                    "An open measurement dataset on the Bitcoin P2P Network.",
                    "Machine-Learning-Based Predictive Handover.",
                    "SWANS: SDN-based Wormhole Analysis using the Neighbor Similarity for a Mobile ad hoc network (MANET).",
                    "Towards Robust Security Risk Metrics for Networked Systems: Work in Progress.",
                    "A Computation Offloading Mechanism Based on Sharable Cache in Smart Community.",
                    "Study of IoT Architecture and Application Invariant Functionalities.",
                    "A Reinforcement Learning Approach for Placement of Stateful Virtualized Network Functions.",
                    "Provisioning and Recovery in Flexible Optical Networks using Ant Colony Optimization.",
                    "A semantic approach for comparing Fog Service Placement Problems.",
                    "Power-Aware Path Planning for Vehicle-Assisted Multi-UAVs in Mobile Crowd Sensing.",
                    "Towards Automating Security Enhancement for Cloud Services.",
                    "CATS: Crowd-based Alert and Tracing Services for building a Safe Community Cluster against COVID-19.",
                    "Pipeline for Crowdsourced IoT Data-Modeling with AI-Supported Convergence.",
                    "Summary Cache of IoT Data Using ICN.",
                    "ETSCP: Flexible SDN data plane configuration based on bootstrapping of in-band control channels.",
                    "A Dashboard for Cyber Situational Awareness and Decision Support in Network Security Management.",
                    "VFTGen: a Tool to Perform Experiments in Virtual Fat Tree Topologies.",
                    "A Framework for the Dynamic Generation of Workflows for Network Management.",
                    "Multi-protocols and Data Manager for IoT Gateways: A smart-building use-case demo.",
                    "Detection of State Transitions in Network elements: On-box demo.",
                    "MRT#: a Fast Multi-Threaded MRT Parser.",
                    "PrIoT Demo: Example of Invariant Functionalities.",
                    "Co-Simulation of Power Systems and Computing Systems using the FMI Standard.",
                    "Codec-Aware Video Delivery Over SDNs.",
                    "Leveraging in-network real-value computation for home network device recognition.",
                    "Stream-Based IP Flow Analysis.",
                    "Software-Defined Architecture for Infrastructure-less Mobile Ad Hoc Networks.",
                    "Survivable Virtual Network Embedding.",
                    "Securing Robots: An Integrated Approach for Security Challenges and Monitoring for the Robotic Operating System (ROS).",
                    "The Cooperative DDoS Signaling based on a Blockchain-based System.",
                    "TANGLED: A Cooperative Anycast Testbed.",
                    "Defense Against SYN Flood DoS Attacks Using Network-based Mitigation Techniques.",
                    "A National Programmable Infrastructure to Experiment with Next-Generation Networks.",
                    "5G Experimentation: The Experience of the Athens 5GENESIS Facility.",
                    "Routing in Fat Trees: a protocol analyzer for debugging and experimentation.",
                    "Design of a Real-Time Traffic Mirroring System.",
                    "Experience with implementing VNF chains with Segment Routing and PCEP.",
                    "What database do you choose for heterogeneous security log events analysis?",
                    "THANOS: Teleprotection Holistic Application for ONOS Controller.",
                    "Digital Mobile Onboarding in Switzerland - a Hands-on Experience.",
                    "Quality that Matters: QoE Monitoring in Education Service Provider (ESP) Networks.",
                    "Real-life V2X Measurement Results for 5G NSA Performance on a High-speed Motorway.",
                    "Predicting cloud-native application failures based on monitoring data of cloud infrastructure.",
                    "LogDTL: Network Log Template Generation with Deep Transfer Learning.",
                    "Exploring the Adaptability of Word Embeddings to Log Message Classification.",
                    "SpeedCam: Towards Efficient Flow Monitoring for Multipath Communication.",
                    "Detection of DoS/DDoS attacks: the UBM and GMM approach.",
                    "CONTAIN: Privacy-oriented Contact Tracing Protocols for Epidemics.",
                    "Fog Orchestration meets Proactive Caching.",
                    "When Deep Learning May Not Be The Right Tool For Traffic Classification.",
                    "Establishing a Chain of Trust in a Sporadically Connected Cyber-Physical System.",
                    "Modeling an Industrial Revolution: How to Manage Large-Scale, Complex IoT Ecosystems?",
                    "A DevOps Approach for Cyber-Physical System-of-Systems Engineering through Arrowhead.",
                    "Analysing Design Approaches for the Power Consumption in Cyber-Physical Systems.",
                    "A Framework to identify People, Devices and Services in Cyber-physical system of systems.",
                    "Key Success Factors for the Implementation of Digital Technologies in the Context of Industry 4.0.",
                    "UAVs-as-a-Service: Cloud-based Remote Application Management for Drones.",
                    "A novel scheme for congestion notification in IoT low power networks.",
                    "Unified SNMP Interface for IoT Monitoring.",
                    "S3MP: A SCION based Secure Smart Metering Platform.",
                    "Cyber-Physical Anomaly Detection for ICS.",
                    "HSL: a Cyber Security Research Facility for Sensitive Data Experiments.",
                    "ORACLE: An Architecture for Collaboration of Data and Control Planes to Detect DDoS Attacks.",
                    "Access Control in Adversarial Environments for IoT-oriented Distributed Ledgers.",
                    "An Electrocardiogram-based Authentication Implementation Integrated with the Blockchain.",
                    "Towards an Efficient Detection of Pivoting Activity.",
                    "Graph-Based CPE Matching for Identification of Vulnerable Asset Configurations.",
                    "Intelligent Charging Infrastructure Design for Connected and Autonomous Electric Vehicles in Smart Cities.",
                    "Sensor Virtualization and Data Orchestration in Internet of Vehicles (IoV).",
                    "Performance Evaluation of Pedestrian Detectors for Autonomous Vehicles.",
                    "A Dynamically-Concise Roadmap Framework for Guiding Connected and Automated Vehicles.",
                    "A Data-Fusion Method using Bayesian Approach to Enhance Raw Data Accuracy of Position and Distance Measurements for Connected Vehicles.",
                    "Age of Information in IEEE 802.11p.",
                    "Lightweight IDS For UAV Networks: A Periodic Deep Reinforcement Learning-based Approach.",
                    "SRFog: A flexible architecture for Virtual Reality content delivery through Fog Computing and Segment Routing.",
                    "Multimedia Microservice Placement in Hierarchical Multi-tier Cloud-to-Fog Networks.",
                    "Infinity: A Scalable Infrastructure for In-Network Applications.",
                    "Cyber-Physiotherapy: Rehabilitation to Training."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th Integrated Network Management 2019",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2019",
                "sub_name": "IFIP/IEEE International Symposium on Integrated Network Management, IM 2019, Washington, DC, USA, April 09-11, 2019.",
                "count": 145,
                "papers": [
                    "P4SC: Towards High-Performance Service Function Chain Implementation on the P4-Capable Device.",
                    "A Content-aware Data-plane for Efficient And Scalable Video Delivery.",
                    "Offloading Real-time DDoS Attack Detection to Programmable Data Planes.",
                    "Optimal Distributed Resource Allocation in 5G Virtualized Networks.",
                    "Environment-Adaptive Sizing and Placement of NFV Service Chains with Accelerated Reinforcement Learning.",
                    "Q-Learning Algorithm for Joint Computation Offloading and Resource Allocation in Edge Cloud.",
                    "Enabling Dynamic SLA Compensation Using Blockchain-based Smart Contracts.",
                    "What-if Scenario Analysis for IT Services in Hybrid Cloud Environments with BDMaaS+.",
                    "A Reputation Scheme for a Blockchain-based Network Cooperative Defense.",
                    "Mining Software Repositories for Predictive Modelling of Defects in SDN Controller.",
                    "Attacker Behavior-Based Metric for Security Monitoring Applied to Darknet Analysis.",
                    "Privacy-Conscious Threat Intelligence Using DNSBloom.",
                    "Effective NFV Orchestration for Wide-Ranging Services Across Heterogeneous Cloud Networks.",
                    "Specifying and Analyzing Virtual Network Services Using Queuing Petri Nets.",
                    "On the Scaling of Virtualized Network Functions.",
                    "Detect Me If You... Oh Wait. An Internet-Wide View of Self-Revealing Honeypots.",
                    "A Graph-Based Machine Learning Approach for Bot Detection.",
                    "Split and Merge: Detecting Unknown Botnets.",
                    "Mitigation of Multi-vector Network Attacks via Orchestration of Distributed Rule Placement.",
                    "Data Querying and Access Control for Secure Multiparty Computation.",
                    "On Multi-Point, In-Network Filtering of Distributed Denial-of-Service Traffic.",
                    "Optimized Placement of Scalable IoT Services in Edge Computing.",
                    "Machine Learning Based Active Measurement Proxy for IoT Systems.",
                    "A Delay and Load-balancing based Hierarchical Route Planning Method for Transmission Line IoT Sensing and Monitoring applications.",
                    "Towards robust controller placement in software-defined networks against links failure.",
                    "Optimizing Controller Placement for Distributed Software-Defined Networks.",
                    "Design and Implementation of Virtual TAP for SDN-based OpenStack networking.",
                    "Performance Prediction in Dynamic Clouds using Transfer Learning.",
                    "Quality of Service Forecasting with LSTM Neural Networks.",
                    "Deep Convolutional LSTM Network-based Traffic Matrix Prediction with Partial Information.",
                    "Collaborative Sleep Mechanism between Cross-domain Nodes in FiWi network based on load balancing and QoS awareness.",
                    "Automatic Quality of Experience Management for WLAN Networks using Multi-Armed Bandit.",
                    "QoS-Aware Power Management with Deep Learning.",
                    "Risk-Aware Service Routes Planning for System Protection Communication Network in Energy Internet.",
                    "Cost-aware Service Function Chaining With Reliability Guarantees in NFV-enabled Inter-DC Network.",
                    "Fault-Tolerant Session Support for Service-Centric Networking.",
                    "Optonomic: Architecture for Autonomic Optical Transport Networks.",
                    "Introducing ReCPRI: A Field Re-configurable Protocol for Backhaul Communication in a Radio Access Network.",
                    "Collaborative informed gateway selection in large-scale and heterogeneous networks.",
                    "Distributed Orchestration in Cloud Data Centers.",
                    "Thinking inside the Box: Differential Fault Localization for SDN Control Plane.",
                    "Using Real-World Event Notifications to Reduce Operational Cost in Virtual Networks.",
                    "INFAS: In-Network Flow mAnagement Scheme for SDN Control Plane Protection.",
                    "Automated Factorization of Security Chains in Software-Defined Networks.",
                    "Optimizing Adaptive Tile-Based Virtual Reality Video Streaming.",
                    "QoE Performance for DASH Videos in a Smart Cache Environment.",
                    "Recovering Content Availability at Failures in ICN.",
                    "A Charging/Rewarding mechanism-based Interest Flooding Attack mitigation strategy in NDN.",
                    "TMAS: A Traffic Monitoring Analytics System Leveraging Machine Learning.",
                    "A Risk-defined Trust Transitivity Model for Group Decisions in Social Networks.",
                    "IT Service Management Frameworks Compared - Simplifying Service Portfolio Management.",
                    "Automated Planning of System Rollback in Declarative IT System Update.",
                    "Capacity Optimization based on Traffic Grooming in Transport Networks.",
                    "IoTC2: A Formal Method Approach for Detecting Conflicts in Large Scale IoT Systems.",
                    "A Modular Distributed IoT Service Discovery.",
                    "Giving IoT Services an Identity and Changeable Attributes.",
                    "LADEQ: A Fast Lagrangian Relaxation Based Algorithm for Destination-Based QoS Routing.",
                    "An Approach for Energy Efficient Deadline-Constrained Flow Scheduling and Routing.",
                    "A Deep Reinforcement Learning based Mechanism for Cell Outage Compensation in 5G UDN.",
                    "3D Aerial Base Station Position Planning based on Deep Q-Network for Capacity Enhancement.",
                    "Traffic Classification with Machine Learning in a Live Network.",
                    "Analysis and Demand Forecasting of Residential Energy Consumption at Multiple Time Scales.",
                    "Automated Failure Modes and Effects Analysis using SysML for Industrial Computer Network Reliability and Cybersecurity.",
                    "Virtual Network Function Descriptors Mining using Word Embeddings and Deep Neural Networks.",
                    "Real-time Pattern Detection in IP Flow Data using Apache Spark.",
                    "Flow/Interface Association for Multi-interface Mobile Terminals: e-Health case proposal.",
                    "Evaluating a Blockchain-based Cooperative Defense.",
                    "Build an SR-IOV Hypervisor.",
                    "Edison: Event-driven Distributed System of Network Measurement.",
                    "Current Issues of Malicious Domains Blocking.",
                    "Low Overhead Distributed IP Flow Records Collection and Analysis.",
                    "Versatile Optical Path Calculation and Monitoring Using Common YANG Model.",
                    "Enabling SSH Protocol Visibility in Flow Monitoring.",
                    "Utilizing Deep Learning for Mobile Telecommunications Network Management.",
                    "SDN Enabled Secure IoT Architecture.",
                    "Redundancy mechanism of Service Function Chain with Node-Ranking Algorithm.",
                    "ASCO: An Availability-aware Service Chain Orchestration.",
                    "Toward Content-Oriented Orchestration: SDN and NFV as Enabling Technologies for NDN.",
                    "Safeguarding from abuse by IoT vendors: Edge messages verification of cloud-assisted equipment.",
                    "Energy-Aware Slicing of Network Resources based on Elastic Demand through Daytime.",
                    "Toward a Policy-based Blockchain Agnostic Framework.",
                    "Mining And Application of User Behavior Pattern Based on Operation And Maintenance Data.",
                    "Functional Topology Inference from Network Events.",
                    "CASH: A Channel Assigner Algorithm for Heterogeneous Devices in Smart Homes.",
                    "Towards Scalable Planning of Wireless Networks.",
                    "Persistent WiFi connectivity during Train journey: An SDN based approach.",
                    "Self-healing solutions for Wi-Fi networks to provide seamless handover.",
                    "A Dynamic Cross-Domain Access Control Model for Collaborative Healthcare Application.",
                    "Real-Time Detection of DNS Exfiltration and Tunneling from Enterprise Networks.",
                    "On the classification and false alarm of invalid prefixes in RPKI based BGP route origin validation.",
                    "Data-driven Resource Allocation in Virtualized Environments.",
                    "Data Analysis and Modelling of Users' Behavior on the Web.",
                    "Normalization of Unstructured Log Data into Streams of Structured Event Objects.",
                    "Towards Virtualization of Software-Defined Networks: A Journey in Three Acts.",
                    "QoE-Centric Network-Assisted Delivery of Adaptive Video Streaming Services.",
                    "Collaborative Computation Offloading for Multi-access Edge Computing.",
                    "Modeling, Monitoring and Scheduling Techniques for Network Recovery from Massive Failures.",
                    "Application-Aware Flow Monitoring.",
                    "SLA-controlled Proxy Service Through Customisable MANO Supporting Operator Policies.",
                    "Network Slice Life-Cycle Management Towards Automation.",
                    "Experimental Demonstration of 5G Virtual EPC Recovery in Federated Testbeds.",
                    "Connection Integration System for ICT Infrastructure Management.",
                    "A Tool Suite for the Automated Synthesis of Security Function Chains.",
                    "A network protocol for distributed orchestration using intent-based forwarding.",
                    "Cloud-Based System for Fake Tweet Identification.",
                    "Demonstration of an Observability Framework for Cloud Native Microservices.",
                    "ViDupe-Duplicate Video Detection as a Service in Cloud.",
                    "Demonstration of Synchronization Attacks on Distributed and Cooperative Control in Microgrids.",
                    "Demo Abstract: A Tool to Detect and Visualize Malicious DNS Queries for Enterprise Networks.",
                    "Highlighting the Gap Between Expected and Actual Behavior in P4-enabled Networks.",
                    "AMIS: Programmable Privacy-Preserving Network Measurement for Analysis and Troubleshooting.",
                    "Automated Distribution of Access Control Rules in Defense Layers of an Enterprise Network.",
                    "Demo: DroidNet - An Android Permission Control Recommendation System Based on Crowdsourcing.",
                    "An Identity Provider as a Service platform for the eduGAIN research and education community.",
                    "IT Operations Analytics: Root Cause Analysis via Complex Event Processing.",
                    "DNS Firewall Data Visualization.",
                    "Demonstration: Predicting Distributions of Service Metrics.",
                    "port2dist: Semantic Port Distances for Network Analytics.",
                    "Machine learning based Insider Threat Modelling and Detection.",
                    "Passive Inference of User Actions through IoT Gateway Encrypted Traffic Analysis.",
                    "Leveraging SDN to Enable Short-Term On-Demand Security Exceptions.",
                    "ICS/SCADA Device Recognition: A Hybrid Communication-Patterns and Passive-Fingerprinting Approach.",
                    "Adaptive Network Management for Safety-Critical Systems.",
                    "Mining Patterns in Mobile Network Logs.",
                    "AECID-PG: A Tree-Based Log Parser Generator To Enable Log Analysis.",
                    "A Method for Temporal Event Correlation.",
                    "An LSTM Framework For Modeling Network Traffic.",
                    "Network Analytics for Streaming Traffic Analysis.",
                    "Neural Network Based Spectrum Prediction in Land Mobile Radio Bands for IoT deployments.",
                    "An Experimental Analysis of Fraud Detection Methods in Enterprise Telecommunication Data using Unsupervised Outlier Ensembles.",
                    "Statistical Characterization of Round-Trip Times with Nonparametric Hidden Markov Models.",
                    "Adversarially Adapting Deceptive Views and Reconnaissance Scans on a Software Defined Network.",
                    "Multivariate Metrics of Normal and Anomalous Network Behaviors.",
                    "Model-based System Identification for Cloud Services Analytics.",
                    "Graph-based malicious login events investigation.",
                    "Hashtray: Turning the tables on Scalable Client Classification.",
                    "A Machine Learning Application for Latency Prediction in Operational 4G Networks.",
                    "Multi-Tenant IoT Service Management towards an IoT App Economy.",
                    "Multi-party authorization and conflict mediation for decentralized configuration management processes.",
                    "Machine-Learning based IoT Data Caching.",
                    "5G Smart City Vertical Slice.",
                    "An End-to-End Carrier Ethernet MEF enabled 5G network architecture.",
                    "Enhancing Security in ETSI Open Source MANO with Usage Control Capability.",
                    "A Blockchain-Based Decentralized Wi-Fi Sharing Mechanism.",
                    "Superlight - A Permissionless, Light-client Only Blockchain with Self-Contained Proofs and BLS Signatures."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th Integrated Network Management 2017",
        "info": "Lisbon, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2017",
                "sub_name": "2017 IFIP/IEEE Symposium on Integrated Network and Service Management (IM), Lisbon, Portugal, May 8-12, 2017.",
                "count": 211,
                "papers": [
                    "Welcome from the Chairs.",
                    "Latency-Sensitive Data Allocation for cloud storage.",
                    "Admission control of API requests in OpenStack.",
                    "Energy-efficient resource allocation and provisioning for in-memory database clusters.",
                    "Elastic, on-line and network aware Virtual Machine placement within a data center.",
                    "Vantage point selection for IPv6 measurements: Benefits and limitations of RIPE Atlas tags.",
                    "Mining causes of network events in log data with causal inference.",
                    "ConMon: An automated container based network performance monitoring system.",
                    "Predictive modeling and scalability analysis for large graph analytics.",
                    "Content Poisoning in Named Data Networking: Comprehensive characterization of real deployment.",
                    "Network defence strategy evaluation: Simulation vs. live network.",
                    "A scalable approach for managing access control in Information Centric Networks.",
                    "A cost-effective security management for clouds: A game-theoretic deception mechanism.",
                    "A distributed NFV orchestrator based on BDI reasoning.",
                    "ReViNE: Reallocation of Virtual Network Embedding to eliminate substrate bottlenecks.",
                    "Affinity measurement for NFV-enabled networks: A criteria-based approach.",
                    "A graph approach to placement of Service Functions Chains.",
                    "Design and evaluation of a flexible Advance bandwidth Reservation Algorithm for media production networks.",
                    "Abstracting .torrent content consumption into two-mode graphs and their projection to content networks (ConNet).",
                    "A transparent load balancing algorithm for heterogeneous Local Area Networks.",
                    "Joint optimization of content placement and request redirection in Mobile-CDN.",
                    "LMS: Label Management Service for intent-driven Cloud Management.",
                    "INSpIRE: Integrated NFV-based Intent Refinement Environment.",
                    "Securing communication in multiple Autonomous System domains with Software Defined Networking.",
                    "HyperExchange: A protocol-agnostic exchange fabric enabling peering of Virtual Networks.",
                    "A link failure recovery algorithm for Virtual Network Function chaining.",
                    "ARES: An autonomic and resilient framework for smart grids.",
                    "Performance comparison of resilience mechanisms for stateless multicast using BIER.",
                    "Neev: A cognitive support agent for content improvement in hardware tickets.",
                    "An effective swapping mechanism to overcome the memory limitation of SDN devices.",
                    "Software-defined traffic load balancing for cost-effective data center interconnection service.",
                    "Programming abstractions for wireless multicasting in software-defined enterprise WLANs.",
                    "CityFlow, enabling quality of service in the Internet: Opportunities, challenges, and experimentation.",
                    "Using residual resource consumption to resample top-k monitoring reports.",
                    "Decentralized monitoring for large-scale Software-Defined Networks.",
                    "Time-series models for cloud workload prediction: A comparison.",
                    "Learning behavioral fingerprints from Netflows using Timed Automata.",
                    "A remote attestation infrastructure for verifying the application of software updates.",
                    "On achieving high data availability in heterogeneous cloud storage systems.",
                    "The actual cost of software switching for NFV chaining.",
                    "Enabling service-centric networks for cloudlets using SDN.",
                    "Layer-independent PCI assignment method for Ultra-Dense multi-layer co-channel mobile Networks.",
                    "An approximation of the backhaul bandwidth aggregation potential using a partial sharing scheme.",
                    "A GRASP based heuristic for Deployment Roadside Units in VANETs.",
                    "Client-side routing-agnostic gateway selection for heterogeneous Wireless Mesh Networks.",
                    "Adaptive service management for cloud applications using overlay networks.",
                    "Enabling L2 network programmability in multi-tenant clouds.",
                    "CloudSim Plus: A cloud computing simulation framework pursuing software engineering principles for improved modularity, extensibility and correctness.",
                    "IP multicast in virtualized data centers: Challenges and opportunities.",
                    "Distributed Management Information Models.",
                    "FLIPPER: Fault-tolerant distributed network management and control.",
                    "Reinforcement learning based dynamic resource migration for virtual networks.",
                    "PrIXP: Preserving the privacy of routing policies at Internet eXchange Points.",
                    "ADE: An ensemble approach for early Anomaly Detection.",
                    "The BitTorrent Peer Collector Problem.",
                    "Fault detection and diagnosis for solar-powered Wireless Mesh Networks using machine learning.",
                    "Sharing performance measurement events across domains.",
                    "Performance evaluation of OpenFlow data planes.",
                    "Sharing data store and backup controllers for resilient control plane in multi-domain SDN.",
                    "A Network Access Control solution combining OrBAC and SDN.",
                    "Using SDN congestion controls to ensure zero packet loss in storage area networks.",
                    "Task assignment optimization in geographically distributed data centers.",
                    "SIMECA: SDN-based IoT Mobile Edge Cloud Architecture.",
                    "Opportunistic fog computing: Feasibility assessment and architectural proposal.",
                    "Cloudified mobility and bandwidth prediction in virtualized LTE networks.",
                    "A Web-based framework for fast synchronization of live video players.",
                    "Overlay routing for fast video transfers in CDN.",
                    "MoViDiff: Enabling service differentiation for mobile video apps.",
                    "Augmenting cloud architectures to support decentralized applications.",
                    "Adaptive auto-scaling for virtual resources in software-defined infrastructure.",
                    "Heterogeneous NetwOrk Policy Enforcement in data centers.",
                    "Locality based approach to improve propagation delay on the Bitcoin peer-to-peer network.",
                    "SDN middlebox architecture for resilient transfers.",
                    "Valley times in the Spanish academic network.",
                    "SFC Path Tracer: A troubleshooting tool for Service Function Chaining.",
                    "An analytical model for combined SDN Forwarding Element.",
                    "Equivalent forwarding set evaluation in software defined networking.",
                    "Network virtualization for Mobile Operators in Software-Defined based LTE networks.",
                    "Measurement correlation for improving cooperation in measurement federations.",
                    "A traffic classification approach based on characteristics of subflows and ensemble learning.",
                    "Application of functional feature extraction to the compression of network time series.",
                    "FM-Delta: Fault Management packet compression.",
                    "Risk assessment and optimization for key services in smart grid communication network.",
                    "Exchanging security events: Which and how many alerts can we aggregate?",
                    "Leveraging SDN to monitor critical infrastructure networks in a smarter way.",
                    "Rule-based technical management for the dependable operation of networked building automation systems.",
                    "Hybrid Radio Frequency and Free Space Optical communication for 5G backhaul.",
                    "Fault-tolerant topology control for heterogeneous wireless sensor networks using Multi-Routing Tree.",
                    "Instantaneous throughput prediction in cellular networks: Which information is needed?",
                    "A handover statistics based approach for Cell Outage Detection in self-organized Heterogeneous Networks.",
                    "DTRF: A dynamic-trust-based recruitment framework for Mobile Crowd Sensing system.",
                    "Ensuring two routes connectivity in mobile ad hoc networks with Random Waypoint mobility.",
                    "A New ICN routing selecting algorithm based on Link Expiration Time of VANET under the highway environment.",
                    "QoS-aware virtual SDN network planning.",
                    "Receive Buffer based Path Management for MPTCP in heterogeneous networks.",
                    "Delay-based priority queueing for VoIP over Software Defined Networks.",
                    "SDQ: Enabling rapid QoE experimentation using Software Defined Networking.",
                    "OpenFlow based VoIP QoE monitoring in enterprise SDN.",
                    "An enhanced Path Computation for Wide Area Networks based on Software Defined Networking.",
                    "Model-driven analytics in SDN networks.",
                    "NFV service dynamicity with a DevOps approach: Insights from a use-case realization.",
                    "Virtualization of radio access network by Virtual Machine and Docker: Practice and performance analysis.",
                    "BlueWall: Software defined network management in hybrid enterprise cloud environments.",
                    "How is your event Wi-Fi doing? Performance measurements of large-scale and dense IEEE 802.11n/ac networks.",
                    "On the impact of TCP segmentation: Experience in VoIP monitoring.",
                    "Analysis of a large multimedia-rich web portal for the validation of personal delivery networks.",
                    "COACH: Cognitive analytics for change.",
                    "Managing vulnerabilities in a cloud native world with bluefix.",
                    "Attacking SCADA systems: A practical perspective.",
                    "Using the COMPA autonomous architecture for mobile network security.",
                    "Traffic steering of middlebox policy chain based on SDN.",
                    "SDN policy-driven service chain placement in OpenStack.",
                    "Evaluation of scalable, on-demand DNS-as-a-Service.",
                    "Blockchains everywhere - a use-case of blockchains in the pharma supply-chain.",
                    "BlueShift: Automated application transformation to Cloud Native architectures.",
                    "Sustainable implementation-level workflow for automating NFV operation.",
                    "Failover time evaluation between checkpoint services in multi-tier stateful applications.",
                    "Advanced testing of mobile applications and devices.",
                    "Prototyping a high availability PaaS: Performance analysis and lessons learned.",
                    "GoLCoNDa: Geo-IP Lookup for campus network NetFlow data.",
                    "Towards tackling privacy disclosure issues in Domain Name Service.",
                    "QoE awareness for the Mobile Termination Rates monopoly liberation.",
                    "A methodology and test environment for QoS measurements in mobile networks.",
                    "Mechanisms for management of SLA for Virtual Software Defined Networks based on QoS Classes.",
                    "Decentralized detection of violations of Service Level Agreements using Peer-to-Peer technology.",
                    "Understanding the impact of network infrastructure changes using large-scale measurement platforms.",
                    "Securing networked embedded systems code through distributed systems analysis.",
                    "A Survival Performance degrAdation fRamework for lArge-scale neTworked systems.",
                    "Energy-efficient peer-to-peer networking for constrained-capacity mobile environments.",
                    "NFV service dynamicity with a DevOps approach.",
                    "FlowVisor vulnerability analysis.",
                    "A RAN/SDN controller based connectivity management platform for Mobile Service Providers.",
                    "Implementation of self-managing applications on cloud using overlay networks.",
                    "Online approach to performance fault localization for cloud and datacenter services.",
                    "CacheMAsT: Cache Management Analysis and Visualization Tool.",
                    "Real-time resource prediction engine for cloud management.",
                    "Enhancing SDN security by device fingerprinting.",
                    "Demonstration of sustainable implementation-level workflow for automating NFV operation.",
                    "An adaptive detection and prevention architecture for unsafe traffic in SDN enabled mobile networks.",
                    "Click-on-OSv: A platform for running Click-based middleboxes.",
                    "Honeypot testbed for network defence strategy evaluation.",
                    "An experimental system for verifying topology changes in mobile communication networks.",
                    "A graph-based representation of relations in network security alert sharing platforms.",
                    "Dynamic cloud service placement for live video streaming with a remote-controlled drone.",
                    "A platform for home network traffic monitoring.",
                    "Overcoming the memory limits of network devices in SDN-enabled data centers.",
                    "AMNESiA: Affinity measurement platform for NFV-enabled networks.",
                    "SDN-based transparent flow scheduling for heterogeneous wireless LANs.",
                    "ETSO: End-To-End SFC Orchestration Framework.",
                    "Demo: Scalable and reliable software-defined multicast with BIER and P4.",
                    "Layer-two peering across SAVI and GENI testbeds using HyperExchange.",
                    "Generating synthetic Internet- and IP-topologies using the Stochastic-Block-Model.",
                    "Virtual instance resource usage modeling: A method for efficient resource provisioning in the cloud.",
                    "Tag-and-Forward: A source-routing enabled data plane for OpenFlow Fat-Tree Networks.",
                    "Learning in SDN-based multi-tenant cellular networks: A game-theoretic perspective.",
                    "Knowledge discovery of port scans from darknet.",
                    "Investigation of malicious portable executable file detection on the network using supervised learning techniques.",
                    "Exploring a service-based normal behaviour profiling system for botnet detection.",
                    "The application of Neural Networks to predicting the root cause of service failures.",
                    "Discovering Cloud Operation History through Log Analysis.",
                    "Random access in nondelimited variable-length record collections for parallel reading with Hadoop.",
                    "On extracting user-centric knowledge for personalised Quality of Service in 5G networks.",
                    "Comprehensive vulnerability assessment and optimization method for smart grid communication transmission systems.",
                    "Assembling VoLTE CDRs based on network monitoring - challenges with fragmented information.",
                    "Monitoring the network monitoring system: Anomaly Detection using pattern recognition.",
                    "Quantifying cloud workload burstiness: New measures and models.",
                    "A clustering-based analysis of DPI-labeled video flow characteristics in cellular networks.",
                    "Application switch using DPN for improving TCP based data center applications.",
                    "Study on the accuracy of QoE monitoring for HTTP adaptive video streaming using VNF.",
                    "QoE based comparison of H.264/AVC and WebM/VP8 in an error-prone wireless network.",
                    "Betas: Deriving quantiles from MOS-QoS relations of IQX models for QoE management.",
                    "OTT-ISP joint service management: A Customer Lifetime Value based approach.",
                    "Embracing uncertainty: A probabilistic view of HTTP video quality.",
                    "Comparison of the initial delay for video playout start for different HTTP-based transport protocols.",
                    "Quality evaluation of 3D video for QoE management in media networks.",
                    "Towards a Hybrid Intrusion Detection System for Android-based PPDR terminals.",
                    "Methods and techniques to identify security incidents using domain knowledge and contextual information.",
                    "Defending against Probe-Response Attacks.",
                    "Efficient probing of heterogeneous IoT networks.",
                    "Privacy-preserving data aggregation in Intelligent Transportation Systems.",
                    "Towards optimally resilient topologies against optimal attacks.",
                    "DroidVisor: An Android secure application recommendation system.",
                    "Domain names abuse and TLDs: From monetization towards mitigation.",
                    "DDoS attack volume forecasting using a statistical approach.",
                    "Applied Machine Learning predictive analytics to SQL Injection Attack detection and prevention.",
                    "Q-Learning for Policy Based SON Management in wireless Access Networks.",
                    "Towards Location Management in SDN-based MCN.",
                    "Efficient RRH assignments for mobile network operators in shared cellular network architecture.",
                    "Capacity self-planning in Small Cell multi-tenant 5G Networks.",
                    "Demystifying network slicing: From theory to practice.",
                    "Cost-efficient method for managing network slices in a multi-service 5G core network.",
                    "Meeting the observability challenges for VNFs in 5G systems.",
                    "Cache peering in multi-tenant 5G networks.",
                    "A framework to facilitate management of services in cloud based 5G environments.",
                    "On non-parametric models for detecting outages in the mobile network.",
                    "Real-time performance management of assisted living services for Bluetooth low energy sensor communication.",
                    "Cost-benefit analysis game for efficient storage allocation in cloud-centric Internet of Things systems: A game theoretic perspective.",
                    "QoS management mechanisms for Enhanced Living Environments in IoT.",
                    "An AAL-oriented measurement-based evaluation of different HTTP-based data transport protocols.",
                    "SVC-based video streaming over highway vehicular networks with base layer guarantee.",
                    "Energy reduction platform based on occupant behavior pattern detection in enhanced living environments.",
                    "Framework to monitor pregnant women with a high risk of premature labour using sensor networks.",
                    "Basic Human Activity Recognition based on sensor fusion in smartphones.",
                    "A decentralized approach for adaptive workload estimation in virtualized environments.",
                    "Orchestrating resource allocation for interactive vs. batch services using a hybrid controller.",
                    "Online learning and adaptation of network hypervisor performance models.",
                    "Cross-layer management of a containerized NoSQL data store.",
                    "Resource aware placement of IoT application modules in Fog-Cloud Computing Paradigm.",
                    "State-machine driven collaborative mobile sensing serving multiple Internet-of-Things applications.",
                    "Lightweight virtualization as enabling technology for future smart cars.",
                    "Distributed spatial indexing for the Internet of Things data management."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "14th Integrated Network Management 2015",
        "info": "Ottawa, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2015",
                "sub_name": "IFIP/IEEE International Symposium on Integrated Network Management, IM 2015, Ottawa, ON, Canada, 11-15 May, 2015.",
                "count": 238,
                "papers": [
                    "Live datastore transformation for optimizing big data applications in cloud environments.",
                    "DNA: An SDN framework for distributed network analytics.",
                    "DREAMS: Dynamic resource allocation for MapReduce with data skew.",
                    "A data annotation architecture for semantic applications in virtualized wireless sensor networks.",
                    "A batch approach for a survivable virtual network embedding based on Monte-Carlo Tree Search.",
                    "Toward service selection game in a heterogeneous market cloud computing.",
                    "QoS-aware bidding strategies for VM spot instances: A reinforcement learning approach applied to periodic long running jobs.",
                    "A framework for the 3-D cloud monitoring based on data stream generation and analysis.",
                    "Predictor: Providing fine-grained management and predictability in multi-tenant datacenter networks.",
                    "EnforSDN: Network policies enforcement with SDN.",
                    "Towards making network function virtualization a cloud computing service.",
                    "Piecing together the NFV provisioning puzzle: Efficient placement and chaining of virtual network functions.",
                    "Testing a community network testbed control system.",
                    "HELM: Conflict-free active measurement scheduling for shared network resource management.",
                    "Evaluating SNMP, NETCONF, and RESTful web services for router virtualization management.",
                    "A learning-based algorithm for improved bandwidth-awareness of adaptive streaming clients.",
                    "Rate, power and carrier-sense threshold coordinated management for high-density IEEE 802.11 networks.",
                    "FSM-based Wi-Fi power estimation method for smart devices.",
                    "DiSCA: A distributed scheduling for convergecast in multichannel wireless sensor networks.",
                    "Capitalizing on SDN-based SCADA systems: An anti-eavesdropping case-study.",
                    "How to adapt: SVC-based quality adaptation for hybrid peercasting systems.",
                    "Algorithms for advance bandwidth reservation in media production networks.",
                    "Beacon-less video streaming management for VANETs based on QoE and link-quality.",
                    "CCNrel: Leveraging relations among objects to improve the performance of CCN.",
                    "Interactive monitoring, visualization, and configuration of OpenFlow-based SDN.",
                    "Policy authoring for software-defined networking management.",
                    "A fast method of verifying network routing with back-trace header space analysis.",
                    "Sparsifying network topologies for application guidance.",
                    "Booters - An analysis of DDoS-as-a-service attacks.",
                    "An optimal statistical test for robust detection against interest flooding attacks in CCN.",
                    "How to exchange security events? Overview and evaluation of formats and protocols.",
                    "Unveiling flat traffic on the Internet: An SSH attack case study.",
                    "Early network failure detection system by analyzing Twitter data.",
                    "Resolution recommendation for event tickets in service management.",
                    "Dude, ask the experts!: Android resource access permission recommendation with RecDroid.",
                    "Latent trait analysis for risk management of complex information technology projects.",
                    "QoS-based cloud resources partitioning aware networked edge datacenters.",
                    "Towards efficient on-demand VM provisioning: Study of VM runtime I/O access patterns to shared image content.",
                    "Dynamic management of applications with constraints in virtualized data centres.",
                    "Do you know how to configure your enterprise relational database to reduce incidents?",
                    "A graph coloring approach for scheduling undo actions in self-organizing networks.",
                    "STS: Space-time scheduling for coordinating self-organization network functions in LTE.",
                    "Automatic network configuration with dynamic churn prediction.",
                    "Disaster-prediction based virtual network mapping against multiple regional failures.",
                    "Rethinking virtual private networks in the software-defined era.",
                    "Ethanol: Software defined networking for 802.11 Wireless Networks.",
                    "HyperFlex: An SDN virtualization architecture with flexible hypervisor function allocation.",
                    "Dynamic capacity management and traffic steering in enterprise passive optical networks.",
                    "Predicting real-time service-level metrics from device statistics.",
                    "Detecting performance interference in cloud-based web services.",
                    "Inside booters: An analysis on operational databases.",
                    "An Ontology-Based Information Extraction System for bridging the configuration gap in hybrid SDN environments.",
                    "Poisson shot-noise process based flow-level traffic matrix generation for data center networks.",
                    "Iterative-tuning support vector machine for network traffic classification.",
                    "Divide and conquer: Partitioning OSPF networks with SDN.",
                    "Multiple classes of service provisioning with bandwidth and delay guarantees in dynamic circuit network.",
                    "Data-centric service-oriented management of things.",
                    "Enhancing Twitter spam accounts discovery using cross-account pattern mining.",
                    "Heterogeneous cloud systems monitoring using semantic and linked data technologies.",
                    "Ontology integration for advanced manufacturing collaboration in cloud platforms.",
                    "Optimizing capacity allocation for big data applications in cloud datacenters.",
                    "A high performance VoLTE traffic classification method using HTCondor.",
                    "A load balancing method in downlink LTE network based on load vector minimization.",
                    "Temporal load balancing of time-driven machine type communications in mobile core networks.",
                    "Topology-aware based energy-saving mechanism in wireless cellular networks.",
                    "Cross-layer management of distributed applications on multi-clouds.",
                    "Modeling and pricing cloud service elasticity for geographically distributed applications.",
                    "Software defined wireless access for a two-tier cloud system.",
                    "Catching the response time tail in the cloud.",
                    "Towards cloud-based compositions of security functions for mobile devices.",
                    "Introducing wireless access programmability using software-defined infrastructure.",
                    "Lifetime maximizing clustering structure using archimedes' spiral based deployment in WSNs.",
                    "URL forwarding for NAT traversal.",
                    "Detection of sinkhole attacks for supporting secure routing on 6LoWPAN for Internet of Things.",
                    "Control-plane slicing methods in multi-tenant software defined networks.",
                    "Establishing PDCA cycles for agile network management in SDN/NFV infrastructure.",
                    "Interference management in software-defined mobile networks.",
                    "The limits of architectural abstraction in network function virtualization.",
                    "vNMF: Distributed fault detection using clustering approach for network function virtualization.",
                    "Adaptive boolean network tomography for link failure detection.",
                    "Fault detection for cloud computing systems with correlation analysis.",
                    "A fault-tolerant and energy-aware mechanism for cluster-based routing algorithm of WSNs.",
                    "Management architecture against hardware failures in an optical packet and circuit integrated network.",
                    "Differentiated pacing on multiple paths to improve one-way delay estimations.",
                    "An adaptable storage slicing algorithm for content delivery networks.",
                    "Kaleidoscope: Real-time content delivery in software defined infrastructures.",
                    "Analyzing strategies to effectively detect changes in content delivery networks.",
                    "Improving flow completion time for short flows in datacenter networks.",
                    "An intelligent two-agent self-configuration approach for radio resource management.",
                    "Distributed decision engine - An information management architecture for autonomie wireless networking.",
                    "Towards flexible, scalable and autonomic virtual tenant slices.",
                    "On re-assembling self-managed components.",
                    "Intelligent timeout master: Dynamic timeout for SDN-based data centers.",
                    "Towards NFV-based multimedia delivery.",
                    "Monitoring and measurement in software-defined infrastructure.",
                    "Federating heterogeneous network virtualization platforms by slice exchange point.",
                    "MILPFlow: A toolset for integration of computational modelling and deployment of data paths for SDN.",
                    "Hybrid SDN architecture to integrate with legacy control and management plane: An experiences-based study.",
                    "An inter-domain multi-path flow transfer mechanism based on SDN and multi-domain collaboration.",
                    "Investigating unique flow marking for tracing back DDoS attacks.",
                    "Continuously delivering your network.",
                    "Model-driven networking: A novel approach for SDN applications development.",
                    "Measuring robustness of SDN control layers.",
                    "Security function virtualization in software defined infrastructure.",
                    "ViNO: SDN overlay to allow seamless migration across heterogeneous infrastructure.",
                    "Collaborative cloud-based management of home networks.",
                    "LIDAR-based virtual environment study for disaster response scenarios.",
                    "Automated business application discovery.",
                    "Particle swarm optimization based multi-domain virtual network embedding.",
                    "Fault diagnosis based on evidences screening in virtual network.",
                    "Quality of service on services selection using anycast techniques: A convergence analysis.",
                    "KVM virtualization impact on active round-trip time measurements.",
                    "Off-peak energy-wise link reconfiguration for virtualized network environment.",
                    "Optimal placement of sequentially ordered virtual security appliances in the cloud.",
                    "Exploring continuous optimization solutions for business-driven IT management problems.",
                    "Business-driven configuration of IT services in public and hybrid clouds based on performance forecasting.",
                    "Cache replacement policy based on server distance.",
                    "Agent-based negotiation for shared QoS control in distributed cloud services.",
                    "Admission control in YARN clusters based on dynamic resource reservation.",
                    "E-stream: Towards pattern centric network incident discovery and corrective action recommendation in telecommunication networks.",
                    "i-MagNet: A real-time intelligent framework for finding specific needles from needle stacks.",
                    "AMSDL: A declarative language for adaptive monitoring control.",
                    "Sales pipeline win propensity prediction: A regression approach.",
                    "Using analytics to understand and control batch operations - A case study.",
                    "A first look at HTTP(S) intrusion detection using NetFlow/IPFIX.",
                    "Scalable in-network rate monitoring.",
                    "Probabilistic text analytics framework for information technology service desk tickets.",
                    "Analysis of the evolution of features in classification problems with concept drift: Application to spam detection.",
                    "Improving network security monitoring for industrial control systems.",
                    "Functional Data Analysis: A step forward in Network Management.",
                    "Urban data collectors: A pragmatic approach to leveraging urban sensing.",
                    "Measuring enterprise network usage pattern & deploying passive optical LANs.",
                    "Design and evaluation of a DASH-compliant second screen video player for live events in mobile scenarios.",
                    "Experiences from building an outdoor testbed for community wireless networks.",
                    "Design and development of a management solution for wireless mesh networks based on IEEE 802.11s.",
                    "A collaborative approach for a source based detection of botclouds.",
                    "Collaborative attack mitigation and response: A survey.",
                    "Network economics approach to data offloading and resource partitioning in two-tier LTE HetNets.",
                    "TinyPolicy: A distributed policy based management framework for Wireless Sensor Networks.",
                    "A cooperative file downloading scheme with genetic algorithm.",
                    "An access point selection mechanism based on cooperation of access points and users movement.",
                    "The need of software development process for wireless sensor networks with cooperative nodes.",
                    "Greedy scheduling with feedback control for overloaded real-time systems.",
                    "Autoconfiguration for faster WiFi community networks.",
                    "Benefits brought by the use of OpenFlow/SDN on the AmLight intercontinental research and education network.",
                    "GreenSDN: Bringing energy efficiency to an SDN emulation environment.",
                    "C-GEP: Adaptive network management with reconfigurable hardware.",
                    "Framework of network service orchestrator for responsive service lifecycle management.",
                    "Experience of developing an openflow SDN prototype for managing IPTV networks.",
                    "Real-time DDoS attack detection for Cisco IOS using NetFlow.",
                    "Load balanced telecommunication event consumption using pools.",
                    "Automating the testing of RESTCONF agents.",
                    "Efficiently bypassing SNI-based HTTPS filtering.",
                    "High-density network flow monitoring.",
                    "Enterprise-scale cloud migration orchestrator.",
                    "A scalable lightweight performance monitoring tool for storage clusters.",
                    "Spade: Decentralized orchestration of data movement and warehousing for physics experiments.",
                    "Deploying clouds in the Guifi community network.",
                    "A data-driven storage recommendation service for multitenant storage management environments.",
                    "Deploying the ICT architecture of a residential demand response pilot.",
                    "Multi-dimensional sensor data aggregator for adaptive network management in M2M communications.",
                    "Supporting development and management of smart office applications: A DYAMAND case study.",
                    "Automatic extraction of POIs in smart cities: Big data processing in ParticipAct.",
                    "A location-aware architecture for heterogeneous building automation systems.",
                    "Measurement-based network link dimensioning.",
                    "Resource allocation and management in Cloud Computing.",
                    "Multihoming aware optimization mechanism.",
                    "Limiting fake accounts in large-scale distributed systems through adaptive identity management.",
                    "Self-managed resources in network virtualisation environments.",
                    "Application-Aware adaptive provisioning in virtualized networks.",
                    "Enabling wireless cooperation in user provided networks.",
                    "Service level agreements-driven management of distributed applications in cloud computing environments.",
                    "A platform for the analysis and visualization of network flow data of android environments.",
                    "Performant deployment of a virtualised network functions in a data center environment using resource aware scheduling.",
                    "What's around me? Location analytics over Software-Defined WLANs.",
                    "Network configuration with quality of service abstractions for SDN and legacy networks.",
                    "Network troubleshooting with SDN-RADAR.",
                    "Demonstration of an FPGA controller for guaranteed-rate optical packet switching.",
                    "A platform for predicting real-time service-level metrics from device statistics.",
                    "DNA: An SDN framework for Distributed Network Analytics (Demo Paper).",
                    "Demo: A holistic energy-monitoring framework for the IT service delivery chain.",
                    "Hardware accelerated flow measurement of 100 Gb ethernet.",
                    "A demonstration of energy efficiency capabilities orchestration in networks.",
                    "C-GEP: Platform demo for 100 Gbit/s network monitoring.",
                    "Roles of DevOps tools in an automated, dynamic service creation architecture.",
                    "Making MPLS VPNs manageable through the adoption of SDN.",
                    "SDN interactive manager: An OpenFlow-based SDN manager.",
                    "Demonstration of carrier network failure detection by analyzing Twitter.",
                    "The cloudy distribution in community network clouds in Guifi.net.",
                    "HyperFlex: Demonstrating control-plane isolation for virtual software-defined networks.",
                    "Traffic engineering based on stochastic model predictive control for uncertain traffic change.",
                    "Caching algorithm for content-oriented networks using prediction of popularity of contents.",
                    "An FPGA controller for deterministic guaranteed-rate optical packet switching.",
                    "Energy efficient and latency aware TDM-PON for local customer internetworking.",
                    "CloudAware: Towards context-adaptive mobile cloud computing.",
                    "Challenges for orchestration and instance selection of composite services in distributed edge clouds.",
                    "Software defined networking-based vehicular Adhoc Network with Fog Computing.",
                    "Design and evaluation of a hierarchical multi-tenant data management framework for cloud applications.",
                    "Investigating the impact of network topology on the processing times of SDN controllers.",
                    "Virtual network functions orchestration in enterprise WLANs.",
                    "Representation of spectrum sensing experimentation functionality for federated management and control.",
                    "A data model for management of network device configuration heterogeneity.",
                    "A credential and encryption based access control solution for named data networking.",
                    "Multihoming with locator/ID Separation Protocol: An experimental testbed.",
                    "Network-based dynamic prioritization of HTTP adaptive streams to avoid video freezes.",
                    "To each according to his needs: Dimensioning video buffer for specific user profiles and behavior.",
                    "An objective multi-layer QoE Evaluation for TCP video streaming.",
                    "The cost of aggressive HTTP adaptive streaming: Quantifying YouTube's redundant traffic.",
                    "Benchmarking in virtual desktops for end-to-end performance traceability.",
                    "Can context monitoring improve QoE? A case study of video flash crowds in the internet of services.",
                    "Reduced reference image quality assessment via Boltzmann Machines.",
                    "Towards estimating video QoE based on frame loss statistics of the video streams.",
                    "An improved anomaly detection in mobile networks by using incremental time-aware clustering.",
                    "ADAMANT - An Anomaly Detection Algorithm for MAintenance and Network Troubleshooting.",
                    "Concurrent cooperative games for coordinating SON functions in cognitive cellular networks.",
                    "Detecting DGA malware using NetFlow.",
                    "Automatic discovery of web servers hosting similar applications.",
                    "Cognitive streaming on android devices.",
                    "Denial-of-service attacks in OpenFlow SDN networks.",
                    "A simulation model for analysis of attacks on the Bitcoin peer-to-peer network.",
                    "Bayesian inference based decision reliability under imperfect monitoring.",
                    "A game-theoretic model for defending against malicious users in RecDroid.",
                    "Data remanence and digital forensic investigation for CUDA Graphics Processing Units.",
                    "Multi-level VM replication based survivability for mission-critical cloud computing.",
                    "Spam intrusion detection in computer networks using intelligent techniques.",
                    "TOPASE: Detection of brute force attacks used disciplined IPs from IDS log.",
                    "Fogging the cloud - Implementing and evaluating searchable encryption schemes in practice.",
                    "A multi-level resilience framework for unified networked environments.",
                    "Distributed security management for the IoT.",
                    "BizMap: A framework for mapping business applications to IT infrastructure.",
                    "Calculation of COBIT metrics using a formal ontology.",
                    "Service provider DevOps for large scale modern network services.",
                    "ResearchOps: The case for DevOps in scientific applications.",
                    "An organizational perspective on business driven IT management.",
                    "Assessment method of operational procedure for runbook automation.",
                    "A system dynamics model for managing service desk capacity.",
                    "Modeling the use of spot instances for cost reduction in cloud computing adoption using a Petri net framework.",
                    "Service and contract composition: A model and a tool."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13th Integrated Network Management 2013",
        "info": "Ghent, Belgium",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2013",
                "sub_name": "2013 IFIP/IEEE International Symposium on Integrated Network Management (IM 2013), Ghent, Belgium, May 27-31, 2013.",
                "count": 236,
                "papers": [
                    "Bypassing Cloud Providers' data validation to store arbitrary data.",
                    "Cost aware fault recovery in clouds.",
                    "VDC Planner: Dynamic migration-aware Virtual Data Center embedding for clouds.",
                    "Network virtualization over heterogeneous federated infrastructures: Data plane connectivity.",
                    "Federation-less-federation of network-virtualization platforms.",
                    "An intent-based approach for network virtualization.",
                    "Optimal scheduling in the hybrid-cloud.",
                    "Dynamic SLA based elastic cloud service management: A SaaS perspective.",
                    "Cost-aware scheduling of deadline-constrained task workflows in public cloud environments.",
                    "Morpheus: Learning configurations by example.",
                    "RPO: Runtime web server optimization under simultaneous multithreading.",
                    "Getting more for less in optimized MapReduce workflows.",
                    "An efficient approach to multi-level route analytics.",
                    "A query language for network search.",
                    "Identifying the root cause of failures in IT changes: Novel strategies and trade-offs.",
                    "Synthetic incident generation in the reenactment of IT support organization behavior.",
                    "Recommending resolutions for problems identified by monitoring.",
                    "Quality improvement and quantitative modeling - Using mashups for human error prevention.",
                    "The right tool for the job: Switching data centre management strategies at runtime.",
                    "Static validation of network device configurations in virtualized multi-tenant datacenters.",
                    "Paradigm-based adaptive provisioning in virtualized data centers.",
                    "On tackling virtual data center embedding problem.",
                    "Managed hybrid storage for home and SOHO environments.",
                    "Distributed firewall anomaly detection through LTL model checking.",
                    "PReSET: A toolset for the evaluation of network resilience strategies.",
                    "MonoScope: Automating network faults diagnosis based on active measurements.",
                    "Performance comparison of not-via addresses and maximally redundant trees (MRTs).",
                    "Dynamic risk-aware routing for OSPF networks.",
                    "OCCASIO: An operable concept for confidential and secure identity outsourcing.",
                    "A formal approach for network security management based on qualitative risk analysis.",
                    "Evaluating third-party Bad Neighborhood blacklists for Spam detection.",
                    "ASMATRA: Ranking ASs providing transit service to malware hosters.",
                    "A component-based performance comparison of four hypervisors.",
                    "Maximizing server utilization while meeting critical SLAs via weight-based collocation management.",
                    "Achieving sub-second downtimes in internet-wide virtual machine live migrations in LISP networks.",
                    "Resource contention detection and management for consolidated workloads.",
                    "PseudoApp: Performance prediction for application migration to cloud.",
                    "Leveraging OpenFlow for resource placement of virtual desktop cloud applications.",
                    "What to discover before migrating to the cloud.",
                    "BonaFide: A traffic shaping detection tool for mobile networks.",
                    "Load-aware self-configuration in mobile peer-to-peer applications.",
                    "Characterizing smart phone traffic: A mobile carrier's perspective.",
                    "Gateway selection in hybrid wireless networks through cooperative probing.",
                    "Exploiting user context information for energy management in enterprise femtocell networks.",
                    "Energy-aware adaptive network resource management.",
                    "Energy-saving routing algorithm using Steiner tree.",
                    "Make it green and useful: Reshaping puzzles for identity management in large-scale distributed systems.",
                    "Assuring trustworthiness of sensor data for cyber-physical systems.",
                    "A framework for managing the selection of spatiotemporally relevant information providers.",
                    "Detecting job interference in large distributed multi-agent systems - A formal approach.",
                    "On the merits of SVC-based HTTP Adaptive Streaming.",
                    "Analysis of content charge by ISPs.",
                    "Slowing down to speed up: Mitigating collusion attacks in Content Distribution Systems.",
                    "CloudView: Enabling tenants to monitor and control their cloud instantiations.",
                    "Rethinking cloud platforms: Network-aware flexible resource allocation in IaaS clouds.",
                    "Dynamic SLA management with forecasting using multi-objective optimization.",
                    "Navigating the clouds with a MAP.",
                    "Improving present security through the detection of past hidden vulnerable states.",
                    "A semantic firewall for Content-Centric Networking.",
                    "Guaranteeing confidentiality in multi-domain networks: The PCE Anomaly Detector (PAD).",
                    "NEOD: Network Embedded On-line Disaster management framework for Software Defined Networking.",
                    "Provisioning of requests for virtual machine sets with placement constraints in IaaS clouds.",
                    "Balancing the load across virtual links from virtual machine requests in Distributed Clouds.",
                    "Improving virtual machines networking performance for cloud computing.",
                    "An architecture for virtualized home gateways.",
                    "Discovering service dependencies in mobile ad hoc networks.",
                    "A framework for integrated configuration management tools.",
                    "A statistical machine learning approach for ticket mining in IT service delivery.",
                    "Design of a management infrastructure for smart grid pilot data processing and analysis.",
                    "Image transfer optimization for agile development.",
                    "NCP: Service replication in data centers through software defined networking.",
                    "Effective resource control strategies using OpenFlow in cloud data center.",
                    "Software bundling selection for Cloud virtual machine images.",
                    "Cache-aware routing in Information-Centric Networks.",
                    "Viewing YouTube from a metropolitan area: What do users accessing from residential ISPs experience?",
                    "Evaluation of a policy-based network management system for energy-efficiency.",
                    "Power-effiicent resource allocation in MapReduce clusters.",
                    "VCG auction-based approach for efficient Virtual Network embedding.",
                    "An experimental study on dynamic network reconfiguration in a virtualized network environment using autonomic management.",
                    "CSS-VM: A centralized and semi-automatic system for VLAN management.",
                    "Dynamic CPU scheduling for QoS provisioning.",
                    "Nine years of observing traffic anomalies: Trending analysis in backbone networks.",
                    "NFQL: A tool for querying network flow records.",
                    "Constraint conditions to eliminate AS incentive of lying in interdomain routing.",
                    "Enhanced OSPF Graceful Restart.",
                    "SAVI testbed: Control and management of converged virtual ICT resources.",
                    "Methods for rapidly testing node reachability on multiple virtual private networks and evaluation.",
                    "Reliability-aware controller placement for Software-Defined Networks.",
                    "A redesign methodology for storage management virtualization.",
                    "OpenFlow: Why latency does matter.",
                    "Flow count: A CDN dynamic Replica Placement Algorithm for cross traffic optimization.",
                    "Enhancing network management frameworks with SDN-like control.",
                    "Network Virtualization: A step closer for seamless resource mobility.",
                    "Towards opportunistic flow management in OpenFlow.",
                    "Emulated and software defined networking convergence.",
                    "A new service platform unifying network control and its prototyping.",
                    "RDStore: In-network resource datastore with distributed processing of resource graph.",
                    "Runtime configuration validation for self-configurable systems.",
                    "Aesop: A semantic system for autonomic management of end-user service quality.",
                    "Performance of self-adapting power-saving algorithms for ICT systems.",
                    "A scheme for adaptive self-diagnosis of QoS degradation in future networks.",
                    "Delay-tolerant management using self-∗ properties and P2P technology.",
                    "Large-scale E-maintenance: A new frontier for management?",
                    "Selecting measurement paths for efficient network monitoring on a user-cooperative scheme.",
                    "Lightweight discovery and exchange of network information in distributed network management.",
                    "Towards interoperability of energy management systems using flexibility through conceptual modeling.",
                    "FTTH network design under power budget constraints.",
                    "Adaptive signatures of soft-failures in end-user devices using aggregated TCP statistics.",
                    "Building NETCONF-enabled network management systems with libnetconf.",
                    "A recommender-system for telecommunications network management actions.",
                    "IT Services Reference Catalog.",
                    "Integrating heterogeneous IT/network management models using linked data.",
                    "Compliance aware cross-organization medical record sharing.",
                    "Rational Policy System for Network Management.",
                    "Semantic web technologies to aid dominance detection for access control policies.",
                    "A behavior based policy management for adaptive trustworthiness assignment in future network.",
                    "Predictive network traffic engineering for streaming video service.",
                    "Selecting the most suited cache strategy for specific streaming media workloads.",
                    "ISP-driven practical P2P traffic control technique.",
                    "On the impact of packet sampling on Skype traffic classification.",
                    "Design of an emulation framework for evaluating large-scale open content aware networks.",
                    "Improving the security of Android inter-component communication.",
                    "MuSIC: An IT security architecture for inter-community clouds.",
                    "Overcoming DNSSEC performance issues with DHT-based architectures.",
                    "Byzantine Robustness for future inter-domain routing security through integrated management plane.",
                    "Routing tables building methods for increasing DNS(SEC) resolving platforms efficiency.",
                    "A key management scheme for Content Centric Networking.",
                    "On the automatic establishment of security relations for devices.",
                    "On differentiating cyber-insurance contracts a topological perspective.",
                    "Personalized radio: Using an integrated management system to uniquely personalize radio content.",
                    "A management suite for a disruption-tolerant wireless network testbed.",
                    "A novel self-organized optimization for wireless network nodes CAC mechanism.",
                    "Autonomic learning through stochastic games for rational allocation of scarce medical resources.",
                    "Data-centric programming environment for cooperative applications in WSN.",
                    "Architecture design for management as a service cloud.",
                    "MicroCloud-based network traffic monitoring.",
                    "Differentiating data collection for cloud environment monitoring.",
                    "Scheduling heterogeneous MapReduce jobs for efficiency improvement in enterprise clusters.",
                    "Energy aware scheduling across 'green' cloud data centres.",
                    "Scale-out architecture for service order processing systems.",
                    "When cloud virtual machine images need to be updated.",
                    "Network-aware coordination of virtual machine migrations in enterprise data centers and clouds.",
                    "Global enterprise cloud transformation: Centralize, distribute or federate?",
                    "Detecting software aging in a cloud computing framework by comparing development versions.",
                    "Migrating medical communications software to a multi-tenant cloud environment.",
                    "MiceTrap: Scalable traffic engineering of datacenter mice flows using OpenFlow.",
                    "Self-provisioning of network infrastructure for server landings in complex data center environments.",
                    "Universal Script Wrapper - An innovative solution to manage endpoints in large and heterogeneous environment.",
                    "Towards user-aware Peer-to-Peer live video streaming systems.",
                    "Federated and autonomic management of multimedia services.",
                    "A management framework for residential broadband environments.",
                    "Quality of Service analysis of Internet links with minimal information.",
                    "Data center resource management with temporal dynamic workload.",
                    "Design and management of collaborative intrusion detection networks.",
                    "Investigating event log analysis with minimum apriori information.",
                    "FRA: Financial Risk Analytics for IT Outsourcing contracts.",
                    "Assessing service deployment readiness using enterprise crowdsourcing.",
                    "Presence based open contact center leveraging social networks.",
                    "A language driven approach to multi-system access control.",
                    "Multi-vendor auto-connectivity in heterogeneous networks.",
                    "Large-scale geolocation for NetFlow.",
                    "Practical experience with IPFIX flow collectors.",
                    "A system for monitoring mobile networks using performance management events.",
                    "Pattern detection in unstructured data: An experience for a virtualized IT infrastructure.",
                    "Workload analysis and demand prediction for the HP ePrint Service.",
                    "Benefits and challenges of managing heterogeneous data centers.",
                    "A demonstration of automatic bootstrapping of resilient OpenFlow networks.",
                    "ACE: Automated capacity evaluation for HP ePrint.",
                    "Real-time search in clouds.",
                    "Maximizing server utilization while meeting critical SLAs via weight-based collocation management.",
                    "Ovaldroid: An OVAL-based vulnerability assessment framework for Android.",
                    "Demo: Zero touch configuration.",
                    "A common performance monitoring system for Wi-Fi and 3GPP networks.",
                    "Distributed monitoring of self-configuring Virtual Private Networks.",
                    "QoE monitoring (QMON) demo proposal.",
                    "Managing Software-Driven Networks with a unified management framework.",
                    "Simulation and evaluation of network resilience with PReSET.",
                    "Distributed Overlay Virtual Ethernet (DOVE) integration with Openstack.",
                    "DCSim: A data centre simulation tool.",
                    "Conflict free coordination of SON functions in a Unified Management Framework: Demonstration of a proof of concept prototyping platform.",
                    "Probability-based adaptive forwarding strategy in named data networking.",
                    "Information-centric networking based homenet.",
                    "CCN & TCP co-existence in the future Internet: Should CCN be compatible to TCP?",
                    "Graph contraction based self-organizing networks for future Internet.",
                    "Progressive virtual topology embedding in OpenFlow networks.",
                    "Secure resource provisioning across multiple domains.",
                    "A novel approach to accurately compute an IP traffic matrix using optical bypass.",
                    "An approach to energy-efficient virtual network embeddings.",
                    "Automated allocation and configuration of dual stack IP networks.",
                    "A novel scheme for node failure recovery in virtualized networks.",
                    "Collaborative selfish node detection with an incentive mechanism for opportunistic networks.",
                    "A platform for tenant network provisioning with provisioning template.",
                    "Using dynamic software variability to manage wireless sensor and actuator networks.",
                    "A framework for SLA establishment of virtual networks based on QoS classes.",
                    "Topology reconfiguration in Wi-Fi home networks.",
                    "Describing commercial virtual networks: Requirement analysis and TMF SID-based solution.",
                    "Toward user-classified P2P IPTV systems: A persona-based approach.",
                    "Towards early deployable Content-Centric Networking enhanced by using IPv6.",
                    "Towards the design of a platform for abuse detection in OSNs using multimedial data analysis.",
                    "RB-tracker: A fully distributed, replicating, network-, and topology-aware P2P CDN.",
                    "CacheMule: A mobile-carried content location mechanism.",
                    "ICEMAN: An architecture for secure federated inter-cloud identity management.",
                    "SARA: A tool for service levels - Aware contracts.",
                    "An ontology-based approach for semantic interoperability in interorganizational IT service management.",
                    "Value cost impact analysis: Estimating the IT cost impact of business developments.",
                    "Automatic optimization for a clustering based approach to support IT management.",
                    "Managing customers' IT capabilities in IT outsourcing over time: A system dynamic approach.",
                    "Adaptive and business-driven service placement in federated Cloud computing environments.",
                    "Robustness of comparison sequential test for the piloting in Service Delivery.",
                    "Towards value-based information security management monitoring.",
                    "Federated ICT for global supply chains: IT service management in cross-border trade.",
                    "A generic algorithm for mid-call audio codec switching.",
                    "Quality of experience driven control of interactive media stream parameters.",
                    "Model for estimating QoE of video delivered using HTTP adaptive streaming.",
                    "Evaluation of full-reference objective video quality metrics on high efficiency video coding.",
                    "Neurophysiological experimental facility for Quality of Experience (QoE) assessment.",
                    "Video quality monitoring based on precomputed frame distortions.",
                    "Optimized segmentation of H.264/AVC video for HTTP adaptive streaming.",
                    "Implementation and user-centric comparison of a novel adaptation logic for DASH with SVC.",
                    "Improving performance of H.264/AVC transmissions over vehicular networks.",
                    "Sampling in transform domain for improved QoE of 3D frame-compatible video coding.",
                    "No-reference algorithms for video quality assessment based on artifact evaluation in MPEG-2 and H.264 encoding standards.",
                    "Design of a large-scale subjective test in the cinema.",
                    "An eVoting platform for QoE evaluation.",
                    "Quality of experience in remote virtual desktop services.",
                    "A chemical-inspired approach to design distributed rate controllers for packet networks.",
                    "Autonomous resource provision in virtual data centers.",
                    "An experimental design approach for link loss inference on large networks.",
                    "Adaptive REST applications via model inference and probabilistic model checking.",
                    "Diagnosis of stochastic discrete event systems based on N-gram models with wildcard characters.",
                    "Improving network services' resilience using independent configuration replication.",
                    "Towards automatic network fault localization in real time using probabilistic inference.",
                    "Minimizing the impact of delay on live SVC-based HTTP adaptive streaming services.",
                    "Synthesis of observers for autonomic evolutionary systems from requirements models.",
                    "Perron-Frobenius measure of systemic risk of cascading overload in complex clouds: Work in progress.",
                    "Management engine using hierarchical role model: A new management platform for virtual networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th Integrated Network Management 2011",
        "info": "Dublin, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2011",
                "sub_name": "Proceedings of the 12th IFIP/IEEE International Symposium on Integrated Network Management, IM 2011, Dublin, Ireland, 23-27 May 2011.",
                "count": 171,
                "papers": [
                    "An information plane architecture supporting home network management.",
                    "Flow signatures of popular applications.",
                    "On the merits of popularity prediction in multimedia content caching.",
                    "An auditing system for multi-domain IP carrying Service Level Agreements.",
                    "Distributed inter-domain SLA negotiation using Reinforcement Learning.",
                    "Impact analysis of BGP sessions for prioritization of maintenance operations.",
                    "A data confidentiality architecture for developing management mashups.",
                    "Managing data retention policies at scale.",
                    "Run-time performance optimization and job management in a data protection solution.",
                    "Towards efficient resource management for data-analytic platforms.",
                    "A prototype for in-network management in NaaS-enabled networks.",
                    "Evaluating the impact of planning long-term contracts on the management of a hybrid IT infrastructure.",
                    "What will happen if cloud management operations burst out?",
                    "A hierarchical model to evaluate quality of experience of online services hosted by cloud computing.",
                    "Policy refinement of network services for MANETs.",
                    "Self-managed content-based routing for opportunistic networks.",
                    "Managing interoperation in multi-organization MANETs by dynamic gateway assignment.",
                    "Design and evaluation of a hierarchical application placement algorithm in large scale clouds.",
                    "Cloud services for SMEs: Contract Management's requirements specification.",
                    "Locating Virtual Infrastructures: Users and InP perspectives.",
                    "SLA-aware placement of multi-virtual machine elastic services in compute clouds.",
                    "Licence-aware management of virtual machines.",
                    "On the use of SNMP as a management interface for virtual networks.",
                    "VMSpreader: Multi-tier application resiliency through virtual machine striping.",
                    "A coordination framework for self-organisation in LTE networks.",
                    "FAST: A fuzzy-based adaptive scheduling technique for IEEE 802.16 networks.",
                    "Magneto approach to QoS monitoring.",
                    "Pattern-based composite application deployment.",
                    "ReComp: QoS-aware recursive service composition at minimum cost.",
                    "Static discovery and remediation of code-embedded resource dependencies.",
                    "Support for concurrent adaptation of multiple Web service compositions to maximize business metrics.",
                    "Leveraging IT project lifecycle data to predict support costs.",
                    "QoS adaptation in inter-domain services.",
                    "Towards solid IT Change Management: Automated detection of conflicting IT change plans.",
                    "Elimination based Fault Localization in shared resource environments.",
                    "Probabilistic differentiated availability services in WDM networks protected by shared protection schemes.",
                    "PTF: Passive Temporal Fingerprinting.",
                    "Incorporating virtualization awareness in service monitoring systems.",
                    "The impact of power management to spectrum trading.",
                    "A P2P-Based self-healing service for network maintenance.",
                    "Observing the BitTorrent universe through Telescopes.",
                    "On the inefficacy of Euclidean classifiers for detecting self-similar Session Initiation Protocol (SIP) messages.",
                    "User behavior anticipation in P2P live video streaming systems through a Bayesian network.",
                    "Adaptive and self-configurable honeypots.",
                    "An experimental testbed to predict the performance of XACML Policy Decision Points.",
                    "Artemisa: An open-source honeypot back-end to support security in VoIP domains.",
                    "Performance analysis in Intrusion Detection and Prevention Systems.",
                    "Mining unstructured log files for recurrent fault diagnosis.",
                    "Statistical techniques for online anomaly detection in data centers.",
                    "On the use of weighted syslog time series for anomaly detection.",
                    "BALG: Bypassing Application Layer Gateways using multi-staged encrypted shellcodes.",
                    "A middleware-based approach to supporting trust-based service selection.",
                    "Online traffic classification based on sub-flows.",
                    "Coordination and information exchange among resource management agents.",
                    "Semantic overlay network for peer-to-peer hybrid information search and retrieval.",
                    "SLA-driven applicability analysis for patch management.",
                    "Towards global service level guarantee within autonomic computing systems.",
                    "An efficient parallel TCAM scheme for the forwarding engine of the next-generation router.",
                    "Building reliable centralized intra-domain routing in Trustworthy and Controllable Network.",
                    "Adaptive post-failure load balancing in fast reroute enabled IP networks.",
                    "A broad-spectrum strategy for runtime risk management in VoIP enterprise architectures.",
                    "Measuring the quality of experience of HTTP video streaming.",
                    "Performance management of Java-based SIP application servers.",
                    "VoIP quality monitoring in LTE femtocells.",
                    "IEEE802.11k enabled adaptive carrier sense management mechanism (KAPCS2).",
                    "Resilient approach for energy management on Hot Spots in WSNs.",
                    "Cost-efficient deployment of a wireless sensor network under dynamic spectrum sharing.",
                    "A declarative approach for global network security configuration verification and evaluation.",
                    "Host-identifier-based scheme for source accountability of the internet.",
                    "Leveraging social network for predicting demand and estimating available resources for communication network management.",
                    "A subscription model for time-scheduled data transfers.",
                    "Modelling and evaluation of a policy-based resource management framework for converged next generation networks.",
                    "Private recommendation service for IPTV systems: Protecting user profile privacy.",
                    "A framework for migrating production snapshots of composite applications to virtualized environments.",
                    "A solution for identifying the root cause of problems in IT change management.",
                    "Effective VM sizing in virtualized data centers.",
                    "Filtering multivariate workload non-conformance in shared IT-infrastructures.",
                    "A bandwidth scheduler for triple play services based on fuzzy theory.",
                    "Enhancing cooperation with multiple stage auctions in opportunistic routing for wireless mesh networks.",
                    "Measurements on movie distribution behavior in Peer-to-Peer networks.",
                    "Chargeback model for resource pools in the cloud.",
                    "A next generation entropy based framework for alert detection in system logs.",
                    "An event management communication system for Wireless Sensor Networks.",
                    "Dynamic shared groups within XMPP: An investigation of the XMPP group model.",
                    "Automatic and independent Domain Name Service Configuration Management.",
                    "Performance evaluation of service searching using aggregation in peer-to-peer Service Overlay Networks.",
                    "Federated autonomic management of HAN services.",
                    "Practical IPv6 monitoring-challenges and techniques.",
                    "Intelligent energy efficient network management across the access networks to CPE pathway.",
                    "A semantic monitoring and management framework for end-to-end services.",
                    "A new method of network bottleneck diagnosis.",
                    "Feedback-based learning for self-managed network elements.",
                    "Dynamic bit-rate adjustment based on traffic characteristics for metro and core networks.",
                    "IEEE 802.21 MIH in Linux Kernel space for cognitive and smart handovers.",
                    "Sustainable QoS provisioning platform for network services based on flexible combination of distributed components.",
                    "On the design of Virtual machine Intrusion detection system.",
                    "A state recognition method based on screen images toward advanced integrated operation management support.",
                    "A characterization study of SNMP usage patterns.",
                    "INSPIRE Ontology Handler: Automatically building and managing a knowledge base for Critical Information Infrastructure protection.",
                    "An approach for autonomic performance management in SOA workflows.",
                    "Online monitoring for sustainable communities of Web Services.",
                    "Limiting pre-distribution and clustering users on multicast pre-distribution VoD.",
                    "MapReduce framework based distributed NMS architecture.",
                    "Cover-VT: Converged Security Visualization Tool.",
                    "A multiple criteria service composition selection algorithm supporting time-sensitive rules.",
                    "A low-energy consuming and user-centric security management architecture adapted to mobile environments.",
                    "Distributed demand response and user adaptation in smart grids.",
                    "Wi-design, Wi-manage, why bother?",
                    "Embedded approach for device inventory collection utilizing OS programmability.",
                    "Virtualisation - Securing a greener tomorrow with yesteryear' technology.",
                    "The cost of service quality in IT Outsourcing.",
                    "Presence based network topology tracing system for VoIP networks.",
                    "YANG-based configuration modeling - The SecSIP IPS case study -.",
                    "COPD24: From Future Internet technologies to health telemonitoring and teletreatment application.",
                    "Policy-based coordination and management of SON functions.",
                    "LTE relay node self-configuration.",
                    "Network topology visualization and monitoring for multi-hop wireless networks.",
                    "Novel distributed call admission control solution based on machine learning approach.",
                    "OMEGA-Q: A platform for measuring, troubleshooting and monitoring the quality of IPTV services.",
                    "Discovering anomalous behavior in large networked systems.",
                    "Planetopus: A system for facilitating collaborative network monitoring.",
                    "Monitoring as an SLA-oriented consumable service for SaaS assurance: A prototype.",
                    "Self-configuration of wireless multi-hop networks.",
                    "Self-management of hybrid optical and packet switching networks.",
                    "An open architecture for distributed IP traffic analysis (DITA).",
                    "Flow-based intrusion detection.",
                    "Business-driven IT management.",
                    "Distributed monitoring and resource management for large cloud environments.",
                    "On the investigation of the joint use of self-* properties and Peer-To-Peer for network management.",
                    "Telco clouds and Virtual Telco: Consolidation, convergence, and beyond.",
                    "A method to reduce interruption time considering number of clients on broadcast and communications integration environments.",
                    "Performance evaluation and improvement of TCP throughput over PFMIPv6 with MIH.",
                    "Joint source channel coding optimization for heterogeneous access networks in multiuser scenario.",
                    "Hybrid optical and wireless technology integrations for next generation broadband access networks.",
                    "Taking advantage of the diversity in wireless access networks: On the simulation of a user centric approach.",
                    "The node-centric formulation for network utility maximization of multihop wireless networks with elastic and inelastic traffic.",
                    "Contract Management for Cloud Services: Information modelling aspects.",
                    "An information model for inter-organizational fault management.",
                    "A maturity model for tool landscapes of IT service providers.",
                    "A study in the expressiveness of semantically different policy modelling schemes.",
                    "Towards automated business-driven indication and mitigation of VM sprawl in Cloud supply chains.",
                    "Learning to self-recover.",
                    "Initial thoughts on business-driven IT management challenges in Cloud computing providers.",
                    "Towards a Configuration Management System for hybrid cloud deployments.",
                    "Towards adopting a tooldriven, integrated and automated change management process for virtual machine provisioning.",
                    "On decision making in business-driven IT management.",
                    "On the design of a flexible software platform for in-building OTT service provisioning.",
                    "A business-driven IT services improvement model.",
                    "Towards automatic provisioning and validation of Ethernet services over transport networks.",
                    "Autonomic management of client concurrency in a distributed storage service.",
                    "Introducing automated management through iteratively increased automation and indicators.",
                    "GSQR: A generic service quality reporting protocol for terminals.",
                    "UML visualization of YANG models.",
                    "Situated vs. global aggregation schemes for autonomous management systems.",
                    "Adopting the DSM paradigm: Defining federation scenarios through resource brokers for experimentally driven research.",
                    "Explicit federal relationship management to support semantic integration.",
                    "A component-based orchestration management framework for multidomain SOA.",
                    "Analysis of cooperative management strategies against route-hijacking.",
                    "Improving the efficiency of collaborative work with trust management.",
                    "Conflict analysis during authoring of management policies for federations.",
                    "Extension for information card systems to achieve User-Controlled Automated Identity Delegation.",
                    "Trust management of XMPP federation.",
                    "Heterogeous resource description and management in generic resource federation frameworks.",
                    "Inherently self-managed networks: Requirements, properties and an initial model.",
                    "A distributed network monitoring framework for wireless networks.",
                    "Network virtualization in GpENI: Framework, implementation & integration experience.",
                    "Towards a compelling new Internet platform.",
                    "OSLAM: Towards ontology-based SLA management for IPTV services.",
                    "Managing federations of virtualized infrastructures: A semantic-aware policy based approach.",
                    "Optimized network utilisation through buffering in PCN enabled multimedia access networks.",
                    "Context-aware characterisation of energy consumption in data centres."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "11th Integrated Network Management 2009",
        "info": "Hofstra University, Long Island, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2009",
                "sub_name": "Integrated Network Management, IM 2009. 11th IFIP/IEEE International Symposium on Integrated Network Management, Hofstra University, Long Island, NY, USA, June 1-5, 2009.",
                "count": 111,
                "papers": [
                    "Configuring resource managers using model fuzzing: A case study of the .NET thread pool.",
                    "Business-impact analysis and simulation of critical incidents in IT service management.",
                    "A universal method for composing business transaction models using logs.",
                    "Probabilistic decentralized network management.",
                    "Robust and scalable trust management for collaborative intrusion detection.",
                    "A rule-based distributed system for self-optimization of constrained devices.",
                    "Policy control management for Web Services.",
                    "Predictive routing of contexts in an overlay network.",
                    "Planning-based configuration and management of distributed systems.",
                    "Service management architecture and system capacity design for PhoneFactorTM - A two-factor authentication service.",
                    "Autonomic service hosting for large-scale distributed MOVE-services.",
                    "A systematic and practical approach to generating policies from service level objectives.",
                    "CHANGEMINER: A solution for discovering IT change templates from past execution traces.",
                    "DACS scheme as next generation Policy-based network management scheme.",
                    "A new approach for multi-sink environments in WSNs.",
                    "Towards an information model for ITIL and ISO/IEC 20000 processes.",
                    "Rapid Service Creation Environment for service delivery platform based on service templates.",
                    "Designing stand-by gateway for managing a waste of networked home-device power.",
                    "Rate-based SIP flow management for SLA satisfaction.",
                    "A generic end-to-end monitoring architecture for multimedia services.",
                    "Secure interworking & roaming of WiMAX with 3G and Wi-Fi.",
                    "Four questions that determine whether traffic management is reasonable.",
                    "Real-time root cause analysis in OSS for a multilayer and multi-domain network using a hierarchical circuit model and scanning algorithm.",
                    "Extending the CIM-SPL policy language with RBAC for distributed management systems in the WBEM infrastructure.",
                    "Probabilistic fault diagnosis for IT services in noisy and dynamic environments.",
                    "Session resumption for the secure shell protocol.",
                    "PCE-based hierarchical segment restoration.",
                    "SecSip: A stateful firewall for SIP-based networks.",
                    "Using argumentation logic for firewall configuration management.",
                    "Evaluating WS-security and XACML in web services-based network management.",
                    "Performance management via adaptive thresholds with separate control of false positive and false negative errors.",
                    "Optimizing correlation structure of event services considering time and capacity constraints.",
                    "Fault detection in IP-based process control networks using data mining.",
                    "A user-centric network management framework for high-density Wireless LANs.",
                    "MeshMan: A management framework for wireless mesh networks.",
                    "A scalable PBNM framework for MANET management.",
                    "Adaptable misbehavior detection and isolation in wireless ad hoc networks using policies.",
                    "Monitoring of SLA compliances for Hosted Streaming Services.",
                    "Gossiping for threshold detection.",
                    "Monitoring and counter-profiling for Voice over IP networks and services.",
                    "Event handling in clean-slate Future Internet management.",
                    "Security and mobility architecture for isolated wireless networks using WIMAX as an infrastructure.",
                    "Investigating the role of a transmission initiator in private peering arrangements.",
                    "Framework to achieve multi-domain service management.",
                    "Analysing Joost peer to peer IPTV protocol.",
                    "Problem classification method to enhance the ITIL incident and problem.",
                    "How much management is management enough? Providing monitoring processes with online adaptation and learning capability.",
                    "Application-specific packet capturing using kernel probes.",
                    "RESERVOIR: Management technologies and requirements for next generation Service Oriented Infrastructures.",
                    "Collaborative content caching algorithms in mobile ad hoc networks environment.",
                    "A policy based security management architecture for sensor networks.",
                    "Managing responsiveness of virtual desktops using passive monitoring.",
                    "Shares and utilities based power consolidation in virtualized server environments.",
                    "iMark: An identity management framework for network virtualization environment.",
                    "Enabling high-speed and extensible real-time communications monitoring.",
                    "Monitoring the impact of P2P users on a broadband operator's network.",
                    "Controlling performance trade-offs in adaptive network monitoring.",
                    "Computing histograms of local variables for real-time monitoring using aggregation trees.",
                    "Heteroscedastic models to track relationships between management metrics.",
                    "SIPFIX: A scheme for distributed SIP monitoring.",
                    "Embedded system management using WBEM.",
                    "Control information description model and processing mechanism in the trustworthy and controllable network.",
                    "Supporting communities in programmable grid networks: gTBN.",
                    "A latency-aware algorithm for dynamic service placement in large-scale overlays.",
                    "ITU-T RACF implementation for application-driven QoS control in MPLS networks.",
                    "Management of SOA based NGN service exposure, service discovery and service composition.",
                    "Using heuristics to improve service portfolio selection in P2P grids.",
                    "A solution to support risk analysis on IT Change Management.",
                    "Defensive configuration with game theory.",
                    "Algorithms for SLA composition to provide inter-domain services.",
                    "On Semantic and Compliance of SNMP MIBs in IP/MPLS routers.",
                    "Monitoring probabilistic SLAs in Web service orchestrations.",
                    "Queuing model based end-to-end performance evaluation for MPLS Virtual Private Networks.",
                    "Enhanced cognitive resource management for QoS-guaranteed service provisioning in home/office network.",
                    "End to end session based bearer control for IP multimedia subsystems.",
                    "Performance of distributed reservation control in wavelength-routed all-optical WDM networks with Adaptive Alternate Routing.",
                    "Techniques for better alias resolution in Internet topology discovery.",
                    "On the feasibility of static analysis for BGP convergence.",
                    "Architectural principles and elements of in-network management.",
                    "An evaluation of network management protocols.",
                    "Adaptive management of connections to meet availability guarantees in SLAs.",
                    "A management scheme of SRLG-disjoint protection path.",
                    "Experiences in using MUWS for scalable distributed monitoring.",
                    "Towards an optimized model of incident ticket correlation.",
                    "Self-management of hybrid networks: Can we trust netflow data?",
                    "Analyzing end-to-end network reachability.",
                    "Applying quorum role in network management.",
                    "Security management with scalable distributed IP traceback.",
                    "Survivable keying for wireless ad hoc networks.",
                    "EJB-based implementation of L1VPN NMS controlled by each customer.",
                    "DeskBench: Flexible virtual desktop benchmarking toolkit.",
                    "Memory overbooking and dynamic control of Xen virtual machines in consolidated environments.",
                    "Refined failure remediation for IT change management systems.",
                    "Mobile service-oriented content delivery in wireless mesh networks.",
                    "An efficient spectrum management mechanism for cognitive radio networks.",
                    "Building end-to-end management analytics for enterprise data centers.",
                    "SURFmap: A network monitoring tool based on the Google Maps API.",
                    "Auto-connectivity and security setup for access network elements.",
                    "Introducing process-oriented IT service management at an academic computing center: An interim report.",
                    "Multi-tenant solution for IT service management: A quantitative study of benefits.",
                    "Best practices for deploying a CMDB in large-scale environments.",
                    "Modeling remote desktop systems in utility environments with application to QoS management.",
                    "A model based approach to autonomic management of virtual networks.",
                    "Web-based administration of grid credentials for identity and authority delegation.",
                    "Adaptive real-time monitoring for large-scale networked systems.",
                    "Policy-based self-management of wireless ad hoc networks.",
                    "STACO - An accounting configuration architecture for multi-service mobile networks.",
                    "Adaptive response system for distributed denial-of-service attacks.",
                    "Performance of network and service monitoring frameworks.",
                    "On harnessing information models and ontologies for policy conflict analysis.",
                    "An approach to measurement based Quality of Service control for communications networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th Integrated Network Management 2007",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2007",
                "sub_name": "Integrated Network Management, IM 2007. 10th IFIP/IEEE International Symposium on Integrated Network Management, Munich, Germany, 21-25 May 2007.",
                "count": 109,
                "papers": [
                    "CLID: A general approach to validate security policies in a dynamic network.",
                    "A model for checking consistency in access control policies for network management.",
                    "Towards simplified specification of policies in different domains.",
                    "Issues in Designing a Policy Language for Distributed Management of IT Infrastructures.",
                    "Efficient Resource Virtualization and Sharing Strategies for Heterogeneous Grid Environments.",
                    "Compass: Cost of Migration-aware Placement in Storage Systems.",
                    "Towards an Accounting System for Multi-Provider Grid Environments.",
                    "A Service Middleware that Scales in System Size and Applications.",
                    "Evaluation of a Decentralized Architecture for Large Scale Collaborative Intrusion Detection.",
                    "Interactive Informatics on Internet Infrastructure.",
                    "Real-time Analysis of Flow Data for Network Attack Detection.",
                    "VoIP Honeypot Architecture.",
                    "Dynamic Placement of Virtual Machines for Managing SLA Violations.",
                    "Self-Adaptive Capacity Management for Multi-Tier Virtualized Environments.",
                    "Server virtualization in autonomic management of heterogeneous workloads.",
                    "Capacity and Performance Overhead in Dynamic Resource Allocation to Virtual Containers.",
                    "Deterministic Models of Software Aging and Optimal Rejuvenation Schedules.",
                    "PANACEA Towards a Self-healing Development Framework.",
                    "Autonomic Software Release Management for Communications Networks.",
                    "Management of Multidomain End-to-End Links; A Federated Approach for the Pan-European Research Network Géant 2.",
                    "Using the Network Description Language in Optical Networks.",
                    "Path Computation Algorithms for Dynamic Service Provisioning in SDH Networks.",
                    "Real-time Application Monitoring and Diagnosis for Service Hosting Platforms of Black Boxes.",
                    "Robust Monitoring of Network-wide Aggregates through Gossiping.",
                    "Toward Globally Optimal Event Monitoring & Aggregation For Large-scale Overlay Networks.",
                    "UAMA: a unified architecture for active measurements in IP networks; End-to-end objetive quality indicators.",
                    "Business-Driven Optimization of Policy-Based Management solutions.",
                    "Automated Availability Management Driven by Business Policies.",
                    "Predicting Labor Cost through IT Management Complexity Metrics.",
                    "The Evaluation of the Efficient Prepaid Scheme TICA for All-IP Networks and Internet Services.",
                    "Estimating End-to-End Performance by Collaborative Prediction with Active Sampling.",
                    "A Generic Application-Oriented Performance Instrumentation for Multi-Tier Environments.",
                    "Network Instrumentation for End-to-End Measurements.",
                    "SNMP Traffic Analysis: Approaches, Tools, and First Results.",
                    "SANchk: An SQL-Based Validation System for SAN Confiuration.",
                    "A decision support tool to optimize scheduling of IT changes.",
                    "Planning and Managing the IPTV Service Deployment.",
                    "Automation Controller for Operational IT Management.",
                    "Assessing the security of VoIP Services.",
                    "A Trustworthy Mobile Agent Infrastructure for Network Management.",
                    "A Hybrid Approach to Operating System Discovery using Answer Set Programming.",
                    "A Version-aware Approach for Web Service Client Application.",
                    "Flexible Automatic Service Brokering for SOAs.",
                    "An Evaluation of Service Composition Technologies Applied to Network Management.",
                    "Declarative Specification of Service Management Attributes.",
                    "Service Assurance Process Re-Engineering Using Location-aware Infrastructure Intelligence.",
                    "Service Management in a Dynamic E-Business Environment.",
                    "On the Performance of Web Services Management Standards - An Evaluation of MUWS and WS-Management for Network Management.",
                    "Access Point Selection for Improving Throughput Fairness in Wireless LANs.",
                    "Design and Evaluation of Distributed Load-Balancing for Wireless Networks.",
                    "A toolbox of mechanisms for robust and scalable service discovery in mobile ad-hoc networks.",
                    "Network Element Auto-configuration in a Managed Network.",
                    "Customer Equipment Configuration Manager for Managed Network Service Providers.",
                    "The Cost Effective, Efficient Integrated-View Solution : Identification & Personalization for OSS Created Contents.",
                    "Automated Management of Disaster Recovery Systems Using Adaptive Scheduling.",
                    "Management of Biometric Data in a Distributed Internet Environment.",
                    "Towards usable and reasonable Identity Management in heterogeneous IT infrastructures.",
                    "Building a Grid Infrastructure with Instant-Grid for Demonstration, Test and Development.",
                    "Managing P2P services via the IMS.",
                    "Troubleshooting SIP Environments.",
                    "TestYourVoIP - A System for Measuring Internet Voice Quality.",
                    "Finding Elephant flows for optical networks.",
                    "Mining Infrastructure Data for System Management Optimization.",
                    "Applying Autonomic Computing with Open Standardized Resource Interface WSDM to Managing Multi-vendor IT Systems.",
                    "Entity MIB and Virtualization.",
                    "A CASE Tool to Support the MIB Development Process.",
                    "Fault Management based on peer-to-peer paradigms; A case study report from the CELTIC project Madeira.",
                    "Galapagos: Automatically Discovering Application-Data Relationships in Networked Systems.",
                    "Hierarchically Federated Registration and Lookup within the perfSONAR Framework.",
                    "IT Service Management for Campus Environment-Practical Concerns in Implementation.",
                    "Learning attack strategies through mining and correlation of security alarms.",
                    "OSPF Failure Identification based on LSA Flooding Analysis.",
                    "Policy-driven Business Management over Web Services.",
                    "Realising Adaptive Web Services through Automated Policy Refinement.",
                    "Reducing Complexity of Software Deployment with Delta Configuration.",
                    "Reliability of Service Level Estimators in the Data Centre.",
                    "Requirements for Managing Distributed Packet Filter Configurations in Carrier-grade Networks.",
                    "Roles Considered Harmful in Policy-based Management for Dynamic Organisations.",
                    "Seamless Integration of Network Management Tools in a Multi-Domain Environment.",
                    "Self-Management of Context-Aware Overlay Ambient Networks.",
                    "Server Capacity Planning with Priority Allocation for Service Level Management in Heterogeneous Server Clusters.",
                    "Service Provider Considerations for IT Service Management.",
                    "SML Model-based Management.",
                    "Storage Planning and Management Using a Web-Based Management Service.",
                    "Towards Automatic Composition of Network Management Web Services.",
                    "Towards Autonomic Provisioning of Wireless Grid Services.",
                    "Virtualizing Resources: Customer-Oriented Cross-Domain Monitoring for Service Grids.",
                    "A Capacity Planning Framework for Multi-tier Enterprise Services with Real Workloads.",
                    "A Classification-Based Approach to Policy Refinement.",
                    "A distributed signaling for the provisioning of on-demand VPN services in transport networks.",
                    "A Framework for Congestion Control for Reliable Data Delivery in Wireless Sensor Networks.",
                    "A Framework for Lightweight QoS Provisioning: Network Planes and Parallel Internets.",
                    "A Logic-based Approach for IP Network Services Management and Configuration.",
                    "A Model-based Simulation Approach to Error Analysis of IT Services.",
                    "A Scalable Modeling Language for Specifying Access Control in Tree Based Structures.",
                    "An Algorithm to Detect Packet Forwarding Misbehavior in Mobile Ad-Hoc Networks.",
                    "An Autonomic Approach to Verify End-to-End Communication Quality.",
                    "An information model for the management of Optical Burst Switched networks.",
                    "Artifact Reuse Method using Knowledge Base to Develop Operation Support Systems.",
                    "Authentication Optimization for Seamless Handovers.",
                    "Automated deployment and Aggregated access control for SOA composite applications.",
                    "Automated Provisioning of Shared Services.",
                    "Automatic Structuring of IT Problem Ticket Data for Enhanced Problem Resolution.",
                    "Automating the Generation, Deployment and Application of Charging Schemes for Composed IMS Services.",
                    "Autonomic Management of Component-Based Embedded Software.",
                    "AutoSeek: A Method to Identify Candidate Automation Steps in IT Change Management.",
                    "Design of NGOSS TSA Using Web Services Technologies.",
                    "Design of the pCASE Platform for enabling Context Aware Services.",
                    "Extracting Bulk Configuration Data from a Relational UMTS Management Database."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "9th Integrated Network Management 2005",
        "info": "Nice, France",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2005",
                "sub_name": "Integrated Network Management, IM 2005. 9th IFIP/IEEE International Symposium on Integrated Network Management, 15-19 May 2005, Nice, France.",
                "count": 68,
                "papers": [
                    "Programmable middleware for the dynamic deployment of services and protocols in ad hoc networks.",
                    "Management of mobile ad-hoc networks: evaluating the network behavior.",
                    "LHA-SP: secure protocols for hierarchical wireless sensor networks.",
                    "Efficient energy management protocol for target tracking sensor networks.",
                    "Monitormining: creating domain knowledge for system automation using a gray-box approach.",
                    "Health monitoring and control for application server environments.",
                    "Data-driven monitoring design of service level and resource utilization.",
                    "Data mining techniques for effective and scalable traffic analysis.",
                    "Real-time views of network traffic using decentralized management.",
                    "Anomaly detection for Internet worms.",
                    "Adaptable server clusters with QoS objectives.",
                    "Adaptive entitlement control of resource containers on shared servers.",
                    "Control of fair queueing: modeling, implementation, and experiences.",
                    "Automatic tuning of ADSL circuits.",
                    "Redesigning network topology with technology considerations.",
                    "Reducing the complexity of application deployment in large data centers.",
                    "A framework for applying inventory control to capacity management for utility computing.",
                    "Root-cause analysis of SAN performance problems: an I/O path affine search approach.",
                    "Quartermaster - a resource utility system.",
                    "Cooperation of control and management plane for provisioning in MPLS networks.",
                    "A novel service oriented framework for automatically switched transport network.",
                    "On the management of aggregation networks with rapidly moving traffic demands.",
                    "Zero-budget network dimensioning.",
                    "A location-based incentive pricing scheme for tree-based relaying in multi-hop cellular networks.",
                    "A tariff model to charge IP services with guaranteed quality: effect of users' demand in a case study.",
                    "Stabilizing markets via a novel auction based pricing mechanism for short-term contracts for network services.",
                    "Decentralized auction-based pricing with PeerMart.",
                    "QoS-aware service composition in large scale multi-domain networks.",
                    "Self-adaptive distributed management of QoS and SLSs in multiservice networks.",
                    "Efficient management of transcoding and multicasting multimedia streams.",
                    "Integrating changes to a hierarchical policy model.",
                    "Policy management for networked systems and applications.",
                    "Policy refinement for DiffServ quality of service management.",
                    "Measurement based networking approach applied to congestion control in the multi-domain Internet.",
                    "Packet marking for integrated load control.",
                    "Efficient transmission of periodic that follows a consistent daily pattern.",
                    "Test-based diagnosis: tree and matrix representations.",
                    "Active integrated fault localization in communication networks.",
                    "Scalable fault management for mobile networks beyond 3G.",
                    "Management of NAT-based private networks.",
                    "An integrated security framework for XML based management.",
                    "Comparing Web services with SNMP in a management by delegation environment.",
                    "Characterization of SNMP MIB modules.",
                    "A model of configuration complexity and its application to a change management system.",
                    "Semantic techniques for reconfiguring adapting networks in pervasive environments.",
                    "A model-driven approach to rapid service introduction.",
                    "Moving from data modeling to process modeling in CIM.",
                    "Investigating the feasibility of open development of operations support solutions.",
                    "Distributed messaging using meta channels and message bins.",
                    "OSS functions for flexible charging and billing of mobile services in a federated environment.",
                    "Threshold management for problem determination in transaction based e-commerce systems.",
                    "Using automatically derived load thresholds to manage compute resources on-demand.",
                    "Towards an optimal network survivability threshold.",
                    "Is policy-based management possible?",
                    "Should we share honeypot information for security management?",
                    "Service-level agreement - how to reach the practical agreement, not the announcement.",
                    "Introduction to control theory for computer scientists.",
                    "Peer-to-peer networking and management.",
                    "Internet management: status and challenges.",
                    "Autonomic networking theory and practice.",
                    "Managing network security policies: firewall and IPSec/VPN.",
                    "Management of wireless sensor networks.",
                    "MPLS operations and management.",
                    "Planning, management and auto-tuning techniques for UMTS and heterogeneous radio acess networks.",
                    "Management of enterprise web applications: problems, approaches, solutions.",
                    "Integrated management of denial-of-service attacks.",
                    "Traffic engineering and quality of service management for IP-based next generation networks.",
                    "Grid computing: fundamentals and management challenges."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "8th Integrated Network Management 2003",
        "info": "Colorado Springs, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2003",
                "sub_name": "Integrated Network Management VII, Managing It All, IFIP/IEEE Eighth International Symposium on Integrated Network Management (IM 2003), March 24-28, 2003, Colorado Springs, USA.",
                "count": 65,
                "papers": [
                    "An SNMP Agent for Stateful Intrusion Inspection.",
                    "Firewall Policy Advisor for Anomaly Discovery and Rule Editing.",
                    "A Scaled, Immunological Approach to Anomaly Countermeasures: Combining pH with Cfengine.",
                    "A Highly Distributed Dynamic IP Multicast Accounting and Management Framework.",
                    "User Oriented IP Accounting in Multi-user Systems.",
                    "Tariff-Based Pricing and Admission Control for DiffServ Networks.",
                    "Monitoring Distributed Systems: A Publish/Subscribe Methodology and Architecture.",
                    "Proactive Intrusion Detection and SNMP-based Security Management: New Experiments and Validation.",
                    "NetLogger: A Toolkit for Distributed System Performance Tuning and Debugging.",
                    "A Case Study of Three Open Source Security Management Tools.",
                    "MTreeDx: A Multicast Network Diagnosis Tool.",
                    "Multiple Authorization - A Model and Architecture for Increased, Practical Security.",
                    "A Controller Agent Model to Counteract DoS Attacks in Multiple Domains.",
                    "Toward Understanding Soft Faults in High Performance Cluster Networks.",
                    "RDF-based Knowledge Models for Network Management.",
                    "Process Management and Control for Heterogeneous Domain Models.",
                    "Semantic Management: Application of Ontologies for the Integration of Management Information Models.",
                    "A Conceptual Framework for Building CIM-based Ontologies.",
                    "Policy-based Cooperation of Services in Ubiquitous Environments.",
                    "Design and Implementation of an Information Model for Integrated Configuration and Performance Management of MPLS-TE/VPN/QoS.",
                    "Using the Access Grid as a Testbed for Network Management Research.",
                    "Automating Placement of Instrumentation in Applications.",
                    "Generic On-Line Discovery of Quantitative Models for Service Level Management.",
                    "A Generic Model for IT Services and Service Management.",
                    "A Revenue-based Model for Making Resource Investment Decisions in IP Networks.",
                    "Policy Provisioning Performance Evaluation using COPS-PR in a Policy Based Network.",
                    "Design and Implementation of a Policy-based Resource Management Architecture.",
                    "BANDS: An Inter-domain Internet Security Policy Management System for IPSec/VPN.",
                    "Performance Management for Cluster Based Web Services.",
                    "Facilitating Efficient and Reliable Monitoring through HAMSA.",
                    "Dynamic Load Balancing for Distributed Network Management.",
                    "Scalability of Peer Configuration Management in Partially Reliable and Ad Hoc Networks.",
                    "Khnum - A Scalable Rapid Application Deployment System for Dynamic Hosting Infrastructures.",
                    "Enabling PreOS Desktop Management.",
                    "Peer-to-Peer Overlay Network Management through AGILE.",
                    "Web Services Management Network: An Overlay Network for Federated Service Management.",
                    "Auto-Discovery at the Network and Service Management Layer.",
                    "Managing Heterogeneous Services and Devices with the Device Unifying Service: Implemented with Parlay APIs.",
                    "Delegation of Expressions for Distributed SNMP Information Processing.",
                    "Weaver: Realizing a Scalable Management Paradigm on Commodity Routers.",
                    "Adaptive Resource Management of a Virtual Call Center Using a Peer-to-Peer Approach.",
                    "Analysis of Mobile Radio Access Network Using the Selforganizing Map.",
                    "An Architecture for Provisioning IP Services in an Operations Support System.",
                    "Wireless Terminal Management Architectures.",
                    "A Scalable and Efficient Inter-domain QoS Routing Architecture for Diffserv Networks.",
                    "Software Distribution for Wireless Devices: A Rconfigurable Approach.",
                    "VPDC: Virtual Private Data Center: A Flexible and Rapid Workloadmanagement System.",
                    "X-CLI: CLI-based Management Architecture using XML.",
                    "A Dynamic SNMP to XML Proxy Solution.",
                    "Interact-DDM: A Solution for the Integration of Domestic Devices on Network Management Platforms.",
                    "An SMIng-centric Proxy Agent for Integrated Monitoring and Provisioning.",
                    "Towards XML Oriented Internet Management.",
                    "Grid Object Description: Characterizing Grids.",
                    "Policy Specification and Architecture for Quality of Service Mangement.",
                    "Resource Access Management for a Utility Hosting Enterprise Applications.",
                    "SLA-driven Management of Distributed Systems Using the Common Information Model.",
                    "A Management-aware Software Development Process Using Design Patterns.",
                    "Managing Virtual Storage Systems: An Approach Using Dependency Analysis.",
                    "Design and Implementation of a Generic Software Architecture for the Management of Next-Generation Residential Services.",
                    "Using Neural Networks to Identify Control and Management Plane Poison Messages.",
                    "Probabilistic Event-driven Fault Diagnosis Through Incremental Hypothesis Updating.",
                    "Hierarchical End-to-End Service Recovery.",
                    "GMPLS Fault Management and Its Impact on Service Resilience Differentiation.",
                    "Functional Evaluation of an Integrated IP over WDM.",
                    "A Network-oriented Power Management Architecture."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7th Integrated Network Management 2001",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/2001",
                "sub_name": "2001 IEEE/IFIP International Symposium on Integrated Network Management, IM 2001, Seattle, USA, May 14-18, 2001. Proceedings.",
                "count": 67,
                "papers": [
                    "Building management solutions for Open Packet Telephony networks.",
                    "An Architectural Framework for Providing QoS in IP Differentiated Services Networks.",
                    "Integrated Management for IP end-to-end Transport Services over WDM Netwroks.",
                    "Evaluating Recovery Protocols for Mobile Agents in Network Management Applications.",
                    "Dynamic Evolution of Network Management Software by Software Hot-Swapping.",
                    "System Designs for Adaptive, Distributed Network Monitoring and Control.",
                    "Management of Differentiated Services Usage by the Cumulus Pricing Scheme and a Generic Internet Charging System.",
                    "Federated Accounting: Service Charging and Billing in a Business-to-Business Environment.",
                    "Development of a Prototype based on TINA Accounting Management Architecture.",
                    "Performance Modeling for Virtual Network based Service Provisioning.",
                    "Design and Implementation of a Generic Connection Management and Service Level Agreement Monitoring Platform Supporting the Virtual Private Network Service.",
                    "Towards an Architecture of High Availability over IP.",
                    "Open Source Components for Internet Management by Delegation.",
                    "Monitoring Networks Using Ntop.",
                    "Using the NeTraMet for Production Traffic Measurement.",
                    "An Architecture for Self-Tuning Cellular Systems.",
                    "A Framework for Integrated Management of Mobile-Stations Over-the-Air.",
                    "An Integrated Capacity Manager for Multimedia Cellular Networks.",
                    "A User-Centric Approach to Automated Service Provisioning.",
                    "A XML based Policy-Driven Management Information Service.",
                    "Provisioning of Heterogeneous Network Devices: a Meta-Data-Driven Approach.",
                    "Intelligent Search for Correlated Alarm Events in Databases.",
                    "Embedded Monitoring of QoS Parameters in IP-Based Virtual Private Networks.",
                    "A Network Management Framework for Multi-Layered Network Survivability: An Overview.",
                    "Data Warehouse Middleware Towards a Unified Resource Management.",
                    "A development Framework for Network Management Systems based on Reconfigurable Components.",
                    "A Generic TC/CORBA Gateway Using Object Pool Mechanism.",
                    "Managing a Differentiated Quality of Service in a World Wide Web Server.",
                    "SNMP Management of MASIF Platforms.",
                    "On the Impact of Using Web Interfaces in a Distributed Management Platform.",
                    "SHAMAN - An Environment for Distributed Management Applications.",
                    "Yemanja - A Layered Event Correlation Engine for Multi-domain Server Farms.",
                    "Towards Discovery of Event Correlation Rules.",
                    "A Dynamic Group Management Framework for Large-scale Distributed Event Monitoring.",
                    "An Active Approach to Characterizing Dynamic Dependencies for Problem Determination in a Distributed Environment.",
                    "Models and Analysis of Trade-offs in Distributed Network Management Approaches.",
                    "A Navigation Pattern for Scalable Internet Management.",
                    "Reverse Engineering Internet MIBs.",
                    "SNMP GetPrev: An Efficient Way To Browse Large MIB Tables.",
                    "Implementation and Performance Analysis of SNMP on a TLS/TCP Base.",
                    "MIB Variable Based Fault Classification: The Next Step Towards Proactive Management.",
                    "A Java API for Advanced Faults Management.",
                    "A Time-aware Fault Diagnosis System in LAN.",
                    "MPLS Management using Policies.",
                    "A Policy Deployment Model for the Ponder Language.",
                    "Policy Division and Fusion: Examples and A Method - Or, Multiple Classifiers Considered Harmful -.",
                    "Semi-Active Replication of SNMP Objects in Agent Groups Applied for Fault Management.",
                    "A Framework for Automated Unit Testing of Live Network Clouds.",
                    "Event Relationship Networks: A Framework for Action Oriented Analysis In Event Management.",
                    "Proactive Detection of Distributed Denial of Service Attacks using MIB Traffic Variables - A Feasibility Study.",
                    "Self-Aware Services: Using Bayesian Networks for Detecting Anomalies in Internet-Based Services.",
                    "Management of End-to-End Security in Collaborative IP Network Environments.",
                    "Managing Application Service Dependencies with XML and the Resource Description Framework.",
                    "Improving Network Management Systems with Contextual Inquiry Methodology.",
                    "The Role of XML in TMN Evolution.",
                    "Managing Highly Dynamic Services Using Extended Temporal Network Information Models.",
                    "Towards generic Service Management Concepts - A Service Model Based Approach.",
                    "Service Creation and Service Management for Advanced IP Networks and Services - An Experience Paper.",
                    "A Phrase-Oriented Approach for Defining Management Algorithms for CORBA Applications.",
                    "An Efficient Naming Service for CORBA-based Network Management.",
                    "Integrating SSL to the JaCoWeb Security Framework: Project and Implementation.",
                    "A novel architecture for active service management.",
                    "ReActive Network Management Architectures & Routing.",
                    "Monitoring OSPF Routing.",
                    "Using Control Theory to Achieve Service Level Objectives In Performance Management.",
                    "Océano - SLA Based Management of a Computing Utility.",
                    "An Intelligent Multiagent System for the Management of Strategic Business Processes."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "6th Integrated Network Management 1999",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/1999",
                "sub_name": "1999 IEEE/IFIP International Symposium on Integrated Network Management, IM 1999, Boston, USA, May 24-28, 1999. Proceedings.",
                "count": 73,
                "papers": [
                    "Push vs. Pull in Web-Based Network Management.",
                    "Web-based Messaging Management Using Java Servlets.",
                    "Event Aggregation and Distribution in Web-based Management Systems.",
                    "Integration of WBEM-based Management Agents in the OSI Framework.",
                    "A Novel Approach for Mapping the OSI-SM / TMN Model to ODP / OMG CORBA.",
                    "TMN-based Intelligent Network Number Portability Service Management System Using CORBA.",
                    "New Design Schemes for Lightweight TMN Mediation Device/Q3 Adapter.",
                    "A Management Information Tree Architecture supporting Efficient Managed Object Selection.",
                    "Measurement and Management of Internet Services.",
                    "Dynamic Polling Scheme Based on Time Variation of Network Management Information Values.",
                    "Minimizing the Monitoring Cost in Network Management.",
                    "Scaling Internet Services by Dynamic Allocation of Connections.",
                    "The Multi-layer VPN Management Architecture.",
                    "MIBlets: A Practical Approach to Virtual Network Management.",
                    "Managing Groups in Dynamic Networks.",
                    "A Conceptual Framework for Network Management Event Correlation and Filtering Systems.",
                    "Composite Events for Network Event Correlation.",
                    "SoLOMon: Monitoring End-User Service Levels.",
                    "The Development of Integrated Inter and Intra Domain Management Services.",
                    "SLA Management in Federated Environments.",
                    "An Approach to Predictive Detection for Service Management.",
                    "Reusable Architecture for Data-Centric Network Management Systems.",
                    "Multi-Facet Internet Resource Management System.",
                    "Experiments with Data Mining in Enterprise Management.",
                    "A Model for Adaptive Monitoring Configurations.",
                    "The Impact of Active Networking Technology on Service Management in a Telecom Environment.",
                    "An Adaptable Network COntrol and Reporting System (ANCORS).",
                    "Formal Specification of SNMP MIB's Using Action Semantics: The Routing Proxy Case Study.",
                    "A Methodology for Formalizing GDMO Behavior Descriptions.",
                    "Application of SDL-92 for the specification of OSI Management Systems.",
                    "On the Design of an Integrated Management Platform for an ADSL/ATM based Access Network using CORBA.",
                    "A Case Study of a WDM Agent.",
                    "WDM Network Management: Experiences gained in a European Field Trial.",
                    "SNMPv3 Can Still be Simple?",
                    "Experiences with the SNMP-based integrated management of a CORBA-based electronic commerce application.",
                    "Managing Modems by Periodic Polling.",
                    "A Distributed Computing Environment for Building Scalable Management Services.",
                    "An Event Notification Framework based on Java and CORBA.",
                    "Managing the Management: CORBA-based Instrumentation of Management Systems.",
                    "Intelligent Agents for Network Management: a Fault Detection Experiment.",
                    "Intelligent Mobile Agents: Towards Network Fault Management Automation.",
                    "Decentralized SNMP Management with Mobile Agents.",
                    "It Ain't What You Charge, It's The Way That You Do It: A User Perspective of Network QoS and Pricing.",
                    "QoSockets: a New Extension to the Sockets API for End-to-End Application QoS Management.",
                    "QoS Restoration using a Disjoint Path Group in ATM Networks.",
                    "Secure Management by Delegation within the Internet Management Framework.",
                    "DecIdUouS: Decentralized Source Identification for Network-Based Intrusions.",
                    "Towards Securing Network Management Agent Distribution and Communication.",
                    "A Constraint-Based Approach to Fault Management for Groupware Services.",
                    "Fault Prediction at the Network Layer using Intelligent Agents.",
                    "Adaptive Network/Service Fault Detection in Transaction-Oriented Wide Area Networks.",
                    "An automatic fault diagnosis and correction system for telecommunications management.",
                    "Policies in SNMPv3-based Management.",
                    "Policy-Based Networking Architecture for QoS Interworking in IP Management.",
                    "Application-Specific Policies: Beyond the Domain Boundaries.",
                    "Modeling IT Operations to Derive Provider Accepted Management Tools.",
                    "Distributed Management with Mobile Components.",
                    "Multi-Management: application-centric approach.",
                    "Control and Management Architecture for Multipoint Videoconferencing over ATM Networks.",
                    "Real-Time Control and Management of Distributed Applications using IP-Multicast.",
                    "Management of Proxy Objects Providing Multimedia Applications in the Mobile Environment.",
                    "An Integrated Management System Architecture for Utility Telecommunication Network.",
                    "Desktop-based Network Management.",
                    "Network Configuration with Plug-and-Play Components.",
                    "Automatic Topology Discovery and Virtual Connection Trace for ATM Networks Using SNMP.",
                    "Improving Reliability of Intelligent Agents for Network Management.",
                    "Generic Performance Management of Multiservice Networks.",
                    "A CSP Approach to IT Service Management.",
                    "TMN-based Integrated Network Management Using Web and CORBA.",
                    "Experiences with Network Management Issues in Integrated Voice/Data Switch.",
                    "X-type Interface for Management of Multi-domain, Multi-technology Networks.",
                    "Debugging Network Management Scripting Applications.",
                    "Integration Architecture of Multi-Technology Management Systems."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "5th Integrated Network Management 1997",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/1997",
                "sub_name": "Integrated Network Management V, Integrated management in a virtual world, Proceedings of the Fifth IFIP/IEEE International Symposium on Integrated Network Management, San Diego, CA, USA, May 12-16, 1997.",
                "count": 75,
                "papers": [
                    "Multi-level Reasoning for Managing Distributed Enterprises and Their Networks.",
                    "Integrated Customer-Focused Network Management: Architectural Perspectives.",
                    "Customer Facing Components for Network Management Systems.",
                    "A VPN Management Architecture for Supporting CNM Services in ATM Networks.",
                    "Network Management Using Internet Technologies.",
                    "Using the World Wide Web and Java for Network Service Management.",
                    "Distributed Systems Management on the Web.",
                    "Integrated TMN Service Provisioning and Management Environment.",
                    "The Use of Allomorphism for the Access Control Service in OSI Management Environment.",
                    "Experiences on Building a Distributed Computing Platform Prototype for Telecom Network and Service Management.",
                    "Active Objects in TMN.",
                    "Joint Inter Domain Management: CORBA, CMIP and SNMP.",
                    "A Service Engineering Approach to Inter-Domain TMN System Development.",
                    "TMN/C++: An Object-oriented API for GDMO, CMIS and ASN.1.",
                    "SNMP and TL-1: Simply Integrating Management of Legacy Systems?",
                    "Determining the Availability of Distributed Applications.",
                    "Secure Service Management in Virtual Service Networks.",
                    "Intelligent Agents for Network Fault Diagnosis and Testing.",
                    "Layered Bandwidth Management in ATM/SDH Networks.",
                    "Unified Fault, Resource Management and Control in ATM-based IBCN.",
                    "Performance Management of Public ATM Networks - a Scaleable and Flexible Approach.",
                    "DIVA: A DIstributed & Dynamic VP Management Algorithm.",
                    "Customer Management and Control of Broadband VPN Services.",
                    "ATM Network Resources Management Using Layer and Virtual Network Concepts.",
                    "Management of New Federated Services.",
                    "A General Framework for Routing Management in Multi-Service ATM Networks.",
                    "Switchlets and Dynamic Virtual ATM Networks.",
                    "The Hollowman: An Innovative ATM Control Architecture.",
                    "Immersive and Non-immersive Virtual Reality Techniques Applied to Telecommunication Network Management.",
                    "Broadband Video/Audio/Data Distribution Networks - The Need for Network Management.",
                    "Management of an ATM Based Integrated Voice and Data Network - A Pragmatic Solution.",
                    "Conflict Analysis for Management Policies.",
                    "Implementation and Evaluation of MIB Tester for OSI Management.",
                    "Design and Testing of Information Models in a Virtual Environment.",
                    "Formal Specification and Testing of a Management Architecture.",
                    "Incorporating Manageability into Distributed Software.",
                    "Designing Scaleable Applications Using CORBA.",
                    "ACE: An Environment for Specifying, Developing and Generating TINA Services.",
                    "Supporting Dynamic Policy Change Using CORBA System Management Facilities.",
                    "Deriving Variabel Polling Frequency Policies for Pro-activce Management in Networks and Distributed Systems.",
                    "Agent Based Management of Distributed Systems with Variabel Polling Frequency Policies.",
                    "A Nonblocking Mechanism for Regulating the Transmission of Network Management Polls.",
                    "Fault Isolation and Event Correlation for Integrated Fault Management.",
                    "Non-Broadcast Network Fault-Monitoring Based on System-Level Diagnosis.",
                    "Proactive Management of Computer Networks Using Artificial Intelligence Agents and Techniques.",
                    "Event Modeling with the MODEL Language.",
                    "Network Management Services Using a Temporal Information Model.",
                    "Meta Managed Objects.",
                    "RelMan: A GRM-based Relationship Manager.",
                    "Divide and Conquer Technique for Network Fault Management.",
                    "Automated Proactive Anomaly Detection.",
                    "Generating Diagnositc Tools for Network Fault Management.",
                    "An Agent-based Approach to Service Management - Towards Service Independent Network Architecture.",
                    "Distributed Network Management with Dynamic Rule-based Managing Agents.",
                    "Delegation Agents: Design and Implementation.",
                    "A Spreadsheet-Based Scripting Environment for SNMP.",
                    "The First Anniversary of the Tivoli/IBM Merger: The Present and Future of TME 10.",
                    "When Societies are Built from Bits.",
                    "The Future of Integrated Network and Systems Management.",
                    "Why Bad Things Happen to Good Systems.",
                    "Distinguished Experts Panel: Integrated Management in a Virtual World.",
                    "Web Based Management.",
                    "Challenges in Managing Intranets.",
                    "Managing Mobility.",
                    "New Technologies Bridging the Gap Between Computer and Telecommunications.",
                    "Open Network Control.",
                    "Implementation of Duplicate MD (Proxy-Agent) with Distributed Functions and High Reliability.",
                    "An Open Distributed VPN Management System for a Multi-Domain Management World.",
                    "SNMP-based Network Security Management.",
                    "Managing Personal Communication Systems in a Multi-domain Environment.",
                    "A Layered Architecture for Capacity Planning in Hybrid Networks.",
                    "Network Management Agents Supported by a Java Environment.",
                    "Integrating SNMP and CMIP Alarm Processing in a TMN Management Environment.",
                    "Distributed Service and Network Management Using Intelligent Filters.",
                    "TINA Service Management Principle."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "4th Integrated Network Management 1995",
        "info": "Santa Barbara, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/1995",
                "sub_name": "Integrated Network Management IV, Proceedings of the Fourth International Symposium on Integrated Network Management, Santa Barbara, CA, USA, 1995.",
                "count": 72,
                "papers": [
                    "Integrating network management and rightsizing in the nineties - introduction.",
                    "Decentralizing control and intelligence in network management.",
                    "Models and support mechanismus for distributed management.",
                    "Configuration management for distributed software services.",
                    "Using a classification of management policies for policy specification and policy transformation.",
                    "Concepts and application of policy-based management.",
                    "Towards policy driven systems management.",
                    "Distributed management environment (DME): dead or alive.",
                    "Icaros, Alice and the OSF DME.",
                    "Managing in a distributed world.",
                    "POLYCENTER license system: enabling electronic license distribution and management.",
                    "A resource management system based on the ODP trader concepts and X.500.",
                    "Standards for integrated services and networks.",
                    "Customer requirements on teleservice management.",
                    "Secure remote management.",
                    "Security management: the ubiquitous mix.",
                    "An architecture for performance management of multimedia networks.",
                    "Network performance management using realistic abductive reasoning model.",
                    "Connection admission management in ATM networks supporting dynamic multi-point session constructs.",
                    "Q quota system for fair share of network resources.",
                    "Towards a practical alarm correlation system.",
                    "Validation and extension of fault management applications through environment simulation.",
                    "Centralized vs distributed fault localization.",
                    "Management technology convergence.",
                    "A coding approach to event correlation.",
                    "Event correlation using rule and object based techniques.",
                    "Real-time telecommunication network management: extending event correlation with temporal constraints.",
                    "Intelligent filtering in network management systems.",
                    "NOAA: an expert system managing the telephone network.",
                    "Using master tickets as a storage for problem-solving expertise.",
                    "Management of cellular digital packetized data (CDPD) networks.",
                    "Object-oriented design of a VPN bandwidth management system.",
                    "A TMN system for VPC and routing management in ATM networks.",
                    "Managing virtual paths on Xunet III: architecture, experimental platform and performance.",
                    "Modeling IN-based service control capabilities as part of TMN-based service management.",
                    "Handling the distribution of information in the TMN.",
                    "Testing management applications with the Q3 emulator.",
                    "Application of the TINA-C management architecture.",
                    "Exploiting the power of OSI management for the control of SNMP-capable resources using generic application level gateways.",
                    "MIB view language (MVL) for SNMP.",
                    "The abstraction and modelling of management agents.",
                    "The OSIMIS platform: making OSI management simple.",
                    "Experiences in multi-domain management system development.",
                    "Designing a distributed management framework - an implementer's perspective.",
                    "Can simple management (SNMP) patrol the information highway?.",
                    "An active temporal model for network management databases.",
                    "ICON: a system for implementing constraints in object-based networks.",
                    "Implementing and deploying MIB in ATM transport network operations systems.",
                    "Towards relationship-based navigation.",
                    "Testing of relationships in an OSI management information base.",
                    "DUALQUEST: an implementation of the real-time bifocal visualization for network management.",
                    "A framework for systems and network management ensembles.",
                    "MODE: a development environment for managed objects based on formal methods.",
                    "Management application creation with DML.",
                    "Formal description techniques for object management.",
                    "An approach to conformance testing of MIB implementations.",
                    "'Can we talk?'.",
                    "The rise of the Lean Service Provider.",
                    "Managing complex systems - when less is more.",
                    "Multimedia information networking in the 90's - the evolving information infrastructures.",
                    "Where are we going with telecommunications development and regulation in the year 2000 and beyond?.",
                    "Formulating a successful management strategy.",
                    "The paradigm shift in telecommunications services and networks.",
                    "An industry response to comprehensive enterprise information systems management.",
                    "Cooperative management.",
                    "Network management simulators.",
                    "On the distributed fault diagnosis of computer networks.",
                    "Fault diagnosis in computer networks.",
                    "The distributed management tree - applying a new concept for managing distributed applications to e-mail.",
                    "A distributed hierarchical management framework for heterogeneous WANs.",
                    "ISOS: intelligent shell of SNMP.",
                    "A critical analysis of the DESSERT information model."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "3rd Integrated Network Management 1993",
        "info": "San Franciso, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/im/1993",
                "sub_name": "Integrated Network Management III, Proceedings of the IFIP TC6/WG6.6 Third International Symposium on Integrated Network Management with participation of the IEEE Communications Society CNOM and with support from the Institute for Educational Services, San Francisco, California, USA, 18-23 April, 1993.",
                "count": 65,
                "papers": [
                    "Strategies for the Nineties.",
                    "Emerging Trends in Network and Systems Management.",
                    "Richer Modeling Semantics for Management Information.",
                    "A High Level Specification Technique for Modeling Networks and their Environments including Semantic Aspects.",
                    "Formal Description of Managed Object Behavior - A Rule Based Approach.",
                    "Design of Network Management Architectures for Heterogeneous Networks Using Object Oriented Approach.",
                    "RMON - From Concept to Specification.",
                    "The RMON MIB: Implementation and Network Management Issues.",
                    "Design f the MANDATE MIB.",
                    "MIB Design for Network Management Transaction Processing.",
                    "Modelling Resources for Integrated Performance Management.",
                    "A Historical Object Base in an Enterprise Management Director.",
                    "A Service for Administering Management Information - VPN Inter-Domain Management Support using X.500 and X.700.",
                    "Integration of the Directory Service in the Network Management Framework.",
                    "Junction Objects - A Solution to a Problem in Naming and Locating OSI Managed Objects.",
                    "International Integrated Network Management - Are We There Yet?",
                    "The DOMAINS Management Language.",
                    "Domain Management and Accounting in an International Cellular Network.",
                    "Modelling Management Policy using Enriched Managed Objects.",
                    "Implementing and Managing the Distributed Computing Environment.",
                    "Distribution in an Enterprise Management Director.",
                    "The Management of Monitoring in Object-Based Distributed Systems.",
                    "Evaluating Management Decisions via Delegation.",
                    "An Introduction to the Simple Management Protocol.",
                    "SNMPv2.",
                    "A Computational Model for OSS Multivendor Software Interoperability.",
                    "UNIX Systems Management via SNMP.",
                    "The NAS Hierarchical Network Management System.",
                    "Managing the Extended LAN.",
                    "Incorporating OSI Management Technology into the Marketplace.",
                    "OSI Management Technology.",
                    "CMIP versus SNMP.",
                    "Simply Open Network Management: An Approach for the Integration of SNMP into OSI Management Concepts.",
                    "Design of Protocol Idependent Management Agent to Support SNMP and CMIP Queries.",
                    "An Application Gateway Design for OSI-Internet Management.",
                    "OMNIPoint: An Implementation Guide to Integrated Networked Information Systems Management.",
                    "OMNIPoint.",
                    "Key Technologies for Integraed Network Management.",
                    "X.400 Message Handling Systems Management Functional Requirements.",
                    "Process Management: The Future of Integrated Management Systems.",
                    "Experiment on and Evaluation of OSI Management Through the INTAP Interoperable Networking Demonstration.",
                    "An Architecture Driven Comparison of Network Management Systems.",
                    "Service Management of a Satellite Ground Station Network in Support of Spacecraft Operation.",
                    "NetView in a Heterogeneous Environment: Implementation of an Experimental Agent Structure.",
                    "Uniform Modelling of Management and Telecommunication Services in Future Telecommunication Environments based on the ROSA Approach.",
                    "A Transition Architecture for Breakthrough Special Services Automation.",
                    "Potential Network Management Services and Capabilities Associated with SMDS.",
                    "Object-Oriented Intelligent Telecommunications Network Management System.",
                    "Managed Object Definition for Customer Network Management in Public Data Networks.",
                    "A State Dependent Reliability Model and Its Applications.",
                    "A Software Architecture for Management Information Model Definition, Implementation and Validation.",
                    "A Hybrid Expert System/Neural Network Traffic Advice System.",
                    "An Expert System for Real Time Fault Diagnosis of the Italian Telecommunications Network.",
                    "Applying OSI Systems Management Standards to Virtual Path Testing in ATM Networks.",
                    "Damage Assessment - A Network Management Application Based on an Integrated Information Model of the Network.",
                    "How Secure Should Network Management Be?",
                    "A Network Diagnostic Expert System for Acculink Multiplexers Based on a General Network Diagnostic Scheme.",
                    "A Case-Based Reasoning Approach to the Resolution of Faults in Communication Networks.",
                    "Event Correlation in Heterogeneous Networks Using the OSI Management Framework.",
                    "A Probabilistic Approach to Fault Diagnosis in Linear Lightwave Networks.",
                    "Multivendor Network Management - The Realities.",
                    "Network Management Applications.",
                    "Supporting Network Management through Declaratively Specified Data Visualizations.",
                    "A Tool Supporting the Management Information Modeling Process.",
                    "Deploying Group Communication Techniques in Network Management."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "2nd Integrated Network Management 1991",
        "info": "Washington, DC, USA",
        "venues": []
    },
    {
        "year": "1989",
        "name": "1st Integrated Network Management 1989",
        "info": "Boston, MA, USA",
        "venues": []
    }
]