[
    {
        "year": "2021",
        "name": "IMC 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2021",
                "sub_name": "IMC '21: ACM Internet Measurement Conference, Virtual Event, USA, November 2-4, 2021.",
                "count": 54,
                "papers": [
                    "Examination of WAN traffic characteristics in a large-scale data center network.",
                    "AutoSens: inferring latency sensitivity of user activity through natural experiments.",
                    "Federated infrastructure: usage, patterns, and insights from \"the people's network\".",
                    "From cloud to edge: a first look at public edge platforms.",
                    "Measuring the network performance of Google cloud platform.",
                    "Cloudy with a chance of short RTTs: analyzing cloud connectivity in the internet.",
                    "Unbiased experiments in congested networks.",
                    "Revisiting TCP congestion control throughput models & fairness properties at scale.",
                    "Precise error estimation for sketch-based flow measurement.",
                    "Who's got your mail?: characterizing mail service provider usage.",
                    "Characterising the IETF through the lens of RFC deployment.",
                    "Third time's not a charm: exploiting SNMPv3 for router fingerprinting.",
                    "IoTLS: understanding TLS usage in consumer IoT devices.",
                    "Tracing your roots: exploring the TLS trust anchor ecosystem.",
                    "Open for hire: attack trends and misconfiguration pitfalls of IoT devices.",
                    "Can you see me now?: a measurement study of Zoom, Webex, and Meet.",
                    "Measuring the performance and network utilization of popular video conferencing applications.",
                    "The shape of view: an alert system for video viewership anomalies.",
                    "It's over 9000: analyzing early QUIC deployments with the standardization on the horizon.",
                    "Web censorship measurements of HTTP/3 over QUIC.",
                    "QUICsand: quantifying QUIC reconnaissance scans and DoS flooding events.",
                    "Sharding and HTTP/2 connection reuse revisited: why are there still redundant connections?",
                    "TopoShot: uncovering Ethereum's network topology leveraging replacement transactions.",
                    "Selfish & opaque transaction ordering in the Bitcoin blockchain: the case for chain neutrality.",
                    "An empirical study of DeFi liquidations: incentives, risks, and instabilities.",
                    "Measuring DNS-over-HTTPS performance around the world.",
                    "TRAGEN: a synthetic trace generator for realistic cache simulations.",
                    "HLISA: towards a more reliable measurement tool.",
                    "Home is where the hijacking is: understanding DNS interception by residential routers.",
                    "TsuNAME: exploiting misconfiguration and vulnerability to DDoS DNS.",
                    "The far side of DNS amplification: tracing the DDoS attack ecosystem from the internet core.",
                    "Throttling Twitter: an emerging censorship technique in Russia.",
                    "Understanding engagement with U.S. (mis)information news sources on Facebook.",
                    "Unique on Facebook: formulation and evidence of (nano)targeting individual users with non-PII data.",
                    "Locked-in during lock-down: undergraduate life on the internet in a pandemic.",
                    "Networked systems as witnesses: association between content demand, human mobility and an infection spread.",
                    "Polls, clickbait, and commemorative $2 bills: problematic political advertising on news and media websites around the 2020 U.S. elections.",
                    "Who you gonna call?: an empirical evaluation of website security.txt deployment.",
                    "Understanding the performance of webassembly applications.",
                    "Knock and talk: investigating local network communications on websites.",
                    "TrackerSift: untangling mixed tracking and functional web resources.",
                    "AS-level BGP community usage classification.",
                    "The parallel lives of autonomous systems: ASN allocations vs. BGP.",
                    "How biased is our validation (data) for AS relationships?",
                    "A large-scale characterization of online incitements to harassment across platforms.",
                    "RacketStore: measurements of ASO deception in Google play via mobile and app usage.",
                    "Smart at what cost?: characterising mobile deep neural networks in the wild.",
                    "Risky BIZness: risks derived from registrar name management.",
                    "Identifying ASes of state-owned internet operators.",
                    "ASdb: a system for classifying owners of autonomous systems.",
                    "Inferring regional access network topologies: methods and applications.",
                    "Follow the scent: defeating IPv6 prefix rotation privacy.",
                    "Towards identifying networks with internet clients using public data.",
                    "Corrigendum: cloud provider connectivity in the flat internet."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "IMC 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2020",
                "sub_name": "IMC '20: ACM Internet Measurement Conference, Virtual Event, USA, October 27-29, 2020.",
                "count": 54,
                "papers": [
                    "The Lockdown Effect: Implications of the COVID-19 Pandemic on Internet Traffic.",
                    "A Characterization of the COVID-19 Pandemic Impact on a Mobile Network Operator Traffic.",
                    "How the Internet reacted to Covid-19: A perspective from Facebook's Edge Network.",
                    "Clouding up the Internet: how centralized is DNS traffic becoming?",
                    "Trufflehunter: Cache Snooping Rare Domains at Large Public DNS Resolvers.",
                    "Behind Closed Doors: A Network Tale of Spoofing, Intrusion, and False DNS Security.",
                    "Are You Human?: Resilience of Phishing Detection to Evasion Techniques Based on Human Verification.",
                    "A Haystack Full of Needles: Scalable Detection of IoT Devices in the Wild.",
                    "Easing the Conscience with OPC UA: An Internet-Wide Study on Insecure Deployments.",
                    "How China Detects and Blocks Shadowsocks.",
                    "Investigating Large Scale HTTPS Interception in Kazakhstan.",
                    "Reading In-Between the Lines: An Analysis of Dissenter.",
                    "Where Things Roam: Uncovering Cellular IoT/M2M Connectivity.",
                    "Five Alarms: Assessing the Vulnerability of US Cellular Communication Infrastructure to Wildfires.",
                    "Lumos5G: Mapping and Predicting Commercial mmWave 5G Throughput.",
                    "Out of Sight, Not Out of Mind: A User-View on the Criticality of the Submarine Cable Network.",
                    "Uncharted Networks: A First Measurement Study of the Bulk Power System.",
                    "Exploring the \"Internet from space\" with Hypatia.",
                    "Cloud Provider Connectivity in the Flat Internet.",
                    "Reduce, Reuse, Recycle: Repurposing Existing Measurements to Identify Stale Traceroutes.",
                    "TopoScope: Recover AS Relationships From Fragmentary Observations.",
                    "Unresolved Issues: Prevalence, Persistence, and Perils of Lame Delegations.",
                    "The Reality of Algorithm Agility: Studying the DNSSEC Algorithm Life-Cycle.",
                    "Putting DNS in Context.",
                    "Measuring the Emergence of Consent Management on the Web.",
                    "On the Potential for Discrimination via Composition.",
                    "Demystifying the Messaging Platforms' Ecosystem Through the Lens of Twitter.",
                    "Quantifying the Impact of Blocklisting in the Age of Address Reuse.",
                    "Who Touched My Browser Fingerprint?: A Large-scale Measurement Study and Classification of Fingerprint Dynamics.",
                    "Learning to Extract and Use ASNs in Hostnames.",
                    "No WAN's Land: Mapping U.S. Broadband Coverage with Millions of Address Queries to ISPs.",
                    "Persistent Last-mile Congestion: Not so Uncommon.",
                    "Towards A User-Level Understanding of IPv6 Behavior.",
                    "FlashRoute: Efficient Traceroute on a Massive Scale.",
                    "MAnycast2: Using Anycast to Measure Anycast.",
                    "Using GANs for Sharing Networked Time Series Data: Challenges, Initial Promise, and Open Questions.",
                    "On Measuring RPKI Relying Parties.",
                    "BGP Beacons, Network Tomography, and Bayesian Computation to Locate Route Flap Damping.",
                    "AS-Path Prepending: there is no rose without a thorn.",
                    "A Bird's Eye View of the World's Fastest Networks.",
                    "Dissecting the Communication Latency in Distributed Deep Sparse Learning.",
                    "Revisiting Transactional Statistics of High-scalability Blockchains.",
                    "Turning Up the Dial: the Evolution of a Cybercrime Market Through Set-up, Stable, and Covid-19 Eras.",
                    "Who is targeted by email-based phishing and malware?: Measuring factors that differentiate risk.",
                    "Accept the Risk and Continue: Measuring the Long Tail of Government https Adoption.",
                    "Mis-shapes, Mistakes, Misfits: An Analysis of Domain Classification Services.",
                    "Identifying Sensitive URLs atWeb-Scale.",
                    "Analyzing Third Party Service Dependencies in Modern Web Services: Have We Learned from the Mirai-Dyn Incident?",
                    "Hiding in Plain Site: Detecting JavaScript Obfuscation through Concealed Browser API Usage.",
                    "On the Origin of Scanning: The Impact of Location on Internet-Wide Scans.",
                    "On Landing and Internal Web Pages: The Strange Case of Jekyll and Hyde in Web Performance Measurement.",
                    "Understanding Incentivized Mobile App Installs on Google Play Store.",
                    "Who's left behind?: Measuring Adoption of Application Updates at Scale.",
                    "When Push Comes to Ads: Measuring the Rise of (Malicious) Push Advertising."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "IMC 2019",
        "info": "Amsterdam, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2019",
                "sub_name": "Proceedings of the Internet Measurement Conference, IMC 2019, Amsterdam, The Netherlands, October 21-23, 2019.",
                "count": 39,
                "papers": [
                    "Roll, Roll, Roll your Root: A Comprehensive Analysis of the First Ever DNSSEC Root KSK Rollover.",
                    "An Empirical Study of the Cost of DNS-over-HTTPS.",
                    "An End-to-End, Large-Scale Measurement of DNS-over-Encryption: How Far Have We Come?",
                    "Measuring Security Practices and How They Impact Security.",
                    "Booting the Booters: Evaluating the Effects of Police Interventions in the Market for Denial-of-Service Attacks.",
                    "DDoS Hide & Seek: On the Effectiveness of a Booter Services Takedown.",
                    "A First Look at the Crypto-Mining Malware Ecosystem: A Decade of Unrestricted Wealth.",
                    "DNS Observatory: The Big Picture of the DNS.",
                    "Cache Me If You Can: Effects of DNS Time-to-Live.",
                    "A Look at the ECS Behavior of DNS Resolvers.",
                    "When to use and when not to use BBR: An empirical analysis and evaluation study.",
                    "Modeling BBR's Interactions with Loss-Based Congestion Control.",
                    "Scanning the Scanners: Sensing the Internet from a Massively Distributed Network Telescope.",
                    "Packet-level Overload Estimation in LTE Networks using Passive Measurements.",
                    "Taming Anycast in the Wild Internet.",
                    "Internet Performance from Facebook's Edge.",
                    "Characterizing JSON Traffic Patterns on a CDN.",
                    "How Cloud Traffic Goes Hiding: A Study of Amazon's Peering Fabric.",
                    "Challenges in the Decentralised Web: The Mastodon Case.",
                    "Errors, Misunderstandings, and Attacks: Analyzing the Crowdsourcing Process of Ad-blocking Systems.",
                    "Tales from the Porn: A Comprehensive Privacy Analysis of the Web Porn Ecosystem.",
                    "Reducing Permission Requests in Mobile Apps.",
                    "Information Exposure From Consumer IoT Devices: A Multidimensional, Network-Informed Measurement Approach.",
                    "No More Chasing Waterfalls: A Measurement Study of the Header Bidding Ad-Ecosystem.",
                    "A Longitudinal Analysis of the ads.txt Standard.",
                    "What You See is NOT What You Get: Discovering and Tracking Social Engineering Attack Campaigns.",
                    "q-MAX: A Unified Scheme for Improving Network Measurement Throughput.",
                    "Learning Regexes to Extract Router Names from Hostnames.",
                    "Prefix Top Lists: Gaining Insights with Prefixes from Domain-based Top Lists on DNS Deployment.",
                    "Multiway Reliability Analysis of Mobile Broadband Networks.",
                    "ECON: Modeling the network to improve application performance.",
                    "TLS Beyond the Browser: Combining End Host and Network Data to Understand Application Behavior.",
                    "VisibleV8: In-browser Monitoring of JavaScript in the Wild.",
                    "RPKI is Coming of Age: A Longitudinal Study of RPKI Deployment and Invalid Route Origins.",
                    "Profiling BGP Serial Hijackers: Capturing Persistent Misbehavior in the Global Routing Table.",
                    "Down the Black Hole: Dismantling Operational Practices of BGP Blackholing at IXPs.",
                    "ShamFinder: An Automated Framework for Detecting IDN Homographs.",
                    "Measuring eWhoring.",
                    "Opening the Blackbox of VirusTotal: Analyzing Online Phishing Scan Engines."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "IMC 2018",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2018",
                "sub_name": "Proceedings of the Internet Measurement Conference 2018, IMC 2018, Boston, MA, USA, October 31 - November 02, 2018.",
                "count": 43,
                "papers": [
                    "Impact of Device Performance on Mobile Internet QoE.",
                    "When the Dike Breaks: Dissecting DNS Defenses During DDoS.",
                    "Three Bits Suffice: Explicit Support for Passive Measurement of Internet Latency in QUIC and TCP.",
                    "Multilevel MDA-Lite Paris Traceroute.",
                    "Following Their Footsteps: Characterizing Account Automation Abuse and Defenses.",
                    "Pushing the Boundaries with bdrmapIT: Mapping Router Ownership at Internet Scale.",
                    "Digging into Browser-based Crypto Mining.",
                    "A First Look at SIM-Enabled Wearables in the Wild.",
                    "Comments on DNS Robustness.",
                    "Measuring Ethereum Network Peers.",
                    "Is the Web Ready for OCSP Must-Staple?",
                    "LDplayer: DNS Experimentation at Scale.",
                    "Characterizing the Internet Host Population Using Deep Learning: A Universal and Lightweight Numerical Embedding.",
                    "Mobility Support in Cellular Networks: A Measurement Study on Its Configurations and Implications.",
                    "Predictive Analysis in Network Function Virtualization.",
                    "Characterizing the Deployment and Performance of Multi-CDNs.",
                    "Understanding Tor Usage with Privacy-Preserving Measurement.",
                    "On the Origins of Memes by Means of Fringe Web Communities.",
                    "How to Catch when Proxies Lie: Verifying the Physical Locations of Network Proxies with Active Geolocation.",
                    "403 Forbidden: A Global View of CDN Geoblocking.",
                    "Who Knocks at the IPv6 Door?: Detecting IPv6 Scanning.",
                    "Understanding Video Management Planes.",
                    "Where The Light Gets In: Analyzing Web Censorship Mechanisms in India.",
                    "O Peer, Where Art Thou?: Uncovering Remote Peering Interconnections at IXPs.",
                    "BGP Communities: Even more Worms in the Routing Can.",
                    "Beyond Google Play: A Large-Scale Comparative Study of Chinese Android App Markets.",
                    "In the IP of the Beholder: Strategies for Active IPv6 Topology Discovery.",
                    "From Deletion to Re-Registration in Zero Seconds: Domain Registrar Behaviour During the Drop.",
                    "Tracing Cross Border Web Tracking.",
                    "The Rise of Certificate Transparency and Its Implications on the Internet Ecosystem.",
                    "Advancing the Art of Internet Edge Outage Detection.",
                    "Clusters in the Expanse: Understanding and Unbiasing IPv6 Hitlists.",
                    "An Empirical Study of the I2P Anonymity Network and its Censorship Resistance.",
                    "A Large Scale Study of Data Center Network Reliability.",
                    "Dissecting Apple's Meta-CDN during an iOS Update.",
                    "Coming of Age: A Longitudinal Study of TLS Deployment.",
                    "Needle in a Haystack: Tracking Down Elite Phishing Domains in the Wild.",
                    "An Empirical Analysis of the Commercial VPN Ecosystem.",
                    "A First Joint Look at DoS Attacks and BGP Blackholing in the Wild.",
                    "Cloud Datacenter SDN Monitoring: Experiences and Challenges.",
                    "How Tracking Companies Circumvented Ad Blockers Using WebSockets.",
                    "A Long Way to the Top: Significance, Structure, and Stability of Internet Top Lists.",
                    "Analyzing Ethereum's Contract Topology."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "IMC 2017",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2017",
                "sub_name": "Proceedings of the 2017 Internet Measurement Conference, IMC 2017, London, United Kingdom, November 1-3, 2017.",
                "count": 42,
                "papers": [
                    "Inferring BGP blackholing activity in the internet.",
                    "Pinpointing delay and forwarding anomalies using large-scale traceroute measurements.",
                    "Through the wormhole: tracking invisible MPLS tunnels.",
                    "Challenges in inferring internet congestion using throughput measurements.",
                    "Investigating the causes of congestion on the african IXP substrate.",
                    "TCP congestion signatures.",
                    "High-resolution measurement of data center microbursts.",
                    "Detection, classification, and analysis of inter-domain traffic with spoofed source IP addresses.",
                    "Millions of targets under attack: a macroscopic characterization of the DoS ecosystem.",
                    "Your state is not mine: a closer look at evading stateful internet censorship.",
                    "lib•erate, (n): a library for exposing (traffic-classification) rules and avoiding them efficiently.",
                    "If you are not paying for it, you are the product: how much do advertisers pay to reach you?",
                    "Exploring the dynamics of search advertiser fraud.",
                    "The ad wars: retrospective measurement and analysis of anti-adblock filter lists.",
                    "On the structure and characteristics of user agent string.",
                    "Cell spotting: studying the role of cellular networks in the internet.",
                    "Measurement-based, practical techniques to improve 802.11ac performance.",
                    "Dissecting VOD services for cellular: performance, root causes and best practices.",
                    "Connected cars in cellular network: a measurement study.",
                    "Target generation for internet-wide IPv6 scanning.",
                    "Packetlab: a universal measurement endpoint interface.",
                    "Automatic metadata generation for active measurement.",
                    "A high-performance algorithm for identifying frequent items in data streams.",
                    "Recursive lattice search: hierarchical heavy hitters revisited.",
                    "Taking a long look at QUIC: an approach for rigorous evaluation of rapidly evolving transport protocols.",
                    "Large-scale scanning of TCP's initial window.",
                    "The record route option is an option!",
                    "Initial measurements of the cuban street network.",
                    "Mission accomplished?: HTTPS security after diginotar.",
                    "Tripwire: inferring internet site compromise.",
                    "Measuring and mitigating oauth access token abuse by collusion networks.",
                    "Understanding the role of registrars in DNSSEC deployment.",
                    "Complexity vs. performance: empirical analysis of machine learning as a service.",
                    "An empirical characterization of IFTTT: ecosystem, usage, and performance.",
                    "The web centipede: understanding how web communities influence each other through the lens of mainstream and alternative news sources.",
                    "Email typosquatting.",
                    "Fifteen minutes of unwanted fame: detecting and characterizing doxing.",
                    "Ethical issues in research using datasets of illicit origin.",
                    "A look at router geolocation in public and commercial databases.",
                    "Shortcuts through colocation facilities.",
                    "Broad and load-aware anycast mapping with verfploeter.",
                    "Recursives in the wild: engineering authoritative DNS servers."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "IMC 2016",
        "info": "Santa Monica, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2016",
                "sub_name": "Proceedings of the 2016 ACM on Internet Measurement Conference, IMC 2016, Santa Monica, CA, USA, November 14-16, 2016.",
                "count": 46,
                "papers": [
                    "Network Growth and Link Prediction Through an Empirical Lens.",
                    "\"Recommended For You\": A First Look at Content Recommendation Networks.",
                    "You Can Yak but You Can't Hide: Localizing Anonymous Social Network Users.",
                    "Measuring the Security Harm of TLS Crypto Shortcuts.",
                    "Weak Keys Remain Widespread in Network Devices.",
                    "What Happens After You Are Pwnd: Understanding the Use of Leaked Webmail Credentials in the Wild.",
                    "Condensing Steam: Distilling the Diversity of Gamer Behavior.",
                    "Browser Feature Usage on the Modern Web.",
                    "Characterizing Website Behaviors Across Logged-in and Not-logged-in Users.",
                    "Ad Blockers: Global Prevalence and Impact.",
                    "On the Free Bridge Across the Digital Divide: Assessing the Quality of Facebook's Free Basics Service.",
                    "Beyond Counting: New Perspectives on the Active IPv4 Address Space.",
                    "Identifying and Aggregating Homogeneous IPv4 /24 Blocks with Hobbit.",
                    "Entropy/IP: Uncovering Structure in IPv6 Addresses.",
                    "Reasons Dynamic Addresses Change.",
                    "Tunneling for Transparency: A Large-Scale Analysis of End-to-End Violations in the Internet.",
                    "A Multi-perspective Analysis of Carrier-Grade NAT Deployment.",
                    "Sneaking Past the Firewall: Quantifying the Unexpected Traffic on Major TCP and UDP Ports.",
                    "Classifiers Unclassified: An Efficient Approach to Revealing IP Traffic Classification Rules.",
                    "WHOIS Lost in Translation: (Mis)Understanding Domain Name Expiration and Re-Registration.",
                    "Anycast vs. DDoS: Evaluating the November 2015 Root DNS Event.",
                    "Zone Poisoning: The How and Where of Non-Secure DNS Dynamic Updates.",
                    "Measuring the Adoption of DDoS Protection Services.",
                    "An Empirical Analysis of a Large-scale Mobile Cloud Storage Service.",
                    "Understanding On-device Bufferbloat for Cellular Upload.",
                    "A View from the Other Side: Understanding Mobile Phone Characteristics in the Developing World.",
                    "Time to Measure the Pi.",
                    "MNTP: Enhancing Time Synchronization for Mobile Devices.",
                    "An Analysis of the Privacy and Security Risks of Android VPN Permission-enabled Apps.",
                    "Should You Use the App for That?: Comparing the Privacy Implications of App- and Web-based Online Services.",
                    "User Profiling in the Time of HTTPS.",
                    "bdrmap: Inference of Borders Between IP Networks.",
                    "MAP-IT: Multipass Accurate Passive Inferences from Traceroute.",
                    "Yarrp'ing the Internet: Randomized High-Speed Active Topology Discovery.",
                    "Towards Better Internet Citizenship: Reducing the Footprint of Internet-wide Scans by Topology Aware Prefix Selection.",
                    "BGPStream: A Software Framework for Live and Historical BGP Data Analysis.",
                    "Detecting Unusually-Routed ASes: Methods and Applications.",
                    "Optical Layer Failures in a Large Backbone.",
                    "BGP Prefix Delegations: A Deep Dive.",
                    "A First Look at Quality of Mobile Live Streaming Experience: the Case of Periscope.",
                    "Anatomy of a Personalized Livestreaming System.",
                    "Performance Characterization of a Commercial Video Streaming Service.",
                    "Measuring Video QoE from Encrypted Traffic.",
                    "Measuring and Applying Invalid SSL Certificates: The Silent Majority.",
                    "Towards a Complete View of the Certificate Ecosystem.",
                    "TLS Proxies: Friend or Foe?"
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "IMC 2015",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2015",
                "sub_name": "Proceedings of the 2015 ACM Internet Measurement Conference, IMC 2015, Tokyo, Japan, October 28-30, 2015.",
                "count": 44,
                "papers": [
                    "Measurement and Analysis of Traffic Exchange Services.",
                    "Resilience of Deployed TCP to Blind Attacks.",
                    "Neither Snow Nor Rain Nor MITM...: An Empirical Analysis of Email Delivery Security.",
                    "Affiliate Crookies: Characterizing Affiliate Marketing Abuse.",
                    "MPLS Under the Microscope: Revealing Actual Transit Path Diversity.",
                    "Is Explicit Congestion Notification usable with UDP?",
                    "Investigating Interdomain Routing Policies in the Wild.",
                    "Empirical Analysis of Search Advertising Strategies.",
                    "Annoyed Users: Ads and Ad-Block Usage in the Wild.",
                    "Measuring the Impact and Perception of Acceptable Advertisements.",
                    "Location, Location, Location: The Impact of Geolocation on Web Search Personalization.",
                    "Reliable Recon in Adversarial Peer-to-Peer Botnets.",
                    "The Doppelgänger Bot Attack: Exploring Identity Impersonation in Online Social Networks.",
                    "Dissecting UbuntuOne: Autopsy of a Global-scale Personal Cloud Back-end.",
                    "The Dark Menace: Characterizing Network-based Attacks in the Cloud.",
                    "An End-to-End Measurement of Certificate Revocation in the Web's PKI.",
                    "Detecting Malicious Activity with DNS Backscatter.",
                    "Opprentice: Towards Practical and Automatic Anomaly Detection Through Machine Learning.",
                    "Understanding Mobile Traffic Patterns of Large Scale Cellular Towers in Urban Environment.",
                    "Identifying Traffic Differentiation in Mobile Networks.",
                    "Tracking the Evolution and Diversity in Network Usage of Smartphones.",
                    "Opportunities and Challenges in Crowdsourced Wardriving.",
                    "MoonGen: A Scriptable High-Speed Packet Generator.",
                    "Ting: Measuring and Exploiting Latencies Between All Tor Nodes.",
                    "Timeouts: Beware Surprisingly High Delay.",
                    "Is There WiFi Yet?: How Aggressive Probe Requests Deteriorate Energy and Throughput.",
                    "Electri-Fi Your Data: Measuring and Combining Power-Line Communications with WiFi.",
                    "Revisiting Network Energy Efficiency of Mobile Apps: Performance in the Wild.",
                    "StreetSense: Effect of Bus Wi-Fi APs on Pedestrian Smartphone.",
                    "Going Wild: Large-Scale Classification of Open DNS Resolvers.",
                    "Who is .com?: Learning to Parse WHOIS Records.",
                    "From .academy to .zone: An Analysis of the New TLD Land Rush.",
                    "Management Plane Analytics.",
                    "PerfSight: Performance Diagnosis for Software Dataplanes.",
                    "Leveraging Internet Background Radiation for Opportunistic Network Analysis.",
                    "Quantifying Interference between Measurements on the RIPE Atlas Platform.",
                    "Examining How the Great Firewall Discovers Hidden Circumvention Servers.",
                    "Characterizing Smartphone Usage Patterns from Millions of Android Users.",
                    "Offline Downloading in China: A Comparative Study.",
                    "In and Out of Cuba: Characterizing Cuba's Connectivity.",
                    "Peeking Beneath the Hood of Uber.",
                    "Temporal and Spatial Classification of Active IPv6 Addresses.",
                    "Are We One Hop Away from a Better Internet?",
                    "Analyzing the Performance of an Anycast CDN."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "IMC 2014",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2014",
                "sub_name": "Proceedings of the 2014 Internet Measurement Conference, IMC 2014, Vancouver, BC, Canada, November 5-7, 2014.",
                "count": 42,
                "papers": [
                    "Inter-Domain Traffic Estimation for the Outsider.",
                    "Challenges in Inferring Internet Interdomain Congestion.",
                    "Inferring Complex AS Relationships.",
                    "Peering at Peerings: On the Role of IXP Route Servers.",
                    "Measuring the Reliability of Mobile Broadband Networks.",
                    "Behind the Curtain: Cellular DNS and Content Replica Selection.",
                    "Need, Want, Can Afford: Broadband Markets and the Behavior of Users.",
                    "When the internet sleeps: correlating diurnal networks with external factors.",
                    "WhoWas: A Platform for Measuring Web Deployments on IaaS Clouds.",
                    "Towards Network-level Efficiency for Cloud Storage Services.",
                    "Paying for Likes?: Understanding Facebook Like Fraud Using Honeypots.",
                    "Whispers in the dark: analysis of an anonymous social network.",
                    "QoE Doctor: Diagnosing Mobile App QoE with Automated UI Control and Cross-layer Analysis.",
                    "A First Look at Performance in Mobile Virtual Network Operators.",
                    "OS Fingerprinting and Tethering Detection in Mobile Networks.",
                    "WiFi, LTE, or Both?: Measuring Multi-Homed Wireless Internet Performance.",
                    "Node Failure Localization via Network Tomography.",
                    "Efficient Large Flow Detection over Arbitrary Windows: An Algorithm Exact Outside an Ambiguity Region.",
                    "Crossroads: A Practical Data Sketching Solution for Mining Intersection of Streams.",
                    "OFSS: Skampling for the Flow Size Distribution.",
                    "Dissecting Web Latency in Ghana.",
                    "How Much Can We Micro-Cache Web Pages?",
                    "Back-Office Web Traffic on The Internet.",
                    "A Look at the Consequences of Internet Censorship Through an ISP Lens.",
                    "Censorship in the Wild: Analyzing Internet Filtering in Syria.",
                    "Automated Detection and Fingerprinting of Censorship Block Pages.",
                    "Measuring Price Discrimination and Steering on E-commerce Web Sites.",
                    "Capturing ghosts: predicting the used IPv4 space by inferring unobserved addresses.",
                    "A QoE Perspective on Sizing Network Buffers.",
                    "Handcrafted Fraud and Extortion: Manual Account Hijacking in the Wild.",
                    "Search + Seizure: The Effectiveness of Interventions on SEO Campaigns.",
                    "The Dark Alleys of Madison Avenue: Understanding Malicious Advertisements.",
                    "Layer 1-informed Internet Topology Measurement.",
                    "WireCAP: a novel packet capture engine for commodity NICs in high-speed networks.",
                    "Timing is Everything: Accurate, Minimum Overhead, Available Bandwidth Estimation in High-speed Wired Networks.",
                    "Identifying and Analyzing High Impact Routing Events with PathMiner.",
                    "Taming the 800 Pound Gorilla: The Rise and Decline of NTP DDoS Attacks.",
                    "DNSSEC and its potential for DDoS attacks: a comprehensive measurement study.",
                    "HILTI: an Abstract Execution Environment for Deep, Stateful Network Traffic Analysis.",
                    "The Matter of Heartbleed.",
                    "Analysis of SSL certificate reissues and revocations in the wake of heartbleed.",
                    "Forced Perspectives: Evaluating an SSL Trust Enhancement at Scale."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "IMC 2013",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2013",
                "sub_name": "Proceedings of the 2013 Internet Measurement Conference, IMC 2013, Barcelona, Spain, October 23-25, 2013.",
                "count": 42,
                "papers": [
                    "Revealing middlebox interference with tracebox.",
                    "Demystifying the dark side of the middle: a field study of middlebox failures in datacenters.",
                    "A method for identifying and confirming the use of URL filtering products for censorship.",
                    "Peer-assisted content distribution in Akamai netsession.",
                    "Analyzing the potential benefits of CDN augmentation strategies for internet video workloads.",
                    "D-mystifying the D-root address change.",
                    "Understanding the domain registration behavior of spammers.",
                    "On measuring the client-side DNS infrastructure.",
                    "Internet nameserver IPv4 and IPv6 address relationships.",
                    "Understanding IPv6 internet background radiation.",
                    "Speedtrap: internet-scale IPv6 alias resolution.",
                    "A fistful of bitcoins: characterizing payments among men with no names.",
                    "Best paper - Follow the money: understanding economics of online aggregation and advertising.",
                    "Understanding the effectiveness of video ads: a measurement study.",
                    "Follow the green: growth and dynamics in twitter follower markets.",
                    "Next stop, the cloud: understanding modern web service deployment in EC2 and azure.",
                    "Choreo: network-aware task placement for cloud applications.",
                    "Benchmarking personal cloud storage.",
                    "Community contribution award - Measuring and mitigating web performance bottlenecks in broadband access networks.",
                    "Studying interdomain routing over long timescales.",
                    "AS-level topology collection through looking glass servers.",
                    "AS relationships, customer cones, and validation.",
                    "RILAnalyzer: a comprehensive 3G monitor on your phone.",
                    "Signals from the crowd: uncovering social relationships through smartphone probes.",
                    "Rise of the planet of the apps: a systematic study of the mobile app ecosystem.",
                    "Analysis of the HTTPS certificate ecosystem.",
                    "Exploring EDNS-client-subnet adopters in your free time.",
                    "Mapping the expansion of Google's serving infrastructure.",
                    "Indexing million of packets per second using GPUs.",
                    "On the benefits of using a large IXP as an internet vantage point.",
                    "Growth analysis of a large ISP.",
                    "Understanding the super-sized traffic of the super bowl.",
                    "Appraising the delay accuracy in browser-based network measurement.",
                    "Network fingerprinting: TTL-based router signatures.",
                    "Peeking behind the NAT: an empirical study of home networks.",
                    "Identifiability of link metrics based on end-to-end path measurements.",
                    "Profiling high-school students with facebook: how online privacy laws can actually increase minors' risk.",
                    "Demystifying porn 2.0: a look into a major adult video streaming website.",
                    "From Paris to Tokyo: on the suitability of ping to measure latency.",
                    "A comparison of syslog and IS-IS for network failure analysis.",
                    "Scap: stream-oriented network traffic capture and analysis for high-speed networks.",
                    "A measurement-based study of MultiPath TCP performance over wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "IMC 2012",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2012",
                "sub_name": "Proceedings of the 12th ACM SIGCOMM Internet Measurement Conference, IMC '12, Boston, MA, USA, November 14-16, 2012.",
                "count": 45,
                "papers": [
                    "Analysis of a \"/0\" stealth scan from a botnet.",
                    "Detecting prefix hijackings in the internet with argus.",
                    "Concurrent prefix hijacks: occurrence and impacts.",
                    "Classifying internet one-way traffic.",
                    "RasterZip: compressing network monitoring data with support for partial decompression.",
                    "Wire-speed statistical classification of network traffic on commodity hardware.",
                    "Fathom: a browser-based network measurement platform.",
                    "Mitigating sampling error when measuring internet client IPv6 capabilities.",
                    "MAPLE: a scalable architecture for maintaining packet latency measurements.",
                    "Can you GET me now?: estimating the time-to-first-byte of HTTP transactions with passive measurements.",
                    "Towards geolocation of millions of IP addresses.",
                    "Evolution of social-attribute networks: measurements, modeling, and implications using google+.",
                    "Evolution of a location-based online social network: analysis and models.",
                    "New kid on the block: exploring the google+ social graph.",
                    "Multi-scale dynamics in a massive online social network.",
                    "Watching videos from everywhere: a study of the PPTV mobile VoD system.",
                    "Program popularity and viewer behaviour in a large TV-on-demand system.",
                    "Video stream quality impacts viewer behavior: inferring causality using quasi-experimental designs.",
                    "Confused, timid, and unstable: picking a video streaming rate is hard.",
                    "Routing state distance: a path-based metric for network analysis.",
                    "On the incompleteness of the AS-level graph: a novel methodology for BGP route collector placement.",
                    "Quantifying violations of destination-based forwarding on the internet.",
                    "Revisiting broadband performance.",
                    "Obtaining in-context measurements of cellular network performance.",
                    "Cell vs. WiFi: on the performance of metro area mobile connections.",
                    "Network performance of smart mobile handhelds in a university campus WiFi network.",
                    "Tackling bufferbloat in 3G/4G networks.",
                    "Breaking for commercials: characterizing mobile advertising.",
                    "Screen-off traffic characterization and optimization in 3G/4G networks.",
                    "Configuring DHCP leases in the smartphone era.",
                    "Video telephony for end-consumers: measurement study of Google+, iChat, and Skype.",
                    "Range tomography: combining the practicality of boolean tomography with the resolution of analog tomography.",
                    "On traffic matrix completion in the internet.",
                    "DNS to the rescue: discerning content and services in a tangled web.",
                    "Taster's choice: a comparative analysis of spam feeds.",
                    "Crime scene investigation: SMS spam data analysis.",
                    "Longtime behavior of harvesting spam bots.",
                    "Observing common spam in Twitter and email.",
                    "Beyond friendship: modeling user activity graphs on social network-based gifting applications.",
                    "Inside dropbox: understanding personal cloud storage services.",
                    "Reducing allocation errors in network testbeds.",
                    "Sharing the cost of backbone networks: cui bono?",
                    "Content delivery and the natural evolution of DNS: remote dns trends, performance issues and alternative solutions.",
                    "Measuring the deployment of IPv6: topology, routing and performance.",
                    "Measuring the impact of the copyright amendment act on New Zealand residential DSL users."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "IMC 2011",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2011",
                "sub_name": "Proceedings of the 11th ACM SIGCOMM Internet Measurement Conference, IMC '11, Berlin, Germany, November 2-, 2011.",
                "count": 42,
                "papers": [
                    "Analysis of country-wide internet outages caused by censorship.",
                    "Pingin' in the rain.",
                    "Detecting, validating and characterizing computer infections in the wild.",
                    "I know where you are and what you are sharing: exploiting P2P communications to invade users' privacy.",
                    "Analyzing facebook privacy settings: user expectations vs. reality.",
                    "An analysis of underground forums.",
                    "Sharing graphs using differentially private graph models.",
                    "Can they hear me now?: a case for a client-assisted approach to monitoring wide-area wireless networks.",
                    "Evaluation of data communication opportunities from oil field locations at remote areas.",
                    "Over the top video: the gorilla in cellular networks.",
                    "Airshark: detecting non-WiFi RF devices using commodity WiFi hardware.",
                    "Proportional rate reduction for TCP.",
                    "Measuring the state of ECN readiness in servers, clients, and routers.",
                    "Is it still possible to extend TCP?",
                    "Q-score: proactive service quality assessment in a large IPTV system.",
                    "Measurement and analysis of a large scale commercial mobile internet TV system.",
                    "Understanding couch potatoes: measurement and modeling of interactive usage of IPTV at large scale.",
                    "Suspended accounts in retrospect: an analysis of twitter spam.",
                    "Uncovering social network sybils in the wild.",
                    "Monitoring the initial DNS behavior of malicious domains.",
                    "Understanding fraudulent activities in online ad exchanges.",
                    "Towards understanding modern web traffic.",
                    "Understanding website complexity: measurements, metrics, and implications.",
                    "Identifying diverse usage behaviors of smartphone apps.",
                    "YouTube everywhere: impact of device and infrastructure synergies on user experience.",
                    "Broadcast yourself: understanding YouTube uploaders.",
                    "Counting YouTube videos via random prefix sampling.",
                    "On word-of-mouth based discovery of the web.",
                    "GQ: practical containment for measuring modern malware systems.",
                    "Measurement and evaluation of a real world deployment of a challenge-response spam filter.",
                    "The SSL landscape: a thorough analysis of the x.509 PKI using active and passive measurements.",
                    "On the prevalence and characteristics of MPLS deployments in the open internet.",
                    "Latency inflation with MPLS-based traffic engineering.",
                    "ShaperProbe: end-to-end detection of ISP traffic shaping using active methods.",
                    "Sketching the delay: tracking temporally uncorrelated flow-level latencies.",
                    "The evolution of network configuration: a tale of two campuses.",
                    "Understanding and characterizing PlanetLab resource usage for federated network testbeds.",
                    "vPF_RING: towards wire-speed network monitoring using virtual machines.",
                    "Going viral: flash crowds in an open CDN.",
                    "Characterizing roles of front-end servers in end-to-end performance of dynamic content distribution.",
                    "Overclocking the Yahoo!: CDN for faster web page loads.",
                    "Web content cartography."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "IMC 2010",
        "info": "Melbourne, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2010",
                "sub_name": "Proceedings of the 10th ACM SIGCOMM Internet Measurement Conference, IMC 2010, Melbourne, Australia - November 1-3, 2010.",
                "count": 47,
                "papers": [
                    "CloudCmp: comparing public cloud providers.",
                    "Comparing DNS resolvers in the wild.",
                    "Improving content delivery using provider-aided distance information.",
                    "Detecting and characterizing social spam campaigns.",
                    "Detecting algorithmically generated malicious domain names.",
                    "Internet background radiation revisited.",
                    "On economic heavy hitters: shapley value analysis of 95th-percentile pricing.",
                    "Challenges in measuring online advertising systems.",
                    "Measurement of loss pairs in network paths.",
                    "Measuring path MTU discovery behaviour.",
                    "Demystifying service discovery: implementing an internet-wide scanner.",
                    "Measurement and analysis of real-world 802.11 mesh networks.",
                    "Characterizing radio resource allocation for 3G networks.",
                    "On the feasibility of effective opportunistic spectrum access.",
                    "Primitives for active internet topology mapping: toward high-frequency characterization.",
                    "Resolving IP aliases with prespecified timestamps.",
                    "On the impact of layer-2 on node degree distribution.",
                    "Eyeball ASes: from geography to connectivity.",
                    "Towards an AS-to-organization map.",
                    "Comparing and improving current packet capturing solutions based on commodity hardware.",
                    "High speed network traffic analysis with commodity multi-core systems.",
                    "Network tomography on correlated links.",
                    "Scamper: a scalable and extensible packet prober for active measurement of the internet.",
                    "Netalyzr: illuminating the edge network.",
                    "An experimental study of home gateway characteristics.",
                    "Network traffic characteristics of data centers in the wild.",
                    "A first look at traffic on smartphones.",
                    "Listen to me if you can: tracking user experience of mobile network on social media.",
                    "The effect of packet loss on redundancy elimination in cellular wireless networks.",
                    "Performance comparison of 3G and metro-scale WiFi for vehicular network access.",
                    "An empirical study of orphan DNS servers in the internet.",
                    "Flowroute: inferring forwarding table updates using passive flow-level measurements.",
                    "Digging into HTTPS: flow-based classification of webmail traffic.",
                    "Revisiting the case for a minimalist approach for network flow monitoring.",
                    "Exact temporal characterization of 10 Gbps optical wide-area network.",
                    "TraceNET: an internet topology data collector.",
                    "Understanding latent interactions in online social networks.",
                    "Measuring the mixing time of social graphs.",
                    "Estimating and sampling graphs with multidimensional random walks.",
                    "The impact of YouTube recommendation system on video views.",
                    "Selecting representative IP addresses for internet topology studies.",
                    "Speed testing without speed tests: estimating achievable download speed from passive measurements.",
                    "YouTube traffic dynamics and its interplay with a tier-1 ISP: an ISP perspective.",
                    "On the characteristics and reasons of long-lived internet flows.",
                    "BasisDetect: a model-based network event detection framework.",
                    "Temporally oblivious anomaly detection on large networks using functional peers.",
                    "What happened in my network: mining network events from router syslogs."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "IMC 2009",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2009",
                "sub_name": "Proceedings of the 9th ACM SIGCOMM Internet Measurement Conference, IMC 2009, Chicago, Illinois, USA, November 4-6, 2009.",
                "count": 41,
                "papers": [
                    "ANTIDOTE: understanding and defending against poisoning of anomaly detectors.",
                    "When private keys are public: results from the 2008 Debian OpenSSL vulnerability.",
                    "Anomaly extraction in backbone networks using association rules.",
                    "Understanding online social network usage from a network perspective.",
                    "Characterizing user behavior in online social networks.",
                    "Network level footprints of facebook applications.",
                    "TCP revisited: a fresh look at TCP in the wild.",
                    "On dominant characteristics of residential broadband internet traffic.",
                    "Detecting traffic differentiation in backbone ISPs with NetPolice.",
                    "Characterizing VLAN-induced sharing in a campus network.",
                    "Challenging statistical classification for operational usage: the ADSL case.",
                    "Mining policies from enterprise network configuration.",
                    "On calibrating enterprise switch measurements.",
                    "Sampling biases in network path measurements and what to do about it.",
                    "An analysis of packet sampling in the frequency domain.",
                    "Triangle inequality variations in the internet.",
                    "Geolocalization of proxied services and its application to fast-flux hidden servers.",
                    "Moving beyond end-to-end path information to optimize CDN performance.",
                    "The nature of data center traffic: measurements & analysis.",
                    "Characterizing podcast services: publishing, usage, and dissemination.",
                    "One-click hosting services: a file-sharing hideout.",
                    "Impact of prefix-match changes on IP reachability.",
                    "Internet optometry: assessing the broken glasses in internet reachability.",
                    "Measurement methods for fast and accurate blackhole identification with binary tomography.",
                    "Measuring serendipity: connecting people, locations and interests in a mobile 3G network.",
                    "Energy consumption in mobile phones: a measurement study and implications for network applications.",
                    "Where's that phone?: geolocating IP addresses on 3G networks.",
                    "Mining communities in networks: a solution for consistency and its evaluation.",
                    "Evolution of an online social aggregation network: an empirical study.",
                    "Scalable proximity estimation and link prediction in online social networks.",
                    "IXPs: mapped?",
                    "Understanding slow BGP routing table transfers.",
                    "Understanding the efficacy of deployed internet source address validation filtering.",
                    "Quantifying ases multiconnectivity using multicast information.",
                    "Non-intrusive, dynamic interference detection for 802.11 networks.",
                    "The importance of being overheard: throughput gains in wireless mesh networks.",
                    "Impact of transient CSMA/CA access delays on active bandwidth measurements.",
                    "Practical beamforming based on RSSI measurements using off-the-shelf wireless clients.",
                    "Live streaming performance of the Zattoo network.",
                    "Modeling user activities in a large IPTV system.",
                    "Inside the bird's nest: measurements of large-scale live VoD from the 2008 olympics."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "IMC 2008",
        "info": "Vouliagmeni, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2008",
                "sub_name": "Proceedings of the 8th ACM SIGCOMM Internet Measurement Conference, IMC 2008, Vouliagmeni, Greece, October 20-22, 2008.",
                "count": 32,
                "papers": [
                    "Graph mining: laws, generators and tools.",
                    "Detecting bittorrent blocking.",
                    "On the difficulty of finding the nearest peer in p2p systems.",
                    "Thinning akamai.",
                    "Unveiling facebook: a measurement study of social network based applications.",
                    "Comparison of online social relations in volume vs interaction: a case study of cyworld.",
                    "Watching television over an IP network.",
                    "Analysis of a mixed-use urban wifi network: when metropolitan becomes neapolitan.",
                    "Mark-and-sweep: getting the \"inside\" scoop on neighborhood networks.",
                    "802.11n under the microscope.",
                    "A measurement study of a commercial-grade urban wifi mesh.",
                    "Correcting congestion-based error in network telescope's observations of worm dynamics.",
                    "Distributed algorithms for stable and secure network coordinates.",
                    "How healthy are today's enterprise networks?",
                    "An empirical evaluation of entropy-based traffic anomaly detection.",
                    "On the internet delay space dimensionality.",
                    "Census and survey of the visible internet.",
                    "Ten years in the evolution of the internet ecosystem.",
                    "Experimental study of router buffer sizing.",
                    "Understanding implications of DNS zone provisioning.",
                    "Context-aware clustering of DNS query traffic.",
                    "Quantifying the operational status of the DNSSEC deployment.",
                    "Towards optimal sampling for flow size estimation.",
                    "Fast monitoring of traffic subpopulations.",
                    "Adaptive shared-state sampling.",
                    "A resource-minimalist flow size histogram estimator.",
                    "Spectral probing, crosstalk and frequency multiplexing in internet paths.",
                    "On the predictive power of shortest-path weight inference.",
                    "Traceroute probe method and forward IP path inference.",
                    "Bigfoot, sasquatch, the yeti and other missing links: what we don't know about the as graph.",
                    "Towards a meaningful MRA of traffic matrices.",
                    "Fixing ally's growing pains with velocity modeling."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "IMC 2007",
        "info": "San Diego, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2007",
                "sub_name": "Proceedings of the 7th ACM SIGCOMM Internet Measurement Conference, IMC 2007, San Diego, California, USA, October 24-26, 2007.",
                "count": 39,
                "papers": [
                    "I tube, you tube, everybody tubes: analyzing the world's largest user generated content video system.",
                    "Youtube traffic characterization: a view from the edge.",
                    "Measurement and analysis of online social networks.",
                    "Characterizing residential broadband networks.",
                    "Understanding passive and active service discovery.",
                    "Usage-based dhcp lease time optimization.",
                    "A brief history of scanning.",
                    "Cryptographic strength of ssl/tls servers: current and recent practices.",
                    "Using uncleanliness to predict future botnet addresses.",
                    "Challenging the supremacy of traffic matrices in anomaly detection.",
                    "Analysis of internet backbone traffic and header anomalies observed.",
                    "A global view of kad.",
                    "The web is smaller than it seems.",
                    "Profiling a million user dht.",
                    "Issues and etiquette concerning use of shared measurement data.",
                    "Legal issues surrounding monitoring during network research.",
                    "Measuring load-balanced paths in the internet.",
                    "Diversity of forwarding paths in pocket switched networks.",
                    "Towards network triangle inequality violation aware distributed systems.",
                    "Networkmd: topology inference and failure diagnosis in the last mile.",
                    "Inferring subnets in router-level topology collection studies.",
                    "Learning network structure from passive measurements.",
                    "On the impact of route monitor selection.",
                    "Acyclic type-of-relationship problems on the internet: an experimental analysis.",
                    "Network loss inference with second order statistics of end-to-end flows.",
                    "Compressed network monitoring for ip and all-optical networks.",
                    "Quality-of-service class specific traffic matrices in ip/mpls networks.",
                    "Blind source separation approach to performance diagnosis and dependency discovery.",
                    "Algorithms and estimators for accurate summarization of internet traffic.",
                    "A data streaming algorithm for estimating entropies of od flows.",
                    "On optimal probing for delay and loss measurement.",
                    "An active measurement system for shared environments.",
                    "Network monitoring using traffic dispersion graphs (tdgs).",
                    "Understanding wifi-based connectivity from moving vehicles.",
                    "Studying wireless routing link metric dynamics.",
                    "Understanding handoffs in large ieee 802.11 wireless networks.",
                    "Interference map for 802.11 networks.",
                    "Understanding the limitations of transmit power control for indoor wlans.",
                    "Passive online rogue access point detection using sequential hypothesis testing with TCP ACK-pairs."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "IMC 2006",
        "info": "Rio de Janeriro, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2006",
                "sub_name": "Proceedings of the 6th ACM SIGCOMM Internet Measurement Conference, IMC 2006, Rio de Janeriro, Brazil, October 25-27, 2006.",
                "count": 34,
                "papers": [
                    "Shared-state sampling.",
                    "Fisher information of sampled packets: an application to flow size estimation.",
                    "On unbiased sampling for unstructured peer-to-peer networks.",
                    "A multifaceted approach to understanding the botnet phenomenon.",
                    "Finding diversity in remote code injection exploits.",
                    "Generating a privacy footprint on the internet.",
                    "Towards IP geolocation using delay and topology measurements.",
                    "Measurement based analysis, modeling, and synthesis of the internet delay space.",
                    "A structural approach to latency prediction.",
                    "Touring the internet in a TCP sidecar.",
                    "Monarch: a tool to emulate transport protocol flowsover the internet at large.",
                    "Semi-automated discovery of application session structure.",
                    "On the impact of research network based testbeds on wide-area experiments.",
                    "Detection and identification of network anomalies using sketch subspaces.",
                    "Avoiding traceroute anomalies with Paris traceroute.",
                    "Impact of packet sampling on anomaly detection metrics.",
                    "Is sampled data sufficient for anomaly detection?",
                    "Comprehensive view of a live network coding P2P system.",
                    "Understanding churn in peer-to-peer networks.",
                    "Rarest first and choke algorithms are enough.",
                    "Delving into internet streaming media delivery: a quality and resource utilization perspective.",
                    "A measurement-based deployment proposal for IP anycast.",
                    "Web search clickstreams.",
                    "An independent-connection model for traffic matrices.",
                    "The need for cross-layer information in access point selection algorithms.",
                    "A study of the short message service of a nationwide cellular network.",
                    "Quantifying path exploration in the internet.",
                    "BGP convergence in virtual private networks.",
                    "binpac: a yacc for writing application protocol parsers.",
                    "Approximate fingerprinting to accelerate pattern matching.",
                    "Efficient sequence alignment of network traffic.",
                    "Unexpected means of protocol inference.",
                    "A study of malware in peer-to-peer networks.",
                    "Malware prevalence in the KaZaA file-sharing network."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "IMC 2005",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2005",
                "sub_name": "Proceedings of the 5th Internet Measurement Conference, IMC 2005, Berkeley, California, USA, October 19-21, 2005.",
                "count": 36,
                "papers": [
                    "Measurement-based Characterization of a Collection of On-line Games (Awarded Best Student Paper!).",
                    "A First Look at Modern Enterprise Traffic.",
                    "Client Behavior and Feed Characteristics of RSS, a Publish-Subscribe System for Web Micronews.",
                    "Measurements, Analysis, and Modeling of BitTorrent-like Systems.",
                    "Characterizing Unstructured Overlay Topologies in Modern P2P File-Sharing Systems.",
                    "Should Internet Service Providers Fear Peer-Assisted Content Distribution?",
                    "Joint Data Streaming and Sampling Techniques for Detection of Super Sources and Destinations.",
                    "Optimal Combination of Sampled Network Measurements.",
                    "The Power of Slicing in Internet Flow Measurement.",
                    "Poisson versus Periodic Path Probing (or, Does PASTA Matter?).",
                    "On the Accuracy of Embeddings for Internet Coordinate Systems.",
                    "An Empirical Approach to Modeling Inter-AS Traffic Matrices.",
                    "Geographic Locality of IP Prefixes.",
                    "An Information-theoretic Approach to Network Monitoring and Measurement.",
                    "Multi-Hop Probing Asymptotics in Available Bandwidth Estimation: Stochastic Analysis.",
                    "Exploiting Internet Route Sharing for Large Scale Available Bandwidth Estimation.",
                    "Inferring and Debugging Path MTU Discovery Failures.",
                    "Characterization and Measurement of TCP Traversal Through NATs and Firewalls.",
                    "Predicting Short-Transfer Latency from TCP Arcana: A Trace-based Validation.",
                    "Novel Approaches to End-to-End Packet Reordering Measurement.",
                    "Data Reduction for the Scalable Automated Analysis of Distributed Darknet Traffic.",
                    "Sparse Approximations for High Fidelity Compression of Network Traffic Data.",
                    "Building a Time Machine for Efficient Recording and Retrieval of High-Volume Network Traffic.",
                    "Improving Sketch Reconstruction Accuracy Using Linear Least Squares Method.",
                    "Understanding Congestion in IEEE 802.11b Wireless Networks.",
                    "Facilitating Access Point Selection in IEEE 802.11 Wireless Networks.",
                    "Eliminating Handoff Latencies in 802.11 WLANs Using Multiple Radios: Applications, Experience, and Evaluation.",
                    "Estimation of Link Interference in Static Multi-hop Wireless Networks.",
                    "Exploiting Partially Overlapping Channels in Wireless Networks: Turning a Peril into an Advantage.",
                    "Network Anomography.",
                    "Combining Filtering and Statistical Methods for Anomaly Detection.",
                    "Detecting Anomalies in Network Traffic Using Maximum Entropy Estimation.",
                    "Exploiting Underlying Structure for Detailed Reconstruction of an Internet-scale Event.",
                    "Collaborating Against Common Enemies.",
                    "Perils of Transitive Trust in the Domain Name System.",
                    "Flooding Attacks by Exploiting Persistent Forwarding Loops."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "IMC 2004",
        "info": "Taormina, Sicily, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2004",
                "sub_name": "Proceedings of the 4th ACM SIGCOMM Internet Measurement Conference, IMC 2004, Taormina, Sicily, Italy, October 25-27, 2004.",
                "count": 39,
                "papers": [
                    "Availability, usage, and deployment characteristics of the domain name system.",
                    "The root of the matter: hints or slaves.",
                    "On the responsiveness of DNS-based network control.",
                    "Characteristics of internet background radiation.",
                    "An analysis of live streaming workloads on the internet.",
                    "Characterizing the query behavior in peer-to-peer file sharing systems.",
                    "Self-configuring network traffic generation.",
                    "A framework for malicious workload generation.",
                    "A pragmatic approach to dealing with high-variability in network measurements.",
                    "Online identification of hierarchical heavy hitters: algorithms, evaluation, and applications.",
                    "Identifying elephant flows through periodically sampled packets.",
                    "Transport layer identification of P2P traffic.",
                    "Class-of-service mapping for QoS: a statistical signature-based approach to IP traffic classification.",
                    "Traffic matrix estimation on a large IP backbone: a comparison on real data.",
                    "A distributed approach to measure IP traffic matrices.",
                    "Network radar: tomography from round trip time measurements.",
                    "Efficient beacon placement for network tomography.",
                    "On scalable attack detection in the network.",
                    "Characterization of network-wide anomalies in traffic flows.",
                    "Reversible sketches for efficient and accurate change detection over network data streams.",
                    "BorderGuard: detecting cold potatoes from peers.",
                    "Robust synchronization of software clocks across the internet.",
                    "Introducing scalability in network measurement: toward 10 Gbps with commodity hardware.",
                    "Structure preserving anonymization of router configuration data.",
                    "MultiQ: automated detection of multiple bottleneck capacities along a path.",
                    "Packet trace manipulation rramework for test labs.",
                    "Debugging DHCP performance.",
                    "Strategies for sound internet measurement.",
                    "Ten fallacies and pitfalls on end-to-end available bandwidth estimation.",
                    "Modeling distances in large-scale networks by matrix factorization.",
                    "Constraint-based geolocation of internet hosts.",
                    "Exploiting as hierarchy for scalable route selection in multi-homed stub networks.",
                    "Single-hop probing asymptotics in available bandwidth estimation: sample-path analysis.",
                    "Bandwidth estimation in broadband access networks.",
                    "A methodology for estimating interdomain web traffic demand.",
                    "Measuring interactions between transport protocols and middleboxes.",
                    "Measurement based characterization and provisioning of IP VPNs.",
                    "Characterizing a spam traffic.",
                    "An empirical study of spam traffic and the use of DNS black lists."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "IMC 2003",
        "info": "Miami Beach, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2003",
                "sub_name": "Proceedings of the 3rd ACM SIGCOMM Internet Measurement Conference, IMC 2003, Miami Beach, FL, USA, October 27-29, 2003.",
                "count": 32,
                "papers": [
                    "BGP beacons.",
                    "On inferring and characterizing internet routing policies.",
                    "System capability effects on algorithms for network bandwidth measurement.",
                    "A measurement study of available bandwidth estimation tools.",
                    "Some findings on the network performance of broadband hosts.",
                    "An analysis of Internet chat systems.",
                    "Measuring and modelling the group mmbership in the internet.",
                    "Inferring relative popularity of internet applications by actively querying DNS caches.",
                    "Best-path vs. multi-path overlay routing.",
                    "An empirical evaluation of wide-area internet bottlenecks.",
                    "Model-based identification of dominant congested links.",
                    "Constructing internet coordinate system based on delay measurement.",
                    "Virtual landmarks for the internet.",
                    "Bitmap algorithms for counting active flows on high speed links.",
                    "Space-code bloom filter for efficient traffic flow measurement.",
                    "Identifying frequent items in sliding windows over on-line packet streams.",
                    "Predicting resource usage and estimation accuracy in an IP flow measurement collection infrastructure.",
                    "Merging logical topologies using end-to-end measurements.",
                    "On the number of distributed measurement points for network tomography.",
                    "Simple network performance tomography.",
                    "Tomography-based overlay network monitoring.",
                    "Inverting sampled traffic.",
                    "Sketch-based change detection: methods, evaluation, and applications.",
                    "Traffic engineering with estimated traffic matrices.",
                    "On the correspondency between TCP acknowledgment packet and data packet.",
                    "Is the round-trip time correlated with the number of packets in flight?",
                    "Variability in TCP round-trip times.",
                    "On the correlation between route dynamics and routing loops.",
                    "Network performance monitoring at small time scales.",
                    "Source-level IP packet bursts: causes and effects.",
                    "On the performance of middleboxes.",
                    "In search of path diversity in ISP networks."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "IMW 2002",
        "info": "Marseille, France",
        "venues": [
            {
                "sub_name_abbr": "conf/imc/2002",
                "sub_name": "Proceedings of the 2nd ACM SIGCOMM Internet Measurement Workshop, IMW 2002, Marseille, France, November 6-8, 2002.",
                "count": 39,
                "papers": [
                    "King: estimating latency between arbitrary internet end hosts.",
                    "Diversity in DNS performance measures.",
                    "A flow-based model for internet backbone traffic.",
                    "Testing the Gaussian approximation of aggregate traffic.",
                    "Does fractal scaling at the IP level depend on TCP flow arrival processes?",
                    "A signal analysis of network traffic anomalies.",
                    "Statistical analysis of malformed packets and their origins in the modern internet.",
                    "Iterative Bayesian estimation of network traffic matrices in the case of bursty flows.",
                    "Experience in measuring backbone traffic variability: models, metrics, measurements and meaning.",
                    "Passive network tomography using Bayesian inference.",
                    "Measuring packet reordering.",
                    "Detection and analysis of routing loops in packet traces.",
                    "Measurement and classification of out-of-sequence packets in a tier-1 IP backbone.",
                    "A hierarchical characterization of a live streaming media workload.",
                    "MediaPlayer™ versus RealPlayer™: a comparison of network turbulence.",
                    "Analyzing peer-to-peer traffic across large networks.",
                    "Provisioning on-line games: a traffic analysis of a busy counter-strike server.",
                    "Properties and prediction of flow statistics from sampled packet streams.",
                    "NetFlow: information loss or win?",
                    "A pragmatic definition of elephants in internet backbone traffic.",
                    "Automated measurement of high volume traffic clusters.",
                    "Traffic classification for application specific peering.",
                    "Observation and analysis of BGP behavior under stress.",
                    "BGP routing stability of popular destinations.",
                    "An empirical study of router response to large BGP routing table load.",
                    "On the structure and application of BGP policy atoms.",
                    "A case study of OSPF behavior in a large enterprise network.",
                    "Inferring link weights using end-to-end measurements.",
                    "Analysis of link failures in an IP backbone.",
                    "Topology inference from BGP routing dynamics.",
                    "On the geographic location of internet resources.",
                    "Observed structure of addresses in IP traffic.",
                    "A technique for counting natted hosts.",
                    "Code-Red: a case study on the spread and victims of an internet worm.",
                    "Agile and scalable analysis of network events.",
                    "Active probing using packet quartets.",
                    "Predicting and bypassing end-to-end internet service degradations.",
                    "The effect of layer-2 switches on pathchar-like tools.",
                    "Preliminary measurements on the effect of server adaptation for web content delivery."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "IMW 2001",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/imw/2001",
                "sub_name": "Proceedings of the 1st ACM SIGCOMM Internet Measurement Workshop, IMW 2001, San Francisco, California, USA, November 1-2, 2001.",
                "count": 29,
                "papers": [
                    "On the marginal utility of network topology measurements.",
                    "Topology modeling via cluster graphs.",
                    "Towards global network positioning.",
                    "An analysis of BGP multiple origin AS (MOAS) conflicts.",
                    "Pop-level and access-link-level traffic dynamics in a tier-1 POP.",
                    "Characterizing large DNS traces using graphs.",
                    "Characteristics of network traffic flow anomalies.",
                    "New directions in traffic measurement and accounting.",
                    "Characteristics of fragmented IP traffic on internet links.",
                    "Connection-level analysis and modeling of network traffic.",
                    "Early measurements of a cluster-based architecture for P2P systems.",
                    "Experience in black-box OSPF measurement.",
                    "Using loss pairs to discover network properties.",
                    "Measuring end-to-end bulk transfer capacity.",
                    "Towards improving packet probing techniques.",
                    "DNS performance and the effectiveness of caching.",
                    "On the use and performance of content distribution networks.",
                    "The Inktomi climate lab: an integrated environment for analyzing and simulating customer network traffic.",
                    "Analyzing the browse patterns of mobile clients.",
                    "On the constancy of internet path properties.",
                    "A non-instrusive, wavelet-based approach to detecting network performance problems.",
                    "Evidence for long-tailed distributions in the internet.",
                    "Charging from sampled network usage.",
                    "A method to compress and anonymize packet traces.",
                    "On the design and performance of prefix-preserving IP traffic trace anonymization.",
                    "Monitoring very high speed links.",
                    "Precision timestepping of network packets.",
                    "Measurement study of low-bitrate internet video streaming.",
                    "An empirical study of realvideo performance across the internet."
                ]
            }
        ]
    }
]