[
    {
        "year": "2021",
        "name": "40th IPCCC 2021",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2021",
                "sub_name": "IEEE International Performance, Computing, and Communications Conference, IPCCC 2021, Austin, TX, USA, October 29-31, 2021.",
                "count": 74,
                "papers": [
                    "A Simulation Study of Hardware Parameters for Future GPU-based HPC Platforms.",
                    "Circuit-based PSI for Covid-19 Risk Scoring.",
                    "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation.",
                    "Accelerate Graph Neural Network Training by Reusing Batch Data on GPUs.",
                    "JointCloud Cross-chain Verification Model of Decentralized Identifiers.",
                    "Private Distributed K-Means Clustering on Interval Data.",
                    "Benchmarking of Pre- and Post-Quantum Group Encryption Schemes with Focus on IoT.",
                    "Incentive Mechanism Design for Blockchain Enabled Distributed Content Caching.",
                    "Federated Variational Learning for Anomaly Detection in Multivariate Time Series.",
                    "Resource allocation algorithm for MEC based on Deep Reinforcement Learning.",
                    "One Layer for All: Efficient System Security Monitoring for Edge Servers.",
                    "Optimal data sink location for real-time NOMA-based Industrial IoTs.",
                    "A Millimeter-wave Multi-channel MAC with Dynamic Spectrum Access Capability for Mobile Self-organizing Heterogeneous Networks.",
                    "Two-layer Federated Learning for Scene Text Detection.",
                    "Three-Party Integer Comparison and Applications.",
                    "3DRIMR: 3D Reconstruction and Imaging via mmWave Radar based on Deep Learning.",
                    "CODS: Cloud-assisted Object Detection for Streaming Videos on Edge Devices.",
                    "A Scalable Approach to Service Placement in Fog/Cloud Environments.",
                    "SNIS: Storage-Network Iterative Simulation for Disaggregated Storage Systems.",
                    "Q-learning-based Opportunistic Communication for Real-time Mobile Air Quality Monitoring Systems.",
                    "Encrypted All-reduce on Multi-core Clusters.",
                    "A General and Practical Framework for Realization of SDN-based Vehicular Networks.",
                    "ALLPC: A Lightweight Block Cipher Based on Generalized Feistel Networks for IoT.",
                    "MAGINS: Neural Network Inertial Navigation System Corrected by Magnetic Information.",
                    "VideoKV: A Fast Key-Value Store For Intelligent Video Surveillance Terminals.",
                    "Research on Tag Method for Joint Extraction of Domain-oriented Entity and Relation.",
                    "Methodological Principles for Deep Learning in Software Engineering.",
                    "Transfer Learning Based Crop Disease Identification Using State-of-the-art Deep Learning Framework.",
                    "Deep Learning-based Face Mask Usage Detection on Low Compute Resource Devices.",
                    "Software Defined Radio based Security Analysis For Unmanned Aircraft Systems.",
                    "QoSP: A Priority-Based Queueing Mechanism in Software-Defined Networking Environments.",
                    "NOMA-Assisted Wireless Caching in Vehicular Networks: A Online Scheduling Strategy.",
                    "NLP-based Entity Behavior Analytics for Malware Detection.",
                    "Performance Evaluation for a Post-Quantum Public-Key Cryptosystem.",
                    "ELSV: An Effective Anomaly Detection System from Web Access Logs.",
                    "PACTS: Power-Aware Charging Time Scheduling in Wireless Rechargeable UAV Networks.",
                    "Learning to Detect: A Data-driven Approach for Network Intrusion Detection.",
                    "FedVF: Personalized Federated Learning Based on Layer-wise Parameter Updates with Variable Frequency.",
                    "The Diminished Importance of Connection-based Features in Intrusion Detection.",
                    "SMOTE for Wi-Fi Fingerprint Construction in Indoor Positioning Systems.",
                    "Communication-Efficient Quantized SGD for Learning Polynomial Neural Network.",
                    "Efficient Data Trading for Stable and Privacy Preserving Histograms in Internet of Things.",
                    "A Service Migration Method for Resource Competition in Mobile Edge Computing.",
                    "A self-adaptive batch request aggregation pattern for improving resource management, response time and costs in microservice and serverless environments.",
                    "Identification of Cotton Growing Stage Based on Faster-RCNN.",
                    "Key-Based Input Transformation Defense Against Adversarial Examples.",
                    "Multi-objective Dynamic Auction Mechanism for Online Advertising.",
                    "Zero-bias Deep Neural Network for Quickest RF Signal Surveillance.",
                    "RecGraph: Graph Recovery Attack using Variational Graph Autoencoders.",
                    "A Traceability System of Livestock Products Based on Blockchain and the Internet of Things.",
                    "Elastic Scheduling of Virtual Machines in Cloudlet Networks.",
                    "A Hybrid System for Learning Classical Data in Quantum States.",
                    "An Efficient Shuffle-Light FFT Library.",
                    "BigBFT: A Multileader Byzantine Fault Tolerance Protocol for High Throughput.",
                    "Universal Perturbation for Flow Correlation Attack on Tor.",
                    "Accelerating DNN Inference by Edge-Cloud Collaboration.",
                    "Differential Shadowing: A Resilience Framework for Extreme-scale, Heterogeneous Environments with Non-Uniform Node Failure Distribution.",
                    "PUFF: A Passive and Universal Learning-based Framework for Intra-domain Failure Detection.",
                    "LAFS: Learning-Based Application-Agnostic Flow Scheduling for Datacenters.",
                    "Data Placement Strategies for Data-Intensive Computing over Edge Clouds.",
                    "Diagnosing the Interference on CPU-GPU Synchronization Caused by CPU Sharing in Multi-Tenant GPU Clouds.",
                    "An air quality prediction model based on deep learning and wavelet analysis considering the COVID-19 pandemic factors.",
                    "MR-tree: A Parametric Family of Multi-Rail Fat-tree.",
                    "MQTT based Wi-Fi communication between Microcontroller and FPGA.",
                    "PMatch: Semantic-based Patch Detection for Binary Programs.",
                    "Spectral Data Classification By One-Dimensional Convolutional Neural Networks.",
                    "Adaptive Video Streaming with Scalable Video Coding using Multipath QUIC.",
                    "Defending Against Adversarial Attacks in Speaker Verification Systems.",
                    "EdgePier: P2P-based Container Image Distribution in Edge Computing Environments.",
                    "DENNI: Distributed Neural Network Inference on Severely Resource Constrained Edge Devices.",
                    "An End-To-End Method for Teenagers Potential Depression Detection on Social Media.",
                    "Fast Monotonicity Preserving Text Sorting On GPU.",
                    "Unravel: An Anomalistic Crowd Investigation Framework Using Social Airborne Sensing.",
                    "SCB: Flexible and Efficient Asymmetric Computations Utilizing Symmetric Cryptosystems Implemented with Intel SGX."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "39th IPCCC 2020",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2020",
                "sub_name": "39th IEEE International Performance Computing and Communications Conference, IPCCC 2020, Austin, TX, USA, November 6-8, 2020.",
                "count": 58,
                "papers": [
                    "A Multimodal Feature Fusion-Based Method for Individual Depression Detection on Sina Weibo.",
                    "UAV Swarm Communication Aware Formation Control via Deep Q Network.",
                    "Supporting Efficient Dynamic Update in Public Integrity Verification of Cloud Data.",
                    "Research of Knowledge Graph Technology and its Applications in Agricultural Information Consultation Field.",
                    "A Modular and Distributed Setup for Power and Performance Analysis of Multi-Processor System-on-Chip at Electronic System Level.",
                    "Distributed Scheduling Algorithm for Optimizing Age of Information in Wireless Networks.",
                    "Efficient arithmetic expression optimization with weighted adjoint matrix.",
                    "Detect Stepping-stone Intrusion by Mining Network Traffic using k-Means Clustering.",
                    "What You See Is Not What You Get: Towards Deception-Based Data Moving Target Defense.",
                    "AdaEmb-Encoder: Adaptive Embedding Spatial Encoder-Based Deduplication for Backing Up Classifier Training Data.",
                    "Website Recommendation with Side Information Aided Variational Autoencoder.",
                    "A Dynamic Task Assignment Framework based on Prediction and Adaptive Batching.",
                    "Software Define Radio in Realizing the Intruding UAS Group Behavior Prediction.",
                    "LIDAUS: Localization of IoT Device via Anchor UAV SLAM.",
                    "A Unite and Conquer Based Ensemble learning Method for User Behavior Modeling.",
                    "Network Resource Scheduling For Cloud/Edge Data Centers.",
                    "P4SFC: Service Function Chain Offloading with Programmable Switches.",
                    "Deploying Network Key-Value SSDs to Disaggregate Resources in Big Data Processing Frameworks.",
                    "Adaptive Video Streaming via Deep Reinforcement Learning from User Trajectory Preferences.",
                    "Hieff: Enabling Efficient VNF Clusters by Coordinating VNF Scaling and Flow Scheduling.",
                    "Improved Window Segmentation for Deep Learning Based Inertial Odometry.",
                    "Interrupting Real-Time IoT Tasks: How Bad Can It Be to Connect Your Critical Embedded System to the Internet?",
                    "NRV: Leveraging Secure Multi-Party Computation for Lightweight BGP Security Enhancement.",
                    "Evaluation of the interest of an extra-slot for a grouped polling-selecting method.",
                    "FProbe: Detecting Stealthy DGA-based Botnets by Group Activities Analysis.",
                    "A Connection-Free Reliable Transport Protocol.",
                    "A sensor attack detection method based on fusion interval and historical measurement in CPS.",
                    "An Encrypted Traffic Classification Method Combining Graph Convolutional Network and Autoencoder.",
                    "The Practical Application of IoT for Large-scale Instruments and Equipment Sharing Management Platform.",
                    "Privacy Preserving Inference with Convolutional Neural Network Ensemble.",
                    "Research on Power Quality Data Placement Strategy Based on Improved Particle Swarm Optimization Algorithm.",
                    "Experiments with Non-Cooperative Space DTN Routing.",
                    "Socially-Aware D2D Pair Strategy: A Stable Matching Approach.",
                    "Automatic Recognition of Identification Schemes for IoT Identifiers via Sequence-to-Sequence Model.",
                    "Budgeted Persuasion on User Opinions via Varying Susceptibility.",
                    "FluxInfer: Automatic Diagnosis of Performance Anomaly for Online Database System.",
                    "Efficient Architecture Paradigm for Deep Learning Inference as a Service.",
                    "Modeling Energy Consumption of Virtual Machines in DVFS-Enabled Cloud Data Centers.",
                    "Authentication Based on Blockchain.",
                    "SEC: Secure, Efficient, and Compatible Source Address Validation with Packet Tags.",
                    "FPGA Implementation of a Pseudo-Random Signal Generator for RF Hardware Test and Evaluation.",
                    "Secure Decentralized Application Development of Blockchain-based Games.",
                    "Deep Learning for IoT.",
                    "Design Alternatives for Performance Monitoring Counter based Malware Detection.",
                    "REPROOF: Quantifying the Jam Resistance of REBUF.",
                    "Spatio-Temporal Data Mining for Aviation Delay Prediction.",
                    "Paradox of AlphaZero: Strategic vs. Optimal Plays.",
                    "BonnMotion 4 - Taking Mobility Generation to the Next Level.",
                    "On Machine Learning-based Stage-aware Performance Prediction of Spark Applications.",
                    "Discussion on Application of the Internet of Things in Modern Agricultural Experimental Base.",
                    "Performance and Consistency Analysis for Distributed Deep Learning Applications.",
                    "Edge Computing Based Privacy-Preserving Data Aggregation Scheme in Smart Grid.",
                    "Open Framework of Gateway Monitoring System for Internet of Things in Edge Computing.",
                    "When is Enough Enough? \"Just Enough\" Decision Making with Recurrent Neural Networks for Radio Frequency Machine Learning.",
                    "Lifecycle Management Protocols for Batteryless, Intermittent Sensor Nodes.",
                    "Policy Units and Categories: Networking Models for Simplifying Security Policy Management.",
                    "Research on Security Estimation and Control of Cyber-Physical System.",
                    "SEGIVE: A Practical Framework of Secure GPU Execution in Virtualization Environment."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "38th IPCCC 2019",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2019",
                "sub_name": "38th IEEE International Performance Computing and Communications Conference, IPCCC 2019, London, United Kingdom, October 29-31, 2019.",
                "count": 64,
                "papers": [
                    "reZig: Decompose a Collision via Reference Waveform in ZigBee.",
                    "Developing the Parallelization Methods for Finding the All-Pairs Shortest Paths in Distributed Memory Architecture.",
                    "A Byte-level CNN Method to Detect DNS Tunnels.",
                    "Data Heat Prediction in Storage Systems Using Behavior Specific Prediction Models.",
                    "Mining Cross-platform User Behaviors for Demographic Attribute Inference.",
                    "Autonomous Detection of Synchronization Attacks in the Industrial Internet Of Things.",
                    "Malicious Domain Detection via Domain Relationship and Graph Models.",
                    "Query optimization Approach with Shuffle Intermediate Cache Layer for Spark SQL.",
                    "Using DCT-based Approximate Communication to Improve MPI Performance in Parallel Clusters.",
                    "I Know What You Are Doing With Remote Desktop.",
                    "Quantitative Analysis of Mobile Application User Interface Design.",
                    "Intelligent IoT Sensing System Based on Compressive Sensing with Adaptively Learned Dictionary.",
                    "ATuMm: Auto-tuning Memory Manager in Apache Spark.",
                    "On Effects of Mobility Management Signalling Based DoS Attacks Against LTE Terminals.",
                    "Scheduling Dependent Tasks in Edge Networks.",
                    "A Deep Learning Approach to Dynamic Passive RTT Prediction Model for TCP.",
                    "Reliability, timeliness and load reduction at the edge for cloud gaming.",
                    "Energy and Delay Co-aware Computation Offloading with Deep Learning in Fog Computing Networks.",
                    "Contract-connection: An efficient communication protocol for Distributed Ledger Technology.",
                    "CLR: A Classification of DNS Tunnel Based on Logistic Regression.",
                    "A New C&C Channel Detection Framework Using Heuristic Rule and Transfer Learning.",
                    "Exploiting Social Network Characteristics for Efficient Routing in Ocean Vessel Ad Hoc Networks.",
                    "Efficient Attack Correlation and Identification of Attack Scenarios based on Network-Motifs.",
                    "High-Precision Adaptive Slope Compensation Circuit for System-on-Chip Power Management.",
                    "VoteGeo: An IoT-based Voting Approach to Verify the Geographic Location of Cloud Hosts.",
                    "Integration of Temporal Contextual Information for Robust Energy Disaggregation.",
                    "Topology-aware Sparse Allreduce for Large-scale Deep Learning.",
                    "Accelerating QUIC's Connection Establishment on High-Latency Access Networks.",
                    "An Efficient Greybox Fuzzing Scheme for Linux-based IoT Programs Through Binary Static Analysis.",
                    "piFogBed: A Fog Computing Testbed Based on Raspberry Pi.",
                    "IoT meets distributed AI - Deployment scenarios of Bonseyes AI applications on FIWARE.",
                    "Emulate Processing of Assorted Database Server Applications on Flash-Based Storage in Datacenter Infrastructures.",
                    "LT Codes with Feedback: Accelerate the Distributed Matrix-Vector Multiplication with Stragglers.",
                    "VPGA: An SDN-based Location Privacy Zones Placement Scheme for Vehicular Networks.",
                    "QuickR: A Novel Routing Strategy for Wireless Mobile Information-centric Networks.",
                    "F2MC: Enhancing Data Storage Services with Fog-toMultiCloud Hybrid Computing.",
                    "Mimic: Fast Recovery from Data Corruption Errors in Stencil Computations.",
                    "Deanonymizing Tor in a Stealthy Way.",
                    "Adaptive Differentially Private Data Stream Publishing in Spatio-temporal Monitoring of IoT.",
                    "A C++ Library for Tensor Decomposition.",
                    "Towards Industrial IoT-AR Systems using Deep Learning-Based Object Pose Estimation.",
                    "A Blockchain-Based Authentication Method with One-Time Password.",
                    "HS-TCN: A Semi-supervised Hierarchical Stacking Temporal Convolutional Network for Anomaly Detection in IoT.",
                    "A Stochastic based Physical Layer Security in Cognitive Radio Networks: Cognitive Relay to Fusion Center.",
                    "Improving Latency and Jitter Performance in CDMA-Based Next-Generation Ethernet Passive Optical Networks for 5G Applications.",
                    "Cost Efficient Internet Path Tracking Based on Routing Changes Prediction.",
                    "Uncovering Flaming Events on News Media in Social Media.",
                    "GPUs Cache Performance Estimation using Reuse Distance Analysis.",
                    "ALEAP: Attention-based LSTM with Event Embedding for Attack Projection.",
                    "Rendering Scheduling Framework in Edge Computing: A Congestion Game-based Approach.",
                    "Typification of Impersonated Accounts on Instagram.",
                    "Cooperative Fair Bandwidth Scaling in Contention-based Wireless Networks using Time Token Bucket.",
                    "CAN't - An ISOBUS Privacy Proxy for Collaborative Smart Farming.",
                    "Exploiting Temperature-Varied ECU Fingerprints for Source Identification in In-vehicle Network Intrusion Detection.",
                    "Placement optimization of IoT security solutions for edge computing based on graph theory.",
                    "A Method Based on Hierarchical Spatiotemporal Features for Trojan Traffic Detection.",
                    "Sphinx: A Transport Protocol for High-Speed and Lossy Mobile Networks.",
                    "Jily: Cost-Aware AutoScaling of Heterogeneous GPU for DNN Inference in Public Cloud.",
                    "A Comprehensive Study of Accelerating IPv6 Deployment.",
                    "Identify OS from encrypted traffic with TCP/IP stack fingerprinting.",
                    "Automatic Data Quality Enhancement with Expert Knowledge for Mobile Crowdsensing.",
                    "An Almost-zero Latency Lightweight Mechanism for Caching Decision in ICN Content Router.",
                    "Side-Channel Information Leakage of Traffic Data in Instant Messaging.",
                    "Hiding and Trapping: A Deceptive Approach for Defending against Network Reconnaissance with Software-Defined Network."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "37th IPCCC 2018",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2018",
                "sub_name": "37th IEEE International Performance Computing and Communications Conference, IPCCC 2018, Orlando, FL, USA, November 17-19, 2018.",
                "count": 88,
                "papers": [
                    "3D-PIM NoCs with Multiple Subnetworks: A Performance and Power Evaluation.",
                    "The Frame Latency of Personalized Livestreaming Can Be Significantly Slowed Down by WiFi.",
                    "A Road-Aware Spatial Mapping for Moving Objects.",
                    "Integrated Bandwidth Variation Pattern Differentiation for HTTP Adaptive Streaming over 4G Cellular Networks.",
                    "Crail-KV: A High-Performance Distributed Key-Value Store Leveraging Native KV-SSDs over NVMe-oF.",
                    "AutoRARE: An Automated Tool For Generating FPGA-Based Multi-Memory Hardware Accelerators For Compute-Intensive Applications.",
                    "ThinDedup: An I/O Deduplication Scheme that Minimizes Efficiency Loss due to Metadata Writes.",
                    "Adaptive Video Encoding and Dynamic Channel Access for Real-time Streaming over SDRs.",
                    "Performance and Stability of Application Placement in Mobile Edge Computing System.",
                    "BFRP: Endpoint Congestion Avoidance Through Bilateral Flow Reservation.",
                    "A Cache Based DoS Attack on Real Information Centric Networking System.",
                    "Vehicle Delay-tolerant Network Routing Algorithm based on Multi-period Bayesian Network.",
                    "Participant Grouping for Privacy Preservation in Mobile Crowdsensing over Hierarchical Edge Clouds.",
                    "Implementing Correct and Efficient Collision Avoidance in Multi-Hop Ad-Hoc Networks.",
                    "Choosing the Best Server for a Data Center: The Importance of Workload Weighting.",
                    "Socialite: Social Activity Mining and Friend Auto-labeling.",
                    "S5: An Application Sensitive QoS Assurance System via SDN.",
                    "Web Tracking Cartography with DNS Records.",
                    "Privacy Preserving Online Social Networks using Enhanced Equicardinal Clustering.",
                    "Cloud Resource Provisioning for Combined Stream and Batch Workflows.",
                    "iPand: Accurate Gesture Input with Ambient Acoustic Sensing on Hand.",
                    "A Game-theoretic Framework for Revenue Sharing in Edge-Cloud Computing System.",
                    "Reliability and Performance Analysis of a Data Center's Network Architecture.",
                    "Robust and Unsupervised KPI Anomaly Detection Based on Conditional Variational Autoencoder.",
                    "An Effective Scheme to Utilize Caches for Streaming Services in Mobile CCN.",
                    "Towards Optimized Online Task Allocation in Cost-Sensitive Crowdsensing Applications.",
                    "An Optimal LTE-U Access Method for Throughput Maximization and Fairness Assurance.",
                    "On the Impact of Sweep Radius and Energy Limitation on Sweep Coverage in Wireless Sensor Networks.",
                    "Where You Really Are: User Trip Based City Functional Zone Ascertainment.",
                    "EasyOrchestrator: A NFV-based Network Service Creation Platform for End-users.",
                    "Dynamic Reservation and Deep Reinforcement Learning based Autonomous Resource Management for wireless Virtual Networks.",
                    "CODA: Achieving Multipath Data Transmission in NDN.",
                    "An Efficient Latch-free Database Index Based on Multi-dimensional Lists.",
                    "A More Scalable Scheduling Algorithm for FPGA-based Time-Triggered Network.",
                    "Fully Dynamic Broadcasting under SINR.",
                    "A Novel Intrusion Detection Algorithm for Industrial Control Systems Based on CNN and Process State Transition.",
                    "Binoclt: A New Binomial Classification Scheme for Long-Text Mining in Online Social Network.",
                    "A Case-Based Decision System for Routing in Packet-Switched Networks.",
                    "GD-FTL: Improving the Performance and Lifetime of TLC SSD by Downgrading Worn-out Blocks.",
                    "Fountain Code Enabled ADS-B for Aviation Security and Safety Enhancement.",
                    "A graph neural network based efficient firmware information extraction method for IoT devices.",
                    "When Group Buying Meets Wi-Fi Advertising.",
                    "DeepSDN: Connecting the Dots Towards Self-driving Networks.",
                    "Privacy-Preserving ECG based Active Authentication (PPEA2) for IoT Devices.",
                    "Peer Data Caching Algorithms in Large-Scale High-Mobility Pervasive Edge Computing Environments.",
                    "How to Set Timeout: Achieving Adaptive Load Balance in Asymmetric Topology Based on Flowlet Switching.",
                    "Centralized In-network Caching for Information Centric Networking with Decoupling Data and Control Planes.",
                    "Location-leaking through Network Traffic in Mobile Augmented Reality Applications.",
                    "Real-time Distributed-Random-Forest-Based Network Intrusion Detection System Using Apache Spark.",
                    "Intelligent Optimization-Based Energy-Efficient Networking in Cloud Services for Multimedia Big Data.",
                    "Utility-based Allocation of Industrial IoT Applications in Mobile Edge Clouds.",
                    "Forwarding and Optical Indices in an All-Optical BCube Networks.",
                    "OC-Cache: An Open-channel SSD Based Cache for Multi-Tenant Systems.",
                    "FacGraph: Frequent Anomaly Correlation Graph Mining for Root Cause Diagnose in Micro-Service Architecture.",
                    "Reversible Programming Techniques for Shortest-Path Algorithms.",
                    "URefFlow: A Unified Android Malware Detection Model Based on Reflective Calls.",
                    "Oceanic Data Processing System Based on Multi-sensor Interaction through Internet of Things.",
                    "GAC: Gain-Aware 2-Round Cooperative Caching Approach in Information-Centric Networking.",
                    "2-Dominant Resource Fairness: Fairness-Efficiency Tradeoffs in Multi-resource Allocation.",
                    "A New Game Theoretic Scheme for Verifiable Cloud Computing.",
                    "UAV-enabled Data Gathering in Wireless Sensor Networks.",
                    "QoS-Aware Matching of Edge Computing Services to Internet of Things.",
                    "HyperProtect: Enhancing the Performance of a Dynamic Backup System Using Intelligent Scheduling.",
                    "Friendly-Jamming-Aware Routing Protocols for Tactical Networks.",
                    "Learning-based Cooperative Sound Event Detection with Edge Computing.",
                    "Stride: Distributed Video Transcoding in Spark.",
                    "Privacy Leakage in Smart Homes and Its Mitigation: IFTTT as a Case Study.",
                    "Cost Effective test-bed for Comparison of SDN Network and Traditional Network.",
                    "CoDE: Fast Name Lookup and Update using Conflict-driven Encoding.",
                    "Discover and Secure (DaS): An Automated Virtual Machine Security Management Framework.",
                    "A Fast Secure Outsourcing of Ridge Regression Based on Singular-Value Decomposition.",
                    "Decouple and Stretch: A Boost to Channel Pruning.",
                    "Classifying User Activities in the Encrypted WeChat Traffic.",
                    "Data Exchange in Delay Tolerant Networks using Joint Inter- and Intra-Flow Network Coding.",
                    "On the Use of Q-Learning to Solve the Selectable Virtual Network Embedding Problem.",
                    "Towards Incentive Mechanism for Taxi Services Allocation with Privacy Guarantee.",
                    "A Deep Learning Based Framework for Cloud Masquerade Attack Detection.",
                    "Efficient Allocation and Heterogeneous Composition of NVM Crossbar Arrays for Deep Learning Acceleration.",
                    "Availability-Aware Container Scheduler for Application Services in Cloud.",
                    "Quality-Aware Task Assignment in Opportunistic Network-Based Crowdsourcing.",
                    "Imaging Subsurface Civil Infrastructure with Smart Seismic Network.",
                    "Rapid Deployment of Anomaly Detection Models for Large Number of Emerging KPI Streams.",
                    "U-PoT: A Honeypot Framework for UPnP-Based IoT Devices.",
                    "Network Embedding based on External Word Vectors.",
                    "A Cost-effective and Energy-efficient Architecture for Die-stacked DRAM/NVM Memory Systems.",
                    "Budget-feasible User Recruitment in Mobile Crowdsensing with User Mobility Prediction.",
                    "Software Rejuvenation in Computer Systems: An Automatic Forecasting Approach Based on Time Series.",
                    "A Novel Method to Generate Frequent Itemsets in Distributed Environment."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "36th IPCCC 2017",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2017",
                "sub_name": "36th IEEE International Performance Computing and Communications Conference, IPCCC 2017, San Diego, CA, USA, December 10-12, 2017.",
                "count": 77,
                "papers": [
                    "Robust and lightweight fault localization.",
                    "When QUIC meets TCP: An experimental study.",
                    "Scheduling loop-free updates for multiple policies with overlaps in software-defined networks.",
                    "H-NVMe: A hybrid framework of NVMe-based storage system in cloud computing environment.",
                    "Link-based fine granularity flow migration in SDNs to reduce packet loss.",
                    "AutoTiering: Automatic data placement manager in multi-tier all-flash datacenter.",
                    "Towards location-aware joint job and data assignment in cloud data centers with NVM.",
                    "START: Sensible traffic scheduling in dynamic data center networks.",
                    "Resource optimization for survivable embedding of virtual clusters in cloud data centers.",
                    "Elastic scaling of virtual clusters in cloud data center networks.",
                    "Spatio-temporal event detection and reporting in mobile-sink wireless sensors networks.",
                    "Can MPTCP increase system efficiency and fairness in 802.11 multirate WLAN environment?",
                    "Avoiding interference from hidden terminals with carrier tones.",
                    "Minimal road-side unit placement for delay-bounded applications in bus Ad-hoc networks.",
                    "Time-based persistence in channel-access protocols with carrier sensing.",
                    "Integrated recovery and task allocation for stream processing.",
                    "Optimizing locality in graph computations using reuse distance profiles.",
                    "Does the content defined chunking really solve the local boundary shift problem?",
                    "On minimizing the maximum sensor movement to construct a horizontal barrier.",
                    "Robust passive static human detection with commodity WiFi devices.",
                    "Mitigating cloud co-resident attacks via grouping-based virtual machine placement strategy.",
                    "A privacy-preserving combinatorial auction mechanism for spectrum redistribution.",
                    "Identifying malware with HTTP content type inconsistency via header-payload comparison.",
                    "Revisiting inter-AS IP spoofing let the protection drive source address validation.",
                    "Cookie-based amplification repression protocol.",
                    "Popularity-based neighborhood collaborative caching for information-centric networks.",
                    "Using entanglements to increase the reliability of two-dimensional square RAID arrays.",
                    "Joint source selection and transfer optimization for erasure coding storage system.",
                    "A DAX-enabled mmap mechanism for log-structured in-memory file systems.",
                    "Secure processing-aware media storage (SPMS).",
                    "A truthful auction mechanism for resource provisioning in mobile crowdsensing.",
                    "iSense: Energy-aware crowd-sensing framework.",
                    "Fault tolerant mechanism design for time coverage in crowdsensing system.",
                    "Towards cost-effective and budget-balanced task allocation in crowdsourcing systems.",
                    "Approach to detect non-adversarial overlapping collusion in crowdsourcing.",
                    "Analyzing and optimizing BGP stability in future space-based internet.",
                    "TCP WISE: One initial congestion window is not enough.",
                    "Scalability comparison of SDN control plane architectures based on simulations.",
                    "Anonymous and analysable web browsing.",
                    "Metrie learning with statistical features for network traffic classification.",
                    "Performance enhancement of a computational persistent homology package.",
                    "Response time speedup of multi-tier internet systems.",
                    "QoE-aware optimization for SVC-based adaptive streaming in D2D communications.",
                    "A hierarchical-learning-based crowdedness estimation mechanism for crowdsensing buses.",
                    "Improving 3D lattice boltzmann method stencil with asynchronous transfers on many-core processors.",
                    "Laro: Lazy repartitioning for graph workloads on heterogeneous clusters.",
                    "DRAPS: Dynamic and resource-aware placement scheme for docker containers in a heterogeneous cluster.",
                    "Mitigate data skew caused stragglers through ImKP partition in MapReduce.",
                    "Efficient tamper-evident logging of distributed systems via concurrent authenticated tree.",
                    "Towards a holistic and optimized framework for smart grid regulation.",
                    "IHB: A scalable and efficient scheme to identify homologous binaries in IoT firmwares.",
                    "Auto-identification of background traffic based on autonomous periodic interaction.",
                    "An energy-aware collaborative multi-agent system for autonomous underwater vehicles.",
                    "A strategy-proof privacy-preserving double auction mechanism for electrical vehicles demand response in microgrids.",
                    "Profit maximization resource allocation in cloud computing with performance guarantee.",
                    "Reducing idle listening time in 802.11 via NDN.",
                    "Fault-tolerant 3D mesh for network-on-chip.",
                    "Motif: A social reading platform that helps people filter, memorize, and organize online contents.",
                    "An update-overhead-aware caching policy for write-optimized file systems on SMR disks.",
                    "Two-level decomposition for multi-commodity multicast traffic engineering.",
                    "Bandwidth preemption for data transfer request with higher priority.",
                    "Secure the internet of things with challenge response authentication in fog computing.",
                    "Balancing interdependent networks: Theory and algorithm.",
                    "Many-objective performance enhancement in computing clusters.",
                    "Unsupervised machine learning in 5G networks for low latency communications.",
                    "Enhancing SSDs with multi-stream: What? why? how?",
                    "Probabilistic Monte Carlo simulations for static branch prediction.",
                    "An efficient and secure scheme for smart home communication using identity-based signcryption.",
                    "Cyber-physical system enabled nearby traffic flow modelling for autonomous vehicles.",
                    "The VLSI architecture of a highly efficient configurable pre-processor for MIMO detections.",
                    "Resource consumption analysis of online activity recognition on mobile phones and smartwatches.",
                    "Towards truthful auction for big data trading.",
                    "Towards scalable and adaptable security monitoring.",
                    "Message content control for distributed map sharing in vehicle safety communications.",
                    "Biomedical signal transmission using human body communication.",
                    "Preserving privacy in distributed system (PPDS) protocol: Security analysis.",
                    "Modeling for performance and security balanced trading communication systems in the cloud."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "35th IPCCC 2016",
        "info": "Las Vegas, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2016",
                "sub_name": "35th IEEE International Performance Computing and Communications Conference, IPCCC 2016, Las Vegas, NV, USA, December 9-11, 2016.",
                "count": 73,
                "papers": [
                    "Fifth generation (5G) cellular wireless: Vision, goals, and challenges.",
                    "Building an IEEE 802.15.4e TSCH network.",
                    "User behavior-aware channel allocation scheme for mobile ad hoc networks.",
                    "Using context switches for VM scaling.",
                    "Bandwidth scheduling with multiple variable node-disjoint paths in high-performance networks.",
                    "KOVA : A tool for kernel visualization and analysis.",
                    "A secure framework for mHealth data analytics with visualization.",
                    "Holistic data centres: Next generation data and thermal energy infrastructures.",
                    "Towards designing and implementing a secure one time password (OTP) authentication system.",
                    "Middleware to support cyber-physical systems.",
                    "Estimating clustering coefficients via metropolis-hastings random walk and wedge sampling on large OSN graphs.",
                    "Improving disk array reliability through faster repairs (Extended abstract).",
                    "Performance prediction techniques for scalable large data processing in distributed MPI systems.",
                    "PETS: Performance, energy and thermal aware scheduler for job mapping with resource allocation in heterogeneous systems.",
                    "Thwart eavesdropping attacks on network communication based on moving target defense.",
                    "Towards a first-reflection ultrasonic sensor array for compensatory movement identification in stroke sufferers.",
                    "Polarized beamforming for enhanced countermeasure of wireless jamming attacks.",
                    "Mining causality graph for automatic web-based service diagnosis.",
                    "The analysis of service extensibility in extensible network service model.",
                    "A hybrid asymmetric traffic classifier for deep packet inspection systems with route asymmetry.",
                    "Towards variable length addressing for scalable Internet routing.",
                    "Benchmarking ISPs in New Zealand.",
                    "A cognitive radio approach for data collection in border surveillance.",
                    "Event-based clustering for composite event detection in wireless sensors networks.",
                    "High performance mass configuration protocols for MANETs using efficient broadcasting.",
                    "Towards energy efficiency in ultra dense networks.",
                    "A dynamic bandwidth pricing mechanism based on trust management in P2P streaming systems.",
                    "Detecting and defending against inter-app permission leaks in android apps.",
                    "CrashFuzzer: Detecting input processing related crash bugs in android applications.",
                    "Optimizing content delivery in ICN networks by the supply chain model.",
                    "Failure recovery using vlan-tag in SDN: High speed with low memory requirement.",
                    "Quantifying entity criticality for fault impact analysis and dependability enhancement in software-defined networks.",
                    "Selecting resources for distributed dataflow systems according to runtime targets.",
                    "On query-adaptive online partitioning: A study of evolutionary algorithms.",
                    "Distributed dynamic MCU for video conferencing in peer-to-peer network.",
                    "A pipelined market data processing architecture to overcome financial data dependency.",
                    "Unified power and energy measurement API for HPC co-processors.",
                    "Mo-sleep: Unobtrusive sleep and movement monitoring via Wi-Fi signal.",
                    "On-demand efficient polling for nanonetworks under dynamic IoT backhaul network conditions.",
                    "An energy-efficient handover algorithm for wireless sensor networks.",
                    "Path planning of mobile sinks in charge of data gathering: A coalitional game theory approach.",
                    "A reuse distance based performance analysis on GPU L1 data cache.",
                    "Sets, lists and trees: Distributed data structures on distributed hash tables.",
                    "An imbalanced data classification method based on automatic clustering under-sampling.",
                    "Minimizing intra-flow interference in multi-channel mesh networks: An optimization approach.",
                    "A secure routing algorithm based on nodes behavior during spectrum sensing in cognitive radio networks.",
                    "Towards an extensive map-oriented trace basis for human mobility modeling.",
                    "Cache locking vs. partitioning for real-time computing on integrated CPU-GPU processors.",
                    "High performance computing on SpiNNaker neuromorphic platform: A case study for energy efficient image processing.",
                    "Optimized GPU implementation for dynamic programming in image data processing.",
                    "Energy-efficient task scheduling for DVFS-enabled heterogeneous computing systems using a linear programming approach.",
                    "eSplash: Efficient speculation in large scale heterogeneous computing systems.",
                    "Montgolfier: Latency-aware power management system for heterogeneous servers.",
                    "Understanding performance of I/O intensive containerized applications for NVMe SSDs.",
                    "Simple data entanglement layouts with high reliability.",
                    "Time synchronization mechanisms for an optically groomed data center network.",
                    "A secure data allocation solution for heterogeneous Hadoop systems: SecHDFS.",
                    "A flexible and scalable implementation of elliptic curve cryptography over GF(p) based on ASIP.",
                    "A support vector machine based naive Bayes algorithm for spam filtering.",
                    "User authentication and identification on smartphones by incorporating capacitive touchscreen.",
                    "Data integrity attacks against the distributed real-time pricing in the smart grid.",
                    "GReM: Dynamic SSD resource allocation in virtualized storage systems with heterogeneous IO workloads.",
                    "Small cache lookaside table for fast DRAM cache access.",
                    "LAMS: A latency-aware memory scheduling policy for modern DRAM systems.",
                    "LMStr: Local memory store the case for hardware controlled scratchpad memory for general purpose processors.",
                    "Enhanced PHY-layer security via co-channel underlays.",
                    "Can maturity models support cyber security?",
                    "AutoReplica: Automatic data replica manager in distributed caching and data processing systems.",
                    "Jamming mobility in 802.11p networks: Modeling, evaluation, and detection.",
                    "Reliability of cyber physical systems with focus on building management systems.",
                    "Dynamically reconfigurable AES cryptographic core for small, power limited mobile sensors.",
                    "Delay analysis of IEEE 802.11e EDCA with enhanced QoS for delay sensitive applications.",
                    "Optimal multicriteria RAT-selection decisions for multiple handoff calls in heterogeneous wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "34th IPCCC 2015",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2015",
                "sub_name": "34th IEEE International Performance Computing and Communications Conference, IPCCC 2015, Nanjing, China, December 14-16, 2015.",
                "count": 95,
                "papers": [
                    "Message from the IPCCC 2015 general chairs.",
                    "Message from the IPCCC 2015 technical program chairs.",
                    "An enhanced algorithm based on paths algebra strategy to solve the VNE problem.",
                    "A novel algorithm for pattern matching with back references.",
                    "Lifetime maximization in rechargeable wireless sensor networks with charging interference.",
                    "Privacy-preserving min and k-th min computations with fully homomorphic encryption.",
                    "SpeedStream: A real-time stream data processing platform in the cloud.",
                    "Efficient TV white space database construction via spectrum sensing and spatial inference.",
                    "Mining friendships through spatial-temporal features in mobile social networks.",
                    "Parallel and distributed normalization of security events for instant attack analysis.",
                    "Class-based delta-encoding for high-speed train data stream.",
                    "On the channel capacity of MIMO-radar-based communications.",
                    "Network coding based transmission schemes in DTNs with group meetings.",
                    "SDN-based TCP congestion control in data center networks.",
                    "Bandwidth guaranteed virtual network function placement and scaling in datacenter networks.",
                    "Dynamic flow consolidation for energy savings in green DCNs.",
                    "Towards shorter task completion time in datacenter networks.",
                    "OMO: Optimize MapReduce overlap with a good start (reduce) and a good finish (map).",
                    "Towards adaptive elastic distributed Software Defined Networking.",
                    "Pirogue, a lighter dynamic version of the Raft distributed consensus algorithm.",
                    "SkipMon: A locality-aware Collaborative Intrusion Detection System.",
                    "Decentralized multi-charger coordination for wireless rechargeable sensor networks.",
                    "Detect and analyze Large-scale BGP events by bi-clustering Update Visibility Matrix.",
                    "Building smartphone Ad-Hoc networks with long-range radios.",
                    "Scalable name-based inter-domain routing for information-centric networks.",
                    "RAPIT: RTT-Aware Pending Interest Table for Content Centric Networking.",
                    "Traffic-aware networking for video streaming service using SDN.",
                    "On stochastic optimal bidding strategy for microgrids.",
                    "Sensor placement based on Delaunay triangulation for complete confident information coverage in an area with obstacles.",
                    "Defending against Energy Dispatching Data integrity attacks in smart grid.",
                    "Power-free Structural Health Monitoring via compressive sensing.",
                    "Distributed load scheduling in smart community with capacity constrained local power supplier.",
                    "Performability analysis of a cloud system.",
                    "How green are cloud patterns?",
                    "Virtual machine placement based on the VM performance models in cloud.",
                    "Minimizing response latency via efficient virtual machine placement in cloud systems.",
                    "A customizable MapReduce framework for complex data-intensive workflows on GPUs.",
                    "Energy cost minimization via intelligent temporal and spatial resource allocation in green heterogeneous cellular networks.",
                    "Comparative analysis of big data transfer protocols in an international high-speed network.",
                    "Towards Controller Placement for robust Software-Defined Networks.",
                    "On secure shared key establishment for mobile devices using contextual information.",
                    "Charging your smartphones on public commuters via wireless energy transfer.",
                    "Efficient RSS measurement in wireless networks based on compressive sensing.",
                    "On the coexistence of 802.11 and 802.15.4 networks with delay constraints.",
                    "Stochastic duty cycling for heterogenous energy harvesting networks.",
                    "Traffic condition estimation using vehicular crowdsensing data.",
                    "On balancing the energy consumption of routing protocols for opportunistic social networks.",
                    "Adaptive partial frequency reuse in LTE-Advanced relay networks.",
                    "Optimum reference node deployment for indoor localization based on the average Mean Square Error minimization.",
                    "Network Performance Isolation Scheme for QoE in a mobile device.",
                    "Network intrusion detection and prevention middlebox management in SDN.",
                    "PATHA: Performance Analysis Tool for HPC Applications.",
                    "Energy-efficient, Delay-aware packet scheduling in high-speed networks.",
                    "Spatio-temporal tensor completion for imputing missing internet traffic data.",
                    "ATLAS: An AdapTive faiLure-Aware Scheduler for Hadoop.",
                    "ScalaSEM: Scalable validation of SDN design with deployable code.",
                    "Narrowing down the debugging space of slow search response time.",
                    "Pricing and revenue sharing in secondary market of mobile internet access.",
                    "Incremental deployment for traffic engineering in hybrid SDN network.",
                    "Complete font generation of Chinese characters in personal handwriting style.",
                    "Learning thresholds for PV change detection from operators' labels.",
                    "Integrated caching and tiering according to use and QoS requirements.",
                    "PASSI: A Parallel, Reliable and Scalable Storage Software Infrastructure for active storage system and I/O environments.",
                    "P-CLS: A popularity-driven Caching Location and Searching scheme in Content Centric Networking.",
                    "WAlloc: An efficient wear-aware allocator for non-volatile main memory.",
                    "A goodput distribution model for IEEE 802.11 wireless mesh networks.",
                    "New tight upper bounds on the capacity for general deterministic dissemination in wireless ad hoc networks.",
                    "Reducing inter-task interference delay by optimizing bank-to-core mapping.",
                    "Optimization strategies for inter-thread synchronization overhead on NUMA machine.",
                    "Resilient and efficient communication in many-core systems using network coding.",
                    "A low-latency fine-grained dynamic shared cache management scheme for chip multi-processor.",
                    "How to protect query and report privacy without sacrificing service quality in participatory sensing.",
                    "A secure OFDM transmission scheme based on chaos mapping.",
                    "Exploring sensor usage behaviors of Android applications based on data flow analysis.",
                    "PROTA: A Privacy-pReserving prOtocol for real-time Targeted Advertising.",
                    "Self-adaptive anonymous communication scheme under SDN architecture.",
                    "Identify user variants based on user behavior on social media.",
                    "Privacy preserving big histogram aggregation for spatial crowdsensing.",
                    "Detecting BGP instability using Recurrence Quantification Analysis (RQA).",
                    "Replication attack detection with monitor nodes in clustered wireless sensor networks.",
                    "Ultra-lightweight deep packet anomaly detection for Internet of Things devices.",
                    "Fincher: Elephant flow scheduling based on stable matching in data center networks.",
                    "A non-orthogonal waveform superposition scheme for high efficient and reliable communications.",
                    "A domestic Adaptable Infant Monitoring System using wireless sensor networks.",
                    "Proactive Complex Event Processing for transportation Internet of Things.",
                    "An effective service discovery approach based on field theory and contribution degree in unstructured P2P networks.",
                    "Measuring the internet routing scalability from the perspective of address allocation.",
                    "Latency-aware routing with bandwidth assignment for Software Defined Networks.",
                    "An ASIP based physical layer virtualization method of centralized radio access network.",
                    "Blind identification of helical interleaving of the first type.",
                    "A dominating-set-based and popularity-driven caching scheme in edge CCN.",
                    "Characterizing I/O workloads of HPC applications through online analysis.",
                    "Reducing the read latency of in-line deduplication file system.",
                    "Minimizing energy cost for green cloud data centers by using ESDs.",
                    "R-PMD: robust passive motion detection using PHY information with MIMO."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "33rd IPCCC 2014",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2014",
                "sub_name": "IEEE 33rd International Performance Computing and Communications Conference, IPCCC 2014, Austin, TX, USA, December 5-7, 2014.",
                "count": 94,
                "papers": [
                    "Challenges and opportunities for analysis based research in big data.",
                    "Prediction and correction of traffic matrix in an IP backbone network.",
                    "Measuring path divergence in the Internet.",
                    "A flexible and scalable high-performance OpenFlow switch on heterogeneous SoC platforms.",
                    "Design and analysis of fault tolerance mechanism for sparrow.",
                    "Achieving transparent coexistence in a multi-hop secondary network through distributed computation.",
                    "Effects of quality of service schemes on the capacity and dimensioning of LTE networks.",
                    "Smoothly truncated levy walks: Toward a realistic mobility model.",
                    "Network agile preference-based prefetching for mobile devices.",
                    "Energy efficient distributed grouping and scaling for real-time data compression in sensor networks.",
                    "Proximity-driven social interactions and their impact on the throughput scaling of wireless networks.",
                    "Accurate statistical performance modeling and validation of out-of-order processors using Monte Carlo methods.",
                    "An efficient certificate revocation scheme for large-scale AMI networks.",
                    "TMODF: Trajectory-based multi-objective optimal data forwarding in vehicular networks.",
                    "A new multi-objective microgrid restoration via semidefinite programming.",
                    "QGrid: Q-learning based routing protocol for vehicular ad hoc networks.",
                    "A novel algorithm for sparse FFT pruning and its applications to OFDMA technology.",
                    "ZigBee vs WiFi: Understanding issues and measuring performances of their coexistence.",
                    "A domain-specific language to facilitate software defined radio parallel executable patterns deployment on heterogeneous architectures.",
                    "RainbowRate: MIMO rate adaptation in 802.11n WiLD links.",
                    "Automated estimation of power consumption for rapid system level design.",
                    "Performance and energy evaluation of RESTful web services in Raspberry Pi.",
                    "Analyzing I/O patterns for the design of energy-efficient image servers.",
                    "Joint power optimization through VM placement and flow scheduling in data centers.",
                    "ERUPT: Energy-efficient trustworthy provenance trees for wireless sensor networks.",
                    "An efficient spin-lock based multi-core resource sharing protocol.",
                    "Analysis of cache tuner architectural layouts for multicore embedded systems.",
                    "A novel thermal-constrained energy-aware partitioning algorithm for heterogeneous multiprocessor real-time systems.",
                    "WCET analysis of static NUCA caches.",
                    "Session-based access control in information-centric networks: Design and analyses.",
                    "A hybrid erasure-coded ECC scheme to improve performance and reliability of solid state drives.",
                    "Enhancing the I/O system for virtual machines using high performance SSDs.",
                    "Application-aware video-sharing services via provenance in cloud storage.",
                    "Replica placement in content delivery networks with stochastic demands and M/M/1 servers.",
                    "An efficient time-stamping solution for long-term digital archiving.",
                    "An encryption and probability based access control model for named data networking.",
                    "SLA aware cost efficient virtual machines placement in cloud computing.",
                    "Achieving bandwidth guarantees in multi-tenant cloud networks using a dual-hose model.",
                    "Online combinatorial double auction for mobile cloud computing markets.",
                    "A combinatorial double auction mechanism for cloud resource group-buying.",
                    "Virtual data center allocation with dynamic clustering in clouds.",
                    "Resisting label-neighborhood attacks in outsourced social networks.",
                    "Provenance logic: Enabling multi-event based trust in mobile sensing.",
                    "POLA: A privacy-preserving protocol for location-based real-time advertising.",
                    "Efficient and enhanced broadcast authentication protocols based on multilevel μTESLA.",
                    "Randomized routing in multi-party internet video conferencing.",
                    "ReMA: Real-time 3D video streaming system for mobile devices.",
                    "Pricing and revenue sharing mechanism for secondary redistribution of data service for mobile devices.",
                    "Distributed compressive data gathering in low duty cycled wireless sensor networks.",
                    "Hot topic analysis and content mining in social media.",
                    "Evaluation of a platform for the provisioning of community-contributed web services.",
                    "Patterns and modeling of group growth in online social networks.",
                    "Parallelization of tree-to-TLV serialization.",
                    "JLMC: A clustering method based on Jordan-Form of Laplacian-Matrix.",
                    "Delay-impact-based local deadline assignment for online scheduling of distributed soft real-time applications.",
                    "Maximizing system's total accrued utility value for parallel and time-sensitive applications.",
                    "Performance enhancement in shared-memory multiprocessors using dynamically classified sharing information.",
                    "GPU acceleration of finding LPRs in DNA sequence based on SUA index.",
                    "Data analytics workloads: Characterization and similarity analysis.",
                    "EPPI: An E-cent-based privacy-preserving incentive mechanism for participatory sensing systems.",
                    "Continuous user identification via touch and movement behavioral biometrics.",
                    "Secure data provenance compression using arithmetic coding in wireless sensor networks.",
                    "Virtual structures and heterogeneous nodes in dependency graphs for detecting metamorphic malware.",
                    "Let more nodes have a second choice.",
                    "File-system-level flash caching for improving application launch time on logical hybrid disks.",
                    "The automatic configuration of transmit power in LTE networks based on throughput estimation.",
                    "Low-latency last-level cache structure based on grouped cores in Chip Multi-Processor.",
                    "A knowledge management approach for testing open source software systems.",
                    "Financial fraud detection using social media crowdsourcing.",
                    "Test oriented formal model of SDN applications.",
                    "An extended contention period protocol for MIMO wireless networks.",
                    "A portable flood detection system using heterogeneous sensor networks.",
                    "A novel method to estimate performance for a high performance computation workload.",
                    "Design of antenna arrays for isoflux radiation in satellite systems.",
                    "Sensitivity analysis of availability of video streaming service in cloud computing.",
                    "A centralized latency optimization solution for tree-based application layer multicast.",
                    "Marbor: A novel large-scale graph data storage and processing framework.",
                    "Cloud-assisted dynamic spectrum access for VANET in transportation cyber-physical systems.",
                    "Embedded system based on microcontroller for generating I-V curves of electronic devices.",
                    "Characterizing the workload dynamics of a mobile phone network during the FIFA 2014 World Cup.",
                    "Reducing (m, k)-missing rate for overloaded real-time systems.",
                    "A hybrid link protection scheme for link-state routing networks.",
                    "Optimal phase control for joint transmission and reception with beamforming.",
                    "Load scheduling in smart buildings with bidirectional energy trading.",
                    "A heuristic for logical data buffer allocation in multicore platforms.",
                    "A light-weight authentication scheme based on message digest and location for mobile cloud computing.",
                    "Shaping HTTP adaptive streams using receive window tuning method in home gateway.",
                    "Combinatorial JPT based on orthogonal beamforming for two-cell cooperation.",
                    "Worst-case performance guaranteed data cache.",
                    "Thread mapping using system-level throughput prediction model for shared memory multicores.",
                    "Empirical capacity modeling and evaluation of delay tolerant network routing protocols.",
                    "A modified max-min ant colony optimization algorithm for virtual machines replacement in cloud datacenter§.",
                    "A promising CUDA-accelerated vehicular area network simulator using NS-3.",
                    "Blackbox security evaluation of chromecast network communications."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "32nd IPCCC 2013",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2013",
                "sub_name": "IEEE 32nd International Performance Computing and Communications Conference, IPCCC 2013, San Diego, CA, USA, December 6-8, 2013.",
                "count": 48,
                "papers": [
                    "Performance analysis of a fault-tolerant exact motif mining algorithm on the cloud.",
                    "Message from the IPCCC 2013 technical program chairs.",
                    "Message from the IPCCC 2013 general chairs.",
                    "Queue reorganization for subscription congestion avoidance in publish/subscribe systems.",
                    "A2E: Adaptively aggressive energy efficient DVFS scheduling for data intensive applications.",
                    "Expander code: A scalable erasure-resilient code to keep up with data growth in distributed storage.",
                    "Improved kernel security through memory layout randomization.",
                    "Using intelligent prefetching to reduce the energy consumption of a large-scale storage system.",
                    "Reducing worst-case execution time of hybrid SPM-caches.",
                    "Providing diagnostic network feedback to end users on smartphones.",
                    "Exploit real-time fine-grained access patterns to partition write buffer to improve SSD performance and life-span.",
                    "OPS/OBS scheduling algorithms: Incorporating a wavelength conversion cost in the performance analysis.",
                    "Reliable and efficient routing protocol for graph theory based communication topology.",
                    "Distributed protocol for channel assignment in cognitive wireless sensor networks.",
                    "CSIR: Cellular scheduling with Interest-driven Routing.",
                    "A novel multi-radio MAC protocol based union mechanism in wireless sensor networks.",
                    "Minimizing routing overhead with Two-Hop Coordinate Awareness in ad hoc networks.",
                    "Automatic incremental routing using multiple roots.",
                    "Rumor restriction in Online Social Networks.",
                    "Session lengths and IP address usage of smartphones in a university campus WiFi network: Characterization and analytical models.",
                    "Location matters: Eliciting responses to direct probes.",
                    "Multi-keyword ranked search supporting synonym query over encrypted data in cloud computing.",
                    "Message digest as authentication entity for mobile cloud computing.",
                    "Scalable load balancing for mapreduce-based record linkage.",
                    "Modeling and analysis of resources availability in volunteer computing systems.",
                    "Impact of sampling design in estimation of graph characteristics.",
                    "Evaluating the performance and energy efficiency of n-body codes on multi-core CPUs and GPUs.",
                    "Extending ODMRP for on-site deployments in disaster area scenarios.",
                    "A comparison of IP header compression schemes in MANETs.",
                    "Minimum-sized Positive Influential Node Set selection for social networks: Considering both positive and negative influences.",
                    "Prediction-based routing with packet scheduling under temporal constraint in delay tolerant networks.",
                    "SEBAR: Social Energy Based Routing scheme for mobile social Delay Tolerant Networks.",
                    "Automated controllers for bandwidth allocation in network virtualization.",
                    "A hybrid GPU/CPU FFT library for large FFT problems.",
                    "Sizing router buffer for the Internet with heterogeneous TCP.",
                    "On a generalized approach to order-independent image composition in parallel visualization.",
                    "Optimization for reliable erasure-coded storage allocation under multiple constraints.",
                    "Proposed enhancements to fixed segmented LRU cache replacement policy.",
                    "Magnetic field modeling-based energy efficient routing in wireless sensor networks.",
                    "Predicting DNS Server Load Distribution.",
                    "A lightweight solution to remote DNS.",
                    "Defend GPUs against DoS attacks.",
                    "The impact of interference from a covert link on a data link using OFDM, AMC, and hybrid ARQ.",
                    "Trustworthy data management for wireless networks in Cyber-Physical Systems.",
                    "Energy-aware image allocation for distributed video processing on handheld devices.",
                    "Backpressure routing for the backhaul in sparse small cell deployments.",
                    "Secure user authentication in cloud computing management interfaces.",
                    "Enhanced infrastructure security through inter-level anomaly detection."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "31st IPCCC 2012",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2012",
                "sub_name": "31st IEEE International Performance Computing and Communications Conference, IPCCC 2012, Austin, TX, USA, December 1-3, 2012.",
                "count": 62,
                "papers": [
                    "A double-edged sword: Implications of crowdsourcing for the future of web security.",
                    "Improving performance and anonymity in the Tor network.",
                    "Temporal characterization of SPEC CPU2006 workloads: Analysis and synthesis.",
                    "Performance-sensitivity and performance-similarity based workload reduction.",
                    "Thermal modeling and analysis of storage systems.",
                    "Improving schedulability and energy performance for weakly hard real-time systems.",
                    "An adaptive power management framework for autonomic resource configuration in cloud computing infrastructures.",
                    "CloudCast: Cloud computing for short-term mobile weather forecasts.",
                    "AFD: Adaptive failure detection system for cloud computing infrastructures.",
                    "ORCA: An offloading framework for I/O-intensive applications on clusters.",
                    "MODESA: An optimized multichannel slot assignment for raw data convergecast in wireless sensor networks.",
                    "An arbitrary mobility model of Mini-Sinks using controlled data collection for reducing congestion appearance in wireless sensor networks.",
                    "Fast sink placement for Gossip-based Wireless Sensor Networks.",
                    "A Desktop Grid enabled parallel Barnes-Hut algorithm.",
                    "Improved deduplication through parallel Binning.",
                    "CAST: A page-level FTL with compact address mapping and parallel data blocks.",
                    "A system analysis of reputation-base defences against pollution attacks in P2P streaming.",
                    "HAS: Hidden anti-theft system based on wireless sensor networks.",
                    "HADEGA: A novel MPLS-based mitigation solution to handle network attacks.",
                    "Exploring the optimal strategy for large-scale data movement in high-performance networks.",
                    "PHY and MAC layer design of Hybrid Spread Spectrum based smart meter network.",
                    "Complex networks clustering algorithm based on the core influence of the nodes.",
                    "Static micro-scheduling: Resource contention relief in multithreaded programs.",
                    "Co-efficient vector based distributed quasi-orthogonal codes in cooperative networks.",
                    "Hierarchical MATE's approach for dynamic performance tuning of large-scale parallel applications.",
                    "Network state aware virtual network parallel embedding.",
                    "A methodology for implementation and integration Two-Factor Authentication into VPN.",
                    "Sensor allocation to multiple applications in shared wireless sensor networks.",
                    "Fixed Segmented LRU cache replacement scheme with selective caching.",
                    "Make systematic conformance testing for BitTorrent protocol feasible: A CP-nets model based testing approach.",
                    "AES decryption using warp-synchronous programming.",
                    "Firefly-inspired synchronization for energy-efficient distance estimation in mobile ad-hoc networks.",
                    "A wireless system for reducing response time in Urban Search & Rescue.",
                    "CAIRN: Creating Anchors for Localization in Realistic Networks.",
                    "Graph theoretic expansion of Borei Cayley Graphs with an optimal and distributed routing algorithm.",
                    "HERO: Heterogeneity-aware erasure coded redundancy optimal allocation for reliable storage in distributed networks.",
                    "A cost-effective scheduling algorithm for scientific workflows in clouds.",
                    "Improving write performance by enhancing internal parallelism of Solid State Drives.",
                    "Management of distributed resource allocations in multi-cluster environments.",
                    "A genetic algorithm based approach to maximizing real-time system value under resource constraints.",
                    "A taxonomy of Semi-FIFO policies.",
                    "Evolution of disconnected components in social networks: Patterns and a generative model.",
                    "Effect of MRAI timers and routing policies on BGP convergence times.",
                    "Highly reliable two-dimensional RAID arrays for archival storage.",
                    "Computing Nash equilibria in bimatrix games: GPU-based parallel support enumeration.",
                    "An efficient dynamic multiple-candidate motion vector approach for GPU-based hierarchical motion estimation.",
                    "Incentive based approach to find selfish nodes in Mobile P2P networks.",
                    "Bandwidth-aware peer selection for P2P live streaming systems under flash crowds.",
                    "Global workload characterization of a large scale satellite image distribution system.",
                    "Devising Secure Sockets Layer-based distributed systems: A performance-aware approach.",
                    "LBSs privacy preserving for continuous query based on semi-honest third parties.",
                    "GeoCAPTCHA - A novel personalized CAPTCHA using geographic concept to defend against 3rd Party Human Attack.",
                    "Locating jamming attackers in malicious wireless sensor networks.",
                    "Secure multipath routing for AMI network in Smart Grid.",
                    "Parallelized benchmark-driven performance evaluation of SMPs and tiled multi-core architectures for embedded systems.",
                    "Performance impact of virtual machine placement in a datacenter.",
                    "Structured Message Transport.",
                    "PhoneCon: Voice-driven SmartPhone Controllable Wireless Sensor Networks.",
                    "Towards network convergence and traffic engineering optimization.",
                    "Channel impulse noise minimization using digital smear and desmear filter.",
                    "A path-transfer based multi-path reliable routing in wireless sensor networks.",
                    "Quality-of-information modeling and adapting for delay-sensitive sensor network applications."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "30th IPCCC 2011",
        "info": "Orlando, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2011",
                "sub_name": "30th IEEE International Performance Computing and Communications Conference, IPCCC 2011, Orlando, Florida, USA, November 17-19, 2011.",
                "count": 59,
                "papers": [
                    "Multi-rate adaptation with interference and congestion awareness.",
                    "Performance modelling of energy efficient wireless nodes.",
                    "JRCA: A joint routing and channel assignment scheme for wireless mesh networks.",
                    "ArA: Adaptive resource allocation for cloud computing environments under bursty workloads.",
                    "Macropower: A coarse-grain power profiling framework for energy-efficient cloud computing.",
                    "Enhancing I/O throughput via efficient routing and placement for large-scale parallel file systems.",
                    "A distributed workflow management system with case study of real-life scientific applications.",
                    "Minimum latency scheduling for Multi-Regional Query in Wireless Sensor Networks.",
                    "A simple myopic mobile sink strategy for wireless sensor networks.",
                    "Web-based heterogeneous WSN integration using pervasive communication.",
                    "An energy efficient and integrity-preserving aggregation protocol in wireless sensor networks.",
                    "Network coding in multicore processors.",
                    "Reliability analysis of an energy-aware RAID system.",
                    "Energy-efficient elastic scheduling in heterogeneous computing systems.",
                    "A subscription overlay network for large-scale and cost-efficient any source multicast.",
                    "Subnet level network topology mapping.",
                    "Using spikes to deal with elephants.",
                    "An efficient SVM-based method for multi-class network traffic classification.",
                    "Dynamic data allocation with replication in distributed systems.",
                    "Optimizing energy consumption under flow and stretch constraints.",
                    "Energy-aware dispatching in parallel queues with on-off energy consumption.",
                    "Using hidden convexity in structured communication problems.",
                    "Fuzzy-based adaptive cross layer routing protocol for mobile ad hoc networks.",
                    "Generalized broadcast scheduling in duty-cycle multi-hop wireless networks.",
                    "Cooperative optimal pricing for stochastic access control in heterogeneous wireless networks.",
                    "A case for packet deflection in structured wireless topologies.",
                    "How P2P live streaming systems scale quickly under a flash crowd?",
                    "Adaptive neighbor management for cooperative P2P video-on-demand streaming.",
                    "Can P2P help the cloud go green?",
                    "Fulfilling end-to-end latency constraints in large-scale streaming environments.",
                    "Joint routing, scheduling and channel assignment in multi-power multi-radio wireless sensor networks.",
                    "Integrated load balanced and energy aware routing in large scale wireless sensor networks.",
                    "Energy modeling and optimization through joint packet size analysis of BSN and WiFi networks.",
                    "Assessing the comparative effectiveness of map construction protocols in wireless sensor networks.",
                    "Making eclipse attacks computationally infeasible in large-scale DHTs.",
                    "Resource-misuse attack detection in delay-tolerant networks.",
                    "DoS resilience of real time streaming protocol.",
                    "Non-interactive OS fingerprinting through memory de-duplication technique in virtual machines.",
                    "Power and energy consumption analysis on intel SCC many-core system.",
                    "A SOA-based framework for cross-layer QoS adaptation in next generation networks.",
                    "QoS assurance in MANETs using flow aware admission control - Multipath protocol.",
                    "Evaluation of process level redundant checkpointing/restart for HPC systems.",
                    "GNAED: A data mining framework for network-wide abnormal event detection in backbone networks.",
                    "Underlay-robust application layer multicast.",
                    "VM clock synchronization measurements.",
                    "Adaptation-based programming for network protocol design: An 802.11x case study (abstract).",
                    "CUDA acceleration of P7Viterbi algorithm in HMMER 3.0.",
                    "Real time video QoE analysis of RTMP streams.",
                    "Mesh traversal and sorting for efficient memory usage in scientific codes.",
                    "A merge-and-split mechanism for dynamic virtual organization formation in grids.",
                    "Improving location privacy in mix-zones for VANETs.",
                    "The cost of location privacy in locator/identifier-split architectures.",
                    "Cryptanalysis and security enhancement of an advanced authentication scheme using smart cards, and a key agreement scheme for two-party communication.",
                    "Biased shortest path trees in wireless networks.",
                    "DAT: An AP scheduler using dynamically adjusted time windows for crowded WLANs.",
                    "Performance and power-consumption analysis of Mobile Internet Devices.",
                    "Best-effort authentication for opportunistic networks.",
                    "Design and implementation of data survival in unattended wireless sensor networks.",
                    "A reputation system for wireless mesh network using multi-path routing protocol."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "29th IPCCC 2010",
        "info": "Albuquerque, NM, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2010",
                "sub_name": "29th International Performance Computing and Communications Conference, IPCCC 2010, 9-11 December 2010, Albuquerque, NM, USA.",
                "count": 45,
                "papers": [
                    "From nowhere to somewhere: Protecting end-to-end location privacy in wireless sensor networks.",
                    "RAPiD: An indirect rogue access points detection system.",
                    "Towards dynamic self-tuning for intrusion detection systems.",
                    "Secure localization against wormhole attacks using conflicting sets.",
                    "Cognitive Multi-Radio Mesh Networks on ISM bands: A cross-layer architecture.",
                    "A non-uniform node deployment approach for event detection sensor networks.",
                    "EASARD: Towards an efficient Energy-Aware Service and Route Discovery scheme in MANET.",
                    "Incremental minimality: A property of optimal solutions for the minimum power broadcast tree problem in wireless ad hoc networks.",
                    "Sender - Receiver cooperation and buffer observation for fine-grained adaptive transmission of video over mobile ad hoc networks.",
                    "auto-AID: A data mining framework for autonomic anomaly identification in networked computer systems.",
                    "Evaluation of a scalable and distributed mobile device video recording approach for accessible presentations.",
                    "Reproducing non-deterministic bugs with lightweight recording in production environments.",
                    "Patient-centric hurricane evacuation management system.",
                    "Optimized information discovery using self-adapting indices over Distributed Hash Tables.",
                    "ARM: An asynchronous receiver-initiated multichannel MAC protocol with duty cycling for WSNs.",
                    "A QoS based routing protocol for wireless sensor networks.",
                    "Statistical bandwidth scavenging for prioritized device coexistence.",
                    "Behavior monitoring framework in large-scale wireless sensor networks.",
                    "A primal-dual approximation algorithm for the Minimum Cost Stashing problem in wireless sensor networks.",
                    "Energy efficient scheduling for hard real-time systems with fixed-priority assignment.",
                    "ES-MPICH2: A Message Passing Interface with enhanced security.",
                    "OS streaming deployment.",
                    "An automatic prefetching and caching system.",
                    "Loosely time-synchronized snapshots in object-based file systems.",
                    "Regression based multi-tier resource provisioning for session slowdown guarantees.",
                    "Online learning approaches in maximizing weighted throughput.",
                    "Selfish misbehavior in scheduling algorithms of wireless networks.",
                    "Multiple description video multicast in MANETs.",
                    "FRuG: A benchmark for packet forwarding in future networks.",
                    "Soft error propagation in floating-point programs.",
                    "Real-time models supporting resource management decisions in highly variable systems.",
                    "Mnemonic Lossy Counting: An efficient and accurate heavy-hitters identification algorithm.",
                    "Internet topology on as-level: Model, generation methods and tool.",
                    "A time dependent performance model for multihop wireless networks with CBR traffic.",
                    "Modelling the behavior of a beacon-based link sensing mechanism with variable sensing range.",
                    "Tuning ZRP framework for CR networks and MANETs.",
                    "Effects of channel SNR in mobile cognitive radios and coexisting deployment of cognitive wireless sensor networks.",
                    "Traffic eavesdropping based scheme to deliver time-sensitive data in sensor networks.",
                    "Performance evaluation of CDMA packet networks in Nakagami fading.",
                    "Belief-free equilibrium of packet forwarding game in ad hoc networks under imperfect monitoring.",
                    "A gateway-based approach for information retrieval from data-centric wireless sensor networks from IP hosts.",
                    "Hardware-assisted security mechanism: The acceleration of cryptographic operations with low hardware cost.",
                    "Profiling and analysis of power consumption for virtualized systems and applications.",
                    "Modeling of non-gaussian noise effect on DSL lines.",
                    "Virtual machine auto-configuration for web application."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "28th IPCCC 2009",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2009",
                "sub_name": "28th International Performance Computing and Communications Conference, IPCCC 2009, 14-16 December 2009, Phoenix, Arizona, USA.",
                "count": 57,
                "papers": [
                    "A universal framework for partial coverage in Wireless Sensor Networks.",
                    "ABC-MC: A simple multi-channel geographic forwarding scheme for wireless sensor networks.",
                    "Static worst-case energy and lifetime estimation of wireless sensor networks.",
                    "EDA: Event-oriented data aggregation in sensor networks.",
                    "Real time clustering of sensory data in wireless sensor networks.",
                    "On Performance-Adaptive flow control for large data transfer in high speed networks.",
                    "Pre-congestion notification-based flow management in MPLS-based DiffServ networks.",
                    "Towards zero loss for TCP in wireless networks.",
                    "Saturation aware TCP throughput prediction.",
                    "ECOS: An energy-efficient cluster storage system.",
                    "Improving reliability of energy-efficient parallel storage systems by disk swapping.",
                    "Performance evaluation of power-aware routing algorithms in Personal Networks.",
                    "Virtual Center: A characteristic of minimum power broadcast trees in wireless ad hoc networks.",
                    "Avoiding state-space explosion of predictive metadata with SESH.",
                    "A user-centric dynamic cluster partitioning approach for HPC service optimization.",
                    "Using shared parity disks to improve the reliability of RAID arrays.",
                    "Optimization of link bandwidth for parallel communication performance.",
                    "Improving file tree traversal performance by scheduling I/O operations in user space.",
                    "Achieving high performance web applications by service and database replications at edge servers.",
                    "Towards social-aware routing in dynamic communication networks.",
                    "Opportunistic mechanisms for IEEE 802.11 networks using directional antennas.",
                    "Efficient multicast for link-heterogeneous wireless mesh networks.",
                    "Characterizing deployment and distribution of self-powered mesh routers in wireless mesh networks.",
                    "Analysis of the impact of swarm mobility on performance of routing protocols in MANETs.",
                    "LWRM: A lightweight response mechanism for TCG TOCTOU attack.",
                    "Modeling primary user emulation attacks and defenses in cognitive radio networks.",
                    "Mobile sink using multiple channels to defend against wormhole attacks in wireless sensor networks.",
                    "On trigger detection against reactive Jamming Attacks: A clique-independent set based approach.",
                    "GPU support for batch oriented workloads.",
                    "Spotlight - a low complexity highly accurate profile-based branch predictor.",
                    "Iterative layer-based raytracing on CUDA.",
                    "Context-aware code optimization.",
                    "Efficient symmetric comparison-based self-diagnosis using backpropagation artificial neural networks.",
                    "A pragmatic approach to location-aware service organization and discovery.",
                    "Low cost indoor location management system using infrared leds and Wii Remote Controller.",
                    "Thermal aware workload scheduling with backfilling for green data centers.",
                    "A-MAC: Efficient Medium Access for cluster-based wireless sensor networks.",
                    "Finding correlated heavy-hitters over data streams.",
                    "Caching techniques for XML message filtering.",
                    "Towards health of replication in large-scale P2P-VoD systems.",
                    "Hotspot Prediction and cache in distributed stream-processing storage systems.",
                    "Network caching for Chip Multiprocessors.",
                    "A study of throughput for Iu-CS and Iu-PS interface in UMTS core network.",
                    "An adaptive polling algorithm with differentiation strategy in IEEE 802.16 multi-hop networks with IEEE 802.11e WLANs.",
                    "Performance comparison of guard channel admission control schemes for IEEE 802.16 system with various turbo code FEC schemes.",
                    "Applying scheduling policies to improve QoE in wireless Voice-over-IP.",
                    "A study of throughput for Nb, Mc and Nc interface in UMTS core network.",
                    "Flow-based TCP connection analysis.",
                    "Predicting Tor path compromise by exit port.",
                    "Multiscale analysis and prediction of network traffic.",
                    "Finding and extracting crypto routines from malware.",
                    "Network measurement based redundancy model and maintenance in dynamic P2P storage systems.",
                    "A goal programming approach for the joint optimization of energy consumption and response time in computational grids.",
                    "System level evaluation for WiMAX IEEE 802.16m.",
                    "Joint precoder and power adaptation for cognitive radios in interference systems.",
                    "Evolutionary algorithms for radio resource management in cognitive radio network.",
                    "Are cognitive radios energy efficient? A study of the Wireless LAN scenario."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "27th IPCCC 2008",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2008",
                "sub_name": "2008 IEEE International Performance, Computing and Communications Conference, IPCCC 2008, Austin, TX, USA, December 7-9, 2008.",
                "count": 74,
                "papers": [
                    "TIME: Time-based Index Management for Event Query Processing in Wireless Sensor Networks.",
                    "Divisible Load Scheduling inWireless Sensor Networks with Information Utility.",
                    "Design and Evaluation of Localization Protocols and Algorithms in Wireless Sensor Networks Using UWB.",
                    "Distributed Energy-Efficient Scheduling for Data-Intensive Applications with Deadline Constraints on Data Grids.",
                    "Progressive Parity-Based Hardening of Data Stores.",
                    "An Adaptive Cache Management Using Dual LRU Stacks to Improve Buffer Cache Performance.",
                    "Understanding Divide-Conquer-Scanning Worms.",
                    "Detection of Worm Propagation Engines in the System Call Domain using Colored Petri Nets.",
                    "A Highly Available Transparent Linux Cluster Security Model.",
                    "Increasing Lifetime of Wireless Sensor Networks Using Controllable Mobile Cluster Heads.",
                    "TSS: An Energy Efficient Communication Scheme for Low Power Wireless Networks.",
                    "Coding-Aware Multi-path Routing in Multi-Hop Wireless Networks.",
                    "A Network Connection Proxy to Enable Hosts to Sleep and Save Energy.",
                    "Cooperative Monitoring for Internet Data Centers.",
                    "A Transient Overload Generator forWeb Servers.",
                    "An Evaluation of Java RMI/JavaSpaces and Ruby DRb/Rinda.",
                    "Performance Models for the Instance Pooling Mechanism of the JBoss Application Server.",
                    "Massively Parallel Network Coding on GPUs.",
                    "Delay and Capacity Optimization in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Location Authentication Methods for Wireless Network Access Control.",
                    "Neighborhood Route Diffusion for Packet Salvaging in Networks with High Mobility.",
                    "Simple and Effective Adaptive Routing Algorithms in Multi-Layer Wormhole Networks.",
                    "Towards Green Routers: Depth-Bounded Multi-Pipeline Architecture for Power-Efficient IP Lookup.",
                    "KAEF: An En-route Scheme of Filtering False Data in Wireless Sensor Networks.",
                    "Analysis of Peer-to-Peer Traffic Using a Behavioural Method Based on Entropy.",
                    "A New Trust Framework Based on Reputation for Unstructured P2P Networks.",
                    "Theoretical and Experimental Evaluation of Communication-Induced Checkpointing Protocols in FE Family.",
                    "Laboratory Measurements and Verification of PSI/SI Transmission in DVB-H Systems.",
                    "A Group-aware Service Discovery Scheme in Ubiquitous Environment using Service Assignment.",
                    "Fairness Analysis in Competitive FIFO Buffer Management.",
                    "QELAR: A Q-learning-based Energy-Efficient and Lifetime-Aware Routing Protocol for Underwater Sensor Networks.",
                    "UD-GEM: A Multi-Path Routing Algorithm for Wireless Sensor Networks.",
                    "An Efficient Key Distribution Scheme for Establishing Pairwise Keys with a Mobile Sink in Distributed Sensor Networks.",
                    "Analysis on Probabilistic View Coverage for Image Sensing - A Geometric Approach.",
                    "Stability Analysis for Communication of Voice and Data Terminals with Packet Reservation Multiple Access Protocol.",
                    "A Lightweight Mutual Authentication Scheme for Mobile Radio Frequency IDentification (mRFID) Systems.",
                    "Directional Double Metric Routing in Wireless Mesh Network.",
                    "Joint Adaptive Redundancy and Partial Retransmission for Reliable Transmission in Wireless Sensor Networks.",
                    "A High Scalability P2P Simulation Framework with Measured Realistic Network Layer Support.",
                    "Towards a Queue Sensitilve Transport Protocol.",
                    "Modeling and Performance Evaluation of Optical Burst Switched Ring Networks with Efficient Adaptive Routing.",
                    "QoS Behavior of Optical Burst Switching under Multimedia Traffic: an Analytical Approach.",
                    "Spectrum Handoff for Cognitive Radio Networks: Reactive-Sensing or Proactive-Sensins?",
                    "Asynchronous Detection and Avoidance (DAA) Protocol for Interference Mitigation in Dynamic Spectrum Access.",
                    "Graph Theoretic Approach to QoS-Guaranteed Spectrum Allocation in Cognitive Radio Networks.",
                    "Spectral Sensing of Adaptive Frequency Hopping signal for Cognitive Radio.",
                    "Universal Classifier Synchronizer Demodulator.",
                    "Minimizing Energy Consumption Using Cognitive Radio.",
                    "Traffic Differentiating Queue For Enhancing AODV Performance in Real-Time Interactive applications.",
                    "Discovering Resources in Tuple-Based Pervasive Systems using Resource-Aware Routing.",
                    "Throughput Enhancement of Macro and Femto Networks By Frequency Reuse and Pilot Sensing.",
                    "RFID Reader Anti-collision Algorithm Using a Server and Mobile Readers Based on Conflict-Free Multiple Access.",
                    "Automatic Generation of User's Profiles for Location-Based Adaptation of Multimedia Documents.",
                    "Fuzzy Evaluation for Wireless Sensor Networks Based on Rough Set Theory.",
                    "Tuning Data Reporting and Sensing for Continuous Monitoring in Wireless Sensor Networks.",
                    "Assessment Strategy with Markov Chain Utilized in Wireless Sensor Networks.",
                    "Enhanced Scanning Scheme for Delay-Constrained Fast Handoff in IEEE 802.11 WLANs.",
                    "Exploring Load Balancing in Heterogeneous Networks by Rate Distribution.",
                    "Practical Covert Channel Implementation through a Timed Mix-Firewall.",
                    "Masquerading a Wired Covert Channel into a Wireless-like Channel.",
                    "A Proxy Agent for Small Network-Enabled Devices.",
                    "Threshold Proxy Re-Signature.",
                    "Support for Security and Privacy in SenSearch.",
                    "Proxy Aided Key Pre-distribution Schemes for Sensor Networks.",
                    "Subjective Audio Quality over Secure IEEE 802.11 Wireless Local Area Networks.",
                    "Activity-based Security Scheme for Ubiquitous Environments.",
                    "Distributed Detection of Replica Cluster Attacks in Sensor Networks Using Sequential Analysis.",
                    "A Model to Use Denied Internet Traffic to Indirectly Discover Internal Network Security Problems.",
                    "Adaptive Access Control Scheme Utilizing Context Awareness in Pervasive Computing Environments.",
                    "On the Formal Verification of a Cluster Based Key Management Protocol for Wireless Sensor Networks.",
                    "The Scalability of Secure Lock.",
                    "Mitigating Evil Twin Attacks in 802.11.",
                    "Noise-Resistant Payload Anomaly Detection for Network Intrusion Detection Systems.",
                    "Towards Mathematically Modeling the Anonymity Reasoning Ability of an Adversary."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "26th IPCCC 2007",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2007",
                "sub_name": "Proceedings of the 26th IEEE International Performance Computing and Communications Conference, IPCCC 2007, April 11-13, 2007, New Orleans, Louisiana, USA.",
                "count": 80,
                "papers": [
                    "A QoS Framework to Support Integrated Services in Multihop Wireless Networks with Infrastructure Support.",
                    "Mobility Support of Multi-User Services in Next Generation Wireless Systems.",
                    "A Malware Signature Extraction and Detection Method Applied to Mobile Networks.",
                    "An Additive Increase Smooth Decrease (AISD) Strategy for Data and Streaming Applications.",
                    "TCP Vegas Performance with Streaming Media.",
                    "Stochastic Fair Traffic Management for Efficient and Robust IP Networking.",
                    "Memory Performance and Scalability of Intel's and AMD's Dual-Core Processors: A Case Study.",
                    "Application Insight Through Performance Modeling.",
                    "Ensuring Performance in Activity-Based File Relocation.",
                    "O(log n)-Localized Algorithms on the Coverage Problem in Heterogeneous Sensor Networks.",
                    "Optimal Cluster Head Selection in the LEACH Architecture.",
                    "Moving Schemes for Mobile Sinks in Wireless Sensor Networks.",
                    "Performance Guarantees for Flow-Mapping Parallel Packet Switch.",
                    "A Queue-based Adaptive Polling Scheme to Improve System Performance in Gigabit Ethernet Networks.",
                    "A Power Management Proxy with a New Best-of-N Bloom Filter Design to Reduce False Positives.",
                    "Analysis of Queuing Delay in RPR Networks.",
                    "A Low Bound for Broadcast in Optical Networks of Bounded Treewidth Using Fewest Converters.",
                    "Performance Evaluation of Optimized Link State Routing-based Localization.",
                    "Rerouting Time and Queueing in Proactive Ad Hoc Networks.",
                    "Priority-Ensured Medium Access in Ad Hoc Networks.",
                    "Streaming in MANET: Proactive Link Protection and Receiver-Oriented Adaptation.",
                    "Understanding Localized-Scanning Worms.",
                    "An Application Layer Extension for Multipoint Communication for the Session Initiation Protocol.",
                    "Scalable and Decentralized Content-Aware Dispatching in Web Clusters.",
                    "Scheduling of Periodic Packets in Energy-Aware Wireless Networks.",
                    "Adaptive Transmission Scheme in IEEE 802.16 WMAN with Error Prone Channel.",
                    "A Model-Based Admission Control for 802.11e EDCA using Delay Predictions.",
                    "A Hybrid Disk-Aware Spin-Down Algorithm with I/O Subsystem Support.",
                    "Self-Adaptive Two-Dimensional RAID Arrays.",
                    "Hierarchical Policy-Based Replication.",
                    "Composite Event Detection in Wireless Sensor Networks.",
                    "Detecting Misused Keys in Wireless Sensor Networks.",
                    "C2AP: Coverage-aware and Connectivity-constrained Actor Positioning in Wireless Sensor and Actor Networks.",
                    "How to Assign Traffic Sources to Nodes in Disaster Area Scenarios.",
                    "On Frugality of Control Packets in Multi-Hop Wireless Networks.",
                    "Performance Evaluation of Energy Efficient Ad Hoc Routing Protocols.",
                    "Workload Characterization for News-on-Demand Streaming Services.",
                    "Automatic Generation of User-Centric Multimedia Communication Services.",
                    "On Network Coding Based Multirate Video Streaming in Directed Networks.",
                    "Peer-to-Peer Multimedia Streaming Using BitTorrent.",
                    "Parallelizing Protocol Processing on SMT Processor Efficiently: A FSM Decomposition Approach.",
                    "Scheduling Divisible Loads on Bus Networks with Arbitrary Processor Release Time and Start-Up Costs: XRMI.",
                    "Reducing ALU and Register File Energy by Dynamic Zero Detection.",
                    "Compiler-Directed Functional Unit Shutdown for Microarchitecture Power Optimization.",
                    "Components and Analysis of Disaster Tolerant Computing.",
                    "Applications of the Oriented Permission Role-Based Access Control Model.",
                    "A Method of Fraud & Intrusion Detection for E-payment Systems in Mobile e-Commerce.",
                    "Towards a Collusion-Resistant Algebraic Multi-Party Protocol for Privacy-Preserving Association Rule Mining in Vertically Partitioned Data.",
                    "Classification Model for Access Control Constraints.",
                    "An Efficient Technique for Preventing Mimicry and Impossible Paths Execution Attacks.",
                    "Threat Analysis of the Session Initiation Protocol Regarding Spam.",
                    "Diversified Process Replicæ for Defeating Memory Error Exploits.",
                    "Towards Survivable and Secure Wireless Sensor Networks.",
                    "Profiling Database Application to Detect SQL Injection Attacks.",
                    "GKM: A Group Dynamics Aware Key Management Scheme for Multicast Communications in Ad-hoc Sensor Networks.",
                    "CT-RBAC: A Temporal RBAC Model with Conditional Periodic Time.",
                    "Epidemics of Mobile Worms.",
                    "Applying Formal Evaluation to Worm Defense Design.",
                    "Inverse Geolocation: Worms with a Sense of Direction.",
                    "PID: A Queue Management Scheme for Improving Network Resilience Under Worm Attacks.",
                    "SpyCon: Emulating User Activities to Detect Evasive Spyware.",
                    "d-ACTM: Distributed Anomaly Connection Tree Method to detect Silent Worms.",
                    "Optimising Networks Against Malware.",
                    "Using Byzantine Agreement in the Design Of IPS Systems.",
                    "Dynamic and User-Centric Network Selection in Heterogeneous Networks.",
                    "The Interworking between EDCA 802.11e and DiffServ.",
                    "A New Channel Allocation Scheme for Real-Time Traffic in Wireless Cellular Networks.",
                    "First Responders' Crystal Ball: How to Scry the Emergency from a Remote Vehicle.",
                    "ACM: A Transmission Mechanism for Urgent Sensor Information.",
                    "QoS Provisioning in Public Safety Radio and Commercial Cellular Integrated Networks for First Responders and Critical Infrastructures.",
                    "A Traffic Chaos Reduction Approach for Emergency Scenarios.",
                    "A Reliable Wireless Mesh Infrastructure Deployment at Crisis Site.",
                    "Rover: An Integration and Fusion Platform to Enhance Situational Awareness.",
                    "Opportunistic Networks for Emergency Applications and Their Standard Implementation Framework.",
                    "Intelligent Highway Infrastructure for Planned Evacuations.",
                    "A Gossip-Style Crash Faults Detection Protocol for Wireless Ad-Hoc and Mesh Networks.",
                    "LoST: A Protocol for Mapping Geographic Locations to Public Safety Answering Points.",
                    "Adaptive Probabilistic Scheduling for a Cellular Emergency Network.",
                    "IMPACT - A Family of Cross-Layer Transmission Protocols for Wireless Sensor Networks.",
                    "Protecting First-Level Responder Resources in an IP-based Emergency Services Architecture."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "25th IPCCC 2006",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2006",
                "sub_name": "Proceedings of the 25th IEEE International Performance Computing and Communications Conference, IPCCC 2006, April 10-12, 2006, Phoenix, Arizona, USA.",
                "count": 88,
                "papers": [
                    "An analytical study on routing overhead of two-level cluster-based routing protocols for mobile ad hoc networks.",
                    "Minimum-energy route configuration for wireless ad hoc networks.",
                    "Path cost metrics for multi-hop network routing.",
                    "A new secure group key management scheme for multicast over wireless cellular networks.",
                    "Cluster based approaches for end-to-end complete feedback collection in multicast.",
                    "SHARP: a new real-time scheduling algorithm to improve security of parallel applications on heterogeneous clusters.",
                    "Source traffic regulation in reserved delivery subnetworks.",
                    "The impacts of timing constraints on virtual channels multiplexing in interconnect networks.",
                    "High performance and alleviated hot-spot problem in processor frontend with enhanced instruction fetch bandwidth utilization.",
                    "SeMAC: robust broadcast MAC protocol for multi-hop wireless ad hoc networks.",
                    "A control-theoretic approach to improving fairness in DCF based WLANs.",
                    "The delay distribution of IEEE 802.11e EDCA and 802.11 DCF.",
                    "A grouped and proportional-fair subcarrier allocation scheme for multiuser OFDM systems.",
                    "Transmit power reduction by adapting rate or power for single carrier wireless systems.",
                    "Channel distribution fairness in multi-channel wireless ad-hoc networks using a channel distribution index.",
                    "Excess bandwidth distribution in DiffServ networks.",
                    "From Network Planning to Traffic Engineering for Optical VPN and Multi-Granular Random Demands.",
                    "BGP with an adaptive minimal route advertisement interval.",
                    "TMS: a trust management system for access control in dynamic collaborative environments.",
                    "A stratified model for security in peer networks: a case for fine grain granularity.",
                    "A novel queue management mechanism for improving performance of multihop flows in IEEE 802.11s based mesh networks.",
                    "A TCP-aware call admission control scheme for packet-switched wireless networks.",
                    "Maintaining an energy-efficient Bluetooth scatternet.",
                    "AWARDS: an adaptive write strategy for secure local disk systems.",
                    "dRamDisk: efficient RAM sharing on a commodity cluster.",
                    "Performance modeling of fully adaptive wormhole routing in n-dimensional mesh-connected multicomputers.",
                    "Adapting connected d-hop dominating sets to topology changes in wireless ad hoc networks.",
                    "Energy-efficient cooperative routing in multi-hop wireless ad hoc networks.",
                    "A novel channel assignment algorithm based on topology simplification in multi-radio wirelesss mesh networks.",
                    "Total information efficiency in multihop wireless networks.",
                    "A traffic-classified technique for filtering spam from bulk delivery E-mails.",
                    "Detection of stepping stone attack under delay and chaff perturbations.",
                    "On capturing and containing E-mail worms.",
                    "Maille authorization - a distributed, redundant authorization protocol.",
                    "Routing and wavelength assignment in optical mesh networks with wavelength conversion.",
                    "A distributed fairness algorithm for bus-based metropolitan optical network.",
                    "Avoiding store misses to fully modified cache blocks.",
                    "Analysis of power control for indoor wireless infrared CDMA communication.",
                    "Polar LEO satellite constellation measurement by delay probing.",
                    "An efficient load balancing algorithm for heterogeneous grid systems considering desirability of grid sites.",
                    "OS-aware tuning: improving instruction cache energy efficiency on system workloads.",
                    "PaScal - a new parallel and scalable server IO networking infrastructure for supporting global storage/file systems in large-size Linux clusters.",
                    "Performance evaluation of DS-BPSK UWB multiple-access systems in standard UWB channels.",
                    "Topological dynamics characterization for layered satellite networks.",
                    "An analytical model of TCP performance.",
                    "Performance modeling of TCP/AQM with generalized AIMD under intermediate buffer sizes.",
                    "Coding schemes for integrated transport and storage reliability.",
                    "Energy efficient model for data gathering in structured multiclustered wireless sensor network.",
                    "Data replication in collaborative sensor network systems.",
                    "Extending sensor network lifetime via first hop data aggregation.",
                    "Key establishment with source coding and reconciliation for wireless sensor networks.",
                    "Performance problem analysis method for Web systems using multiple decision trees.",
                    "Evaluating the impact of reactivity on the performance of Web applications.",
                    "Efficient server cooperation mechanism in content delivery network.",
                    "Unstructured peer-to-peer session over IP using SIP.",
                    "Enabling mobility in enterprise security management.",
                    "Discovery-based role activations in role-based access control.",
                    "Role-based profile analysis for scalable and accurate insider-anomaly detection.",
                    "Reliability enhancements for a Jini and JavaSpaces based network management system.",
                    "A survey of PKI components and scalability issues.",
                    "Multiple design patterns for voice over IP (VoIP) security.",
                    "Incorruptible system self-cleansing for intrusion tolerance.",
                    "A group signature scheme with signature claiming and variable linkability.",
                    "Monitor placement for stepping stone analysis.",
                    "A framework for distributed key management schemes in heterogeneous wireless sensor networks.",
                    "Safe base-station repositioning in wireless sensor networks.",
                    "Wavelength retuning in a WDM mesh network with survivable traffic grooming.",
                    "Risk reduction based survivable WDM network design.",
                    "And you though you were safe after SLAMMER, not so, swarms not Zombies present the greatest risk to our national Internet infrastructure.",
                    "Portal monitoring based anti-malware framework: design and implementation.",
                    "Towards a framework for worm-defense evaluation.",
                    "Connectionless port scan detection on the backbone.",
                    "Optimising malware.",
                    "Automatically deducing propagation sequences that circumvent a collaborative worm defense.",
                    "Wireless intrusion protection system using distributed collaborative intelligence.",
                    "AVARE: aggregated vulnerability assessment and response against zero-day exploits.",
                    "An energy-efficient sensing coverage protocol for surveillance and monitoring applications using wireless sensors.",
                    "Overcoming the challenge of security in a mobile environment.",
                    "Wireless sensor network based model for secure railway operations.",
                    "PROFITIS: architecture for location-based vertical handovers supporting real-time applications.",
                    "Secure data aggregation without persistent cryptographic operations in wireless sensor networks.",
                    "QoS reliability of hierarchical clustered wireless sensor networks.",
                    "Enhanced blocking probability in adaptive multimedia wireless networks.",
                    "Truthful application-layer multicast in mesh-based selfish overlays.",
                    "Caching of interactive multiple choice MPEG-4 presentations.",
                    "Voice over application-level multicast.",
                    "An improved Wu-Manber multiple patterns matching algorithm.",
                    "A modularized QoS multicasting approach on common homogeneous trees for heterogeneous members in DiffServ."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "24th IPCCC 2005",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2005",
                "sub_name": "Proceedings of the 24th IEEE International Performance Computing and Communications Conference, IPCCC 2005, April 7-9, 2005, Phoenix, Arizona, USA.",
                "count": 90,
                "papers": [
                    "Proving secure properties of cryptographic protocols with knowledge based approach.",
                    "An efficient network intrusion detection method based on information theory and genetic algorithm.",
                    "A key distribution scheme for double authentication in link state routing protocol.",
                    "Improving effective bandwidth of networks on clusters using load balancing for communication-intensive applications.",
                    "Improving network performance through task duplication for parallel applications on clusters.",
                    "Parallelized scheduling algorithm for input queued switches using local search technique.",
                    "Designing efficient routing protocol for heterogeneous sensor networks.",
                    "Performance evaluation of range-free localization methods for wireless sensor networks.",
                    "Improving sensor network performance by deploying mobile sensors.",
                    "Connectionless probabilistic (CoP) routing: an efficient protocol for mobile wireless ad-hoc sensor networks.",
                    "On sampling unit size in sampled microprocessor simulation.",
                    "Cluster-based input/output trace synthesis.",
                    "Performance characterization of iSCSI processing in a server platform.",
                    "Performance evaluations for hybrid IEEE 802.11b and 802.11g wireless networks.",
                    "Further reduced search for optimal diagonal space-time constellations from groups.",
                    "A power management scheme for the IEEE 802.11 based WLANs.",
                    "DualRTT: detecting spurious timeouts in wireless mobile environments.",
                    "On the construction of energy-efficient broadcast tree with Hitch-hiking in wireless networks.",
                    "Targeted search: reducing the time and cost for searching for objects in multiple-server networks.",
                    "Efficient file sharing strategy in DHT based P2P systems.",
                    "On transport daemons for small collaborative applications over wide-area networks.",
                    "A simple but efficient broadcasting protocol for video-on-demand.",
                    "Source routing based pairwise key establishment protocol for sensor networks.",
                    "Totally distributed key management for dynamic groups in MANETs.",
                    "RINK-RKP: a scheme for key predistribution and shared-key discovery in sensor networks.",
                    "Key management in wireless ad hoc networks: collusion analysis and prevention.",
                    "Utilizing characteristics of last link to improve TCP performance.",
                    "Multimedia streaming using multiple TCP connections.",
                    "On large scale deployment of parallelized file transfer protocol.",
                    "Virtual machine effects on network traffic dynamics.",
                    "DINloop based inter-domain multicast with MPLS.",
                    "OMFVS: overlay multicast for file distribution using virtual sources.",
                    "Performance analysis of reliable multicast protocol using transparent proxy servers over hybrid networks.",
                    "DIG: an overlay network for Internet multicasting.",
                    "A tree-based reliable multicast scheme exploiting the temporal locality of transmission errors.",
                    "Providing efficient certification services against active attacks in ad hoc networks.",
                    "Measuring energy-security tradeoffs in wireless networks.",
                    "Calculating a node's reputation in a mobile ad hoc network.",
                    "Adaptive object cache pre-fetching scheme based on object flow.",
                    "The effects of AQM on the performance of assured forwarding services.",
                    "The design and implementation of RAPID-cache for Linux.",
                    "An efficient broadcast query forwarding technique for wireless multipath routing.",
                    "Leveraging 1-hop neighborhood knowledge for efficient flooding in wireless ad hoc networks.",
                    "On the construction of stable virtual backbones in mobile ad-hoc networks.",
                    "ISPRP: a message-efficient protocol for initializing structured P2P networks.",
                    "Wireless sensor network security: a secure sink node architecture.",
                    "Secure data aggregation and source-channel coding with MIT code for wireless sensor networks.",
                    "Piezoelectric materials for powering remote sensors.",
                    "Energy-efficient rate adaptation MAC protocol for ad hoc wireless networks.",
                    "A novel joint routing and power management algorithm for energy-constraint ad-hoc sensor network.",
                    "MMAC: a mobility-adaptive, collision-free MAC protocol for wireless sensor networks.",
                    "Energy-efficient task scheduling for wireless sensor nodes with multiple sensing units.",
                    "Performance analysis of a channel allocation scheme with preemptive priority for integrated voice/data mobile networks.",
                    "CAC and blocking capacity of multi-service smart antenna CDMA systems with and without code re-use.",
                    "Real time agreement protocol and resource pre-reservation for wireless system.",
                    "A performance comparison of class-based scheduling algorithms in future UMTS access.",
                    "Towards an automated development methodology for dependable systems with application to sensor networks.",
                    "SECK: survivable and efficient clustered keying for wireless sensor networks.",
                    "Reliable multicast in wireless ad hoc and sensor networks.",
                    "Accurate anchor-free node localization in wireless sensor networks.",
                    "Performance of IEEE 802.11 based wireless sensor networks in noisy environments.",
                    "Secure cell relay routing protocol for sensor networks.",
                    "Multi-rate congestion control using packet-pair bandwidth detection with session and layer changing manager.",
                    "Examining the benefits of a hybrid distributed architecture for bandwidth brokers.",
                    "Multihoming media streaming.",
                    "Performance comparison of multiplexing techniques for MPEG-4 object-based content.",
                    "Source descriptor selection schemes for multiple description coded services in 4G wireless communication systems.",
                    "Adapting spatial constraints of composite multimedia objects to achieve universal access.",
                    "A novel addressing architecture for wireless sensor networks.",
                    "EECS: an energy efficient clustering scheme in wireless sensor networks.",
                    "Power control based topology construction for the distributed wireless sensor networks.",
                    "Energy efficiency of two virtual infrastructures for MANETs.",
                    "Multi-class adaptive radio resource management policy for multimedia cellular networks.",
                    "Optimal resource allocation and leaky bucket based power control for CBR MIMO systems.",
                    "Modeling and performance analysis of public safety wireless networks.",
                    "Simplifying the power allocation for OFDM-MIMO: a partial curve fitting approach.",
                    "Energy efficient sensor, relay and base station placements for coverage, connectivity and routing.",
                    "Dynamic localization control for mobile sensor networks.",
                    "Optimal common transmit power in ad hoc wireless networks.",
                    "Minimum cost guaranteed lifetime design for heterogeneous wireless sensor networks (WSNs).",
                    "A feasible approach for QoS management in coordinated heterogeneous radio access networks.",
                    "Resource management for handoff traffic in hierarchical cellular networks.",
                    "A novel joint radio resource management approach with reinforcement learning mechanisms.",
                    "Enhancement of IEEE 802.15.3 high rate WPAN via MAC header compression.",
                    "A centralized server based signaling and resource reservation protocol design for fast protection and restoration in optical ring networks.",
                    "A high-performance WDM photonic switch architecture for future super networks infrastructures.",
                    "Energy aware adaptive scheduler for a sensor node.",
                    "Using β-skeletons for localized topology control in wireless ad hoc networks.",
                    "Design and stochastic modeling of distributed, dynamic, randomized clustering protocols in wireless sensor networks.",
                    "Energy savings for data caches: ELRU-SEQ replacement policy."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "23rd IPCCC 2004",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2004",
                "sub_name": "Proceedings of the 23rd IEEE International Performance Computing and Communications Conference, IPCCC 2004, April 15-17, 2004, Phoenix, Arizona, USA.",
                "count": 119,
                "papers": [
                    "Message from the General Chair.",
                    "Message from the Program Co-Chairs.",
                    "Panel I: Wireless networking: interoperability and security challenges.",
                    "Panel II: PKI to the masses.",
                    "Improving server broadcast efficiency through better utilization of client receiving bandwidth.",
                    "A buffer management scheme for tree-based reliable multicast using infrequent acknowledgments.",
                    "Selection algorithms for anycast relay routing.",
                    "Aggressive telecommunications overbooking ratios.",
                    "Settlement and capacity planning in multi-service provider infrastructures.",
                    "Algebraic geometric code based IP traceback.",
                    "Connection-level performance analysis for adaptive bandwidth allocation in multimedia wireless cellular networks.",
                    "Adaptive channel switching for admission control with QoS and priority in WCDMA uplink.",
                    "A novel velocity-dependent directional probability function based call admission control scheme in wireless multimedia communications.",
                    "Toward efficient distributed network monitoring.",
                    "Admission control in deadline-based network resource management.",
                    "On the performance of Maestro2 high performance network equipment, using new improvement techniques.",
                    "Survivable multipath routing using link penalization.",
                    "Benchmarks for IP forwarding tables.",
                    "Damping BGP route flaps.",
                    "Channel state dependent robust TCP/IP header compression for 3G wireless networks.",
                    "Interplay of service differentiation and routing mechanisms in MANETs: a performance study.",
                    "Framework for performance analysis of channel-aware wireless schedulers.",
                    "An efficient method for computing the bit error probabilities of band-limited asynchronous DS-CDMA systems with random signature sequences.",
                    "Predicting node location in a PCS network.",
                    "A cluster based secure routing scheme for wireless ad hoc networks.",
                    "CGRED: class guided random early discarding.",
                    "Capacity provisioning in DiffServ/MPLS networks based on correlated traffic inputs.",
                    "SONAR: a platform for flexible DiffServ/MPLS traffic engineering.",
                    "Available bandwidth measurement using Poisson probing on the Internet.",
                    "Optimization of the bandwidth distribution scheme for handling topology changes.",
                    "Statistical bounds on the drop probability of assured forwarding services in DiffServ interior nodes under the processor sharing scheduling discipline.",
                    "Compositional layered performance modeling of peer-to-peer routing software.",
                    "A performance analysis of the sockets direct protocol (SDP) with asynchronous I/O over 4X InfiniBand.",
                    "Analysis and improvements to MATE algorithm.",
                    "Probabilistic packet delay guarantee in buffered crossbar switch.",
                    "A game theory based approach for security in wireless sensor networks.",
                    "A simulation study on a layered video multicast algorithm.",
                    "A fast pattern matching algorithm for network processor-based intrusion detection system.",
                    "Using adaptive priority scheduling for service differentiation QoS-aware Web servers.",
                    "End-to-end layered multicast of streaming media in heterogeneous networks.",
                    "Differentiated caching of dynamic content using effective page classification.",
                    "Differentiated-service enabled group communications using bandwidth brokers.",
                    "On the reliability of ODMRP in mobile ad hoc networks.",
                    "An adaptive algorithm for estimating wireless communication channel.",
                    "A goal-oriented self-tuning caching algorithm.",
                    "Coopeer: a peer-to-peer Web search engine towards collaboration, humanization and personalization.",
                    "Queueing analysis of DCHF and token-passing protocols with varying turnaround time.",
                    "Secure multimedia transmission in IPv6 wireless networks.",
                    "A public key algorithm for ad-hoc networks.",
                    "Performance analysis of multi-hop wireless ad hoc networks using IEEE 802.11 DCF.",
                    "Adaptive gossip-based routing algorithm.",
                    "Stability helps quality of service routing in wireless ad hoc networks.",
                    "An information dissemination protocol for an ad hoc network.",
                    "Position-based routing with a power-aware weighted forwarding function in MANETs.",
                    "Flexible mechanisms for performance enhancements of cluster networks.",
                    "A distributed coordinated approach to parallel programming.",
                    "Object allocation and memory contention study of Java multithreaded applications.",
                    "Comparative analysis of algorithms for tree structure restoration in sensor networks.",
                    "A new protocol for a low power sensor network.",
                    "Load-balanced routing through virtual paths: highly adaptive and efficient routing scheme for ad hoc wireless networks.",
                    "SEKEN: secure and efficient key exchange for sensor networks.",
                    "Adaptive location aided mobile ad hoc network routing.",
                    "Performance implications of different adaptation mechanisms for network content delivery.",
                    "Meta algorithms for hierarchical Web caches.",
                    "QoS differentiation in switching-based Web caching.",
                    "Location-centric isolation of misbehavior and trust routing in energy-constrained sensor networks.",
                    "Relocation of gateway for enhanced timeliness in wireless sensor networks.",
                    "Energy-efficient broadcast-based event update dissemination.",
                    "A robust PI controller for improving performance in the AF-based differentiated services network.",
                    "EPCF: a lightweight multi-priority PCF for QoS support in IEEE 802.11 wireless LANs.",
                    "QoS service routing in one-to-one and one-to-many scenarios in next-generation service-oriented networks.",
                    "Improving file transfers using SCTP multistreaming.",
                    "IPCC-SCTP: an enhancement to the standard SCTP to support multi-homing efficiently.",
                    "Active queue management for Web traffic.",
                    "On CAC, DCA, and scheduling in TDD multi-hop 4G wireless networks.",
                    "Performance analysis of ARQ schemes for UTRA TDD ad hoc mode.",
                    "Dynamic rate-selection for extending the lifetime of energy-constrained networks.",
                    "On carrier-sense integration in learning automata-based MAC protocols for ad-hoc wireless LANs.",
                    "A QoS-aware MAC layer protocol for wireless LANs.",
                    "A directional antennas-based dual mode MAC protocol for ad hoc networks.",
                    "Max-min fair collision-free scheduling for wireless sensor networks.",
                    "An analysis on selective dropping attack in BGP.",
                    "VisFlowConnect: providing security situational awareness by visualizing network traffic flows.",
                    "Experimental analysis of attacks against routing network infrastructures.",
                    "Position-based QoS routing in mobile ad hoc networks: problem statement and a novel approach.",
                    "A location information-based route discovery protocol for mobile ad hoc networks.",
                    "CKDS: an efficient combinatorial key distribution scheme for wireless ad-hoc networks.",
                    "A dynamic multicast tree reconstruction algorithm for minimum-energy multicasting in wireless ad hoc networks.",
                    "Robust tree-based multicasting in ad hoc networks.",
                    "Mobile ad hoc multicasting to support distributed virtual environments.",
                    "PARIX: a protocol adaptive mechanism for routing information exchange across heterogeneous ad hoc routing domains.",
                    "Architecting information assurance.",
                    "How to predict e-mail viruses under uncertainty.",
                    "Flow policies: specification and enforcement.",
                    "An energy-efficient MAC layer scheme for 802.11-based WLANs.",
                    "Reducing overhearing energy in 802.11 networks by low-power interface idling.",
                    "Performance evaluation of the IEEE 802.15.4 MAC for low-rate low-power wireless networks.",
                    "Analysis and optimization of energy efficiency in 802.11 distributed coordination function.",
                    "Application-specific modelling of information routing in wireless sensor networks.",
                    "Reducing localization errors in sensor ad hoc networks.",
                    "An adaptive low power reservation based MAC protocol for wireless sensor networks.",
                    "The interaction of security and survivability in hybrid wireless networks.",
                    "On intrusion detection and response for mobile ad hoc networks.",
                    "SPECSA: a scalable, policy-driven, extensible, and customizable security architecture for wireless enterprise applications.",
                    "On the performance of reflective systems software.",
                    "Regression benchmarking with simple middleware benchmarks.",
                    "Performance consequences of inconsistent client-side membership information in the open group model.",
                    "On the generalised stochastic Petri net modeling of message-oriented middleware systems.",
                    "Cost-aware downlink scheduling of shared channels for cellular networks with relays.",
                    "Free trade for hybrid multihop wireless networks.",
                    "Low delay marking for TCP in wireless ad hoc networks.",
                    "Lightweight key management for wireless sensor networks.",
                    "Ensuring information assurance in federated identity management.",
                    "A classification of malicious software attacks.",
                    "Committal deniable signatures over elliptic curves.",
                    "Performance analysis of the Globus Toolkit Monitoring and Discovery Service, MDS2.",
                    "Adaptive power aware remote processing - a step towards power aware middleware.",
                    "Scale-up and performance studies of three agent platforms.",
                    "Performance evaluation of the meta-ORB reflective middleware platform."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "22nd IPCCC 2003",
        "info": "Phoenix, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/2003",
                "sub_name": "Proceedings of the 22nd IEEE International Performance Computing and Communications Conference, IPCCC 2003, April 9-11, 2003, Phoenix, Arizona, USA.",
                "count": 64,
                "papers": [
                    "Impact of request routing algorithms on the delivery performance of content delivery networks.",
                    "Performance evaluation for penalty-based resource management: an adaptive QoS scheme for service differentiation and adaptation in heterogeneous wireless networks.",
                    "A novel architecture and coexistence method to provide global access to/from Bluetooth WPANs by IEEE 802.11 WLANs.",
                    "Group aggregation for scalable anycast routing.",
                    "TMRCC: a congestion control mechanism for tree-based many-to-many reliable multicast protocols.",
                    "Bottom-up construction of dynamic multicast trees in WDM networks.",
                    "Autonomia: an autonomic computing environment.",
                    "Performance analysis of HP AlphaServer ES80 vs. SAN-based clusters.",
                    "High-performance embedded computing for Conventional Matched-Field Processing.",
                    "Energy-efficient broadcast and multicast routing in ad hoc wireless networks.",
                    "Achieving fairness in distributed scheduling in wireless ad-hoc networks.",
                    "Fair scheduling in wireless ad-hoc networks of location dependent channel errors.",
                    "Ad hoc grids: communication and computing in a power constrained environment.",
                    "Optimal cross-layer designs for energy-efficient wireless ad hoc and sensor networks.",
                    "Power-efficiency clustering method with power-limit constraint for sensor networks.",
                    "Adjustable multi-constrained routing with a novel evaluation method.",
                    "A QoS enabled MAC protocol for multi-hop ad hoc wireless networks.",
                    "Minimal connected dominating set algorithms and application for a MANET routing protocol.",
                    "Identifying flaws in the secure routing protocol.",
                    "An improvement on secure communication in PCS.",
                    "High-speed router filter for blocking TCP flooding under DDoS attack.",
                    "An energy-efficient TCP quick timeout scheme for wireless LANs.",
                    "Adaptive management of Bluetooth master/slave bridge.",
                    "A simplified and efficient implementation of FPGA-based turbo decoder.",
                    "A framework for dynamic SLA management under heterogeneous traffic conditions in MPLS networks.",
                    "Reducing load distribution overhead with message aggregation.",
                    "A client side measurement scheme for request routing in virtual open content delivery networks.",
                    "Long-term data resilience using opinion polls.",
                    "HARTs: high availability cluster architecture with redundant TCP stacks.",
                    "Network analysis of Counter-strike and Starcraft.",
                    "Minimum-energy broadcast routing in wireless multi-hop networks.",
                    "Ant routing algorithm for mobile ad-hoc networks (ARAMA).",
                    "A comparative study of on-demand and cluster-based routing protocols in MANETs.",
                    "On the advantages of lifetime and RTT classification schemes for TCP flows.",
                    "TCP Vegas-A: solving the fairness and rerouting issues of TCP Vegas.",
                    "A novel fair bandwidth allocation algorithm for TCP window control.",
                    "A unified, low-overhead framework to support continuous profiling and optimization.",
                    "Scenario-based test case generation for state-based embedded systems.",
                    "The potential of compression to improve memory system performance, power consumption, and cost.",
                    "Active queue management and global fairness objectives.",
                    "Multi-objective optimization based flow control in multipoint-to-point communication.",
                    "A performance analysis of a refined hybrid TDMA/CDMA protocol for wireless networks with a QoS adaptation.",
                    "Transparent distributed Web caching with minimum expected response time.",
                    "Algorithms for effective variable bit rate traffic smoothing.",
                    "Rate-controlled scheduling for networked multimedia applications.",
                    "Performance modeling of a disk subsystem and its application to performance design of a Web proxy server.",
                    "Visualizing cache effects on I/O workload predictability.",
                    "A proactive implementation of interactive video-on-demand.",
                    "Efficient QoS partition and routing in multiservice IP networks.",
                    "An evaluation of timestamp-based packet schedulers using a novel measure of instantaneous fairness.",
                    "CLAMP: differentiated capacity allocation in access networks.",
                    "Multifractal analysis and model of the MPEG-4 video traffic.",
                    "Equation-based approach to TCP-compatible multicast congestion control for layered transmission in low-multiplexing environments.",
                    "Using optimization to achieve efficient quality of service in voice over IP networks.",
                    "The RR/RR CICQ switch: hardware design for 10-Gbps link speed.",
                    "Stability of a multicast tree in cumulative layered multicast congestion control.",
                    "Toward end-to-end fairness: a framework for the allocation of multiple prioritized resources.",
                    "An experimental prototype for scalable server selection.",
                    "Usage based service differentiation for end-to-end quality of service management.",
                    "Fuzzy routing in ad hoc networks.",
                    "Performance evaluation of predictive handoff scheme with channel borrowing.",
                    "Using IEEE 802.11e MAC for QoS over wireless.",
                    "IPSec overhead in wireline and wireless networks for Web and email applications.",
                    "Interreference interval for purged objects: a new metric for design and analysis of Web caching algorithms."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "19th IPCCC 2000",
        "info": "Phoenix, Arizona, USA",
        "venues": []
    },
    {
        "year": "1999",
        "name": "18th IPCCC 1999",
        "info": "Phoenix/Scottsdale, Arizona, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipccc/1999",
                "sub_name": "Proceedings of the IEEE International Performance Computing and Communications Conference, IPCCC 1999, Phoenix/Scottsdale, Arizona, USA, 10-12 February 1999.",
                "count": 64,
                "papers": [
                    "Evaluation of cluster interconnects for a distributed shared memory.",
                    "Using a single address space operating system for distributed computing and high performance.",
                    "The most reliable data path transmission.",
                    "Space optimal PIF algorithm: self-stabilized with no extra space.",
                    "Solving the consensus problem in a mobile environment.",
                    "An adaptive distributed channel allocation strategy for mobile cellular networks.",
                    "A simulation evaluation of optimistic replicated filing in mobile environments.",
                    "Virtual personal computers and the portable network.",
                    "Sectored renaming for superscalar microprocessors.",
                    "Accurately modeling speculative instruction fetching in trace-driven simulation.",
                    "PDATS II: improved compression of address traces.",
                    "Performance analysis of intelligent mobile ATM networks.",
                    "Managing mobility in a wireless ATM network.",
                    "Performance analysis of a person-based mobility management scheme for PCN.",
                    "Error control techniques for wireless ATM networks.",
                    "POCAT: power control and channel assignment tool for wireless networks.",
                    "Distributed dynamic channel allocation in mobile networks: combining search and update.",
                    "Modeling and evaluation of channel management for real-time multimedia connections in highway cellular networks.",
                    "Power-based leader selection in ad-hoc wireless networks.",
                    "Core discovery in Internet multicast routing protocol.",
                    "Multiple paths protocol for a cluster type network.",
                    "On estimating protocol performance from a formal specification.",
                    "A simulation performance study of TCP Vegas and Random Early Detection.",
                    "Hybrid TCP-UDP transport for Web traffic.",
                    "Latency analysis of UDP and BPI on Myrinet.",
                    "Optimisation of the performance of a rate-based congestion control system by using fuzzy controllers.",
                    "A method of service quality estimation with a network measurement tool.",
                    "Design and analysis of one prong network restoration algorithms.",
                    "RORP: Distributed object relocation protocol for wide area networks.",
                    "Session traces: an enhancement to network simulator.",
                    "Accelerating ATM: on-line compression of ATM streams.",
                    "Performance evaluation of a general traffic control framework in ATM networks.",
                    "Buffer requirements for ABR traffic using congestion control mechanism.",
                    "Measurement, analysis and performance improvement of the Apache Web server.",
                    "Measuring dynamic memory invocations in object-oriented programs.",
                    "Contrasting branch characteristics and branch predictor performance of C++ and C programs.",
                    "Are all scientific workloads equal?",
                    "The effects of memory-access ordering on multiple-issue uniprocessor performance.",
                    "Enhancing the PCI bus to support real-time streams.",
                    "Towards the design of a snoopy coprocessor for dynamic software-fault detection.",
                    "Management policies for non-volatile write caches.",
                    "Design and performance of a general-purpose software cache.",
                    "Sidney and RDS: an evaluation of two persistent storage systems.",
                    "A split input sunshine switch architecture.",
                    "Equivalent permutation capabilities between time division optical omega network and non-optical extra stage omega network.",
                    "A high-capacity, scalable video-on-demand system architecture, based on a 3-stage Clos network.",
                    "A new synchronization algorithm for hitless protection switching in ATM networks.",
                    "A hierarchical routing protocol for large scale ad hoc network.",
                    "Characteristics of deterministic optimal routing for a simple traffic control problem.",
                    "Routing by distributed recursive computation and information reuse.",
                    "On a virtual wavelength translation scheme for routing in all-optical networks.",
                    "An optical layer protocol for lightpath management in WDM networks.",
                    "Centralized packet filtering protocols: a new class of high performance protocols for single-hop lightwave WDM networks.",
                    "Throughput analysis of WDM-based dual-bus local area networks.",
                    "AltiVecTM: bringing vector technology to the PowerPCTM processor family.",
                    "Performance analysis for chipsets and systems.",
                    "Validation of Turandot, a fast processor model for microarchitecture exploration.",
                    "A PowerPC platform full system simulation-from the MOOSE up.",
                    "An open solution to fault-tolerant Ethernet: design, prototyping, and evaluation.",
                    "An agent framework for survivable network systems.",
                    "A channel resource management framework for cellular networks.",
                    "Transistor paradigm shift required to meet the power demands for microprocessors.",
                    "A toolset for assisted formal verification.",
                    "Operating firewalls outside the LAN perimeter."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "17th IPCCC 1998",
        "info": "Phoenix/Tempe, Arizona, USA",
        "venues": []
    }
]