[
    {
        "year": "2021",
        "name": "20th IPSN 2021",
        "info": "Nashville, TN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2021",
                "sub_name": "IPSN '21: The 20th International Conference on Information Processing in Sensor Networks, Nashville, TN, USA, May, 2021.",
                "count": 43,
                "papers": [
                    "Magneto: Joint Angle Analysis Using an Electromagnet-Based Sensing Method.",
                    "Locating Everyday Objects using NFC Textiles.",
                    "PhyAug: Physics-Directed Data Augmentation for Deep Sensing Model Transfer in Cyber-Physical Systems.",
                    "A Novel Model-Based Security Scheme for LoRa Key Generation.",
                    "PrivacyGuard: Enhancing Smart Home User Privacy.",
                    "Dancing Waltz with Ghosts: Measuring Sub-mm-Level 2D Rotor Orbit with a Single mmWave Radar.",
                    "Moonshine: An Online Randomness Distiller for Zero-Involvement Authentication.",
                    "InaudibleKey: Generic Inaudible Acoustic Signal based Key Agreement Protocol for Mobile Devices.",
                    "MagicInput: Training-free Multi-lingual Finger Input System using Data Augmentation based on MNISTs.",
                    "BLE Can See: A Reinforcement Learning Approach for RF-based Indoor Occupancy Detection.",
                    "OwLL: Accurate LoRa Localization using the TV Whitespaces.",
                    "PRComm: Anti-Interference Cross-Technology Communication Based on Pseudo-random Sequence.",
                    "Sound-Adapter: Multi-Source Domain Adaptation for Acoustic Classification Through Domain Discovery.",
                    "Deep Functional Network (DFN): Functional Interpretation of Deep Neural Networks for Intelligent Sensing Systems.",
                    "CSafe: An Intelligent Audio Wearable Platform for Improving Construction Worker Safety in Urban Environments.",
                    "ExGSense: Toward Facial Gesture Sensing with a Sparse Near-Eye Sensor Array.",
                    "DeepLight: Robust & Unobtrusive Real-time Screen-Camera Communication for Real-World Displays.",
                    "WARP: On-the-fly Program Synthesis for Agile, Real-time, and Reliable Wireless Networks.",
                    "BLEX: Flexible Multi-Connection Scheduling for Bluetooth Low Energy.",
                    "Efficient Execution of Deep Neural Networks on Mobile Devices with NPU.",
                    "A3: Adaptive Autonomous Allocation of TSCH Slots.",
                    "On the Root of Trust Identification Problem.",
                    "PigNet: Failure-Tolerant Pig Activity Monitoring System Using Structural Vibration.",
                    "Watching the Grid: Utility-Independent Measurements of Electricity Reliability in Accra, Ghana.",
                    "Repurposing Cathodic Protection Systems as Reliable, in-situ, Ambient Batteries for Sensor Networks.",
                    "Optimal sensor channel selection for resource-efficient deep activity recognition.",
                    "Multiple Event Detection using Minimum Inputs: Poster Abstract.",
                    "Protecting User Data Privacy with Adversarial Perturbations: Poster Abstract.",
                    "VoiSense: Harnessing Voice Interaction on a Smartwatch to Collect Sensor Data: Demo Abstract.",
                    "Hands-On IoT Education with Mobile Devices: Demo Abstract.",
                    "Game-Theoretic Optimization of the TSCH Scheduling Function for Low-Power IoT Networks: Poster Abstract.",
                    "Distributed Virtual CPS Environment for K12: Demo Abstract.",
                    "Low-Cost, Perspective Invariant and Personalized Thermal Comfort Estimation: Poster Abstract.",
                    "A Novel Architecture for Semi-Active Wake-Up Radios Attaining Sensitivity Beyond -70 dBm: Demo Abstract.",
                    "User Identification Across Multiple Smart Pill Bottle Systems: Poster Abstract.",
                    "Improving Acoustic Detection and Classification in Mobile and Embedded Platforms: Poster Abstract.",
                    "Non-parametric Bayesian Learning for Newcomer Detection using Footstep-Induced Floor Vibration: Poster Abstract.",
                    "Detecting Human-Induced Changes in Powerline Signals: A Human Sensing System Design: Poster Abstract.",
                    "Are Android Malware Detection Models Adversarially Robust?: Poster Abstract.",
                    "A Multi-source Unsupervised Domain Adaptation Method for Wearable Sensor based Human Activity Recognition: Poster Abstract.",
                    "Designing Adversarial Robust and Explainable Malware Detection System for Android based Smartphones: PhD Forum Abstract.",
                    "User Identification using Smart Pill Bottles: Systems and Machine Learning Models: PhD Forum Abstract.",
                    "Towards Reducing Labeling Efforts in IoT-based Machine Learning Systems: PhD Forum Abstract."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "19th IPSN 2020",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2020",
                "sub_name": "19th ACM/IEEE International Conference on Information Processing in Sensor Networks, IPSN 2020, Sydney, Australia, April 21-24, 2020.",
                "count": 59,
                "papers": [
                    "Message from the IPSN 2020 Organizers.",
                    "Supreme: Fine-grained Radio Map Reconstruction via Spatial-Temporal Fusion Network.",
                    "SateLoc: A Virtual Fingerprinting Approach to Outdoor LoRa Localization using Satellite Images.",
                    "VLD: Smartphone-assisted Vertical Location Detection for Vehicles in Urban Environments.",
                    "Estimating Heart Rate and Detecting Feeding Events of Fish Using an Implantable Biologger.",
                    "E-Jacket: Posture Detection with Loose-Fitting Garment using a Novel Strain Sensor.",
                    "No-frills Water Comfort for Developing Regions.",
                    "MDLdroid: a ChainSGD-reduce Approach to Mobile Deep Learning for Personal Mobile Sensing.",
                    "Fireworks: Channel Estimation of Parallel Backscattered Signals.",
                    "Distributed Slot Scheduling for QoS Guarantee over TSCH-based IoT Networks via Adaptive Parameterization.",
                    "Robust Dynamic Hand Gesture Interaction using LTE Terminals.",
                    "LOCI: Privacy-aware, Device-free, Low-power Localization of Multiple Persons using IR Sensors.",
                    "RFMap: Generating Indoor Maps using RF Signals.",
                    "A Spoof-Proof GPS Receiver∗.",
                    "Group-In: Group Inference from Wireless Traces of Mobile Devices.",
                    "TagAlong: Efficient Integration of Battery-free Sensor Tags in Standard Wireless Networks.",
                    "Continuous Sensing on Intermittent Power.",
                    "SolarFinder: Automatic Detection of Solar Photovoltaic Arrays.",
                    "Efficient Localization of Multiple Intruders in Shared Spectrum System.",
                    "Electric Vehicle Battery Energy Information is Enough to Track You.",
                    "Brake Data-Based Location Tracking in Usage-Based Automotive Insurance Programs.",
                    "Selective Sampling for Sensor Type Classification in Buildings.",
                    "Distributed Human Trajectory Sensing and Partial Similarity Queries.",
                    "OFFICE: Optimization Framework For Improved Comfort & Efficiency.",
                    "Quick (and Dirty) Aggregate Queries on Low-Power WANs.",
                    "All that GLITTERs: Low-Power Spoof-Resilient Optical Markers for Augmented Reality.",
                    "CollabAR: Edge-assisted Collaborative Image Recognition for Mobile Augmented Reality.",
                    "Road Grade Estimation Using Crowd-Sourced Smartphone Data.",
                    "Poster Abstract: a ChainSGD-reduce Approach to Mobile Deep Learning for Personal Mobile Sensing.",
                    "Poster Abstract: A Novel Modeling Involved Security Approach for LoRa Key Generation.",
                    "Poster Abstract: A QoS-aware, Energy-efficient Trajectory Optimization for UAV Base Stations using Q-Learning.",
                    "Poster Abstract: A Weakly Supervised Tracking of Hand Hygiene Technique.",
                    "Poster Abstract: C-Sync: The Resilient Time Synchronization Protocol.",
                    "Poster Abstract: Combating Transceiver Layout Variation in Device-Free WiFi Sensing using Convolutional Autoencoder.",
                    "Poster Abstract: Data Communication using Switchable Privacy Glass.",
                    "Poster Abstract: Don't Wait For Weight: Towards Weight Inference of Passengers and Luggage using Smartphone Camera.",
                    "Poster Abstract: Federated Learning for Speech Emotion Recognition Applications.",
                    "Poster Abstract: Human Detection with Weak Ranging Signal for FMCW Radar Systems.",
                    "Poster Abstract: Multi-Drone Assisted Internet of Things Testbed Based on Bluetooth 5 Communications.",
                    "Poster Abstract: Passive Activity Classification of Smart Homes through Wireless Packet Sniffing.",
                    "Poster Abstract: Robust Calibration for Low-Cost Air Quality Sensors using Historical Data.",
                    "Poster Abstract: Using Deep Learning to Classify The Acceleration Measurement Devices.",
                    "Demo Abstract: Active Structural Occupant Detector.",
                    "Demo Abstract: An Internet of Plants System for Micro Gardens.",
                    "Demo Abstract: Bootstrapping Batteryless Networks Using Fluorescent Light Properties.",
                    "Demo Abstract: Collision Prediction from Pairwise Ranging.",
                    "Demo Abstract: Human Activity Detection with Loose-Fitting Smart Jacket.",
                    "Demo Abstract: Perception vs. Reality - Never Believe in What You See.",
                    "Demo Abstract: RF Soil Moisture Sensing via Radar Backscatter Tags.",
                    "Demo Abstract: Wireless Glasses for Non-contact Facial Expression Monitoring.",
                    "PhD Forum Abstract: Activity Classification at the Edge.",
                    "PhD Forum Abstract: Dynamic Inference on IoT Network Traffic using Programmable Telemetry and Machine Learning.",
                    "PhD Forum Abstract: Energy Harvesting based Sensing for the Batteryless IoT.",
                    "PhD Forum Abstract: Key Generation Scheme for LPWAN IoT devices.",
                    "PhD Forum Abstract: Low-Power Wide-Area Networks: Connect, Sense and Secure.",
                    "PhD Forum Abstract: Scheduling Tasks on Intermittently Powered Systems.",
                    "PhD Forum Abstract: Towards Deep Learning in Signal Translation for Cross Configurations in device-free WiFi Sensing.",
                    "PhD Forum Abstract: Transforming Construction Processes using Internet of Things and Blockchain.",
                    "PhD Forum Abstract: Understanding Deep Model Compression for IoT Devices."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "18th IPSN 2019",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2019",
                "sub_name": "Proceedings of the 18th International Conference on Information Processing in Sensor Networks, IPSN 2019, Montreal, QC, Canada, April 16-18, 2019.",
                "count": 51,
                "papers": [
                    "Recovering bits from thin air: demodulation of bandpass sampled noisy signals for space IoT.",
                    "DeltaVR: achieving high-performance mobile VR dynamics through pixel reuse.",
                    "3D-OmniTrack: 3D tracking with COTS RFID systems.",
                    "Collaborative wideband signal decoding using non-coherent receivers.",
                    "WIDE: physical-level CTC via digital emulation.",
                    "SnapLoc: an ultra-fast UWB-based indoor localization system for an unlimited number of tags.",
                    "Event-triggered natural hazard monitoring with convolutional neural networks on the edge.",
                    "Transferring activity recognition models for new wearable sensors with deep generative domain adaptation.",
                    "SGSF: a small groups based serial fusion method.",
                    "Getting more out of energy-harvesting systems: energy management under time-varying utility with PreAct.",
                    "ALICE: autonomous link-based cell scheduling for TSCH.",
                    "Chorus: UWB concurrent transmissions for GPS-like passive localization of countless targets.",
                    "Automated estimation of link quality for LoRa: a remote sensing approach.",
                    "SmartDashCam: automatic live calibration for DashCams.",
                    "Mic2Mic: using cycle-consistent generative adversarial networks to overcome microphone variability in speech systems.",
                    "Tracking from one side: multi-person passive tracking with WiFi magnitude measurements.",
                    "Capacity over capacitance for reliable energy harvesting sensors.",
                    "Cross-sender bit-mixing coding.",
                    "SoundSemantics: exploiting semantic knowledge in text for embedded acoustic event classification.",
                    "Wireless computer vision using commodity radios.",
                    "TennisEye: tennis ball speed estimation using a racket-mounted motion sensor.",
                    "Quantle: fair and honest presentation coach in your pocket.",
                    "H2B: heartbeat-based secret key generation using piezo vibration sensors.",
                    "Can a phone hear the shape of a room?",
                    "LongShoT: long-range synchronization of time.",
                    "Privacy-preserving control message dissemination for PVCPS: poster abstract.",
                    "Synchronous automatic training for wearable sensors via knowledge distillation: poster abstract.",
                    "A maximal correlation embedding method for multilabel human context recognition: poster abstract.",
                    "Array resource allocation based on KKT optimization for radar and communication integration: poster abstract.",
                    "SoftLoRa - a LoRa-based platform for accurate and secure timing: poster abstract.",
                    "Vehicle dispatching for sensing coverage optimization in mobile crowdsensing systems: poster abstract.",
                    "Unsupervised anomaly detection via generative adversarial networks: poster abstract.",
                    "I2C considered wasteful: saving energy with host-controlled pull-up resistors: poster abstract.",
                    "Evaluation of a LoRa mesh wireless networking system supporting time-critical transmission and data lost recovery: poster abstract.",
                    "Gait health monitoring through footstep-induced floor vibrations: poster abstract.",
                    "An automated real-time and affordable airborne pollen sensing system: poster abstract.",
                    "Multi-channel software-based MAC protocol for UWSNs.",
                    "On-device training from sensor data on batteryless platforms: poster abstract.",
                    "IoT enabled Wi-Fi indoor positioning system using raster maps: poster abstract.",
                    "Carrier scheduling in IoT networks with interoperable battery-free backscatter tags: poster abstract.",
                    "A long-lifetime sensor platform for a reliable internet of things: demo abstract.",
                    "Secure pairing via video and IMU verification: demo abstract.",
                    "The dual processor platform architecture: demo abstract.",
                    "Low power, portable and infrastructure light indoor UWB ranging solution: demo.",
                    "Fast feedback control and coordination with mode changes for wireless cyber-physical systems: demo abstract.",
                    "A testbed for long-range LoRa communication: demo abstract.",
                    "A sensor-fusion approach system for detecting early extravasation of infant intravenous infusion: demo abstract.",
                    "TotTernary - a wearable platform for social interaction tracking: demo abstract.",
                    "SnapLoc: an ultra-fast UWB-based indoor localization system for an unlimited number of tags: demo abstract.",
                    "How many climb the matterhorn?: demo abstract.",
                    "Deskbuddy: an office activity detection system: demo abstract."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "17th IPSN 2018",
        "info": "Porto, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2018",
                "sub_name": "Proceedings of the 17th ACM/IEEE International Conference on Information Processing in Sensor Networks, IPSN 2018, Porto, Portugal, April 11-13, 2018.",
                "count": 50,
                "papers": [
                    "Plug-and-play irrigation control at scale.",
                    "Walkway discovery from large scale crowdsensing.",
                    "Monitoring meteorological parameters with crowdsourced air traffic control data.",
                    "On the ability of mobile sensor networks to diffuse information.",
                    "Continuous wireless link rates for internet of things.",
                    "Charm: exploiting geographical diversity through coherent combining in low-power wide-area networks.",
                    "Codecast: supporting data driven in-network processing for low-power wireless sensor networks.",
                    "Interference-resilient ultra-low power aperiodic data collection.",
                    "A stitch in time and frequency synchronization saves bandwidth.",
                    "Smart saline management system: poster abstract.",
                    "Trainko: poster abstract: train arrival time prediction system for Sri Lanka.",
                    "Attributed-based authentication and access control for IoT home devices: demo abstract.",
                    "Emeasure: using a smart device with consumer-grade accelerometer as an accurate measuring scale: demo abstract.",
                    "An iterative approach for non-line-of-sight error mitigation in UWB localization: poster abstract.",
                    "Pulse shot: photo shooting and retrieval system using heartbeat information: poster abstract.",
                    "Fast indoor localization using WiFi channel state information: poster abstract.",
                    "Energy efficient mobile data collection from sensor networks with range-dependent data rates: poster abstract.",
                    "Applications on the signpost platform for city-scale sensing: demo abstract.",
                    "Multiple door opening/closing detection system using infrasound sensor: poster abstract.",
                    "Runtime adaptation of PHY settings for dependable UWB communications: poster abstract.",
                    "Battery-free 802.15.4 receiver: demo abstract.",
                    "Towards smaller checkpoints for better intermittent computing: poster abstract.",
                    "A motion-triggered stereo camera for 3D experience capture: demo abstract.",
                    "Federated authentication of things: demo abstract.",
                    "The openchirp low-power wide-area network and ecosystem: demo abstract.",
                    "A tool to access and visualize classroom attendance data from a smart campus: demo abstract.",
                    "Road quality classification for road repair authorities and regular drivers, using an on-board data logger: poster abstract.",
                    "Posepair: pairing IoT devices through visual human pose analysis: demo abstract.",
                    "Welcome to my world: demystifying multi-user AR with the cloud: demo abstract.",
                    "Walkway discovery from large scale crowdsensing: demo abstract.",
                    "Zero-power receiver for touch communication and touch sensing: poster abstract.",
                    "Reliable push notification for mobile users in interactive smart mobile applications: poster abstract.",
                    "Building IoT nodes - a flexible approach: poster abstract.",
                    "Long-term energy-neutral operation of solar energy-harvesting sensor nodes under time-varying utility: poster abstract.",
                    "Toward fast closed-loop control over multi-hop low-power wireless networks: poster abstract.",
                    "Combining LoRa and RTK to achieve a high precision self-sustaining geo-localization system: poster abstract.",
                    "An efficient approach to multisuperframe tuning for DSME networks: poster abstract.",
                    "Battery-free 802.15.4 receiver.",
                    "Glimpse.3D: a motion-triggered stereo body camera for 3D experience capture and preview.",
                    "The signpost platform for city-scale sensing.",
                    "Using deep data augmentation training to address software and hardware heterogeneities in wearable and smartphone sensing devices.",
                    "Moving convolutional neural networks to embedded systems: the alexnet and VGG-16 case.",
                    "Data-driven monitoring and optimization of classroom usage in a smart campus.",
                    "ODDS: real-time object detection using depth sensors on embedded GPUs.",
                    "Slocalization: sub-μW ultra wideband backscatter localization.",
                    "Magnitude-based angle-of-arrival estimation, localization, and target tracking.",
                    "Data fusion for hybrid and autonomous time-of-flight positioning.",
                    "Nanosecond-precision time-of-arrival estimation for aircraft signals with low-cost SDR receivers.",
                    "Enhancing indoor smartphone location acquisition using floor plans.",
                    "Orientation-aware RFID tracking with centimeter-level accuracy."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "16th IPSN 2017",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2017",
                "sub_name": "Proceedings of the 16th ACM/IEEE International Conference on Information Processing in Sensor Networks, IPSN 2017, Pittsburgh, PA, USA, April 18-21, 2017.",
                "count": 57,
                "papers": [
                    "Coresets for differentially private k-means clustering and applications to privacy in mobile sensor networks.",
                    "MinHash hierarchy for privacy preserving trajectory sensing and query.",
                    "Density-aware compressive crowdsensing.",
                    "PrOLoc: resilient localization with private observers using partial homomorphic encryption.",
                    "Natural timestamping using powerline electromagnetic radiation.",
                    "SCAN: learning speaker identity from noisy sensor data.",
                    "Synchronous dynamic view learning: a framework for autonomous training of activity recognition models using wearable sensors.",
                    "Griassdi: mutually assisted slotless neighbor discovery.",
                    "BLEnd: practical continuous neighbor discovery for Bluetooth low energy.",
                    "Panoptes: servicing multiple applications simultaneously using steerable cameras.",
                    "3D through-wall imaging with unmanned aerial vehicles using wifi.",
                    "VideoMec: a metadata-enhanced crowdsourcing system for mobile videos.",
                    "Argus: realistic target coverage by drones.",
                    "Kryptein: a compressive-sensing-based encryption scheme for the internet of things.",
                    "Pitchln: eavesdropping via intelligible speech reconstruction using non-acoustic sensor fusion.",
                    "SurfaceVibe: vibration-based tap & swipe tracking on ubiquitous surfaces.",
                    "HarvOS: efficient code instrumentation for transiently-powered embedded sensing.",
                    "Fast and robust GPS fix using one millisecond of data.",
                    "Calibration-free network localization using non-line-of-sight ultra-wideband measurements.",
                    "Non-intrusive blood glucose monitor by multi-task deep learning: PhD forum abstract.",
                    "Crowd sensing with execution uncertainty: PhD forum abstract.",
                    "Separating heartbeats from multiple people on one bed using geophones: PhD forum abstract.",
                    "PrOLoc: resilient localization with private observers using partial homomorphic encryption: demo abstract.",
                    "A LoRa wireless mesh networking module for campus-scale monitoring: demo abstract.",
                    "A LoRa wireless smart badge for enhancing museum visitors' experience: demo abstract.",
                    "Understanding slotless neighbor discovery: demo abstract.",
                    "A wireless sensor network simulator focuses on imitating wireless charging vehicle: demo abstract.",
                    "Conflict detection in online textual health advice: demo abstract.",
                    "Natural timestamping using electrical power grid: demo abstract.",
                    "Cyber-physical ad: an audience-aware signage sensing and interacting system based on internet of things technologies: demo abstract.",
                    "Phase-gain IC based novel design of tidal breathing pattern sensor for pulmonary disease diagnostics: demo abstract.",
                    "HB-phone: a bed-mounted geophone-based heartbeat monitoring system: demo abstract.",
                    "IASA - indoor air quality sensing and automation: demo abstract.",
                    "Mobile sensing to improve medication adherence: demo abstract.",
                    "Panoptes : a cheap, extensible, open-source multi-camera tracking system: demo abstract.",
                    "Video streaming in multi-hop aerial networks: demo abstract.",
                    "Block cycle length-based asymmetric rendezvous protocol for IoT applications: poster abstract.",
                    "Zoning by mobility: evaluating city administrative regions by taxi data: poster abstract.",
                    "Using low-cost, non-sensor-equipped BLE beacons to track people's movements: poster abstract.",
                    "An adaptive-delay transmission strategy of a fixed-interval wireless reporting application: poster abstract.",
                    "Long-term monitoring of cane-toads using acoustic sensors: poster abstract.",
                    "3D activity localization with multiple sensors: poster abstract.",
                    "CAR - a deep learning structure for concurrent activity recognition: poster abstract.",
                    "Sleep scheduling in wireless powered industrial wireless sensor networks: poster abstract.",
                    "Analysis and evaluation of driving behavior recognition based on a 3-axis accelerometer using a random forest approach: poster abstract.",
                    "KLEP: a kernel level energy profiling tool for Android: poster abstract.",
                    "Long term occupancy estimation in a commercial space: an empirical study: poster abstract.",
                    "User authentication using wrist mounted inertial sensors: poster abstract.",
                    "E-loc: indoor localization through building electric wiring: poster abstract.",
                    "A beverage intake tracking system based on machine learning algorithms, and ultrasonic and color sensors: poster abstract.",
                    "Interdependent component framework for simulating indoor internet-of-things systems (intercom): poster abstract.",
                    "Improving RGB-D SLAM using wi-fi: poster abstract.",
                    "Empirical research on behavior change promoted by information technology: poster abstract.",
                    "Range-based localization in underwater wireless sensor networks using deep neural network: poster abstract.",
                    "Improved reverse localization schemes for underwater wireless sensor networks: poster abstract.",
                    "Prolonging global connectivity in group-based industrial wireless sensor networks: poster abstract.",
                    "Hybrid and adaptive drone identification through motion actuation and vision feature matching: poster abstract."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "15th IPSN 2016",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2016",
                "sub_name": "15th ACM/IEEE International Conference on Information Processing in Sensor Networks, IPSN 2016, Vienna, Austria, April 11-14, 2016.",
                "count": 68,
                "papers": [
                    "Accurate Power Quality Monitoring in Microgrids.",
                    "Burnout: A Wearable System for Unobtrusive Skeletal Muscle Fatigue Estimation.",
                    "Characterizing the Accuracy of a Self-Synchronized Reverse-GPS Wildlife Localization System.",
                    "CrossZig: Combating Cross-Technology Interference in Low-Power Wireless Networks.",
                    "DeepX: A Software Accelerator for Low-Power Deep Learning Inference on Mobile Devices.",
                    "Demonstration Abstract: A Novel Human Tracking and Localization System Based on Pyroelectric Infrared Sensors.",
                    "Demonstration Abstract: Accelerating Embedded Deep Learning Using DeepX.",
                    "Demonstration Abstract: Automated Resource Allocation for T-Res.",
                    "Demonstration Abstract: Enabling Robust Data Collection in Unplanned Cross-Technology Interference of Urban Environments.",
                    "Demonstration Abstract: IoTSuite - A Framework to Design, Implement, and Deploy IoT Applications.",
                    "Demonstration Abstract: Platform for Benchmarking RF-Based Indoor Localization Solutions.",
                    "Demonstration Abstract: Real-Time Indoor Localization with TDOA and Distributed Software Defined Radio.",
                    "Demonstration Abstract: Research Platform for Visible Light Communication and Sensing Systems.",
                    "Frame Counter: Achieving Accurate and Real-Time Link Estimation in Low Power Wireless Sensor Networks.",
                    "Generic Route Repair: Augmenting Wireless Ad Hoc Sensor Networks for Local Connectivity.",
                    "Harmonium: Asymmetric, Bandstitched UWB for Fast, Accurate, and Robust Indoor Localization.",
                    "HB-Phone: A Bed-Mounted Geophone-Based Heartbeat Monitoring System.",
                    "HeadScan: A Wearable System for Radio-Based Sensing of Head and Mouth-Related Activities.",
                    "Highly Reliable Signal Strength-Based Boundary Crossing Localization in Outdoor Time-Varying Environments.",
                    "Indoor Tracking Using Crowdsourced Maps.",
                    "MAGIC: Model-Based Actuation for Ground Irrigation Control.",
                    "Oppcast: Exploiting Spatial and Channel Diversity for Robust Data Collection in Urban Environments.",
                    "Ph.D. Forum Abstract: A Scalable Testbed Infrastructure for Embedded Industrial Wireless Sensor and Actuator Networks.",
                    "Ph.D. Forum Abstract: Accurate and Robust Low-Cost GNSS Localization.",
                    "Ph.D. Forum Abstract: Activity-Based Implicit Authentication for Wearable Devices.",
                    "Ph.D. Forum Abstract: Ambient Backscatter Communication.",
                    "Ph.D. Forum Abstract: Back to the Future - Sustainable Transiently Powered Embedded Systems.",
                    "Ph.D. Forum Abstract: Increasing Robustness in WSN Using Software Defined Network Architecture.",
                    "Ph.D. Forum Abstract: Modeling and Evaluation of Dependable Wireless Sensor Networks.",
                    "Ph.D. Forum Abstract: Scalable Wireless Networks for Industrial Control Systems with Time and Reliability Constraints.",
                    "Ph.D. Forum Abstract: Tracking Inefficient Power Usages in WSN by Monitoring the Network Firmware.",
                    "Poster Abstract: A Framework for Chainsaw Detection Using One-Class and WSNs.",
                    "Poster Abstract: A Heterogeneous System Architecture for Event-Triggered Wireless Sensing.",
                    "Poster Abstract: An Efficient Authentication Model in Smart Grid Networks.",
                    "Poster Abstract: An Embedded Gateway with Mobile Network Connectivity Can Talk Directly to Cloud Storage.",
                    "Poster Abstract: An Extremely Long Standby Time Wireless Sensor System for Debris Flow Monitoring.",
                    "Poster Abstract: An Ultra-Low Power Wake up Radio with Addressing and Retransmission Capabilities for Advanced Energy Efficient MAC Protocols.",
                    "Poster Abstract: Architecture Proposal for Heterogeneous, BLE-Based Sensor and Actuator Networks for Easy Management of Smart Homes.",
                    "Poster Abstract: Automatic Calibration of Device Attitude in Inertial Measurement Unit Based Traffic Probe Vehicles.",
                    "Poster Abstract: BouKey: Location-Based Key Sharing Using Visible Light Communication.",
                    "Poster Abstract: DeGas - Toxic Gas Boundary Area Detection in Industrial Wireless Sensor Networks.",
                    "Poster Abstract: Efficient Visual Positioning with Adaptive Parameter Learning.",
                    "Poster Abstract: Enhanced Real-Time Transmission Using Time Gain in Wireless Sensor Networks.",
                    "Poster Abstract: Exploiting Temporal Variation of Received Radio Signal Strength for Indoor Human Tracking.",
                    "Poster Abstract: Human Tracking and Activity Monitoring Using 60 GHz mmWave.",
                    "Poster Abstract: Improving the BLE Mesh Transmissions with User Collaboration in Smart Spaces Management.",
                    "Poster Abstract: KinetiSee - A Perpetual Wearable Camera Acquisition System with a Kinetic Harvester.",
                    "Poster Abstract: LocaLight - A Battery-Free Passive Localization System Using Visible Light.",
                    "Poster Abstract: MagoNode++ - A Wake-Up-Radio-Enabled Wireless Sensor Mote for Energy-Neutral Applications.",
                    "Poster Abstract: Node Deployment Mechanism for Quick, Indoor, and Device-Free Localization.",
                    "Poster Abstract: Personal Energy Footprint in Shared Building Environment.",
                    "Poster Abstract: Piezoelectric Energy Harvesting Powered WSN for Aircraft Structural Health Monitoring.",
                    "Poster Abstract: Scaling IoT Device APIs and Analytics.",
                    "Poster Abstract: Sleep Scheduling with Toxic Gas Coverage Requirement in Large-Scale Industry.",
                    "Poster Abstract: SmileWave - Sensing and Analysis of Smile-Based Emotional Contagion over Social Network.",
                    "Poster Abstract: The Impact of User Engagement in the Effectiveness of Energy Saving Programs.",
                    "Poster Abstract: The TWECIS Testbed Architecture.",
                    "Poster Abstract: Wake-Up Receivers for Energy Efficient and Low Latency Communication.",
                    "Poster Abstract: WSNLOC.EU - An Introduction to WSN Localization Tasks Repository.",
                    "Recursive Ground Truth Estimator for Social Data Streams.",
                    "RNFD: Routing-Layer Detection of DODAG (Root) Node Failures in Low-Power Wireless Networks.",
                    "Sensor-Assisted Face Recognition System on Smart Glass via Multi-View Sparse Representation Classification.",
                    "System Design for a Synergistic, Low Power Mote/BLE Embedded Platform.",
                    "TinySDM: Software Defined Measurement in Wireless Sensor Networks.",
                    "Topic-Aware Social Sensing with Arbitrary Source Dependency Graphs.",
                    "VibID: User Identification through Bio-Vibrometry.",
                    "Walkie-Talkie: Motion-Assisted Automatic Key Generation for Secure On-Body Device Communication.",
                    "WiWho: WiFi-Based Person Identification in Smart Spaces."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "14th IPSN 2015",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2015",
                "sub_name": "Proceedings of the 14th International Conference on Information Processing in Sensor Networks, IPSN 2015, Seattle, WA, USA, April 14-16, 2015.",
                "count": 75,
                "papers": [
                    "TIIM: technology-independent interference mitigation for low-power wireless networks.",
                    "Decentralized multichannel medium access control: viewing desynchronization as a convex optimization method.",
                    "Bringing multi-antenna gain to energy-constrained wireless devices.",
                    "Optimal placement of protective jammers for securing wireless transmissions in a geographic domain.",
                    "RAMP: accelerating wireless sensor hardware design with a reconfigurable analog/mixed-signal platform.",
                    "SunaPlayer: high-accuracy emulation of solar cells.",
                    "A software-defined sensor architecture for large-scale wideband spectrum monitoring.",
                    "ORBIT: a smartphone-based platform for data-intensive embedded sensing applications.",
                    "Tongue-n-cheek: non-contact tongue gesture recognition.",
                    "Hand hygiene duration and technique recognition using wrist-worn sensors.",
                    "Graph scale-space theory for distributed peak and pit identification.",
                    "Cost-aware compressive sensing for networked sensing systems.",
                    "PIR sensors: characterization and novel localization technique.",
                    "Radio-based device-free activity recognition with radio frequency interference.",
                    "dRTI: directional radio tomographic imaging.",
                    "A realistic evaluation and comparison of indoor location technologies: experiences and lessons learned.",
                    "Debiasing crowdsourced quantitative characteristics in local businesses and services.",
                    "Scalable social sensing of interdependent phenomena.",
                    "QueueVadis: queuing analytics using smartphones.",
                    "Feeder: supporting last-mile transit with extreme-scale urban infrastructure data.",
                    "Geo-referenced proximity detection of wildlife with WildScope: design and characterization.",
                    "How hot is piping hot?: lower energy consumption with smarter hot water delivery.",
                    "Samba: a smartphone-based robot system for energy-efficient aquatic environment monitoring.",
                    "Reducing multi-hop calibration errors in large-scale mobile sensor networks.",
                    "TARDIS: software-only system-level record and replay in wireless sensor networks.",
                    "SIFT: building an internet of safe things.",
                    "SIoT: securing the internet of things through distributed system analysis.",
                    "Radio signature based posture recognition using WBSN.",
                    "Intelligent diagnostic framework using HMMs and mel-frequency cepstral coefficients applied to wind power machine.",
                    "Link weight based truth discovery in social sensing.",
                    "Wind speed and direction estimation using manifold approximation.",
                    "STIM: smart train infrastructure monitoring.",
                    "Using wearable equipment to construct monitoring maps in large-scale petrochemical plants.",
                    "Screen dynamics analysis-based adaptive frame skipping for efficient mobile screen sharing.",
                    "Design insights for a mobile based sensor application framework: for aiding platform independent algorithm design.",
                    "Improving WSNs sleep scheduling mechanism with SDN-like architecture.",
                    "FuzzyCAT: a novel procedure for refining the F-transform based sensor data compression.",
                    "Detecting malicious morphological alterations of ECG signals in body sensor networks.",
                    "Structural sensing system with networked dynamic sensing configuration.",
                    "Secure brightness/contrast filter using fully homomorphic encryption.",
                    "CleanHands: an integrated monitoring system for control of hospital acquired infections.",
                    "A model for semantic localization.",
                    "Improving the error drift of inertial navigation based indoor location tracking.",
                    "Towards enabling concurrent transmissions in heterogeneous networks.",
                    "Road congestion sensing via crowdsourcing and MapReduce.",
                    "Predictable wireless embedded platforms.",
                    "Wake-up flooding: an asynchronous network flooding primitive.",
                    "SiCILIA: a smart sensor system for clothing insulation inference using heat exchange.",
                    "CheepSync: a time synchronization service for resource constrained bluetooth low energy advertisers.",
                    "WiFi positioning with propagation-based calibration.",
                    "Spatio-temporal analysis of state-of-charge streams for electric vehicles.",
                    "Vehicle detection and speed estimation with PIR sensors.",
                    "BioMeSensi: a wearable multi-sensing platform for bio-medical applications.",
                    "Enabling plug-n-play for the internet of things with self describing devices.",
                    "Step-level person localization through sparse sensing of structural vibration.",
                    "Robust vision-based indoor localization.",
                    "A column matching based algorithm for target self-localization using beacon nodes.",
                    "Fleye on the car: big data meets the internet of things.",
                    "A web-based camera dispatch system for video surveillance with dynamic requirements.",
                    "Extensible modular wireless sensor and actuator network and IoT platform with plug&play module connection.",
                    "Detecting and localizing border crossings using RF links.",
                    "A smart helmet for network level early warning in large scale petrochemical plants.",
                    "SiCILIA: a smart sensor system for clothing insulation inference using heat exchange.",
                    "A participatory transport trip quality measurement system.",
                    "A low-cost sensor platform for large-scale wideband spectrum monitoring.",
                    "Health-optimal routing in urban areas.",
                    "Software-only system-level record and replay in wireless sensor networks.",
                    "RAMP: accelerating wireless sensor hardware design with a reconfigurable analog/mixed-signal platform.",
                    "Decentralized time-synchronized channel swapping.",
                    "Exploration and topological mapping with Hexbugs.",
                    "Detecting deterioration of nearsightness.",
                    "Games of drones: an affective game with cyber-physical systems.",
                    "RUBreathing: non-contact real time respiratory rate monitoring system.",
                    "Wearable sensor grid architecture for body posture and surface detection and rehabilitation.",
                    "From spotting the difference to spotting your difference."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "13th IPSN 2014",
        "info": "Berlin, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2014",
                "sub_name": "IPSN'14, Proceedings of the 13th International Symposium on Information Processing in Sensor Networks (part of CPS Week), April 15-17, 2014, Berlin, Germany.",
                "count": 63,
                "papers": [
                    "Fine-grained remote monitoring, control and pre-paid electrical service in rural microgrids.",
                    "Aquatic debris monitoring using smartphone-based robotic sensors.",
                    "Airplanes aloft as a sensor network for wind forecasting.",
                    "Using humans as sensors: an estimation-theoretic perspective.",
                    "One meter to find them all: water network leak localization using a single flow meter.",
                    "Non-invasive respiration rate monitoring using a single COTS TX-RX pair.",
                    "Identifying drug (cocaine) intake events from acute physiological response in the presence of free-living physical activity.",
                    "Bringing up OpenSky: a large-scale ADS-B sensor network for research.",
                    "TempLab: a testbed infrastructure to study the impact of temperature on wireless sensor networks.",
                    "RESONATE: reverberation environment simulation for improved classification of speech models.",
                    "CSense: a stream-processing toolkit for robust and high-rate mobile sensing applications.",
                    "Lightweight map matching for indoor localisation using conditional random fields.",
                    "PiLoc: a self-calibrating participatory indoor localization system.",
                    "Energy efficient GPS acquisition with sparse-gps.",
                    "Optimal sensor placement and measurement of wind for water quality studies in urban reservoirs.",
                    "Lightweight neighborhood cardinality estimation in dynamic wireless networks.",
                    "Fast and fine-grained counting and identification via constructive interference in WSNs.",
                    "P3: a practical packet pipeline using synchronous transmissions for wireless sensor networks.",
                    "Cyclic network automata and cohomological waves.",
                    "SIPs: solar irradiance prediction system.",
                    "Face recognition on smartphones via optimised sparse representation classification.",
                    "Visual light landmarks for mobile devices.",
                    "Sensors with lasers: building a WSN power grid.",
                    "Poster abstract: practical limits of wifi time-of-flight echo techniques.",
                    "Poster abstract: MaWi: a hybrid magnetic and wi-fi system for scalable indoor localization.",
                    "Poster abstract: water level estimation in urban ultrasonic/passive infrared flash flood sensor networks using supervised learning.",
                    "Poster abstract: Implications of target diversity for organic device-free localization.",
                    "Poster abstract: eNav: a smartphone-based energy efficient vehicular navigation system.",
                    "Poster abstract: PiMi air community: : getting fresher indoor air by sharing data and know-hows.",
                    "Poster abstract: a decentralized routing scheme based on a zero-sum game to optimize energy in solar powered sensor networks.",
                    "Poster abstract: a MAC protocol for medical applications.",
                    "Poster abstract: supporting heterogeneous LCD/camera links.",
                    "Poster abstract: EIL: an environment-independent device-free passive localization approach.",
                    "Poster abstract: smartphone support for persons who stutter.",
                    "Poster abstract: SADSense: personalized mobile sensing for seasonal effects on health.",
                    "Poster abstract: static analysis of device drivers in TinyOS.",
                    "Poster abstract: a harmony of sensors: achieving determinism in multi-application sensor networks.",
                    "Poster abstract: precision improvement of aircrafts attitude estimation through gyro sensors data fusion in a redundant inertial measurement unit.",
                    "Poster abstract: information-maximizing data collection in social sensing using named-data.",
                    "Poster abstract: NDP: a novel device-free localization method with little efforts.",
                    "Poster abstract: directional transmissions and receptions for burst forwarding using disjoint paths.",
                    "Poster abstract: a location aware personalized smart control system.",
                    "Demonstration abstract: Crowdmeter: predicting performance of crowd-sensing applications using emulations.",
                    "Demonstration abstract: OpenSky: a large-scale ADS-B sensor network for research.",
                    "Demonstration abstract: PyoT, a macroprogramming framework for the IoT.",
                    "Demonstration abstract: automatic radio map construction exploiting annotated walking trajectories.",
                    "Demonstration abstract: applying industrial wireless sensor networks to welder machine system.",
                    "Demonstration abstract: a MEMS-based airflow sensor network.",
                    "Demonstration abstract: automatic speech recognition for resource-constrained embedded systems.",
                    "Demonstration abstract: airfeed: indoor real time interactive air quality monitoring system.",
                    "Demonstration abstract: PiMi air box: a cost-effective sensor for participatory indoor quality monitoring.",
                    "Demonstration abstract: simply RIOT: teaching and experimental research in the internet of things.",
                    "Demonstration abstract: Crowdsourced indoor localization and navigation with anyplace.",
                    "Demonstration abstract: a lightweight, portable device with integrated USB-host support for reprogramming wireless sensor nodes.",
                    "Demonstration abstract: positioning by synchronized IR light.",
                    "Demonstration abstract: participatory sensing enabled environmental monitoring in smart cities.",
                    "Demonstration abstract: sensor mockup experiments with SmartLab.",
                    "Demonstration abstract: an 8x8 mm2 bluetooth low energy wireless motion-sensing platform.",
                    "Demonstration abstract: enabling WSN nodes to send data to smartmobiles by blinking LEDs.",
                    "Demonstration abstract: submetering by synthesizing side-channel sensor streams.",
                    "Demonstration abstract: how many lights do you see?",
                    "Demonstration abstract: BioWatch: a wrist watch based physiological signal acquisition system.",
                    "Demonstration abstract: upper body motion capture system using inertial sensors."
                ]
            },
            {
                "sub_name_abbr": "conf/ipsn/2014ubicitec",
                "sub_name": "Proceedings of the 5th International Workshop on Networks of Cooperating Objects for Smart Cities (UBICITEC 2014) co-located with CPSWeek 2014, Berlin, Germany, Apr 14, 2014.",
                "count": 8,
                "papers": [
                    "Distributed Agent-based Dynamic State Estimation over a Lossy Network.",
                    "ANIMO, Framework to simplify the real-time distributed communication.",
                    "A Platform for Wildfire Fighting: A Comprehensive Approach.",
                    "Cooperation of Smart Objects and Urban Operators for Smart City Applications.",
                    "Cyber-Physical Software Systems for Smart Worlds: A Case Study of Intelligent Transportation System.",
                    "Rainbow: an Intelligent Platform for Large-Scale Networked Cyber-Physical Systems.",
                    "On the Classification of Cyberphysical Smart Objects in the Internet of Things.",
                    "Self-learning assessment of communication in distributed embedded systems - a feasibility study."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "12th IPSN 2013",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2013",
                "sub_name": "The 12th International Conference on Information Processing in Sensor Networks (co-located with CPS Week 2013), IPSN 2013, Philadelphia, PA, USA, April 8-11, 2013.",
                "count": 55,
                "papers": [
                    "Sensemaking for mobile health.",
                    "Aerial robot swarms.",
                    "Challenges in modeling cyber-physical systems.",
                    "A fresh perspective: learning to sparsify for detection in massive noisy sensor networks.",
                    "Autonomous place naming system using opportunistic crowdsensing and knowledge from crowdsourcing.",
                    "Matchstick: a room-to-room thermal model for predicting indoor temperature from wireless sensor data.",
                    "Low power counting via collaborative wireless communications.",
                    "SoNIC: classifying interference in 802.15.4 sensor networks.",
                    "Camazotz: multimodal activity-based GPS sampling.",
                    "SCPL: indoor device-free multi-subject counting and localization using radio signal strength.",
                    "Volcanic earthquake timing using wireless sensor networks.",
                    "In-pavement wireless weigh-in-motion.",
                    "FixtureFinder: discovering the existence of electrical and water fixtures.",
                    "Strip, bind, and search: a method for identifying abnormal energy consumption in buildings.",
                    "Nemo: a high-fidelity noninvasive power meter system for wireless sensor networks.",
                    "FlockLab: a testbed for distributed, synchronized tracing and profiling of wireless embedded systems.",
                    "A comprehensive compiler-assisted thread abstraction for resource-constrained systems.",
                    "A real-time auto-adjustable smart pillow system for sleep apnea detection and treatment.",
                    "MARS: a muscle activity recognition system enabling self-configuring musculoskeletal sensor networks.",
                    "POEM: power-efficient occupancy-based energy management system.",
                    "Acoustic shockwave-based bearing estimation.",
                    "Radio tomographic imaging and tracking of stationary and moving people via kernel distance.",
                    "Using wearable inertial sensors for posture and position tracking in unconstrained environments through learned translation manifolds.",
                    "SugarMap: location-less coverage for micro-aerial sensing swarms.",
                    "Think globally, act locally: on the reshaping of information landscapes.",
                    "Energy-efficient low power listening for wireless sensor networks in noisy environments.",
                    "MediaScope: selective on-demand media retrieval from mobile devices.",
                    "Demo abstract: networking algorithms on a resource-limited distributed mobile embedded system.",
                    "Demo abstract: EnergyLab: building energy testbed for demand-response.",
                    "Demo abstract: a radio tomographic system for real-time multiple people tracking.",
                    "Demo abstract: a magnetic field-based appliance metering system.",
                    "Demo abstract: netamorph: field-programmable analog arrays for energy-efficient sensor networks.",
                    "Demo abstract: distributed debugging architecture for wireless sensor networks.",
                    "Demo abstract: mediascope: selective on-demand media retrieval from mobile devices.",
                    "Demo abstract: low capacity devices with semantic interfaces.",
                    "Demo abstract - Nemo: a high-fidelity noninvasive power meter system for wireless sensor networks.",
                    "Demo abstract - Skitracker: measuring skiing performance using a body-area network.",
                    "Poster abstract: connected wireless camera network deployment with visibility coverage.",
                    "Poster abstract: ASFECs: using approximately synchronized fetch-and-execute cycles as basic operation cycles for wireless sensor networks.",
                    "Poster abstract: managing road lighting with a hitchhiking sensor system.",
                    "Poster abstract: a mobile-cloud service for physiological anomaly detection on smartphones.",
                    "Poster abstract: Range-based localization in sensor networks: localizability and accuracy.",
                    "Poster abstract: SmartRoad: a crowd-sourced traffic regulator detection and identification system.",
                    "Poster abstract: a machine learning approach for vehicle classification using passive infrared and ultrasonic sensors.",
                    "Poster abstract: extensible sensor network solutions for visitor identification and tracking.",
                    "Poster abstract: human localization and activity detection using thermopile sensors.",
                    "Poster abstract: studied wind sensor nodes deployment towards accurate data fusion for ship movement controlling.",
                    "Poster abstract: enabling a cloud-based logging service for ball screw with an autonomous networked sensor system.",
                    "Poster abstract: high throughput data collection with topology adaptability in wireless sensor network.",
                    "Poster abstract: exploiting nonlinear data similarities-a multi-scale nearest-neighbor approach for adaptive sampling in wireless pollution sensor networks.",
                    "Poster abstract: occupancy estimation using real and virtual sensors.",
                    "Poster abstract: human tracking based on LRF and wearable IMU data fusion.",
                    "Poster abstract: ASWP: a long-term WSN deployment for environmental monitoring.",
                    "Poster abstract: virtualizing external wireless sensors for designing personalized smartphone services.",
                    "Poster abstract: voxnet acoustic array for multiple bird source separation by beamforming using measured data."
                ]
            },
            {
                "sub_name_abbr": "conf/ipsn/2013conet",
                "sub_name": "Proceedings of 4th International Workshop on Networks of Cooperating Objects for Smart Cities 2013, Philadelphia, USA, April 8, 2013.",
                "count": 7,
                "papers": [
                    "Smart Lighting in Multipurpose Outdoor Environments: Energy Efficient Solution using Network of Cooperating Objects.",
                    "A Sensing Platform for High Visibility of the Datacenter.",
                    "Towards the Coexistence of Divergent Applications on Smart City Sensing Infrastructure.",
                    "Cooperating Objects Design Space and Markets.",
                    "Automated Evaluation of RF-based Indoor Localization Systems.",
                    "makeSense: Real-world Business Processes through Wireless Sensor Networks.",
                    "STaR: a Reconfigurable and Transparent middleware for WSNs security."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "11th IPSN 2012",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2012",
                "sub_name": "The 11th International Conference on Information Processing in Sensor Networks (co-located with CPS Week 2012), IPSN 2012, Beijing, China, April 16-19, 2012.",
                "count": 60,
                "papers": [
                    "In-situ soil moisture sensing: measurement scheduling and estimation using compressive sensing.",
                    "Efficient cross-correlation via sparse representation in sensor networks.",
                    "Closing the loop: a simple distributed method for control over wireless networks.",
                    "@scale: insights from a large, long-lived appliance energy WSN.",
                    "Simbeeotic: a simulator and testbed for micro-aerial vehicle swarm experiments.",
                    "TriopusNet: automating wireless sensor network deployment and replacement in pipeline monitoring.",
                    "Collaborative calibration and sensor placement for mobile sensor networks.",
                    "Detecting faulty street lamps with illumination maps.",
                    "Fault detection in wireless sensor networks: a hybrid approach.",
                    "Cyclic network automata for indoor sensor network.",
                    "TDOA sensor pairing in multi-hop sensor networks.",
                    "The low-power wireless bus: simplicity is (again) the soul of efficiency.",
                    "Effectively modeling data from large-area community sensor networks.",
                    "MARS: a muscle activity recognition system using inertial sensors.",
                    "Sensorcam: an energy-efficient smart wireless camera for environmental monitoring.",
                    "Extreme learning machine for wireless indoor localization.",
                    "Efficient background subtraction for tracking in embedded camera networks.",
                    "Distributed sparse approximation for frog sound classification.",
                    "Ambulatory real-time micro-sensor motion capture.",
                    "Light-weight network health monitoring.",
                    "Understanding city dynamics by manifold learning correlation analysis.",
                    "Cybermussels: a biological sensor network using freshwater mussels.",
                    "Direct multi-hop time synchronization with constructive interference.",
                    "Pair-wise reference-free fault detection in wireless sensor networks.",
                    "Crane charades: behavior identification via backpack mounted sensor platforms.",
                    "Exploiting human mobility trajectory information in indoor device-free passive tracking.",
                    "A beamforming method for multiple source DOA estimation, spectrum separation and localization from field data.",
                    "Multi-channel communication vs. adaptive routing for reliable communication in WSNs.",
                    "Shipping data from heterogeneous protocols on packet train.",
                    "Histogram distance-based radio tomographic localization.",
                    "BlimpProbe: an aerial surveillance platform.",
                    "MiDebug: microcontroller integrated development and debugging environment.",
                    "Sensor-enabled yo-yos as new musical instruments.",
                    "A compact, inexpensive, and battery-powered software-defined radio platform.",
                    "Simbeeotic: a simulation-emulation platform for large scale micro-aerial swarms.",
                    "Free-form text summarization in social sensing.",
                    "PhotoNet+: outlier-resilient coverage maximization in visual sensing applications.",
                    "Collaborative indoor sensing with the sensorfly aerial sensor network.",
                    "Ultra-constrained sensor platform interfacing.",
                    "An energy harvesting nonvolatile sensor node and its application to distributed moving object detection.",
                    "AudioDAQ: turning the mobile phone's headset port into a universal data acquisition interface.",
                    "Scaling the wireless AC power meter.",
                    "RF time-of-flight ranging on commodity software radios.",
                    "Personal building controls.",
                    "SEPTIMU: continuous in-situ human wellness monitoring and feedback using sensors embedded in earphones.",
                    "Strawman: resolving collisions in bursty low-power wireless networks.",
                    "pTunes: runtime parameter adaptation for low-power MAC protocols.",
                    "Low power, low delay: opportunistic routing meets duty cycling.",
                    "Grafting energy-harvesting leaves onto the sensornet tree.",
                    "Improving RF-based device-free passive localization in cluttered indoor environments through probabilistic classification methods.",
                    "Design and evaluation of a wireless magnetic-based proximity detection platform for indoor applications.",
                    "On truth discovery in social sensing: a maximum likelihood estimation approach.",
                    "SunCast: fine-grained prediction of natural sunlight levels for improved daylight harvesting.",
                    "An effective coreset compression algorithm for large scale sensor networks.",
                    "mPuff: automated detection of cigarette smoking puffs from respiration measurements.",
                    "Accuracy-aware aquatic diffusion process profiling using robotic sensor networks.",
                    "Error-resilient and complexity-constrained distributed coding for large scale sensor networks.",
                    "Fully wireless implementation of distributed beamforming on a software-defined radio platform.",
                    "Magneto-inductive networked rescue system (MINERS): taking sensor networks underground.",
                    "Sensing through the continent: towards monitoring migratory birds using cellular sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "10th IPSN 2011",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2011",
                "sub_name": "Proceedings of the 10th International Conference on Information Processing in Sensor Networks, IPSN 2011, April 12-14, 2011, Chicago, IL, USA.",
                "count": 59,
                "papers": [
                    "Sensor networks for the detection and tracking of radiation and other threats in cities.",
                    "The next big one: Detecting earthquakes and other rare events from community-based sensors.",
                    "Overcomplete Radon bases for target property management in sensor networks.",
                    "WiFlock: Collaborative group discovery and maintenance in mobile sensor networks.",
                    "Exploration of path space using sensor network geometry.",
                    "Probabilistic addressing: Stable addresses in unstable wireless networks.",
                    "Efficient network flooding and time synchronization with Glossy.",
                    "In-pavement wireless sensor network for vehicle classification.",
                    "Continuous inference of psychological stress from sensory measurements collected in the natural environment.",
                    "A prototype of sensor network visualization application with geographic information.",
                    "Demo abstract: Radio-diversity collection tree protocol.",
                    "EcoCast: Interactive, object-oriented macroprogramming for networks of ultra-compact wireless sensor nodes.",
                    "Demo abstract: Feature-rich platform for WSN design space exploration.",
                    "Architecture for a fully distributed Wireless Control Network.",
                    "Demo abstract: Closed-loop testing for implantable cardiac pacemakers.",
                    "Demo abstract, the next big one: Detecting earthquakes and other rare events from community-based sensors.",
                    "Demo abstract: R.A.V.E.N. - Remote autonomous vehicle explorer network.",
                    "EnRoute: An energy router for energy-efficient buildings.",
                    "DustDoctor: A self-healing sensor data collection system.",
                    "Apollo: Towards factfinding in participatory sensing.",
                    "Demo abstract: AutoPlug - An automotive test-bed for ECU testing, validation and verification.",
                    "EcoIMU: A compact, wireless, gyro-free inertial measurement unit based on two triaxial accelerometers.",
                    "PhotoNet: A similarity-aware image delivery service for situation awareness.",
                    "Demo abstract: Online detection of speaking from respiratory measurements collected in the natural environment.",
                    "Demo abstract: Efficient data retrieval for interactive browsing of large sensor network data sets.",
                    "Demo abstract: Debugging wireless sensor network simulations with YETI and COOJA.",
                    "Demo abstract: A service-oriented application programming interface for sensor network virtualization.",
                    "Demo abstract: Diagnostic tracing of wireless sensor networks with TinyTracer.",
                    "Poster abstract: Three plane localization.",
                    "Poster abstract: Message position modulation for power saving and increased bandwidth in sensor networks.",
                    "Near-real-time analysis for REACTS.",
                    "Cross-platform wireless sensor network development.",
                    "Multi-purpose passive debugging for embedded wireless.",
                    "Hardware platform for wireless geophysical monitoring.",
                    "Power watermarking: Facilitating power-based diagnosis of node silence in remote high-end sensing systems.",
                    "Poster abstract: A congestion mitigation approach using mobile nodes in Wireless Sensor Networks.",
                    "Modeling an electronically switchable directional antenna for low-power wireless networks.",
                    "Poster abstract: A channel quality metric for interference-aware wireless sensor networks.",
                    "Poster abstract: Accurate monitoring of circardian rhythms using wearable Body Sensor Networks.",
                    "LinkBench: Benchmark and metric framework for wireless sensor networks.",
                    "Proposed long-distance communication in sensor network using weak radio waves and DSP.",
                    "JamLab: Augmenting sensornet testbeds with realistic and controlled interference generation.",
                    "Is there light at the ends of the tunnel? Wireless sensor networks for adaptive lighting in road tunnels.",
                    "IMUSim: A simulation environment for inertial sensing algorithm design and evaluation.",
                    "SpiderBat: Augmenting wireless sensor networks with distance and angle information.",
                    "SensorFly: Controlled-mobile sensing platform for indoor emergency response applications.",
                    "Ultra-low power time synchronization using passive radio receivers.",
                    "Duty-cycling buildings aggressively: The next frontier in HVAC control.",
                    "OBSERVE: Occupancy-based system for efficient reduction of HVAC energy.",
                    "Radio diversity for reliable communication in WSNs.",
                    "Reconstruction of the correct temporal order of sensor network data.",
                    "Foresee (4C): Wireless link prediction using link features.",
                    "Unified broadcast in sensor networks.",
                    "Convex programming based robust localization in NLOS prone cluttered environments.",
                    "Localising speech, footsteps and other sounds using resource-constrained devices.",
                    "Sequential Monte Carlo for simultaneous passive device-free tracking and sensor localization using received signal strength measurements.",
                    "μSETL: A set based programming abstraction for wireless sensor networks.",
                    "EcoCast: Interactive, object-oriented macroprogramming for networks of ultra-compact wireless sensor nodes.",
                    "Fast-Lipschitz optimization with wireless sensor networks applications."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "9th IPSN 2010",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2010",
                "sub_name": "Proceedings of the 9th International Conference on Information Processing in Sensor Networks, IPSN 2010, April 12-16, 2010, Stockholm, Sweden.",
                "count": 73,
                "papers": [
                    "Programming storage-centric sensor networks with Squirrel.",
                    "Distributed genetic evolution in WSN.",
                    "Slotted programming for sensor networks.",
                    "Consensus-based distributed linear support vector machines.",
                    "On-line sensing task optimization for shared sensors.",
                    "Information processing for live photo mosaic with a group of wireless image sensors.",
                    "Robust uncorrelated bit extraction methodologies for wireless sensors.",
                    "Self-identifying sensor data.",
                    "A system for distributed event detection in wireless sensor networks.",
                    "Ear-phone: an end-to-end participatory urban noise mapping system.",
                    "Diagnostic powertracing for sensor node failure analysis.",
                    "Hibernets: energy-efficient sensor networks using analog signal processing.",
                    "Lakon: a middle-ground approach to high-frequency data acquisition and in-network processing in sensor networks.",
                    "High-resolution, low-power time synchronization an oxymoron no more.",
                    "Multichannel reliability assessment in real world WSNs.",
                    "T-check: bug finding for sensor networks.",
                    "KleeNet: discovering insidious interaction bugs in wireless sensor networks before deployment.",
                    "Run time assurance of application-level requirements in wireless sensor networks.",
                    "Bayesian optimization for sensor set selection.",
                    "Online distributed sensor selection.",
                    "Covering space for in-network sensor data storage.",
                    "Collaborative signal processing for action recognition in body sensor networks: a distributed classification algorithm using motion transcripts.",
                    "Distributed estimation of linear acceleration for improved accuracy in wireless inertial motion capture.",
                    "Markov-optimal sensing policy for user state estimation in mobile devices.",
                    "Routing without routes: the backpressure collection protocol.",
                    "Data stashing: energy-efficient information delivery to mobile sinks through trajectory prediction.",
                    "Addressing burstiness for reliable communication and latency bound generation in wireless sensor networks.",
                    "i-MAC - a MAC that learns.",
                    "Adaptive IEEE 802.15.4 protocol for energy efficient, reliable and timely communications.",
                    "Practical modeling and prediction of radio coverage of indoor sensor networks.",
                    "U-connect: a low-latency energy-efficient asynchronous neighbor discovery protocol.",
                    "The design considerations of a sensor grid for monitoring precipitation in debris-flow-prone areas.",
                    "Emergency response MAC protocol (ER-MAC) for wireless sensor networks.",
                    "Statistical vector based point-to-point routing in wireless networks.",
                    "Energy optimization framework for WSN design.",
                    "Monitoring quantity and quality of sleeping using WISPs.",
                    "Long-range detection in acoustic sensor networks.",
                    "sMAP: simple monitoring and actuation profile.",
                    "Image sensing under unfavorable photographic conditions with a group of wireless image sensors.",
                    "A hardware-based remote attestation protocol in wireless sensor networks.",
                    "Exploiting protocol models for generating feasible communication stack configurations.",
                    "Using meta-code for building task-specific WSNs.",
                    "Neighbor tables in sensor network routing.",
                    "AEGIS: a rule based framework for traffic gatekeeping in wireless sensor networks.",
                    "Energy-efficient localization for virtual fencing.",
                    "Collecting sensor data using compressed IPFIX.",
                    "Architecture for redundant knowledge reduction in embedded fuzzy rule-based systems into wireless sensor network nodes.",
                    "Alternative path creation vs data rate reduction for congestion mitigation in wireless sensor networks.",
                    "User-centric radio power control for opportunistic mountain hiking networks.",
                    "Energy hole prevention in wireless sensor networks.",
                    "Software verification for TinyOS.",
                    "Localization based on stochastic optimization and RSSI measurements.",
                    "Distributed RSSI processing for intrusion detection in indoor environments.",
                    "Low-power wireless IPv6 routing with ContikiRPL.",
                    "Discovering routine events in sensor streams for macroscopic sensing composition.",
                    "TOSPIE2: tiny operating system plug-in for energy estimation.",
                    "Towards a framework for a versatile wireless multimedia sensor network platform.",
                    "MobiSense: power-efficient micro-mobility in IPv6-based sensor networks.",
                    "Experimental evaluation of multi-hop routing protocols for wireless sensor networks.",
                    "A platform for implantable medical device validation.",
                    "Enabling energy efficient continuous sensing on mobile phones with LittleRock.",
                    "Run-time compilation of bytecode in wireless sensor networks.",
                    "SenPro: concurrent system profiling for wireless sensor networks.",
                    "A vehicular surveillance and sensing system for car security and tracking applications.",
                    "My Tai-Chi book: a virtual-physical social network platform.",
                    "Demonstrating principal component aggregation for distributed spatial pattern recognition.",
                    "RatMote: a sensor platform for animal habitat monitoring.",
                    "Appliance activity monitoring using wireless sensors.",
                    "Multi-modal fall detection within the WeCare framework.",
                    "Smart antennas made practical: the SPIDA way.",
                    "Augmenting reality with IP-based sensor networks.",
                    "Hibernets: energy-efficient sensor networks using analog signal processing.",
                    "Real-time burst event detection in water distribution systems."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "8th IPSN 2009",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2009",
                "sub_name": "Proceedings of the 8th International Conference on Information Processing in Sensor Networks, IPSN 2009, April 13-16, 2009, San Francisco, California, USA.",
                "count": 66,
                "papers": [
                    "Secure and highly-available aggregation queries in large-scale sensor networks via set sampling.",
                    "Dialog codes for secure wireless communications.",
                    "Transient-based identification of wireless sensor nodes.",
                    "Gradient clock synchronization in wireless sensor networks.",
                    "Event-triggered distributed optimization in sensor networks.",
                    "Recovering temporal integrity with Data Driven Time Synchronization.",
                    "Automating rendezvous and proxy selection in sensornets.",
                    "Archetype-based design: Sensor network programming for application experts, not just programming experts.",
                    "Distributed resource management and matching in sensor networks.",
                    "Predictive QoS routing to mobile sinks in wireless sensor networks.",
                    "Greedy routing with guaranteed delivery using Ricci flows.",
                    "On hierarchical routing in wireless sensor networks.",
                    "Application-informed radio duty-cycling in a re-taskable multi-user sensing system.",
                    "Energy efficient sensor data logging with amnesic flash storage.",
                    "Improving the speed and scalability of distributed simulations of sensor networks.",
                    "Simultaneous placement and scheduling of sensors.",
                    "Algebraic approach to recovering topological information in distributed camera networks.",
                    "Near-optimal Bayesian localization via incoherence and sparsity.",
                    "Sensor ranking: A primitive for efficient content-based sensor search.",
                    "Approximating sensor network queries using in-network summaries.",
                    "Peer-to-peer estimation over wireless sensor networks via Lipschitz optimization.",
                    "Design and implementation of a high-fidelity AC metering network.",
                    "PermaDAQ: A scientific instrument for precision sensing and data recovery in environmental extremes.",
                    "Monitoring heritage buildings with wireless sensor networks: The Torre Aquila deployment.",
                    "Secure-TWS: Authenticating node to multi-user communication in shared sensor networks.",
                    "Anti-jamming for embedded wireless networks.",
                    "SENESCOPE: A design tool for cost optimization of wireless sensor nodes.",
                    "Radio interferometric Quasi Doppler bearing estimation.",
                    "PDA: Passive distributed assertions for sensor networks.",
                    "Enabling large-scale storage in sensor networks with the Coffee file system.",
                    "Poster abstract: Measuring traffic in short-term construction work zones.",
                    "Poster abstract: Energy management in wireless healthcare systems.",
                    "Poster abstract: IP-based testbed for herd monitoring.",
                    "Poster abstract: Multi-channel interference in wireless sensor networks.",
                    "Poster abstract: Exploiting the LQI variance for rapid channel quality assessment.",
                    "Poster abstract: Gesture recognition via continuous maximum entropy training on accelerometer data.",
                    "Poster abstract: Distributed fault detection using a recurrent neural network.",
                    "Poster abstract: A distributed algorithm to compute spatial skyline in wireless sensor networks.",
                    "Poster abstract: MDP framework for sensor network coordination.",
                    "Poster abstract: Making sensor data available using Web feeds.",
                    "Poster abstract: Multihop routing in camera sensor networks - An experimental study.",
                    "Poster abstract: BioLogger: A wireless physiological monitoring and logging system.",
                    "Poster abstract: Ultra wideband biomedical wireless sensor neworks using wavelet lifting for image transmission.",
                    "Post abstract: Role-based deceptive detection and filtering in WSNs.",
                    "Poster abstract: Community sensor grids deployment and usage.",
                    "Poster abstract: Enabling reliable and high-fidelity data center sensing.",
                    "Poster abstract: On the spatial characteristics of the gray region for 802.15.4 radios.",
                    "Poster abstract: Practical issues in image acquisition and transmission over wireless sensor network.",
                    "Poster abstract: Reliable data collection from mobile users for real-time clinical monitoring.",
                    "Demo abstract: An ultra-compact and multiple channel protocol for ultra-tiny wireless sensor nodes.",
                    "Demo abstract: Fusion of audio and image information for efficient object detection and capture.",
                    "Demo abstract: IEEE 802.15.4a-based anchor-free mobile node localization system.",
                    "Demo abstract: Operating a sensor network at 3500 m above sea level.",
                    "Demo abstract: Design and implementation of a web service for liteos-based sensor networks.",
                    "Demo abstract: Application of WINTeR industrial testbed to the analysis of closed-loop control systems in wireless sensor networks.",
                    "Demo abstract: Sensornet checkpointing between simulated and deployed networks.",
                    "Demo abstract: Embedded Virtual Machines for wireless industrial automation.",
                    "Demo abstract: The Sensor Andrew infrastructure for large-scale campus-wide sensing and actuation.",
                    "Demo abstract: Towards continuous tracking: Low-power communication and fail-safe presence assurance.",
                    "Demo abstract: A Trusted Platform based framework for participatory sensing.",
                    "Demo abstract: ControlCity - Integrating wireless sensor networks and building management systems.",
                    "Demo abstract: Signal reconstruction with subnyquist sampling using wireless sensor networks.",
                    "Demo abstract: Discovering services in mobile, flexible and heterogeneous wireless sensor networks.",
                    "Demo abstract: Laser-based trace-gas chemical sensors for distributed wireless sensor networks.",
                    "Demo abstract: A high-fidelity sensor network simulator using accurate CC2420 model.",
                    "Demo abstract: SWAT: Know your network."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "7th IPSN 2008",
        "info": "St. Louis, Missouri, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2008",
                "sub_name": "Proceedings of the 7th International Conference on Information Processing in Sensor Networks, IPSN 2008, St. Louis, Missouri, USA, April 22-24, 2008.",
                "count": 63,
                "papers": [
                    "Passive Localization: Large Size Sensor Network Localization Based on Environmental Events.",
                    "Moving-Baseline Localization.",
                    "Pareto Frontiers of Sensor Networks for Localization.",
                    "A Wireless Sensor Network for Real-Time Indoor Localisation and Motion Monitoring.",
                    "Y-MAC: An Energy-Efficient Multi-channel MAC Protocol for Dense Wireless Sensor Networks.",
                    "On the Network Coding Advantage for Wireless Multicast in Euclidean Space.",
                    "A Practical Multi-channel Media Access Control Protocol for Wireless Sensor Networks.",
                    "Effects of Correlated Shadowing: Connectivity, Localization, and RF Tomography.",
                    "Sensor Selection for Minimizing Worst-Case Prediction Error.",
                    "Towards Real-Time Information Processing of Sensor Network Data Using Computationally Efficient Multi-output Gaussian Processes.",
                    "Composable Information Gradients in Wireless Sensor Networks.",
                    "Distributed Online Simultaneous Fault Detection for Multiple Sensors.",
                    "ACE in the Hole: Adaptive Contour Estimation Using Collaborating Mobile Sensors.",
                    "Alert: An Adaptive Low-Latency Event-Driven MAC Protocol for Wireless Sensor Networks.",
                    "Fountain Codes Based Distributed Storage Algorithms for Large-Scale Wireless Sensor Networks.",
                    "Joint Routing and 2D Transform Optimization for Irregular Sensor Network Grids Using Wavelet Lifting.",
                    "LOCALE: Collaborative Localization Estimation for Sparse Mobile Sensor Networks.",
                    "On Boundary Recognition without Location Information in Wireless Sensor Networks.",
                    "Using Echo State Networks for Anomaly Detection in Underground Coal Mines.",
                    "The LiteOS Operating System: Towards Unix-Like Abstractions for Wireless Sensor Networks.",
                    "TinyECC: A Configurable Library for Elliptic Curve Cryptography in Wireless Sensor Networks.",
                    "Towards Energy Efficient Design of Multi-radio Platforms for Wireless Sensor Networks.",
                    "Deriving State Machines from TinyOS Programs Using Symbolic Execution.",
                    "Energy Metering for Free: Augmenting Switching Regulators for Real-Time Monitoring.",
                    "TRANSACT: A Transactional Framework for Programming Wireless Sensor/Actor Networks.",
                    "Opportunistic Aggregation over Duty Cycled Communications in Wireless Sensor Networks.",
                    "Real-Time Human Posture Reconstruction in Wireless Smart Camera Networks.",
                    "SensorScope: Out-of-the-Box Environmental Monitoring.",
                    "When Timing Matters: Enabling Time Accurate and Scalable Simulation of Sensor Network Applications.",
                    "On the Design of MAC Protocols for Low-Latency Hard Real-Time Discrete Control Applications over 802.15.4 Hardware.",
                    "VoxNet: An Interactive, Rapidly-Deployable Acoustic Monitoring Platform.",
                    "The Energy Endoscope: Real-Time Detailed Energy Accounting for Wireless Sensor Nodes.",
                    "HERMES: A Software Architecture for Visibility and Control in Wireless Sensor Network Deployments.",
                    "Design, Modeling, and Capacity Planning for Micro-solar Power Sensor Networks.",
                    "Koala: Ultra-Low Power Data Retrieval in Wireless Sensor Networks.",
                    "Data Discovery and Dissemination with DIP.",
                    "Seluge: Secure and DoS-Resistant Code Dissemination in Wireless Sensor Networks.",
                    "Rateless Deluge: Over-the-Air Programming of Wireless Sensor Networks Using Random Linear Codes.",
                    "Design and Implementation of a Dual-Camera Wireless Sensor Network for Object Retrieval.",
                    "Toward Community Sensing.",
                    "Identification of Low-Level Point Radiation Sources Using a Sensor Network.",
                    "On the Use of Mutual Information to Compare the Performance of Wireless Sensor Networks in Detection Applications.",
                    "High Performance Sleep-Wake Sensor Systems Based on Cyclic Cellular Automata.",
                    "Air Quality Monitoring with SensorMap.",
                    "Asynchronous Neighbor Discovery: Finding Needles of Connectivity in Haystacks of Time.",
                    "BehaviorScope: Real-Time Remote Human Monitoring Using Sensor Networks.",
                    "Cyclic Cellular Automata: A Tool for Self-Organizing Sleep Scheduling in Sensor Networks.",
                    "Demonstration of Active Guidance with SmartCane.",
                    "Demonstration of Location Information Based Network.",
                    "Demonstration of a WSN Application in Relic Protection and an Optimized System Deployment Tool.",
                    "Demonstration of a Wireless Sensor Network for Real-Time Indoor Localisation and Motion Monitoring.",
                    "EcoDAQ: A Densely Distributed, High Bandwidth Wireless Data Acquisition System.",
                    "Epic: An Open Mote Platform for Application-Driven Design.",
                    "Faithful Reconstruction of Application Behavior Based on Event Traces in the LiteOS Operating System.",
                    "Image Registration in Low Resolution Visual Sensor Networks.",
                    "Interference Detection and Mitigation in IEEE 802.15.4 Networks.",
                    "Locomotion Monitoring Using Body Sensor Networks.",
                    "MetroNet: Case Study for Collaborative Data Sharing on the World Wide Web.",
                    "Missouri S&T Mote-Based Demonstration of Energy Monitoring Solution for Network Enabled Manufacturing Using Wireless Sensor Networks (WSN).",
                    "Secure and DoS-Resistant Code Dissemination in Wireless Sensor Networks Using Seluge.",
                    "SenseWorld: Towards Cyber-Physical Social Networks.",
                    "Sensible Doctor - A Mobile Diagnosis Tool for Wireless Sensor Networks.",
                    "Tiny Web Services for Sensor Device Interoperability."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "6th IPSN 2007",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2007",
                "sub_name": "Proceedings of the 6th International Conference on Information Processing in Sensor Networks, IPSN 2007, Cambridge, Massachusetts, USA, April 25-27, 2007.",
                "count": 75,
                "papers": [
                    "The worst-case capacity of wireless sensor networks.",
                    "DESYNC: self-organizing desynchronization and TDMA on wireless sensor networks.",
                    "Improving wireless simulation through noise modeling.",
                    "A control theory approach to throughput optimization in multi-channel collection sensor networks.",
                    "An empirical study of collaborative acoustic source localization.",
                    "Localization in wireless sensor networks.",
                    "Robust system multiangulation using subspace methods.",
                    "Underground structure monitoring with wireless sensor networks.",
                    "Blind calibration of sensor networks.",
                    "Differential nested lattice encoding for consensus problems.",
                    "Distributed consensus and linear functional calculation in networks: an observability perspective.",
                    "Robust message-passing for statistical inference in sensor networks.",
                    "A platform for ubiquitous sensor deployment in occupational and domestic environments.",
                    "mPlatform: a reconfigurable architecture and efficient data sharing mechanism for modular sensor nodes.",
                    "A higher capability sensor node platform suitable for demanding applications.",
                    "RETOS: resilient, expandable, and threaded operating system for wireless sensor networks.",
                    "Interface contracts for TinyOS.",
                    "Beacon location service: a location service for point-to-point routing in wireless sensor networks.",
                    "Worldsens: development and prototyping tools for application specific wireless sensors networks.",
                    "Micro power meter for energy monitoring of wireless sensor networks at scale.",
                    "SenQ: a scalable simulation and emulation environment for sensor networks.",
                    "The design and evaluation of a mobile sensor/actuator network for autonomous animal control.",
                    "Energy-optimized image communication on resource-constrained sensor platforms.",
                    "LaserSPECks: : laser SPECtroscopic trace-gas sensor networks - sensor integration and applications.",
                    "Exact distributed Voronoi cell computation in sensor networks.",
                    "Maximizing the data utility of a data archiving & querying system through joint coding and scheduling.",
                    "Health monitoring of civil infrastructures using wireless sensor networks.",
                    "PIPENETa wireless sensor network for pipeline monitoring.",
                    "The impact of quasi-equally spaced sensor layouts on field reconstruction.",
                    "Hybrid transition density approximation for efficient recursive prediction of nonlinear dynamic systems.",
                    "Wireless localization using self-organizing maps.",
                    "Energy-efficient routing for signal detection under the Neyman-Pearson criterion in wireless sensor networks.",
                    "Energy-efficient coverage for target detection in wireless sensor networks.",
                    "A spatial sampling scheme based on innovations diffusion in sensor networks.",
                    "Distributed sparse random projections for refinable approximation.",
                    "Harbor: software-based memory protection for sensor nodes.",
                    "Lucid dreaming: reliable analog event detection for energy-constrained applications.",
                    "MeshEye: a hybrid-resolution smart camera mote for applications in distributed intelligent surveillance.",
                    "Design and implementation of a wireless sensor network for intelligent light control.",
                    "A compact, high-speed, wearable sensor network for biomotion capture and interactive media.",
                    "Active sensing platform for wireless structural health monitoring.",
                    "Approximate isocontours and spatial summaries for sensor networks.",
                    "FlashDB: dynamic self-tuning database for NAND flash.",
                    "Hierarchical spatial gossip for multi-resolution representations in sensor networks.",
                    "Sparse data aggregation in sensor networks.",
                    "Communicating via fireflies: geographic routing on duty-cycled sensors.",
                    "Dozer: ultra-low power data gathering in sensor networks.",
                    "Link layer support for unified radio power management in wireless sensor networks.",
                    "Power scheduling for wireless sensor and actuator networks.",
                    "MiniSec: a secure sensor network communication architecture.",
                    "The regiment macroprogramming system.",
                    "Channel surfing: defending wireless sensor networks from interference.",
                    "Object tracking in the presence of occlusions via a camera network.",
                    "Probabilistic detection of mobile targets in heterogeneous sensor networks.",
                    "Tracking multiple targets using binary proximity sensors.",
                    "Aggregator-centric QoS for body sensor networks.",
                    "A sensor-cyber network testbed for plume detection, identification, and tracking.",
                    "sChat: a group communication service over wireless sensor networks.",
                    "Distributed algorithms for multi-robot systems.",
                    "Building a sensor network of mobile phones.",
                    "NIST smart data flow system II: speaker localization.",
                    "Worldsens: from lab to sensor network application development and deployment.",
                    "SMILE: distributed middleware for event stream processing.",
                    "Acoustic source localization using the acoustic ENSBox.",
                    "Demonstration of image compression in a low-bandwidth wireless camera network.",
                    "The RETOS operating system: kernel, tools and applications.",
                    "A group tour guide system with RFIDs and wireless sensor networks.",
                    "Wearable wireless sensor network to assess clinical status in patients with neurological disorders.",
                    "SPOTWorld and the Sun SPOT.",
                    "Movement Analysis in Rock-Climbers.",
                    "UMR mote-based demonstration of wireless sensor networking protocols using pneumatic testbed.",
                    "Wireless sensors, sensing wireless (WSSW) for the characterization of multipath fading.",
                    "A low-complexity, compact antenna for mitigating frequency-selective fading.",
                    "A sensor network architecture for the IP enterprise.",
                    "etop: sensor network application energy profiling on the LEAP2 platform."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "5th IPSN 2006",
        "info": "Nashville, Tennessee, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2006",
                "sub_name": "Proceedings of the Fifth International Conference on Information Processing in Sensor Networks, IPSN 2006, Nashville, Tennessee, USA, April 19-21, 2006.",
                "count": 62,
                "papers": [
                    "Security in sensor networks: industry trends, present and future research directions.",
                    "Near-optimal sensor placements: maximizing information while minimizing communication cost.",
                    "Utility based sensor selection.",
                    "Global connectivity from local geometric constraints for sensor networks with various wireless footprints.",
                    "Simultaneous localization, calibration, and tracking in an ad hoc sensor network.",
                    "Distributed localization of networked cameras.",
                    "Data gathering tours in sensor networks.",
                    "Decentralized compression and predistribution via randomized gossiping.",
                    "Active learning for adaptive mobile sensing networks.",
                    "Geographic gossip: efficient aggregation for sensor networks.",
                    "Differential games in large-scale sensor-actuator networks.",
                    "Active wireless sensing for rapid information retrieval in sensor networks.",
                    "Kinetically stable task assignment for networks of microservers.",
                    "Random distributed multiresolution representations with significance querying.",
                    "Slip surface localization in wireless sensor networks for landslide prediction.",
                    "Beyond SensorWebs: closing the loop in network embedded systems.",
                    "Coverage for target localization in wireless sensor networks.",
                    "Error propagation in dense wireless networks with cooperation.",
                    "Compressive wireless sensing.",
                    "Sweeps over wireless sensor networks.",
                    "CAPTRA: coordinated packet traceback.",
                    "On the interdependence of sensing and estimation complexity in sensor networks.",
                    "A space-time diffusion scheme for peer-to-peer least-squares estimation.",
                    "Universal distributed sensing via random projections.",
                    "Sensor networks and inverse scattering.",
                    "Analytic modeling of detection latency in mobile sensor networks.",
                    "Effects of A-D conversion nonidealities on distributed sampling in dense sensor networks.",
                    "SmartGossip: an improved randomized broadcast protocol for sensor networks.",
                    "Sleep scheduling and lifetime maximization in sensor networks: fundamental limits and optimal solutions.",
                    "Structuring contention-based channel access in wireless sensor networks.",
                    "eSENSE: energy efficient stochastic sensing framework scheme for wireless sensor platforms.",
                    "An architecture for distributed wavelet analysis and processing in sensor networks.",
                    "A sensory grammar for inferring behaviors in sensor networks.",
                    "Sensing the channel: sensor networks with shared sensing and communications.",
                    "Design and testing of robust acoustic arrays for localization and enhancement of several bird sources.",
                    "CRBcast: a collaborative rateless scheme for reliable and energy-efficient broadcasting in wireless sensor networks.",
                    "Energy-driven detection scheme with guaranteed accuracy.",
                    "Secure code distribution in dynamically programmable wireless sensor networks.",
                    "A linear programming approach to NLOS error mitigation in sensor networks.",
                    "Energy-efficient data representation and routing for wireless sensor networks based on a distributed wavelet compression algorithm.",
                    "A robustness analysis of multi-hop ranging-based localization approximations.",
                    "Securing the deluge Network programming system.",
                    "Channel allocation strategies for wireless sensors statically deployed in multipath environments.",
                    "Tapper: a lightweight scripting engine for highly constrained wireless sensor nodes.",
                    "Tinker: a tool for designing data-centric sensor networks.",
                    "TinyNode: a comprehensive platform for wireless sensor network applications.",
                    "The uPart experience: The uPart experience.",
                    "Ultra-low power data storage for sensor networks.",
                    "Probing the mystery of the highest energy cosmic particles with a large distributed observatory.",
                    "A 15 - 15 mm, 1 µA, reliable sensor-net module: enabling application-specific nodes.",
                    "Miniaturization platform for wireless sensor nodes based on 3D-packaging technologies.",
                    "Kansei: a testbed for sensing at scale.",
                    "Trio: enabling sustainable and scalable outdoor wireless sensor network deployments.",
                    "Marionette: using RPC for interactive development and debugging of wireless embedded networks.",
                    "A spreadsheet approach to programming and managing sensor networks.",
                    "Sdlib: a sensor network data and communications library for rapid and robust application development.",
                    "Node density independent localization.",
                    "The low power energy aware processing (LEAP)embedded networked sensor system.",
                    "Address-event imagers for sensor networks: evaluation and modeling.",
                    "Towards radar-enabled sensor networks.",
                    "A sensor network for social dynamics.",
                    "Wireless adhoc sensor and actuator networks on the farm."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "4th IPSN 2005",
        "info": "Los Angeles, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2005",
                "sub_name": "Proceedings of the Fourth International Symposium on Information Processing in Sensor Networks, IPSN 2005, April 25-27, 2005, UCLA, Los Angeles, California, USA.",
                "count": 69,
                "papers": [
                    "Data fusion in sensor networks.",
                    "Maximizing the functional lifetime of sensor networks.",
                    "Maximizing system lifetime in wireless sensor networks.",
                    "Towards optimal sleep scheduling in sensor networks for rare-event detection.",
                    "Dynamic wake-up and topology maintenance protocols with spatiotemporal guarantees.",
                    "Building up to macroprogramming: an intermediate language for sensor networks.",
                    "Beyond event handlers: programming wireless sensors with attributed state machines.",
                    "A robust architecture for distributed inference in sensor networks.",
                    "A scheme for robust distributed sensor fusion based on average consensus.",
                    "The effects of ranging noise on multihop localization: an empirical study.",
                    "Statistical model of lossy links in wireless sensor networks.",
                    "Robust statistical methods for securing wireless localization in sensor networks.",
                    "Attack-resistant location estimation in sensor networks.",
                    "Snow crashing the diamond age: mobile devices meet sensor networks.",
                    "Ubiquitous access to distributed data in large-scale sensor networks through decentralized erasure codes.",
                    "Communication and sensing trade-offs in decentralized mobile sensor networks: a cross-layer design approach.",
                    "Sensing capacity for discrete sensor network applications.",
                    "Approximate distributed kalman filtering in sensor networks with quantifiable performance.",
                    "Adaptive statistical sampling methods for decentralized estimation and detection of localized phenomena.",
                    "The sensor selection problem for bounded uncertainty sensing models.",
                    "On the optimal density for real-time data gathering of spatio-temporal processes in sensor networks.",
                    "Sensor configuration and activation for field detection in large sensor arrays.",
                    "Lazy inference on object identities in wireless sensor networks.",
                    "Distributed particle filter with GMM approximation for multiple targets localization and tracking in wireless sensor network.",
                    "Lifetime-aware intrusion detection under safeguarding constraints.",
                    "Tracking on a graph.",
                    "Estimation in sensor networks: a graph approach.",
                    "Detecting cuts in sensor networks.",
                    "Lossy network correlated data gathering with high-resolution coding.",
                    "Robustness vs. efficiency in sensor networks.",
                    "Quantizer design and distributed encoding algorithm for source localization in sensor networks.",
                    "Analysis of a wireless sensor dropping problem in wide-area environmental monitoring.",
                    "Virtual patrol: a new power conservation design for surveillance using sensor networks.",
                    "Coverage and hole-detection in sensor networks via homology.",
                    "A key pre-distribution scheme using deployment knowledge for wireless sensor networks.",
                    "Geographic routing with limited information in sensor networks.",
                    "Efficient routing with small buffers in dense networks.",
                    "Ecolocation: a sequence based technique for RF localization in wireless sensor networks.",
                    "QoM and lifetime-constrained random deployment of sensor networks for minimum energy consumption.",
                    "On target tracking with binary proximity sensors.",
                    "A self-reorganizing slot allocation protocol for multi-cluster sensor networks.",
                    "Fading observation alignment via feedback.",
                    "Rope: robust position estimation in wireless sensor networks.",
                    "Matched source-channel communication for field estimation in wireless sensor networks.",
                    "A family of distributed space-time trellis codes with asynchronous cooperative diversity.",
                    "Robust computation of aggregates in wireless sensor networks: distributed randomized algorithms and analysis.",
                    "Scalable topology control for deployment-support networks.",
                    "Telos: enabling ultra-low power wireless research.",
                    "The development of a novel minaturized modular platform for wireless sensor networks.",
                    "Networked infomechanical systems: a mobile embedded networked sensor platform.",
                    "Mobile agent middleware for sensor networks: an application case study.",
                    "Some sensor network elements for ubiquitous computing.",
                    "Mass: modular architecture for sensor systems.",
                    "Eco: an ultra-compact low-power wireless sensor node for real-time motion monitoring.",
                    "Robomote: enabling mobility in sensor networks.",
                    "A compact modular wireless sensor platform.",
                    "Experiences and directions in pushpin computing.",
                    "eBlocks - an enabling technology for basic sensor based systems.",
                    "Global scale sensor networks - opportunities and challenges.",
                    "The Intel Mote platform: a bluetooth-based sensor network for industrial monitoring.",
                    "The particle computer system.",
                    "XYZ: a motion-enabled, power aware sensor node platform for distributed sensor network applications.",
                    "Design considerations for solar energy harvesting wireless embedded systems.",
                    "Perpetual environmentally powered sensor networks.",
                    "A modular power-aware microsensor with >1000X dynamic power range.",
                    "Avrora: scalable sensor network simulation with precise timing.",
                    "Multiple simultaneous acoustic source localization in urban terrain.",
                    "Design of a wireless sensor network platform for detecting rare, random, and ephemeral events.",
                    "The design and evaluation of a hybrid sensor network for cane-toad monitoring."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "3rd IPSN 2004",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2004",
                "sub_name": "Proceedings of the Third International Symposium on Information Processing in Sensor Networks, IPSN 2004, Berkeley, California, USA, April 26-27, 2004.",
                "count": 50,
                "papers": [
                    "Distributed regression: an efficient framework for modeling sensor network data.",
                    "Locally constructed algorithms for distributed computations in ad-hoc networks.",
                    "Distributed optimization in sensor networks.",
                    "The impact of spatial correlation on routing with compression in wireless sensor networks.",
                    "Entropy-based sensor selection heuristic for target localization.",
                    "Semidefinite programming for ad hoc wireless sensor network localization.",
                    "A bit-map-assisted energy-efficient MAC scheme for wireless sensor networks.",
                    "Distributed online localization in sensor networks using a moving target.",
                    "On the effect of localization errors on geographic face routing in sensor networks.",
                    "Distributed beamforming for information transfer in sensor networks.",
                    "On distributed sampling of smooth non-bandlimited fields.",
                    "Distributed particle filters for sensor networks.",
                    "Fusion in sensor networks with communication constraints.",
                    "An energy conservation method for wireless sensor networks employing a blue noise spatial sampling technique.",
                    "Backcasting: adaptive sampling for sensor networks.",
                    "A wake-up detector for an acoustic surveillance sensor network: algorithm and VLSI implementation.",
                    "Power-efficient sensor placement and transmission structure for data gathering under distortion constraints.",
                    "RoamHBA: maintaining group connectivity in sensor networks.",
                    "Reliability vs. efficiency in distributed source coding for field-gathering sensor networks.",
                    "On the scalability and capacity of wireless networks with omnidirectional antennas.",
                    "Multi-hop communication is order-optimal for homogeneous sensor networks.",
                    "Lattice sensor networks: capacity limits, optimal routing and robustness to failures.",
                    "Effect of overhearing transmissions on energy efficiency in dense sensor networks.",
                    "Flexible power scheduling for sensor networks.",
                    "An energy-aware data-centric generic utility based approach in wireless sensor networks.",
                    "Nonparametric belief propagation for self-calibration in sensor networks.",
                    "Distributed state representation for tracking problems in sensor networks.",
                    "How to distribute sensors in a random field?",
                    "Estimation from lossy sensor data: jump linear modeling and Kalman filtering.",
                    "The sybil attack in sensor networks: analysis & defenses.",
                    "A probabilistic approach to inference with limited information in sensor networks.",
                    "Efficient and robust query processing in dynamic environments using random walk techniques.",
                    "Virtual radar imaging for sensor networks.",
                    "On the scalability of hierarchical cooperation for dense sensor networks.",
                    "Complexity constrained sensor networks: achievable rates for two relay networks and generalizations.",
                    "Fractionally cascaded information in a sensor network.",
                    "Power-bandwidth-distortion scaling laws for sensor networks.",
                    "Rate-distortion problem for physics based distributed sensing.",
                    "Adaptive clock synchronization in sensor networks.",
                    "Improved interval-based clock synchronization in sensor networks.",
                    "Modeling of sensor nets in Ptolemy II.",
                    "Scattered data selection for dense sensor networks.",
                    "Constraint-guided dynamic reconfiguration in sensor networks.",
                    "Sensing uncertainty reduction using low complexity actuation.",
                    "Loss inference in wireless sensor networks based on data aggregation.",
                    "Robust distributed estimation in sensor networks using the embedded polygons algorithm.",
                    "Co-Grid: an efficient coverage maintenance protocol for distributed sensor networks.",
                    "Set k-cover algorithms for energy efficient monitoring in wireless sensor networks.",
                    "Network coverage using low duty-cycled sensors: random & coordinated sleep algorithms.",
                    "Naps: scalable, robust topology management in wireless ad hoc networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "2nd IPSN 2003",
        "info": "Palo Alto, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/ipsn/2003",
                "sub_name": "Information Processing in Sensor Networks, Second International Workshop, IPSN 2003, Palo Alto, CA, USA, April 22-23, 2003, Proceedings.",
                "count": 44,
                "papers": [
                    "On the Many-to-One Transport Capacity of a Dense Wireless Sensor Network and the Compressibility of Its Data.",
                    "Distributed Sampling for Dense Sensor Networks: A \"Bit-Conservation Principle\".",
                    "Energy-Quality Tradeoffs for Target Tracking in Wireless Sensor Networks.",
                    "Adaptive and Decentralized Operator Placement for In-Network Query Processing.",
                    "Beyond Average: Toward Sophisticated Sensing with Queries.",
                    "Boundary Estimation in Sensor Networks: Theory and Methods.",
                    "Scalable Control of Decentralised Sensor Platforms.",
                    "Distributed Group Management for Track Initiation and Maintenance in Target Localization Applications.",
                    "Using Predictable Observer Mobility for Power Efficient Design of Sensor Networks.",
                    "Bounds on Achievable Rates for General Multi-terminal Networks with Practical Constraints.",
                    "Source-Channel Communication in Sensor Networks.",
                    "On Rate-Constrained Estimation in Unreliable Sensor Networks.",
                    "Collaborative Signal Processing for Distributed Classification in Sensor Networks.",
                    "Multi-target Sensor Management Using Alpha-Divergence Measures.",
                    "A Distributed Algorithm for Managing Multi-target Identities in Wireless Ad-hoc Sensor Networks.",
                    "Hypothesis Testing over Factorizations for Data Association.",
                    "Energy-Constrained Collaborative Processing for Target Detection, Tracking, and Geolocation.",
                    "Array Processing for Target DOA, Localization, and Classification Based on AML and SVM Algorithms in Sensor Networks.",
                    "Energy Based Acoustic Source Localization.",
                    "A Collaborative Approach to In-Place Sensor Calibration.",
                    "On the Error Characteristics of Multihop Node Localization in Ad-Hoc Sensor Networks.",
                    "Organizing a Global Coordinate System from Local Information on an Ad Hoc Sensor Network.",
                    "A Performance Evaluation of Intrusion-Tolerant Routing in Wireless Sensor Networks.",
                    "Scalable Decentralized Control for Sensor Networks via Distributed Lattices.",
                    "Coverage, Exploration, and Deployment by a Mobile Robot and Communication Network.",
                    "Distance Based Decision Fusion in a Distributed Wireless Sensor Network.",
                    "Maximum Mutual Information Principle for Dynamic Sensor Query Problems.",
                    "A Formalism for the Analysis and Design of Time and Path Diversity Schemes in Wireless Sensor Networks.",
                    "Sensor Placement for Isotropic Source Localization.",
                    "Mobicast: Just-in-Time Multicast for Sensor Networks under Spatiotemporal Constraints.",
                    "Sentry-Based Power Management in Wireless Sensor Networks.",
                    "Energy Aware Multi-path Routing for Uniform Resource Utilization in Sensor Networks.",
                    "Efficient and Fault-Tolerant Feature Extraction in Wireless Sensor Networks.",
                    "Event Detection Services Using Data Service Middleware in Distributed Sensor Networks.",
                    "Meteorology and Hydrology in Yosemite National Park: A Sensor Network Application.",
                    "Detection, Classification, and Collaborative Tracking of Multiple Targets Using Video Sensors.",
                    "Decentralised Ground Target Tracking with Heterogeneous Sensing Nodes on Multiple UAVs.",
                    "Power-Aware Acoustic Processing.",
                    "Distributed Environmental Monitoring Using Random Sensor Networks.",
                    "Characterization of Location Error in Wireless Sensor Networks: Analysis and Applications.",
                    "A Distributed Algorithm for Waking-up in Heterogeneous Sensor Networks.",
                    "Location Tracking in a Wireless Sensor Network by Mobile Agents and Its Data Fusion Strategies.",
                    "Acoustic Target Tracking Using Tiny Wireless Sensor Devices.",
                    "A Robust Data Delivery Protocol for Large Scale Sensor Networks."
                ]
            }
        ]
    }
]