[
    {
        "year": "2021",
        "name": "29th IWQoS 2021",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2021",
                "sub_name": "29th IEEE/ACM International Symposium on Quality of Service, IWQOS 2021, Tokyo, Japan, June 25-28, 2021.",
                "count": 104,
                "papers": [
                    "SeqAD: An Unsupervised and Sequential Autoencoder Ensembles based Anomaly Detection Framework for KPI.",
                    "Designing Approximate and Deployable SRPT Scheduler: A Unified Framework.",
                    "Automated Quality of Service Monitoring for 5G and Beyond Using Distributed Ledgers.",
                    "HierTopo: Towards High-Performance and Efficient Topology Optimization for Dynamic Networks.",
                    "LCL: Light Contactless Low-delay Load Monitoring via Compressive Attentional Multi-label Learning.",
                    "High-QoE DASH Live Streaming Using Reinforcement Learning.",
                    "Can Online Learning Increase the Reliability of Extreme Mobility Management?",
                    "Secure and Efficient Task Matching with Multi-keyword in Multi-requester and Multi-worker Crowdsourcing.",
                    "Gost: Enabling Efficient Spatio-Temporal GPU Sharing for Network Function Virtualization.",
                    "Neuron Manifold Distillation for Edge Deep Learning.",
                    "Throughput Maximization for Wireless Powered Communication: Reinforcement Learning Approaches.",
                    "Supporting Flow-Cardinality Queries with O(1) Time Complexity in High-speed Networks.",
                    "CUP: Cellular Ultra-light Probe-based Available Bandwidth Estimation.",
                    "Joint D2D Collaboration and Task Offloading for Edge Computing: A Mean Field Graph Approach.",
                    "Efficient Fine-Grained Website Fingerprinting via Encrypted Traffic Analysis with Deep Learning.",
                    "No Wait, No Waste: A Novel and Efficient Coordination Algorithm for Multiple readers in RFID Systems.",
                    "FedEraser: Enabling Efficient Client-Level Data Removal from Federated Learning Models.",
                    "Exploiting Outlier Value Effects in Sparse Urban CrowdSensing.",
                    "Multipath-aware TCP for Data Center Traffic Load-balancing.",
                    "Understanding and Improving User Engagement in Adaptive Video Streaming.",
                    "A Behavior Privacy Preserving Method towards RF Sensing.",
                    "Privacy-Preserving Optimal Recovering for the Nearly Exhausted Payment Channels.",
                    "EC-Scheduler: A Load-Balanced Scheduler to Accelerate the Straggler Recovery for Erasure Coded Storage Systems.",
                    "GreenTE.ai: Power-Aware Traffic Engineering via Deep Reinforcement Learning.",
                    "Coded Matrix Chain Multiplication.",
                    "Joint Resource Placement and Task Dispatching in Mobile Edge Computing across Timescales.",
                    "Continuous Flow Measurement with SuperFlow.",
                    "A-DDPG: Attention Mechanism-based Deep Reinforcement Learning for NFV.",
                    "Eunomia: Efficiently Eliminating Abnormal Results in Distributed Stream Join Systems.",
                    "Robust P2P Connectivity Estimation for Permissionless Bitcoin Network.",
                    "ReCLive: Real-Time Classification and QoE Inference of Live Video Streaming Services.",
                    "BESURE: Blockchain-Based Cloud-Assisted eHealth System with Secure Data Provenance.",
                    "Design of Robust and Efficient Edge Server Placement and Server Scheduling Policies.",
                    "A Multi-objective Reinforcement Learning Perspective on Internet Congestion Control.",
                    "When Virtual Network Operator Meets E-Commerce Platform: Advertising via Data Reward.",
                    "GraphCP: An I/O-Efficient Concurrent Graph Processing Framework.",
                    "PQR: Prediction-supported Quality-aware Routing for Uninterrupted Vehicle Communication.",
                    "Clean: Minimize Switch Queue Length via Transparent ECN-proxy in Campus Networks.",
                    "QoE-assured Live Video Streaming Based on Coalition Game in 5G eMBMS Networks.",
                    "Workload Migration across Distributed Data Centers under Electrical Load Shedding.",
                    "DarkTE: Towards Dark Traffic Engineering in Data Center Networks with Ensemble Learning.",
                    "Charging on the Move: Scheduling Static Chargers with Tunable Power for Mobile Devices.",
                    "Adaptive Search Area Configuration for Location-based P2P Networks.",
                    "FedACS: Federated Skewness Analytics in Heterogeneous Decentralized Data Environments.",
                    "A Proactive Failure Tolerant Mechanism for SSDs Storage Systems based on Unsupervised Learning.",
                    "Distributed and Adaptive Traffic Engineering with Deep Reinforcement Learning.",
                    "Computation Offloading Scheduling for Deep Neural Network Inference in Mobile Computing.",
                    "IMP: Impedance Matching Enhanced Power-Delivered-to-Load Optimization for Magnetic MIMO Wireless Power Transfer System.",
                    "Revisiting Double-Spending Attacks on the Bitcoin Blockchain: New Findings.",
                    "Protecting Your Offloading Preference: Privacy-aware Online Computation Offloading in Mobile Blockchain.",
                    "Controlling the Maximum Link Estimation Error in Network Performance Tomography.",
                    "To share or not to share: reliability assurance via redundant cellular connectivity in Connected Cars.",
                    "BCAC: Batch Classifier based on Agglomerative Clustering for traffic classification in a backbone network.",
                    "Smartbuf: An Agile Memory Management for Shared-Memory Switches in Datacenters.",
                    "FairCrowd: Fair Human Face Dataset Sampling via Batch-Level Crowdsourcing Bias Inference.",
                    "Isolayer: The Case for an IoT Protocol Isolation Layer.",
                    "AIR: An AI-based TCAM Entry Replacement Scheme for Routers.",
                    "Secure and Scalable QoS for Critical Applications.",
                    "Byte-Label Joint Attention Learning for Packet-grained Network Traffic Classification.",
                    "Privacy-Preserving Approximate Top-k Nearest Keyword Queries over Encrypted Graphs.",
                    "ModelCoder: A Fault Model based Automatic Root Cause Localization Framework for Microservice Systems.",
                    "Joint Service Placement for Maximizing the Social Welfare in Edge Federation.",
                    "FlexNF: Flexible Network Function Orchestration on the Programmable Data Plane.",
                    "Secure Outsourced Top-k Selection Queries against Untrusted Cloud Service Providers.",
                    "Time-expanded Method Improving Throughput in Dynamic Renewable Networks.",
                    "Accelerating Transactions Relay in Blockchain Networks via Reputation.",
                    "EXTRA: An Experience-driven Control Framework for Distributed Stream Data Processing with a Variable Number of Threads.",
                    "Lightning: A Practical Building Block for RDMA Transport Control.",
                    "Drag-JDEC: A Deep Reinforcement Learning and Graph Neural Network-based Job Dispatching Model in Edge Computing.",
                    "Soudain: Online Adaptive Profile Configuration for Real-time Video Analytics.",
                    "LightNF: Simplifying Network Function Offloading in Programmable Networks.",
                    "Optimizing Quality of Experience for Long-Range UAS Video Streaming.",
                    "Glint: Decentralized Federated Graph Learning with Traffic Throttling and Flow Scheduling.",
                    "SuperClass: A Deep Duo-Task Learning Approach to Improving QoS in Image-driven Smart Urban Sensing Applications.",
                    "Differential Privacy-Preserving User Linkage across Online Social Networks.",
                    "Scalable Hardware Content Router: Architecture, Modeling and Performance.",
                    "A Reality-Conforming Approach for QoS Performance Analysis of AFDX in Cyber-Physical Avionics Systems.",
                    "pSAV: A Practical and Decentralized Inter-AS Source Address Validation Service Framework.",
                    "Multivariate Time Series Forecasting exploiting Tensor Projection Embedding and Gated Memory Network.",
                    "QoS-Aware Network Energy Optimization for Danmu Video Streaming in WiFi Networks.",
                    "BatFL: Backdoor Detection on Federated Learning in e-Health.",
                    "Practical Root Cause Localization for Microservice Systems via Trace Analysis.",
                    "wCompound: Enhancing Performance of Multipath Transmission in High-speed and Long Distance Networks.",
                    "Snapshot for IoT: Adaptive Measurement for Multidimensional QoS Resources.",
                    "DATE: Disturbance-Aware Traffic Engineering with Reinforcement Learning in Software-Defined Networks.",
                    "Towards Robust Multi-Tenant Clouds Through Multi-Constrained VM Placement.",
                    "MASK: Practical Source and Path Verification based on Multi-AS-Key.",
                    "A Crowd-driven Dynamic Neural Architecture Searching Approach to Quality-aware Streaming Disaster Damage Assessment.",
                    "Online Cloud Resource Provisioning Under Cost Budget for QoS Maximization.",
                    "A Novel Proof-of-Reputation Consensus for Storage Allocation in Edge Blockchain Systems.",
                    "Robustness-Aware Real-Time SFC Routing Update in Multi-Tenant Clouds.",
                    "Towards Private Similarity Query based Healthcare Monitoring over Digital Twin Cloud Platform.",
                    "MoDEMS: Optimizing Edge Computing Migrations For User Mobility.",
                    "ChirpMu: Chirp Based Imperceptible Information Broadcasting with Music.",
                    "Joint Optimization of Multi-user Computing Offloading and Service Caching in Mobile Edge Computing.",
                    "Load Balancing in Heterogeneous Server Clusters: Insights From a Product-Form Queueing Model.",
                    "ASAP: Anti-Spoofing Aphorism Using Path-analysis.",
                    "FuzzySkyline: QoS-Aware Fuzzy Skyline Parking Recommendation Using Edge Traffic Facilities.",
                    "Stateful-BBR - An Enhanced TCP for Emerging High-Bandwidth Mobile Networks.",
                    "Demystifying the Relationship Between Network Latency and Mobility on High-Speed Rails: Measurement and Prediction.",
                    "DeepDelivery: Leveraging Deep Reinforcement Learning for Adaptive IoT Service Delivery.",
                    "Optimizing Federated Learning on Device Heterogeneity with A Sampling Strategy.",
                    "Towards Chain-Aware Scaling Detection in NFV with Reinforcement Learning.",
                    "Cumulus: A Secure BFT-based Sidechain for Off-chain Scaling."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "28th IWQoS 2020",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2020",
                "sub_name": "28th IEEE/ACM International Symposium on Quality of Service, IWQoS 2020, Hangzhou, China, June 15-17, 2020.",
                "count": 49,
                "papers": [
                    "PE-HEALTH: Enabling Fully Encrypted CNN for Health Monitor with Optimized Communication.",
                    "Decode-and-Compare: An Efficient Verification Scheme for Coded Edge Computing.",
                    "Network-based Malware Detection with a Two-tier Architecture for Online Incremental Update.",
                    "Incentive Assignment in PoW and PoS Hybrid Blockchain in Pervasive Edge Environments.",
                    "Supporting Multi-dimensional and Arbitrary Numbers of Ranks for Software Packet Scheduling.",
                    "Private Deep Neural Network Models Publishing for Machine Learning as a Service.",
                    "BioDraw: Reliable Multi-Factor User Authentication with One Single Finger Swipe.",
                    "GeoClone: Online Task Replication and Scheduling for Geo-Distributed Analytics under Uncertainties.",
                    "A Deep Reinforcement Learning Approach for Online Computation Offloading in Mobile Edge Computing.",
                    "Modeling and Analyzing Live Streaming Performance.",
                    "GroupCoach: Compressed Sensing Based Group Activity Monitoring and Correction.",
                    "Decimeter-Level WiFi Tracking in Real-Time.",
                    "Multi-layer Coordination for High-Performance Energy-Efficient Federated Learning.",
                    "Improving the Path Programmability for Software-Defined WANs under Multiple Controller Failures.",
                    "Revisiting Multipath Congestion Control for Virtualized Cloud Environments.",
                    "PFcrowd: Privacy-Preserving and Federated Crowdsourcing Framework by Using Blockchain.",
                    "DeepQoE: Real-time Measurement of Video QoE from Encrypted Traffic with Deep Learning.",
                    "Finedge: A Dynamic Cost-Efficient Edge Resource Management Platform for NFV Network.",
                    "Joint Switch-Controller Association and Control Devolution for SDN Systems: An Integration of Online Control and Online Learning.",
                    "Delay-Sensitive Computation Partitioning for Mobile Augmented Reality Applications.",
                    "Exploiting Rateless Codes and Cross-Layer Optimization for Low-Power Wide-Area Networks.",
                    "PQA-CNN: Towards Perceptual Quality Assured Single-Image Super-Resolution in Remote Sensing.",
                    "i5GAccess: Nash Q-learning Based Multi-Service Edge Users Access in 5G Heterogeneous Networks.",
                    "Age-aware Fairness in Blockchain Transaction Ordering.",
                    "LogSayer: Log Pattern-driven Cloud Component Anomaly Diagnosis with Machine Learning.",
                    "High-quality Activity-Level Video Advertising.",
                    "A General Approach to Robust QR Codes Decoding.",
                    "Taming the Wildcards: Towards Dependency-free Rule Caching with FreeCache.",
                    "Tag Pollution Detection in Web Videos via Cross-Modal Relevance Estimation.",
                    "Towards the Construction of Global IPv6 Hitlist and Efficient Probing of IPv6 Address Space.",
                    "RLLL: Accurate Relative Localization of RFID Tags with Low Latency.",
                    "Greening Reliability of Virtual Network Functions via Online Optimization.",
                    "I Know If the Journey Changes: Flexible Source and Path Validation.",
                    "Back-Guard: Wireless Backscattering based User Activity Recognition and Identification with Parallel Attention Model.",
                    "Online Distributed Edge Caching for Mobile Data Offloading in 5G Networks.",
                    "Incorporating Intra-flow Dependencies and Inter-flow Correlations for Traffic Matrix Prediction.",
                    "Additive and Subtractive Cuckoo Filters.",
                    "Towards Lightweight Serverless Computing via Unikernel as a Function.",
                    "Application-Layer DDoS Defense with Reinforcement Learning.",
                    "Leveraging Stragglers in Coded Computing with Heterogeneous Servers.",
                    "Preventing Spread of Spam Transactions in Blockchain by Reputation.",
                    "Serpens: A High-Performance Serverless Platform for NFV.",
                    "Generative Adversarial Networks-based Privacy-Preserving 3D Reconstruction.",
                    "MPTCP+: Enhancing Adaptive HTTP Video Streaming over Multipath.",
                    "Adaptive and Robust Network Routing Based on Deep Reinforcement Learning with Lyapunov Optimization.",
                    "GuardRider: Reliable WiFi Backscatter Using Reed-Solomon Codes With QoS Guarantee.",
                    "Localizing Failure Root Causes in a Microservice through Causality Inference.",
                    "Uncontrolled Randomness in Blockchains: Covert Bulletin Board for Illicit Activity.",
                    "Mag-Barcode: Magnet Barcode Scanning for Indoor Pedestrian Tracking."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "27th IWQoS 2019",
        "info": "Phoenix, AZ, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2019",
                "sub_name": "Proceedings of the International Symposium on Quality of Service, IWQoS 2019, Phoenix, AZ, USA, June 24-25, 2019.",
                "count": 42,
                "papers": [
                    "RetroFlow: maintaining control resiliency and flow programmability for software-defined WANs.",
                    "mmHandover: a pre-connection based handover protocol for 5G millimeter wave vehicular networks.",
                    "NEIVA: environment identification based video bitrate adaption in cellular networks.",
                    "An empirical study of mobile network behavior and application performance in the wild.",
                    "P4Tester: efficient runtime rule fault detection for programmable data planes.",
                    "NB-cache: non-blocking in-network caching for high-speed content routers.",
                    "ML defense: against prediction API threats in cloud-based machine learning service.",
                    "Selecting optimal mobile users for long-term environmental monitoring by crowdsourcing.",
                    "Mechanism design for cross-market task crowdsourcing.",
                    "Orchestrating service chain deployment with plutus in next generation cellular core.",
                    "Elastic, geo-distributed RAFT.",
                    "Chunk-level request-grant-transfer mode for QoE-sensitive video delivery in CDN.",
                    "CoFlux: robustly correlating KPIs by fluctuations for service troubleshooting.",
                    "Evaluating performance and inefficient routing of an anycast CDN.",
                    "Trigger relationship aware mobile traffic classification.",
                    "LEAP: learning-based smart edge with caching and prefetching for adaptive video streaming.",
                    "Understanding I/O performance of IPFS storage: a client's perspective.",
                    "Encrypted traffic classification of decentralized applications on ethereum using feature fusion.",
                    "WiCAR: wifi-based in-car activity recognition with multi-adversarial domain adaptation.",
                    "Dependent task placement and scheduling with function configuration in edge computing.",
                    "NFVdeep: adaptive online service function chain deployment with deep reinforcement learning.",
                    "Characterizing and orchestrating NFV-ready servers for efficient edge data processing.",
                    "Variety matters: a new model for the wireless data market under sponsored data plans.",
                    "Proactive inter-datacenter multicast with realtime and bulk transfers.",
                    "Towards privacy-preserving data trading for web browsing history.",
                    "Balancing of the quality-of-service, energy and revenue of base stations in wireless networks via tullock contests.",
                    "pRide: private ride request for online ride hailing service with secure hardware enclave.",
                    "DaRTree: deadline-aware multicast transfers in reconfigurable wide-area networks.",
                    "MixGeo: efficient secure range queries on encrypted dense spatial data in the cloud.",
                    "Chic: experience-driven scheduling in machine learning clusters.",
                    "Litedge: towards light-weight edge computing for efficient wireless surveillance system.",
                    "FAST: enabling fast software/hardware prototype for network experimentation.",
                    "Secure indoor positioning against signal strength attacks via optimized multi-voting.",
                    "LOSC: efficient out-of-core graph processing with locality-optimized subgraph construction.",
                    "Predictive switch-controller association and control devolution for SDN systems.",
                    "Branch scheduling: dag-aware scheduling for speeding up data-parallel jobs.",
                    "Multidimensional behavioral profiling of internet-of-things in edge networks.",
                    "ATMPA: attacking machine learning-based malware visualization detection methods via adversarial examples.",
                    "Who limits the resource efficiency of my datacenter: an analysis of Alibaba datacenter traces.",
                    "SocialDistance: how far are you from verified users in online social media?",
                    "A game theoretic analysis on block withholding attacks using the zero-determinant strategy.",
                    "No-jump-into-latency in China's internet!: toward last-mile hop count based IP geo-localization."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "26th IWQoS 2018",
        "info": "Banff, AB, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2018",
                "sub_name": "26th IEEE/ACM International Symposium on Quality of Service, IWQoS 2018, Banff, AB, Canada, June 4-6, 2018.",
                "count": 64,
                "papers": [
                    "Practical Key Tag Monitoring in RFID Systems.",
                    "Online Control of Cloud and Edge Resources Using Inaccurate Predictions.",
                    "ProSC+: Profit-Driven Online Participant Selection in Compressive Mobile Crowdsensing.",
                    "Shaping Deadline Coflows to Accelerate Non-Deadline Coflows.",
                    "Energy-Aware Allocation of Approximate Query Processing Over Data Streams with Error Guarantee.",
                    "MaMPF: Encrypted Traffic Classification Based on Multi-Attribute Markov Probability Fingerprints.",
                    "Time-Efficient RFID-Based Stocktaking with a Coarse-Grained Inventory List.",
                    "Scheduling Coflows with Incomplete Information.",
                    "Design and Evaluation of In-Situ Resource Provisioning Method for Regional IoT Services.",
                    "Byte Segment Neural Network for Network Traffic Classification.",
                    "SWAM: SDN-Based Wi-Fi Small Cells with Joint Access-Backhaul and Multi-Tenant Capabilities.",
                    "A Data Center Interconnects Calculus.",
                    "Anchor Selection for Localization in Large Indoor Venues.",
                    "An Online Approximate Stream Processing Framework with Customized Error Control.",
                    "Predicting Outages in Radio Networks with Alarm Data.",
                    "SDNKeeper: Lightweight Resource Protection and Management System for SDN-Based Cloud.",
                    "Online Demand Response of GPU Cloud Computing with DVFS.",
                    "How Would you Like Your Packets Delivered? An SDN-Enabled Open Platform for QoS Routing.",
                    "Scalable Ground-Truth Annotation for Video QoE Modeling in Enterprise WiFi.",
                    "Minimizing the Cask Effect of Multi-Source Content Delivery.",
                    "An Online Placement Scheme for VNF Chains in Geo-Distributed Clouds.",
                    "Device-Agnostic Log Anomaly Classification with Partial Labels.",
                    "NetCP: Consistent, Non-Interruptive and Efficient Checkpointing and Rollback of SDN.",
                    "Deep and Broad Learning Based Detection of Android Malware via Network Traffic.",
                    "Highlight-Aware Content Placement in Crowdsourced Livecast Services.",
                    "Authentication of Multi-Dimensional Top-$K$ Query on Untrusted Server.",
                    "Fault Injection Framework for Assessing Fault Containment of TTEthernet Against Babbling Idiot Failures.",
                    "Towards a Fast Regular Expression Matching Method Over Compressed Traffic.",
                    "Edge Computing Empowered Generative Adversarial Networks for Realtime Road Sensing.",
                    "Collaborative Interactive Wireless Charging in a Cyclic Mobispace.",
                    "Completion Time Minimization in Multi-User Task Scheduling with Heterogeneous Processors and Budget Constraints.",
                    "OFM: Optimized Flow Migration for NFV Elasticity Control.",
                    "Ridesharing as a Service: Exploring Crowdsourced Connected Vehicle Information for Intelligent Package Delivery.",
                    "Sensing Power Spectrum Density of True Ultrasounds on Mobile Devices.",
                    "Subscriber-Driven Cloud Interference Mitigation for Network Services.",
                    "Throughput, Coverage and Scalability of LoRa LPWAN for Internet of Things.",
                    "Toward Accurate Inference of Web Activities from Passive DNS Data.",
                    "VCN: Versatile Clos-Type Networks for Traffic Locality in Data Centers.",
                    "An Efficient Online Market Mechanism for Resource Leasing in Cloud Radio Access Networks.",
                    "On Maximizing QoE in AVC-Based HTTP Adaptive Streaming: An SDN Approach.",
                    "ImgPricing: Everyone Can Earn Proper Rewards by Simply Taking Photos.",
                    "Improving TRILL Mesh Network's Throughput Using Smart NICs.",
                    "Providing VNF Services with Pipe&Hose Model Based Nonblocking SDN Networks.",
                    "A Stackelberg Game Framework for Mobile Data Gathering in Leasing Residential Sensor Networks.",
                    "Improving Quality of Experience of Service-Chain Deployment for Multiple Users.",
                    "Robust and Rapid Clustering of KPIs for Large-Scale Anomaly Detection.",
                    "Enabling Efficient Source and Path Verification via Probabilistic Packet Marking.",
                    "Slow but Steady: Cap-Based Client-Network Interaction for Improved Streaming Experience.",
                    "A WiFi-Direct Based Local Communication System.",
                    "Data Quality Aware Task Allocation Under a Feasible Budget in Mobile Crowdsensing.",
                    "Follow Me at the Edge: Mobility-Aware Dynamic Service Placement for Mobile Edge Computing.",
                    "Reducing Web Latency Through Dynamically Setting TCP Initial Window with Reinforcement Learning.",
                    "Toward Smart and Cooperative Edge Caching for 5G Networks: A Deep Learning Based Approach.",
                    "Software-Defined Label Switching: Scalable Per-Flow Control in SDN.",
                    "Improving Quality of Experience for Mobile Broadcasters in Personalized Live Video Streaming.",
                    "Flow-Level Traffic Engineering in Conventional Networks with Hop-by-Hop Routing.",
                    "ALB: Adaptive Load Balancing Based on Accurate Congestion Feedback for Asymmetric Topologies.",
                    "A Hybrid Approach to Scalable Name Prefix Lookup.",
                    "Improved Adam Optimizer for Deep Neural Networks.",
                    "Competitive Online Scheduling Algorithms with Applications in Deadline-Constrained EV Charging.",
                    "Data Utility Maximization When Leveraging Crowdsensing in Machine Learning.",
                    "Optimal Cloud Instance Acquisition via IaaS Cloud Brokerage with Volume Discount.",
                    "Enabling Privacy-Preserving Header Matching for Outsourced Middleboxes.",
                    "OBMA: Minimizing Bitmap Data Structure with Fast and Uninterrupted Update Processing."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "25th IWQoS 2017",
        "info": "Vilanova i la Geltrú, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2017",
                "sub_name": "25th IEEE/ACM International Symposium on Quality of Service, IWQoS 2017, Vilanova i la Geltrú, Spain, June 14-16, 2017.",
                "count": 75,
                "papers": [
                    "A secure cloud storage system based on discrete logarithm problem.",
                    "Efficient and generalized geometric range search on encrypted spatial data in the cloud.",
                    "Preserving the Relationship Privacy of the published social-network data based on Compressive Sensing.",
                    "A measurement study on Skype voice and video calls in LTE networks on high speed rails.",
                    "Adaptive radio and transmission power selection for Internet of Things.",
                    "Enabling accurate and efficient modeling-based CPU power estimation for smartphones.",
                    "Latency-based WiFi congestion control in the air for dense WiFi networks.",
                    "SCoP: Smartphone energy saving by merging push services in Fog computing.",
                    "Congestion control in Converged Ethernet with heterogeneous and time-varying delays.",
                    "Copula-based parameter estimation for Markov-modulated Poisson Process.",
                    "NOVA: Towards on-demand equivalent network view abstraction for network optimization.",
                    "Per-flow counting for big network data stream over sliding windows.",
                    "Skipping congestion-links for coflow scheduling.",
                    "Optimizing the cost-performance tradeoff for geo-distributed data analytics with uncertain demand.",
                    "A cost-efficient scheme with decoupling host-side flow scheduling from switches in DCNs.",
                    "Delay updating in Software-Defined Datacenter networks.",
                    "Fairness-aware dynamic rate control and flow scheduling for network function virtualization.",
                    "Which DRM grade could BYOD users employ? A differentiated DRM service between the cloud and mobile devices.",
                    "Ultra-Fast Bloom Filters using SIMD techniques.",
                    "Queueing in the mist: Buffering and scheduling with limited knowledge.",
                    "QoS evaluation of prioritized data plane service employing queueing model.",
                    "Efficient modeling and performance analysis for IEEE 802.15.4 with coloured Petri nets.",
                    "XpressEth: Concise and efficient converged real-time Ethernet.",
                    "Syslog processing for switch failure diagnosis and prediction in datacenter networks.",
                    "FFTree: A flexible architecture for data center networks towards configurability and cost efficiency.",
                    "Rethinking transfer optimization in a datacenter: Integrating load balancing with multipath flow control.",
                    "Joint deployment and routing in hybrid SDNs.",
                    "Multicast scheduling algorithm in software defined fat-tree data center networks.",
                    "OptiBook: Optimal resource booking for energy-efficient datacenters.",
                    "SLA-aware broker for Public Cloud.",
                    "Topology calibration in data centers.",
                    "CounterMap: Towards generic traffic statistics collection and query in Software Defined Network.",
                    "Mixing SDN and CCN for content-centric Qos aware smart grid architecture.",
                    "Towards a Fog-to-Cloud control topology for QoS-aware end-to-end communication.",
                    "Application-aware network sharing for enabling high progress of multi-tenants.",
                    "NFV-based QoS provision for Software Defined Optical Access and residential networks.",
                    "A clustering-based approach for Virtual Network Function Mapping and Assigning.",
                    "Towards a fast packet inspection over compressed HTTP traffic.",
                    "A cooperative mechanism for efficient inter-domain in-network cache sharing.",
                    "Using quality of computation to enhance quality of service in mobile computing systems.",
                    "Enabling automatic composition and verification of service function chain.",
                    "Cost-efficient workload scheduling in Cloud Assisted Mobile Edge Computing.",
                    "HARV: Harnessing hybrid virtualization to improve instance (re)usage in public cloud.",
                    "Generic and agile service function chain verification on cloud.",
                    "EncSIM: An encrypted similarity search service for distributed high-dimensional datasets.",
                    "Carrier-grade availability-aware mapping of Service Function Chains with on-site backups.",
                    "Secure, efficient and practical double spectrum auction.",
                    "You can hide, but your periodic schedule can't.",
                    "Root cause analysis of anomalies of multitier services in public clouds.",
                    "Verifiable Ranked Search over dynamic encrypted data in cloud computing.",
                    "On the RSU-based secure distinguishability among vehicular flows.",
                    "Reliable multicast routing with uncertain sources.",
                    "Real-time middleware for cyber-physical event processing.",
                    "Cost-efficient negotiation over multiple resources with reinforcement learning.",
                    "Reinforcement learning-based adaptive resource management of differentiated services in geo-distributed data centers.",
                    "Radio resource scheduling for low-latency communications in LTE and beyond.",
                    "Failure Inference for shortening traffic Detours.",
                    "A two-way link loss measurement approach for software-defined networks.",
                    "Task assignment with guaranteed quality for crowdsourcing platforms.",
                    "Towards load-balanced VNF assignment in geo-distributed NFV Infrastructure.",
                    "When privacy meets economics: Enabling differentially-private battery-supported meter reporting in smart grid.",
                    "Jump-start crowdsensing: A three-layer incentive framework for mobile crowdsensing.",
                    "An autonomous compensation game to facilitate peer data exchange in crowdsensing.",
                    "Link-Coupled TCP for 5G networks.",
                    "Handling scheduling uncertainties through traffic shaping in Time-Triggered train networks.",
                    "Performance analysis of randomized data fetching in cluster computing.",
                    "MUSA: Wi-Fi AP-assisted video prefetching via Tensor Learning.",
                    "PSOM: Periodic Self-Organizing Maps for unsupervised anomaly detection in periodic time series.",
                    "An efficient kurtosis-based causal discovery method for linear non-Gaussian acyclic data.",
                    "A study on resource granularity of vEPC optimal resource assignment.",
                    "On the measurement of P2P file synchronization: Resilio Sync as a case study.",
                    "Efficient group labeling for multi-group RFID systems.",
                    "C2: Procuring uncertain freelancers for interactive live video transcoding.",
                    "Social media stickiness in Mobile Personal Livestreaming service.",
                    "Accelerating mobile web browsing with screen scrolling."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "24th IWQoS 2016",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2016",
                "sub_name": "24th IEEE/ACM International Symposium on Quality of Service, IWQoS 2016, Beijing, China, June 20-21, 2016.",
                "count": 68,
                "papers": [
                    "Bandwidth-aware delayed repair in distributed storage systems.",
                    "Efficient routing for cooperative data regeneration in heterogeneous storage networks.",
                    "Zebra: Demand-aware erasure coding for distributed storage systems.",
                    "Practical fast scheduling and routing over slotted CSMA for wireless mesh networks.",
                    "DVMP: Incremental traffic-aware VM placement on heterogeneous servers in data centers.",
                    "Efficient and proactive V2V information diffusion using Named Data Networking.",
                    "FDRC - Flow duration time based rate control in data center networks.",
                    "FlowShadow: Keeping update consistency in software-based OpenFlow switches.",
                    "An experimental investigation of hyperbolic routing with a smart forwarding plane in NDN.",
                    "Tetris: Optimizing cloud resource usage unbalance with elastic VM.",
                    "Diving into cloud-based file synchronization with user collaboration.",
                    "A secure hierarchical deduplication system in cloud storage.",
                    "MSRT: Multi-Source Request and Transmission in Content-Centric Networks.",
                    "Dynamic flow scheduling for Power-efficient Data Center Networks.",
                    "Traffic big data based path planning strategy in public vehicle systems.",
                    "A decision-tree-based on-line flow table compressing method in Software Defined Networks.",
                    "On efficiently harnessing cloud to securely solve linear regression and other matrix operations.",
                    "sdnMAC: A software defined networking based MAC protocol in VANETs.",
                    "Tube caching: An effective caching scheme in Content-Centric Networking.",
                    "FTDC: A fault-tolerant server-centric data center network.",
                    "IP lookup using Minimal Perfect Hashing.",
                    "Achieving convergent causal consistency and high availability with asynchronous replication.",
                    "Tradeoff between executing time and revenue for runtime service composition.",
                    "FDALB: Flow distribution aware load balancing for datacenter networks.",
                    "Reliability in future radio access networks: From linguistic to quantitative definitions.",
                    "HybridFlow: A lightweight control plane for hybrid SDN in enterprise networks.",
                    "Real-time detection of performance anomalies for cloud services.",
                    "Improving revenue for reliability-aware VDC embedding in a software-defined data center.",
                    "Low delay streaming of DASH content with WebRTC data channel.",
                    "Multi-channel mode for emergency system in urban connected vehicles.",
                    "Tunneling on demand: A lightweight approach for IP fast rerouting against multi-link failures.",
                    "Multicast routing with uncertain sources in software-defined network.",
                    "A reliability estimation method for reconfigurable routing and switching software.",
                    "High-throughput anycast routing and congestion-free reconfiguration for SDNs.",
                    "Adaptive rate control over mobile data networks with heuristic rate compensations.",
                    "FICUS: Fast Incremental Consistent Update in SDN based on relation graph.",
                    "HetSDN: Exploiting SDN for intelligent network usage in heterogeneous wireless networks.",
                    "Multi-Resource Partial-Ordered Task Scheduling in cloud computing.",
                    "Lexicographical order Max-Min fair source quota allocation in mobile Delay-Tolerant Networks.",
                    "Toward online virtual network function placement in Software Defined Networks.",
                    "Self-described buffer: A novel mechanism to improve packet I/O efficiency in Linux.",
                    "Network Codes-based Multi-Source Transmission Control Protocol for Content-centric Networks.",
                    "Dynamic resource scheduling in cloud radio access network with mobile cloud computing.",
                    "Demystifying the energy efficiency of Network Function Virtualization.",
                    "M3: Practical and reliable multi-layer video multicast over multi-rate Wi-Fi network.",
                    "On mobile instant video clip sharing with screen scrolling.",
                    "Coverage and distinguishability requirements for Traffic Flow Monitoring Systems.",
                    "MCTCP: Congestion-aware and robust multicast TCP in Software-Defined networks.",
                    "LCC-Graph: A high-performance graph-processing framework with low communication costs.",
                    "Using recurrent neural networks toward black-box system anomaly prediction.",
                    "Exploiting time-varying graphs for data forwarding in mobile social Delay-Tolerant Networks.",
                    "Towards QoE assessment of encrypted YouTube adaptive video streaming in mobile networks.",
                    "Online influence maximization in non-stationary Social Networks.",
                    "Smartphone-assisted smooth live video broadcast on wearable cameras.",
                    "Data Rate Guarantee for Coflow scheduling in network function virtualization.",
                    "Choquet integral based QoS-to-QoE mapping for mobile VoD applications.",
                    "Model-based techniques for QoS assessment of cloud-hosted CDN services.",
                    "Collusion-resisting secure nearest neighbor query over encrypted data in cloud, revisited.",
                    "Your trajectory privacy can be breached even if you walk in groups.",
                    "Differentially private density estimation via Gaussian mixtures model.",
                    "TrafficAV: An effective and explainable detection of mobile malware behavior using network traffic.",
                    "Selecting most informative contributors with unknown costs for budgeted crowdsensing.",
                    "QuickPoint: Efficiently identifying densest sub-graphs in Online Social Networks for event stream dissemination.",
                    "On the performance of cloud storage applications with global measurement.",
                    "Enhancing participant selection through caching in mobile crowd sensing.",
                    "Certificate-aware encrypted traffic classification using Second-Order Markov Chain.",
                    "Truthful incentive mechanism for vehicle-based nondeterministic crowdsensing.",
                    "The detection of physical attacks against iBeacon transmitters."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "23rd IWQoS 2015",
        "info": "Portland, OR, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2015",
                "sub_name": "23rd IEEE International Symposium on Quality of Service, IWQoS 2015, Portland, OR, USA, June 15-16, 2015.",
                "count": 63,
                "papers": [
                    "Smart hashing based queries in the cloud.",
                    "M2SDN: Achieving multipath and multihoming in data centers with software defined networking.",
                    "Online cost minimization for operating geo-distributed cloud CDNs.",
                    "One-restart algorithm for scheduling and offloading in a hybrid cloud.",
                    "Traffic and failure aware VM placement for multi-tenant cloud computing.",
                    "A self-adaptive reconfiguration scheme for throughput maximization in municipal WMNs.",
                    "An online cloud data center simulation system.",
                    "Managing traffic-light-duration by exploiting smart antenna technology (MATSAT).",
                    "SFabric: A scalable SDN based large layer 2 data center network fabric.",
                    "An efficient distributed algorithm for spectrum allocation in multi-hop cognitive radio networks.",
                    "Collaborative localization in participatory sensing with load balancing.",
                    "FRINGE: Improving the scalability of Ethernet DCN via efficient software-defined edge control.",
                    "Model-based control plane for fast routing in industrial QoS network.",
                    "TSP: A traffic sharing platform for mobile networks.",
                    "α%-Green is enough: Refocusing on Internet routing optimization.",
                    "Does chunk size matter in distributed video transcoding?",
                    "QoE-aware routing for video streaming over wired networks.",
                    "Modeling and performance analysis of the multiple controllers' approach in software defined networking.",
                    "Towards QoE-aware adaptive video streaming.",
                    "Improving QoS in SDN with lossless multi-domain reconfigurations.",
                    "PFT-CCKP: A proactive fault tolerance mechanism for data center network.",
                    "Path-aware peer-assisted web content delivery against network failures.",
                    "Secure double spectrum auctions.",
                    "A distributed RFID reader activation approach.",
                    "User-level fairness delivered: Network resource allocation for adaptive video streaming.",
                    "Scalable network-based video-freeze detection for HTTP adaptive streaming.",
                    "Improving user QoE for residential broadband: Adaptive traffic management at the network edge.",
                    "AndroidPerf: A cross-layer profiling system for Android applications.",
                    "Sustaining Ad-driven P2P streaming ecosystems: A market-based approach.",
                    "WebQ: A virtual queue for improving user experience during web server overload.",
                    "Modeling dynamics of online video popularity.",
                    "Publish me and protect me: Personalized and flexible location privacy protection in mobile social networks.",
                    "Hamburger attack: A collusion attack against privacy-preserving data aggregation schemes.",
                    "Identity-preserving public auditing for shared cloud data.",
                    "cCluster: A highly scalable and elastic OpenFlow control plane.",
                    "Software defined backpressure mechanism for edge router.",
                    "Performance study of dynamic QoS management for OpenFlow-enabled SDN switches.",
                    "COSTA: Cross-layer optimization for sketch-based software defined measurement task assignment.",
                    "Traffic engineering in hierarchical SDN control plane.",
                    "Broadband fast-lanes with two-sided control: Design, evaluation, and economics.",
                    "Detecting low-quality crowdtesting workers.",
                    "Incentive and reputation mechanisms for online crowdsourcing systems.",
                    "Deco: False data detection and correction framework for participatory sensing.",
                    "Crowdsourcing sensing to smartphones: A randomized auction approach.",
                    "Enhancing TCP Incast congestion control over large-scale datacenter networks.",
                    "Catching failures of failures at big-data clusters: A two-level neural network approach.",
                    "Contention detection by throttling: A black-box on-line approach.",
                    "A methodology for root-cause analysis in component based systems.",
                    "Enhancing reliability of real-time traffic via cooperative scheduling in cognitive radio networks.",
                    "Performance and incentive of teamwork-based channel allocation in spectrum access networks.",
                    "Algebra and algorithms for efficient and correct multipath QoS routing in link state networks.",
                    "NetInf TP: A receiver-driven protocol for ICN data transport.",
                    "Compressing IP forwarding tables with fast and bounded update.",
                    "Identifying frequent flows in large datasets through probabilistic bloom filters.",
                    "One-hashing bloom filter.",
                    "Mining network traffic anomaly based on adjustable piecewise entropy.",
                    "Fine-grained dissection of WeChat in cellular networks.",
                    "WebPro: A proxy-based approach for low latency web browsing on mobile devices.",
                    "Stability analysis of Frame Slotted Aloha protocol.",
                    "Scheduling with predictable link reliability for wireless networked control.",
                    "Even data placement for load balance in reliable distributed deduplication storage systems.",
                    "Fair rewarding in colocation data centers: Truthful mechanism for emergency demand response.",
                    "Robust resource reservation in virtual wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "22nd IWQoS 2014",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2014",
                "sub_name": "IEEE 22nd International Symposium of Quality of Service, IWQoS 2014, Hong Kong, China, May 26-27, 2014.",
                "count": 49,
                "papers": [
                    "Up-and-down routing in mobile opportunistic social networks with bloom-filter-based hints.",
                    "Compressive detection and localization of multiple heterogeneous events with sensor networks.",
                    "E3: Towards energy-efficient distributed least squares estimation in sensor networks.",
                    "Analysis of EDF scheduling for Wireless Sensor-Actuator Networks.",
                    "RSMOA: A revenue and social welfare maximizing online auction for dynamic cloud resource provisioning.",
                    "Online resource scheduling under concave pricing for cloud computing.",
                    "Towards efficient virtual network embedding across multiple network domains.",
                    "Analysing convergence of Quantized Congestion Notification in Data Center Ethernet.",
                    "Optimize the dynamic provisioning and request dispatching in distributed memory cache services.",
                    "Keyword search with access control over encrypted data in cloud computing.",
                    "QBLESS: A case for QoS-aware bufferless NoCs.",
                    "A quantitative analysis of quorum system availability in data centers.",
                    "Dynamic hybrid routing: Achieve load balancing for changing traffic demands.",
                    "Toward the most representative summaries of network user activities.",
                    "TED: Inter-domain traffic engineering via deflection.",
                    "Tackling the challenge of bufferbloat in Multi-Path Transport over heterogeneous wireless networks.",
                    "kTRxer: A portable toolkit for reliable internet probing.",
                    "Designing a disaster-resilient network with software defined networking.",
                    "The joint optimization of rules allocation and traffic engineering in Software Defined Network.",
                    "Scalability of control planes for Software defined networks: Modeling and evaluation.",
                    "Necklace: An efficient cuckoo hashing scheme for cloud storage services.",
                    "Needle in a haystack: Cost-Effective data analytics for real-time cloud sharing.",
                    "Jointly optimal selection and scheduling for lossy transmission of dependent frames with delay constraint.",
                    "Towards line-speed and accurate on-line popularity monitoring on NDN routers.",
                    "Efficient end-to-end communication services for mixed criticality avionics systems.",
                    "Fast name lookup for Named Data Networking.",
                    "PAINT: Partial in-network transcoding for adaptive streaming in information centric network.",
                    "Robust multipath multicast routing algorithms for videos in Software-Defined Networks.",
                    "RNC: A high-precision Network Coordinate System.",
                    "Shared relay assignment (SRA) for many-to-one traffic in cooperative wireless transmissions.",
                    "Cooperative routing with relay assignment in multi-radio multi-hop wireless networks.",
                    "A concurrent transmission enabled cooperative MAC protocol for Vehicular Ad Hoc Networks.",
                    "Distributed dynamic channel access scheduling in large WMN systems.",
                    "A traffic QoS aware approach for cellular infrastructure offloading using VANETs.",
                    "Energy-traffic tradeoff cooperative offloading for mobile cloud computing.",
                    "Fair QoS multi-resource allocation for wireless LAN.",
                    "Incremental design of scalable wireless interconnection structure for CMPs.",
                    "Online algorithms for energy cost minimization in cellular networks.",
                    "Link-aware AP selection for improving Wi-Fi quality.",
                    "Efficient data dissemination by crowdsensing in vehicular networks.",
                    "QoS-based joint power and resource allocation with Adaptive Modulation and Coding for OFDMA femtocell networks.",
                    "A novel incentive negotiation mechanism for participatory sensing under budget constraints.",
                    "Distributed social welfare maximization in vehicular participatory sensing systems.",
                    "Energy-efficient sensor selection for data quality and load balancing in wireless sensor networks.",
                    "Power-proportional router: Architectural design and experimental evaluation.",
                    "KEEP: Fast secret key extraction protocol for D2D communication.",
                    "LOCK: A fast and flexible tag scanning mechanism with handheld readers.",
                    "Secure distributed keyword search in multiple clouds.",
                    "Achieving efficient and secure range query in two-tiered wireless sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "21st IWQoS 2013",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2013",
                "sub_name": "21st IEEE/ACM International Symposium on Quality of Service, IWQoS 2013, Montreal, Canada, 3-4 June 2013.",
                "count": 26,
                "papers": [
                    "mBenchLab: Measuring QoE of Web applications using mobile devices.",
                    "A cloud-assisted energy-efficient video streaming system for smartphones.",
                    "Remora: Sensing resource sharing among smartphone-based body sensor networks.",
                    "Adaptive data transmission in the cloud.",
                    "Optimization and stabilization of composite service processing in a cloud system.",
                    "Small versus large: Switch sizing in topology design of energy-efficient data centers.",
                    "Revenue maximization with dynamic auctions in IaaS cloud markets.",
                    "Autonomic performance and power control for co-located Web applications on virtualized servers.",
                    "Prioritizing local inter-domain communication in Xen.",
                    "Predictive VM consolidation on multiple resources: Beyond load balancing.",
                    "Quantifying and improving I/O predictability in virtualized systems.",
                    "A datacenter network tale from a server's perspective.",
                    "Joint study on optimizations of data center deployment, VM assignment and migration.",
                    "Exploring the profit-reliability trade-off in Amazon's spot instance market: A better pricing mechanism.",
                    "Joint channel and delay aware user scheduling for multiuser MIMO system over LTE-A network.",
                    "RPFP: IP fast reroute with providing complete protection and without using tunnels.",
                    "Multi-resource generalized processor sharing for packet processing.",
                    "An enhanced bloom filter for longest prefix matching.",
                    "Optimising quality of information in data collection for mobile sensor networks.",
                    "Modeling and understanding burst transmission algorithms for energy efficient ethernet.",
                    "On the impact of popularity decays in peer-to-peer VoD systems.",
                    "Improving wireless network capacity under high transmission power with adaptive carrier sensing and routing.",
                    "Achieving secure and efficient data collaboration in cloud computing.",
                    "On interference-aware provisioning for cloud-based big data processing.",
                    "Preferred keyword search over encrypted data in cloud computing.",
                    "Cost-minimizing preemptive scheduling of mapreduce workloads on hybrid clouds."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "20th IWQoS 2012",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2012",
                "sub_name": "20th IEEE International Workshop on Quality of Service, IWQoS 2012, Coimbra, Portugal, June 4-5, 2012.",
                "count": 35,
                "papers": [
                    "Fast cloned-tag identification protocols for large-scale RFID systems.",
                    "CloudGPS: A scalable and ISP-friendly server selection scheme in cloud computing environments.",
                    "Application dependency discovery using matrix factorization.",
                    "Scheduling with outdated CSI: Effective service capacities of optimistic vs. pessimistic policies.",
                    "On the impact of virtualization on Dropbox-like cloud file storage/synchronization services.",
                    "Simulating CSMA/CA behavior for performance evaluation of multi-hop wireless networks.",
                    "Mining frequent partial periodic patterns in spectrum usage data.",
                    "Periodical auctioning for QoS aware virtual network embedding.",
                    "Elite: Differentiating the playback lag for peer-assisted live video streaming.",
                    "Understanding video propagation in online social networks.",
                    "Improving the throughput and delay performance of network processors by applying push model.",
                    "AIST: Insights into queuing and loss on highly multiplexed links.",
                    "Understanding the impact of Denial of Service attacks on Virtual Machines.",
                    "A service quality coordination model bridging QoS and QoE.",
                    "Approaching optimal compression with fast update for large scale routing tables.",
                    "Division-of-labor between server and P2P for streaming VoD.",
                    "Video quality estimator for wireless mesh networks.",
                    "Audio-on-demand over wireless sensor networks.",
                    "On the partial caching of streaming video.",
                    "NCShield: Securing decentralized, matrix factorization-based network coordinate systems.",
                    "InSite: QoE-aware video delivery from cloud data centers.",
                    "Dishonest reporting in queue-based cross-layer network optimization.",
                    "Network Calculus and mixed-integer LP applied to a switched aircraft cabin network.",
                    "Session reconstruction for HTTP adaptive streaming: Laying the foundation for network-based QoE monitoring.",
                    "Adaptive dynamic priority scheduling for virtual desktop infrastructures.",
                    "Enhancing AQM to combat wireless losses.",
                    "Maximizing the bandwidth multiplier effect for hybrid cloud-P2P content distribution.",
                    "Exploring the policy selection of P2P VoD system - A simulation based research.",
                    "Next hop of strict partial order for NSFIB construction & aggregation.",
                    "Geo-fencing: Geographical-fencing based energy-aware proactive framework for mobile devices.",
                    "DECOR: A distributed coordinated resource monitoring system.",
                    "Preventing TCP incast throughput collapse at the initiation, continuation, and termination.",
                    "NetDEO: Automating network design, evolution, and optimization.",
                    "Pricing, competition and innovation: A profitable business model to resolve the tussle involved in peer-to-peer streaming applications.",
                    "A contract-ruled economic model for QoS guarantee in mobile peer-to-peer streaming services."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "19th IWQoS 2011",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2011",
                "sub_name": "19th International Workshop on Quality of Service, IWQoS 2011, San Jose, California, USA, 6-7 June 2011.",
                "count": 44,
                "papers": [
                    "Measuring the effectiveness of infrastructure-level detection of large-scale botnets.",
                    "Identity attack and anonymity protection for P2P-VoD systems.",
                    "Rake: Semantics assisted network-based tracing framework.",
                    "Multi-tiered, burstiness-aware bandwidth estimation and scheduling for VBR video flows.",
                    "Peer-assisted online games with social reciprocity.",
                    "On long-term social relationships in peer-to-peer systems.",
                    "A theoretical framework for developing distributed admissions control over delay-sensitive media flows.",
                    "Solve tree setup-break problem and minimize control overhead in delay-bounded distributed wireless multicast QoS routing.",
                    "Trajectory-assisted Delay-Bounded routing with moving receivers in Vehicular Ad-hoc Networks.",
                    "Charging ratio model for quality-based VoIP charging mechanism.",
                    "Initial CWND determination method for fast startup TCP algorithms.",
                    "Minimizing energy cost for Internet-scale datacenters with dynamic traffic.",
                    "TCAM-based DFA deflation: A novel approach to fast and scalable regular expression matching.",
                    "An MDP-based admission control for a QoS-aware service-oriented system.",
                    "Architecture and algorithms for virtual routers as a service.",
                    "MPCT: Minimum protection cost tree for IP fast reroute using Tunnel.",
                    "Distributed learning approach for channel selection in Cognitive Radio Networks.",
                    "On traffic characteristics and user experience of Skype video call.",
                    "QoS routing algorithms using fully polynomial time approximation scheme.",
                    "Delay based feedback, transport protocols and small buffers.",
                    "Performance evaluation of H264/SVC streaming system featuring real-time in-network adaptation.",
                    "QoS policy verification for DiffServ networks.",
                    "An application-level solution for the TCP-incast problem in data center networks.",
                    "PriceMyRoute: A competitive pricing strategy for Internet connectivity service providers.",
                    "Thwarting Spam over Internet Telephony (SPIT) attacks on VoIP networks.",
                    "Future Internet video multicasting with essentially perfect resource utilization and QoS guarantees.",
                    "Applying stochastic network calculus to 802.11 backlog and delay analysis.",
                    "Detecting shared congestion paths based on PCA.",
                    "Adaptive data-driven service integrity attestation for multi-tenant cloud systems.",
                    "PERFUME: Power and performance guarantee with fuzzy MIMO control in virtualized servers.",
                    "DynaQoS: Model-free self-tuning fuzzy control of virtualized resources for QoS provisioning.",
                    "OLIC: OnLine Information Compression for scalable hosting infrastructure monitoring.",
                    "Dexferizer: A service for data transfer optimization.",
                    "Auto-scaling emergency call centres using cloud resources to handle disasters.",
                    "Advanced Quality-of-Service signaling for IP multicast.",
                    "Measuring and enhancing the social connectivity of UGC video systems: A case study of YouKu.",
                    "Mitigating interference in a network measurement service.",
                    "Restoration measurements on an IP/MPLS backbone: The effect of Fast Reroute on link failure.",
                    "Multi-channel reliability and spectrum usage in real homes: Empirical studies for home-area sensor networks.",
                    "Utilizing elevator for wireless sensor data collection in high-rise structure monitoring.",
                    "Evaluating coverage quality through best covered pathes in wireless sensor networks.",
                    "Leveraging statistical multiplexing gains in single- and multi-hop networks.",
                    "Designing efficient codes for synchronization error channels.",
                    "On the performance of TCP over throughput-optimal CSMA."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "18th IWQoS 2010",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2010",
                "sub_name": "18th International Workshop on Quality of Service, IWQoS 2010, Beijing, China, 16-18 June 2010.",
                "count": 62,
                "papers": [
                    "Distributed tries for load balancing in peer-to-peer systems.",
                    "BitTorrent under a microscope: Towards static QoS provision in dynamic peer-to-peer networks.",
                    "SPoIM: A close look at pollution attacks in P2P live streaming.",
                    "PPVA: A universal and transparent peer-to-peer accelerator for interactive online video sharing.",
                    "Dynamic file-selection policies for bundling in BitTorrent-like systems.",
                    "APEX: A personalization framework to improve quality of experience for DVD-like functions in P2P VoD applications.",
                    "vPnP: Automated coordination of power and performance in virtualized datacenters.",
                    "Virtual batching: Request batching for energ conservation in virtualized servers.",
                    "A switch-based approach to throughput collapse and starvation in data centers.",
                    "VMRPC: A high efficiency and light weight RPC system for virtual machines.",
                    "An effective feedback-driven approach for energy saving in battery powered systems.",
                    "Dynamic duty cycle control for end-to-end delay guarantees in wireless sensor networks.",
                    "Providing fairness between TCP NewReno and TCP Vegas with RD network services.",
                    "Statistical end-to-end performance bounds for networks under long memory FBM cross traffic.",
                    "QoS-revenue tradeoff with time-constrained ISP pricing.",
                    "DAWN: Energy efficient data aggregation in WSN with mobile sinks.",
                    "On the complexity of maximizing the minimum Shannon capacity in Wireless Networks by joint channel assignment and power allocation.",
                    "A group-based cooperative medium access control protocol for cognitive radio networks.",
                    "Exploiting use of a new performance metric for construction of robust and efficient wireless backbone network.",
                    "Delay constrained optimal relay placement for planned wireless sensor networks.",
                    "Path diversified retransmission for TCP over wireless mesh networks.",
                    "Fish a lake: Fast release/capture sampling in large-scale sensor networks.",
                    "RC-MAC: A receiver-centric medium access control protocol for wireless sensor networks.",
                    "Wireless sensor network deployment in mobile phones assisted environment.",
                    "Evaluating the impact of data center network architectures on application performance in virtualized environments.",
                    "Traffic identification using flexible neural trees.",
                    "Resource allocation for QoS multiuser MIMO with zero forcing and MMSE beamforming.",
                    "Avidity-model based clonal selection algorithm for network intrusion detection.",
                    "An automatic performance testing method based on a formal model for communicating systems.",
                    "Measurement and analysis of end-to-end dependability characteristics in the global network.",
                    "Engineering an autonomous fuzzy controller for QoS control in distributed services.",
                    "Routing with uncertainty in wireless mesh networks.",
                    "Intelligent price-based congestion control for communication networks.",
                    "Macro-scheduling of base stations for video-on-demand flows in WiMAX networks.",
                    "Effective traffic control in IEEE 802.16j WiMAX networks.",
                    "10 Gbps implementation of TLS/SSL accelerator on FPGA.",
                    "Efficient parallel searching with TCAMs.",
                    "Traffic-aware base station sleeping in dense cellular networks.",
                    "Lightweight IP fast reroute with Tunnel-AT.",
                    "A measure of growth of user community in OSNs.",
                    "Exploring BitTorrent peer distribution via hybrid PlanetLab-Internet measurement.",
                    "Efficient and fine-grained sharing of encrypted files.",
                    "A clone of social networks to decentralized bootstrapping P2P networks.",
                    "Exploring the practicability of mobile sensors in complex environment surveillance.",
                    "A smart RFID system.",
                    "Handling triangle inequality violations in Euclidean distance based network coordinate systems.",
                    "MPIActor: A thread-based MPI program accelerator.",
                    "Data sweeper: A proactive filtering framework for error-bounded sensor data collection.",
                    "Measurements, analysis and modeling of private tracker sites.",
                    "Impacts of duty-cycle on TPGF geographical multipath routing in wireless sensor networks.",
                    "Research on uncertain weight of web service QoS criterions.",
                    "UPnP QoS and queuing in home networks.",
                    "Power aware job scheduling with QoS guarantees based on feedback control.",
                    "Tolerable interference in multi-channel sensor networks: A measurement study.",
                    "Evaluations of MadWifi MAC layer rate control mechanisms.",
                    "Analyzing router performance using network calculus with external measurements.",
                    "Characterizing tight-link bandwidth of multi-hop paths using probing response curves.",
                    "SureCall: Towards glitch-free real-time audio/video conferencing.",
                    "Energy efficient cooperation in underwater sensor networks.",
                    "Streaming scalable video over WiMAX networks.",
                    "On the model transform in stochastic network calculus.",
                    "DREAM: On the reaction delay in large scale wireless networks with mobile sensors."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "17th IWQoS 2009",
        "info": "Charleston, South Carolina, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2009",
                "sub_name": "17th International Workshop on Quality of Service, IWQoS 2009, Charleston, South Carolina, USA, 13-15 July 2009.",
                "count": 38,
                "papers": [
                    "Passive access capacity estimation for QoS measurement.",
                    "Cooperative multicast scheduling with random network coding in WiMAX.",
                    "Ensuring data storage security in Cloud Computing.",
                    "A calculus for information-driven networks.",
                    "On the fair coexistence of loss- and delay-based TCP.",
                    "Co-Con: Coordinated control of power and application performance for virtualized server clusters.",
                    "Generalized distributed rate limiting.",
                    "Fast Resilient Jumbo frames in wireless LANs.",
                    "Tree-structured data regeneration with network coding in distributed storage systems.",
                    "High quality P2P-Video-on-Demand with download bandwidth limitation.",
                    "Routing with QoS information aggregation in hierarchical networks.",
                    "Uncovering global icebergs in distributed monitors.",
                    "Modeling the interactions of congestion control and switch scheduling.",
                    "Optimal multi-path routing and bandwidth allocation under utility max-min fairness.",
                    "HOBRP: A hardware optimized packet scheduler that provides tunable end-to-end delay bound.",
                    "Reliable navigation of mobile sensors in wireless sensor networks without localization service.",
                    "On optimal information capture by energy-constrained mobile sensor.",
                    "Rate and delay controlled core networks: An experimental demonstration.",
                    "Supporting application network flows with multiple QoS constraints.",
                    "Integrated control of matching delay and CPU utilization in information dissemination systems.",
                    "Hybrid multi-channel multi-radio wireless mesh networks.",
                    "Congestion location detection: Methodology, algorithm, and performance.",
                    "Delay tolerant event collection for underground coal mine using mobile sinks.",
                    "Fast rerouting for IP multicast in managed IPTV networks.",
                    "HiDRA: Statistical multi-dimensional resource discovery for large-scale systems.",
                    "Admission control for roadside unit access in Intelligent Transportation Systems.",
                    "Throughput-smoothness tradeoff in preventing competing TCP from starvation.",
                    "Adaptive admission control for web applications with variable capacity.",
                    "Client and server games in peer-to-peer networks.",
                    "SigLM: Signature-driven load management for cloud computing infrastructures.",
                    "QoEScope: Adaptive IP service management for heterogeneous enterprise networks.",
                    "Online detection of network traffic anomalies using behavioral distance.",
                    "Succinct priority indexing structures for the management of large priority queues.",
                    "Efficient allocation of seed servers in peer-to-peer streaming systems with scalable videos.",
                    "End-wise admission control delegation for effective end-to-end quality of service.",
                    "On generalized low-rate denial-of-quality attack against Internet services.",
                    "Efficient server provisioning with end-to-end delay guarantee on multi-tier clusters.",
                    "A framework for fast handoff in IEEE 802.11 based systems."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "16th IWQoS 2008",
        "info": "Enskede, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2008",
                "sub_name": "16th International Workshop on Quality of Service, IWQoS 2008, University of Twente, Enskede, The Netherlands, 2-4 June 2008.",
                "count": 32,
                "papers": [
                    "Evolution and Enhancement of BitTorrent Network Topologies.",
                    "Cryptanalysis of a Hash Function Based on Quasi-cyclic Codes.",
                    "Reputation-Assisted Utility Maximization Algorithmsfor Peer-to-Peer Networks.",
                    "SLA-Based Service Composition in Enterprise Computing.",
                    "A Negotiation Mechanism for Advance Resource Reservations Using the Alternate Offers Protocol.",
                    "Self-* Overload Control for Distributed Web Systems.",
                    "On the Speedup Required to Achieve 100% Throughput for Multicast Over Crossbar Switches.",
                    "Obtaining High Throughput in Networks with Tiny Buffers.",
                    "Extensible Modular Design and Implementation of Hybrid Packet Schedulers.",
                    "Scaling Laws for File Dissemination in P2P Networks with Random Contacts.",
                    "Routers With Very Small Buffers: Anomalous Loss Performance for Mixed Real-Time and TCP Traffic.",
                    "ABS: Adaptive Buffer Sizing for Heterogeneous Networks.",
                    "Making a Delay-Based Protocol Adaptive to Heterogeneous Environments.",
                    "Performance Evaluation of PCN-Based Admission Control.",
                    "Towards Experimental Evaluation of Explicit Congestion Control.",
                    "Delay Analysis of Bandwidth Request in Truncated Binary Exponential Backoff Mechanism over Error-Free/Error-Prone Channels in IEEE 802.16e.",
                    "Dynamic Control of Tunable Sub-Optimal Algorithms for Scheduling of Time-Varying Wireless Networks.",
                    "Collaborative Target Detection in Wireless Sensor Networks with Reactive Mobility.",
                    "Achieving Energy Efficiency with Transmission Pushbacks in Sensor Networks.",
                    "Transcasting: Cost-Efficient Video Multicast for Heterogeneous Mobile Terminals.",
                    "Performance of TCP in Multi-Hop Access Networks.",
                    "Architecture of Achieving QoS for Multiple Flows per Node in WLANs.",
                    "Stochastically Guaranteed Routing for Additive Link Metrics with Unknown Distributions.",
                    "Performance Evaluation of Pre-Congestion Notification.",
                    "Dynamic Balancing of Packet Filtering Workloads on Distributed Firewalls.",
                    "Application Identification Based on Network Behavioral Profiles.",
                    "Statistics and Social Network of YouTube Videos.",
                    "Packet Loss in Real-Time Services: Markovian Models Generating QoE Impairments.",
                    "TCP-ROME: A Transport-Layer Approach to Enhance Quality of Experience for Online Media Streaming.",
                    "Edge-to-Edge Bailout Forward Contracts for Single-Domain Internet Services.",
                    "Control Plane for End-to-End QoS Guarantee: A Theory and Its Application.",
                    "Flexible QoS Route Selection with Diverse Objectives and Constraints."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "15th IWQoS 2007",
        "info": "Evanston, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2007",
                "sub_name": "Fifteenth IEEE International Workshop on Quality of Service, IWQoS 2007, Evanston, Illinois, USA, June 21-22, 2007.",
                "count": 25,
                "papers": [
                    "Competitive and Considerate Congestion Control for Bulk Data Transfers.",
                    "PIQI-RCP: Design and Analysis of Rate-Based Explicit Congestion Control.",
                    "Fairness Attacks in the Explicit Control Protocol.",
                    "Decentralized Replication Algorithms for Improving File Availability in P2P Networks.",
                    "On the Resilience-Complexity Tradeoff of Network Coding in Dynamic P2P Networks.",
                    "Parallelized Progressive Network Coding With Hardware Acceleration.",
                    "Probabilistic Field Coverage using a Hybrid Network of Static and Mobile Sensors.",
                    "Improving Routing Quality of Greedy Forwarding in Wireless Networks.",
                    "Evaluation of a Stateful Transport Protocol for Multi-channel Wireless Mesh Networks.",
                    "On the Stability Region of Linear-Memory Scheduling for Time Varying Channels.",
                    "On Area of Interest Coverage in Surveillance Mobile Sensor Networks.",
                    "On the Feasibility of Switching ISPs in Residential Multihoming.",
                    "Load Balancing Routing of Fault Tolerant QoS-Guaranteed VPNs.",
                    "Value of Supporting Class-of-Service in IP Backbones.",
                    "Efficient Algorithms For Optimizing Policy-Constrained Routing.",
                    "Drop counters are enough.",
                    "Slow and Steady: Modelling and Performance Analysis of the Network Entry Process in IEEE 802.16.",
                    "Recall and Precision in Distributed Bandwidth Allocation.",
                    "Improving Individual Flow Performance with Multiple Queue Fair Queuing.",
                    "Detecting Stealthy Spreaders Using Online Outdegree Histograms.",
                    "Securing BGP through Keychain-based Signatures.",
                    "Designing networks with hop bounded protection paths.",
                    "Performance metrics and configuration strategies for group network communication.",
                    "Structuring Multi-Layer Scalable Streams to Maximize Cient-Perceived Quality.",
                    "Profit-aware Admission Control for Overload Protection in E-commerce Web Sites."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "14th IWQoS 2006",
        "info": "New Haven, CT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2006",
                "sub_name": "Quality of Service - IWQoS 2006: 14th International Workshop, IWQoS 2006, New Haven, CT, USA, 19-21 June 2006, Proceedings.",
                "count": 38,
                "papers": [
                    "A Locating-First Approach for Scalable Overlay Multicast.",
                    "A Blueprint for Constructing Peer-to-Peer Systems Robust to Dynamic Worst-Case Joins and Leaves.",
                    "Echelon: Peer-to-Peer Network Diagnosis with Network Coding.",
                    "Stochastic Analysis and File Availability Enhancement for BT-like File Sharing Systems.",
                    "A Payment-based Incentive and Service Differentiation Mechanism for Peer-to-Peer Streaming Broadcast.",
                    "Modeling the Peering and Routing Tussle between ISPs and P2P Applications.",
                    "Improving Performance of Internet Services Through Reward-Driven Request Prioritization.",
                    "Optimal Capacity Sharing of Networks with Multiple Overlays.",
                    "Real-time Power-Aware Routing in Sensor Networks.",
                    "Partial Network Coding: Theory and Application for Continuous Sensor Data Collection.",
                    "Optimal Sleep/Wake Scheduling for Time-Synchronized Sensor Networks with QoS Guarantees.",
                    "Performance Analysis of a Reuse Partitioning Technique for OFDM Based Evolved UTRA.",
                    "Integrating Stability Estimation into Quality of Service Routing in Mobile Ad-hoc Networks.",
                    "GVGrid: A QoS Routing Protocol for Vehicular Ad Hoc Networks.",
                    "Dynamic Resource Allocation in IEEE 802.16 Broadband Wireless Networks.",
                    "Overload Protection for IEEE 802.11 Cells.",
                    "On the Performance of Error-Resilient End-Point-Based Multicast Streaming.",
                    "A Service Providers Approach for Improving Performance of Aggregate Voice-over-IP Traffic.",
                    "An Analytical Model for the Capacity Estimation of Combined VoIP and TCP File Transfers over EDCA in an IEEE 802.11e WLAN.",
                    "Network Decoupling for Secure Communications in Wireless Sensor Networks.",
                    "Fast Detection of Denial-of-Service Attacks on IP Telephony.",
                    "Efficient Proxy-Based Internet Media Distribution Control and Privacy Protection Infrastructure.",
                    "Host-Based Service Differentiation with Congestion Feedback.",
                    "A Case of TCP-Friendly Admission Control.",
                    "Supporting Loss Guarantees in Buffer-Limited Networks.",
                    "QoC-based Optimization of End-to-End M-Health Data Delivery Services.",
                    "An End-to-End Probabilistic Network Calculus with Moment Generating Functions.",
                    "Protecting Bursty Applications Against Traffic Aggressiveness.",
                    "How Practical is Network Coding?",
                    "A Simple Framework for QoS Provisioning in Traffic Engineered Networks.",
                    "QoS-GRAF: A Framework for QoS based Grid Resource Allocation with Failure Provisioning.",
                    "An Enhanced Scalable Proximity Model.",
                    "Flow-Cookies: Using Bandwidth Amplification to Defend Against DDoS Flooding Attacks.",
                    "QoS-Guaranteed Path Selection Algorithm for Service Composition.",
                    "Dynamic Adaptation of Temporal Event Correlation for QoS Management in Distributed Systems.",
                    "Performance of Ad Hoc Networks with Two-Hop Relay Routing and Limited Packet Lifetime.",
                    "A Variation of Route Flap Damping to Improve BGP Routing Convergence.",
                    "Issues in Bottleneck Detection in Multi-Tier Enterprise Applications."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "13th IWQoS 2005",
        "info": "Passau, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2005",
                "sub_name": "Quality of Service - IWQoS 2005: 13th International Workshop, IWQoS 2005, Passau, Germany, June 21-23, 2005, Proceedings.",
                "count": 43,
                "papers": [
                    "COPS: Quality of Service vs. Any Service at All.",
                    "Beyond Middleware and QoS - Service-Oriented Architectures - Cult or Culture?",
                    "Would Self-organized or Self-managed Networks Lead to Improved QoS?.",
                    "Overlay Networks with Linear Capacity Constraints.",
                    "A High-Throughput Overlay Multicast Infrastructure with Network Coding.",
                    "On Topological Design of Service Overlay Networks.",
                    "On Transport Layer Adaptation in Heterogeneous Wireless Data Networks.",
                    "LT-TCP: End-to-End Framework to Improve TCP Performance over Networks with Lossy Channels.",
                    "QoS Guarantees in Multimedia CDMA Wireless Systems with Non-precise Network Parameter Estimates.",
                    "Analyzing Object Detection Quality Under Probabilistic Coverage in Sensor Networks.",
                    "A Self-tuning Fuzzy Control Approach for End-to-End QoS Guarantees in Web Servers.",
                    "Calculation of Speech Quality by Aggregating the Impacts of Individual Frame Losses.",
                    "Best-Effort Versus Reservations Revisited.",
                    "An Advanced QoS Protocol for Real-Time Content over the Internet.",
                    "Designing a Predictable Internet Backbone with Valiant Load-Balancing.",
                    "Preserving the Independence of Flows in General Topologies Using Turn-Prohibition.",
                    "Supporting Differentiated QoS in MPLS Networks.",
                    "Avoiding Transient Loops Through Interface-Specific Forwarding.",
                    "Analysis of Stochastic Service Guarantees in Communication Networks: A Server Model.",
                    "Preemptive Packet-Mode Scheduling to Improve TCP Performance.",
                    "Edge-Based Differentiated Services.",
                    "Processor Sharing Flows in the Internet.",
                    "A Practical Method for the Efficient Resolution of Congestion in an On-path Reduced-State Signalling Environment.",
                    "Case Study in Assessing Subjective QoS of a Mobile Multimedia Web Service in a Real Multi-access Network.",
                    "WXCP: Explicit Congestion Control for Wireless Multi-hop Networks.",
                    "A Non-homogeneous QBD Approach for the Admission and GoS Control in a Multiservice WCDMA System.",
                    "Quality of Service Authentication, Authorization and Accounting.",
                    "Preliminary Results Towards Building a Highly Granular QoS Controller.",
                    "Concept of Admission Control in Packet Switching Networks Based on Tentative Accommodation of Incoming Flows.",
                    "Improving Uplink QoS of Wifi Hotspots.",
                    "Resilient State Management in Large Scale Networks.",
                    "Performance Analysis of Wireless Scheduling with ARQ in Fast Fading Channels.",
                    "Privacy and Reliability by Dispersive Routing.",
                    "Distributed Online LSP Merging Algorithms for MPLS-TE.",
                    "Implicit Flow QoS Signaling Using Semantic-Rich Context Tags.",
                    "Using IP as Transport Technology in Third Generation and Beyond Radio Access Networks.",
                    "Closing the Gap Between Industry, Academia and Users: Is There a Need for QoS in Wireless Systems?",
                    "Why QoS Will Be Needed in Metro Ethernets.",
                    "Research Issues in QoS Provisioning for Personal Networks.",
                    "RSVP Standards Today and the Path Towards a Generic Messenger.",
                    "QoS in Hybrid Networks - An Operator's Perspective.",
                    "QoS for Aggregated Flows in VPNs.",
                    "Supporting Mission-Critical Applications over Multi-service Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "12th IWQoS 2004",
        "info": "Montreal, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2004",
                "sub_name": "Quality of Service - IWQoS 2004, 12th International Workshop, Montreal, Canada, June 7-9, 2004, Proceedings.",
                "count": 30,
                "papers": [
                    "Enhancing mobile QoS based on movement contracts.",
                    "Robust communications for sensor networks in hostile environments.",
                    "Distributed on-line schedule adaptation for balanced slot allocation in wireless ad hoc networks.",
                    "Mobility assisted optimal routing in noninterfering mobile ad hoc networks.",
                    "Decay function model for resource configuration and adaptive allocation on Internet servers.",
                    "Yaksha: a self-tuning controller for managing the performance of 3-tiered Web sites.",
                    "Provisioning servers in the application tier for e-commerce systems.",
                    "Triage: performance isolation and differentiation for storage systems.",
                    "Coordinated aggregate scheduling for improving end-to-end delay performance.",
                    "Local flow separation.",
                    "A simple FIFO-based scheme for differentiated loss guarantees.",
                    "Delay bound Guarantees with WFQ-based CBQ discipline.",
                    "Network calculus meets queueing theory -a simulation based approach to bounded queues.",
                    "Service performance monitoring for EGPRS networks based on treatment classes.",
                    "Service quality measurements for IPv6 inter-networks.",
                    "A mechanism for equitable bandwidth allocation under QoS and budget constraints.",
                    "Towards a formal model for QoS specification and handling in networks.",
                    "Backward connection preemption in multiclass QoS-aware networks.",
                    "On quality-of-service and energy consumption tradeoffs in FEC-encoded audio streaming.",
                    "Incentive mechanism for peer-to-peer media streaming.",
                    "Towards content distribution networks with latency guarantees.",
                    "Policy-driven multifile distribution.",
                    "Small world overlay P2P networks.",
                    "Topology design for service overlay networks with bandwidth guarantees.",
                    "Maxmin overlay multicast: rate allocation and tree construction.",
                    "Service availability: a new approach to characterize IP backbone topologies.",
                    "Paving the first mile for QoS-dependent applications and appliances.",
                    "Client-centered energy and delay analysis for TCP downloads.",
                    "Single-service quality differentiation.",
                    "Where packet traces meet speech samples: an instrumental approach to perceptual QoS evaluation of VoIP."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "11th IWQoS 2003",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2003",
                "sub_name": "Quality of Service - IWQoS 2003, 11th International Workshop, Berkeley, CA, USA, June 2-4, 2003, Proceedings.",
                "count": 27,
                "papers": [
                    "Network Characteristics: Modelling, Measurements, and Admission Control.",
                    "Statistical Characterization for Per-hop QoS.",
                    "Performance Analysis of Server Sharing Collectives for Content Distribution.",
                    "An Approximation of the End-to-End Delay Distribution.",
                    "Price-Based Resource Allocation in Wireless Ad Hoc Networks.",
                    "On Achieving Fairness in the Joint Allocation of Processing and Bandwidth Resources.",
                    "Distributed Admission Control for Heterogeneous Multicast with Bandwidth Guarantees.",
                    "Subjective Impression of Variations in Layer Encoded Videos.",
                    "A Moving Average Predictor for Playout Delay Control in VoIP.",
                    "To Play or to Control: A Game-Based Control-Theoretic Approach to Peer-to-Peer Incentive Engineering.",
                    "Improving Dependability of Real-Time Communication with Preplanned Backup Routes and Spare Resource Pool.",
                    "Fault Tolerance in Networks with an Advance Reservation Service.",
                    "Routing and Grooming in Two-Tier Survivable Optical Mesh Networks.",
                    "Fast Network Re-optimization Schemes for MPLS and Optical Networks.",
                    "HMP: Hotspot Mitigation Protocol for Mobile Ad hoc Networks.",
                    "Failure Insensitive Routing for Ensuring Service Availability.",
                    "Network Availability Based Service Differentiation.",
                    "Quality of Availability: Replica Placement for Widely Distributed Systems.",
                    "Using Latency Quantiles to Engineer QoS Guarantees for Web Services.",
                    "DotQoS - A QoS Extension for .NET Remoting.",
                    "Dynamic Resource Allocation for Shared Data Centers Using Online Measurements.",
                    "Providing Deterministic End-to-End Fairness Guarantees in Core-Stateless Networks.",
                    "Per-domain Packet Scale Rate Guarantee for Expedited Forwarding.",
                    "On Achieving Weighted Service Differentiation: An End-to-End Perspective.",
                    "Online Response Time Optimization of Apache Web Server.",
                    "A Practical Learning-Based Approach for Dynamic Storage Bandwidth Allocation.",
                    "CacheCOW: QoS for Storage System Caches."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "10th IWQoS 2002",
        "info": "Miami Beach, FL, USA",
        "venues": []
    },
    {
        "year": "2001",
        "name": "9th IWQoS 2001",
        "info": "Karlsruhe, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/iwqos/2001",
                "sub_name": "Quality of Service - IWQoS 2001, 9th International Workshop Karlsruhe, Germany, June 6-8, 2001, Proceedings.",
                "count": 32,
                "papers": [
                    "Panel Discussion: How Will Media Distribution Work in the Internet.",
                    "Invited Talk: Automated, Dynamic Traffic Engineering in Multi-service IP Networks.",
                    "Dynamic Core Provisioning for Quantitative Differentiated Service.",
                    "Towards Provisioning Diffserv Intra-Nets.",
                    "Analysis of Paris Metro Pricing Strategy for QoS with a Single Service Provider.",
                    "Why Value Is Everything: A User-Centered Approach to Internet Quality of Service and Pricing.",
                    "Traveling to Rome: QoS Specifications for Automated Storage System Management.",
                    "Extending a Best-Effort Operating System to Provide QoS Processor Management.",
                    "User Focus in Consumer Terminals and Conditionally Guaranteed Budgets.",
                    "Extending BGMP for Shared-Tree Inter-Domain QoS Multicast.",
                    "Granularity of QoS Routing in MPLS Networks.",
                    "Fault Tolerance and Load Balancing in QoS Provisioning with Multiple MPLS Paths.",
                    "On Selection of Paths for Multipath Routing.",
                    "Preferential Treatment of Acknowledgment Packets in a Differentiated Services Network.",
                    "A Quantitative Model for the Parameter Setting of RED with TCP Traffic.",
                    "Evaluation of the QoS Offered by PRTP-ECN - A TCP-Compliant Partially Reliable Transport Protocol.",
                    "GAME Based QoS Provisioning in Multimedia Wideband CDMA Networks.",
                    "QoS-Aware Adaptive Services in Mobile Ad-Hoc Networks.",
                    "Experimental Extensions to RSVP - Remote Client and One-Pass Signalling.",
                    "Extended Quality-of-Service for Mobile Networks.",
                    "Quality of Service Schemes for IEEE 802.11: A Simulation Study.",
                    "Differentiated Services over Shared Media.",
                    "End-to-Edge QoS System Integration: Integrated Resource Reservation Framework for Mobile Internet.",
                    "Problems of Elastic Traffic Admission Control in an HTTP Scenario.",
                    "Aggregation and Scalable QoS: A Performance Study.",
                    "Customizable Cooperative Metering for Multi-ingress Service Level Agreements in Differentiated Network Services.",
                    "Segmented Adaptation of Traffic Aggregates.",
                    "Differentiated Services with Lottery Queueing.",
                    "On Creating Proportional Loss-Rate Differentiation: Predictability and Performance.",
                    "A Novel Scheduler For a Low Delay Service Within Best-Effort.",
                    "JoBS: Joint Buffer Management and Scheduling for Differentiated Services.",
                    "Optimal Call Admission Control under Generalized Processor Sharing Scheduling."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "8th IWQoS 2000",
        "info": "Pittsburgh, PA, USA",
        "venues": []
    },
    {
        "year": "1999",
        "name": "7th IWQoS 1999",
        "info": "London, UK",
        "venues": []
    },
    {
        "year": "1998",
        "name": "6th IWQoS 1998",
        "info": "Napa, California, USA",
        "venues": []
    },
    {
        "year": "1997",
        "name": "5th IWQoS 1997",
        "info": "New York, NY, USA",
        "venues": []
    },
    {
        "year": "1996",
        "name": "4th IWQoS 1996",
        "info": "Paris, France",
        "venues": []
    },
    {
        "year": "1995",
        "name": "3rd IWQoS 1995",
        "info": "Brisbane, Queensland, Australia",
        "venues": []
    },
    {
        "year": "1994b",
        "name": "2nd IWQoS 1994",
        "info": "Aachen, Germany",
        "venues": []
    },
    {
        "year": "1994a",
        "name": "1st IWQoS 1994",
        "info": "Montreal, Canada",
        "venues": []
    }
]