[
    {
        "name": "JNCA",
        "year": "2022",
        "info": "2022: Volumes\n197,\n198,\n199,\n200,",
        "count": 32,
        "papers": [
            "Optimizing the quality of information of networked machine learning agents.",
            "A progressive learning method on unknown protocol behaviors.",
            "Video streaming over IoV using IP multicast.",
            "Efficient solutions to the placement and chaining problem of User Plane Functions in 5G networks.",
            "A context-aware information-based clone node attack detection scheme in Internet of Things.",
            "Recent advances in energy management for Green-IoT: An up-to-date and comprehensive survey.",
            "RANet: Network intrusion detection with group-gating convolutional neural network.",
            "An enhanced deep learning based framework for web attacks detection, mitigation and attacker profiling.",
            "A robust authentication scheme for remote diagnosis and maintenance in 5G V2N.",
            "Design and implementation of an intrusion detection system by using Extended BPF in the Linux kernel.",
            "On the scalability of Big Data Cyber Security Analytics systems.",
            "A survey on energy efficiency in underwater wireless communications.",
            "Smart network maintenance in edge cloud computing environment: An allocation mechanism based on comprehensive reputation and regional prediction model.",
            "Blockchain-based delegated Quantum Cloud architecture for medical big data security.",
            "Performability evaluation of switch-over Moving Target Defence mechanisms in a Software Defined Networking using stochastic reward nets.",
            "Measuring fault tolerance in IoT mesh networks using Voronoi diagram.",
            "Uniform and regular reliable broadcast protocols facilitating concurrent message dissemination for mobile ad hoc networks with the network liveness property.",
            "Who are there: Discover Twitter users and tweets for target area using mention relationship strength and local tweet ratio.",
            "A cost aware topology formation scheme for latency sensitive applications in edge infrastructure-as-a-service paradigm.",
            "Raze policy conflicts in SDN.",
            "Multi-access Edge Computing fundamentals, services, enablers and challenges: A complete survey.",
            "Preemptive admission control mechanism for strict QoS guarantee to life-saving emergency traffic in wireless LANs.",
            "An efficient and lightweight identity-based scheme for secure communication in clustered wireless sensor networks.",
            "Industrial digital twins at the nexus of NextG wireless networks and computational intelligence: A survey.",
            "A contemporary survey on free space optical communication: Potentials, technical challenges, recent advances and research direction.",
            "Privacy-preserving mechanisms for location privacy in mobile crowdsensing: A survey.",
            "Towards blockchain-IoT based shared mobility: Car-sharing and leasing as a case study.",
            "Device and network driven cellular networks architecture and mobility management technique for fog computing-based mobile communication system.",
            "An efficient and cost effective application mapping for network-on-chip using Andean condor algorithm.",
            "Design and implementation of NDN-based Ethereum blockchain.",
            "Dynamic hard pruning of Neural Networks at the edge of the internet.",
            "Service discovery and selection in IoT: A survey and a taxonomy."
        ]
    },
    {
        "name": "JNCA",
        "year": "2021",
        "info": "2021: Volumes\n173,\n174,\n175,\n176,\n177,\n178,\n179,\n180,\n181,\n182,\n183-184,\n185,\n186,\n187,\n188,\n189,\n190,\n191,\n192,\n193,\n194,\n195,\n196",
        "count": 181,
        "papers": [
            "Selective blockchain system for secure and efficient D2D communication.",
            "Utilizing QR codes to verify the visual fidelity of image datasets for machine learning.",
            "Yet efficient routing protocols for half- and full-duplex cognitive radio Ad-Hoc Networks over IoT environment.",
            "Adaptive Small Cell position algorithm (ASPA) for green farming using NB-IoT.",
            "Integrating blockchain and Internet of Things systems: A systematic review on objectives and designs.",
            "When RSSI encounters deep learning: An area localization scheme for pervasive sensing systems.",
            "DNC: A Deep Neural Network-based Clustering-oriented Network Embedding Algorithm.",
            "VE-CoAP: A constrained application layer protocol for IoT video transmission.",
            "A Trust Game Model of Service Cooperation in Cloud Computing.",
            "A load-adaptive fair access protocol for MAC in underwater acoustic sensor networks.",
            "HeporCloud: An energy and performance efficient resource orchestrator for hybrid heterogeneous cloud computing environments.",
            "Distributed real-time SlowDoS attacks detection over encrypted traffic using Artificial Intelligence.",
            "Identifying click-requests for the network-side through traffic behavior.",
            "IoT-based telemedicine for disease prevention and health promotion: State-of-the-Art.",
            "User preference-aware navigation for mobile robot in domestic via defined virtual area.",
            "Network traffic classification using deep convolutional recurrent autoencoder neural networks for spatial-temporal features extraction.",
            "A comprehensive survey of load balancing techniques in software-defined network.",
            "A privacy-preserving protocol for continuous and dynamic data collection in IoT enabled mobile app recommendation system (MARS).",
            "Fog data management: A vision, challenges, and future directions.",
            "Routing in the Space Internet: A contact graph routing tutorial.",
            "IoMT amid COVID-19 pandemic: Application, architecture, technology, and security.",
            "Protected Resource Allocation in Space Division Multiplexing-Elastic Optical Networks with Fluctuating Traffic.",
            "QoS-oriented joint optimization of concurrent scheduling and power control in millimeter wave mesh backhaul network.",
            "Receivers location privacy in avionic crowdsourced networks: Issues and countermeasures.",
            "Tensor based framework for Distributed Denial of Service attack detection.",
            "DroneCells: Improving spectral efficiency using drone-mounted flying base stations.",
            "Corrigendum to \"A trust game model of service cooperation in cloud computing\" [J. Netw. Comput. Appl. 173 (20) 2020 102864].",
            "Enhancing BitTorrent for efficient interactive video-on-demand streaming over MANETs.",
            "Regulating data sharing across MQTT environments.",
            "A privacy-preserving consensus mechanism for an electric vehicle charging scheme.",
            "FAMD: A Flow-Aware Marking and Delay-based TCP algorithm for datacenter networks.",
            "The Blockchain Random Neural Network for cybersecure IoT and 5G infrastructure in Smart Cities.",
            "Renewable energy powered sustainable 5G network infrastructure: Opportunities, challenges and perspectives.",
            "Field surveillance of fuel dispensers using IoT-based metering and blockchains.",
            "Towards end-to-end resource provisioning in Fog Computing over Low Power Wide Area Networks.",
            "Fine granularity resource allocation of virtual data center with consideration of virtual switches.",
            "Security and blockchain convergence with Internet of Multimedia Things: Current trends, research challenges and future directions.",
            "Unified and standalone monitoring module for NFV/SDN infrastructures.",
            "From smart parking towards autonomous valet parking: A survey, challenges and future Works.",
            "Wersync: A web platform for synchronized social viewing enabling interaction and collaboration.",
            "Network-aware task selection to reduce multi-application makespan in cloud.",
            "Spatial-temporal constrained particle filter for cooperative target tracking.",
            "Proxy re-encryption enabled secure and anonymous IoT data sharing platform based on blockchain.",
            "Mutual authentication with multi-factor in IoT-Fog-Cloud environment.",
            "On the reduction of authoritative DNS cache timeouts: Detection and implications for user privacy.",
            "SPO: A Secure and Performance-aware Optimization for MapReduce Scheduling.",
            "A survey on network forwarding in Software-Defined Networking.",
            "Proactive tasks management for Pervasive Computing Applications.",
            "A multi-type and decentralized data transaction scheme based on smart contracts and digital watermarks.",
            "RC-chain: Reputation-based crowdsourcing blockchain for vehicular networks.",
            "Survey on blockchain based smart contracts: Applications, opportunities and challenges.",
            "DRL-R: Deep reinforcement learning approach for intelligent routing in software-defined data-center networks.",
            "The convergence of IoT and distributed ledger technologies (DLT): Opportunities, challenges, and solutions.",
            "Dissecting bitcoin blockchain: Empirical analysis of bitcoin network (2009-2020).",
            "A GRU deep learning system against attacks in software defined networks.",
            "Content delivery enhancement in Vehicular Social Network with better routing and caching mechanism.",
            "MutualRec: Joint friend and item recommendations with mutualistic attentional graph neural networks.",
            "Joint edge caching and dynamic service migration in SDN based mobile edge computing.",
            "Analysis and comparison of mobility management strategies in public land mobile networks from a multiobjective perspective.",
            "SDRS: A stable data-based recruitment system in IoT crowdsensing for localization tasks.",
            "Modeling and analyzing RFID Generation-2 under unreliable channels.",
            "Blockchain and smart contract for access control in healthcare: A survey, issues and challenges, and open issues.",
            "Secure and cost-effective controller deployment in multi-domain SDN with Baguette.",
            "Virtual reality: A survey of enabling technologies and its applications in IoT.",
            "Adopting elitism-based Genetic Algorithm for minimizing multi-objective problems of IoT service placement in fog computing environment.",
            "LIDDE: A differential evolution algorithm based on local-influence-descending search strategy for influence maximization in social networks.",
            "An autonomous computation offloading strategy in Mobile Edge Computing: A deep learning-based hybrid approach.",
            "A comprehensive survey and taxonomy of the SVM-based intrusion detection systems.",
            "A survey on the suitability of risk identification techniques in the current networked environment.",
            "Energy-efficient scheduling of small cells in 5G: A meta-heuristic approach.",
            "Contra-∗: Mechanisms for countering spam attacks on blockchain's memory pools.",
            "MedHypChain: A patient-centered interoperability hyperledger-based medical healthcare system: Regulation in COVID-19 pandemic.",
            "Towards reliable and efficient data retrieving in ICN-based satellite networks.",
            "Reliability optimization for industrial WSNs with FD relays and multiple parallel connections.",
            "Dew computing-inspired health-meteorological factor analysis for early prediction of bronchial asthma.",
            "The rise of software vulnerability: Taxonomy of software vulnerabilities detection and machine learning approaches.",
            "A heuristic scheduling approach for fog-cloud computing environment with stationary IoT devices.",
            "New signal location method based on signal-range data for proximity tracing tools.",
            "Context-aware scheduling in Fog computing: A survey, taxonomy, challenges and future directions.",
            "Cost-aware automatic scaling and workload-aware replica management for edge-cloud environment.",
            "Temporary immutability: A removable blockchain solution for prosumer-side energy trading.",
            "A distributed deployment algorithm for communication coverage in wireless robotic networks.",
            "A scalable private Bitcoin payment channel network with privacy guarantees.",
            "A two-phase virtual machine placement policy for data-intensive applications in cloud.",
            "Applying machine learning techniques for caching in next-generation edge networks: A comprehensive survey.",
            "Blockchain for IoT-based smart cities: Recent advances, requirements, and future challenges.",
            "Application-aware resource allocation and data management for MEC-assisted IoT service providers.",
            "A hierarchical approach for accelerating IoT data management process based on SDN principles.",
            "Advanced protocols for the mitigation of friendly jamming in mobile ad-hoc networks.",
            "Blockchain based solutions to secure IoT: Background, integration trends and a way forward.",
            "A survey of consensus algorithms in public blockchain systems for crypto-currencies.",
            "Wi-Fi HaLow for the Internet of Things: An up-to-date survey on IEEE 802.11ah research.",
            "An application of multi-objective reinforcement learning for efficient model-free control of canals deployed with IoT networks.",
            "Unknown hostile environment-oriented autonomous WSN deployment using a mobile robot.",
            "TRAQR: Trust aware End-to-End QoS routing in multi-domain SDN using Blockchain.",
            "DISTILLER: Encrypted traffic classification via multimodal multitask deep learning.",
            "FAN: Fast and Active Network Formation in IEEE 802.15.4 TSCH Networks.",
            "GSA-RPI: GSA based Rendezvous Point Identification in a two-level cluster based LR-WPAN for uncovering the optimal trajectory of Mobile Data Collection Agent.",
            "Cost_EACP: Cost-effective adaptive controller provisioning in software defined DCNs.",
            "Temperature-aware routing protocol for Intrabody Nanonetworks.",
            "Service migration in multi-access edge computing: A joint state adaptation and reinforcement learning mechanism.",
            "A trustworthy and incentivized smart grid energy trading framework using distributed ledger and smart contracts.",
            "DP-GAN: Differentially private consecutive data publishing using generative adversarial nets.",
            "Domain-specific knowledge graphs: A survey.",
            "Application placement in Fog computing with AI approach: Taxonomy and a state of the art survey.",
            "A fast all-packets-based DDoS attack detection approach based on network graph and graph kernel.",
            "Worm computing: A blockchain-based resource sharing and cybersecurity framework.",
            "Learned Bloom-filter for the efficient name lookup in Information-Centric Networking.",
            "Proactive fault-tolerant wireless mesh networks for mission-critical control systems.",
            "Corrigendum to \"Service migration in multi-access edge computing: A joint state adaptation and reinforcement learning mechanism\" [J. Netw. Comput. Appl. 183-184 (2021) 103058].",
            "Minimizing the spread of misinformation in online social networks: A survey.",
            "An adaptive hierarchical data dissemination mechanism for mobile data collector enabled dynamic wireless sensor network.",
            "Emerging DDoS attack detection and mitigation strategies in software-defined networks: Taxonomy, challenges and future directions.",
            "A survey on the role of Internet of Things for adopting and promoting Agriculture 4.0.",
            "Automated DDOS attack detection in software defined networking.",
            "Towards secure intrusion detection systems using deep learning techniques: Comprehensive analysis and review.",
            "Attacks and defenses in user authentication systems: A survey.",
            "A Systematic Review of Quality of Service in Wireless Sensor Networks using Machine Learning: Recent Trend and Future Vision.",
            "Low load DIDS task scheduling based on Q-learning in edge computing environment.",
            "Prepare for trouble and make it double! Supervised - Unsupervised stacking for anomaly-based intrusion detection.",
            "Energy-efficient user association with load-balancing for cooperative IIoT network within B5G era.",
            "Exploring an edge convolution and normalization based approach for link prediction in complex networks.",
            "UAV assisted 5G and beyond wireless networks: A survey.",
            "Traffic Engineering in Hybrid Software Defined Network via Reinforcement Learning.",
            "SDN-based wireless mobile backhaul architecture: Review and challenges.",
            "Hierarchical community discovery for multi-stage IP bearer network upgradation.",
            "Fake news outbreak 2021: Can we stop the viral spread?",
            "Secure data aggregation methods and countermeasures against various attacks in wireless sensor networks: A comprehensive review.",
            "Intercepting Hail Hydra: Real-time detection of Algorithmically Generated Domains.",
            "Analysis of cryptocurrency transactions from a network perspective: An overview.",
            "An overview on low energy wake-up radio technology: Active and passive circuits associated with MAC and routing protocols.",
            "Optimizing the resource usage of actor-based systems.",
            "Mobile cloud computing models security issues: A systematic review.",
            "Towards DDoS detection mechanisms in Software-Defined Networking.",
            "Automatic guarantee scheme for intent-driven network slicing and reconfiguration.",
            "Fog radio access network optimization for 5G leveraging user mobility and traffic data.",
            "Privacy protection among three antithetic-parties for context-aware services.",
            "Swarm intelligence for next-generation networks: Recent advances and applications.",
            "Cross-layer multipath approach for critical traffic in duty-cycled wireless sensor networks.",
            "Two-sided preferences task matching mechanisms for blockchain-based crowdsourcing.",
            "Performance analysis of spatially distributed LTE-U/NR-U and Wi-Fi networks: An analytical model for coexistence study.",
            "An optimized content caching strategy for video stream in edge-cloud environment.",
            "A novel hybrid model for intrusion detection systems in SDNs based on CNN and a new regularization technique.",
            "Touch-based continuous mobile device authentication: State-of-the-art, challenges and opportunities.",
            "SecureBallot: A secure open source e-Voting system.",
            "A systematic review of IoT in healthcare: Applications, techniques, and trends.",
            "Strategizing secured image storing and efficient image retrieval through a new cloud framework.",
            "Temporal complex networks modeling applied to vehicular ad-hoc networks.",
            "Reducing traffic burstiness for MPTCP in data center networks.",
            "LMAAS-IoT: Lightweight multi-factor authentication and authorization scheme for real-time data access in IoT cloud-based environment.",
            "Internet of Healthcare Things: A contemporary survey.",
            "Deep Q-Network and Traffic Prediction based Routing Optimization in Software Defined Networks.",
            "Publicly verifiable outsourced data migration scheme supporting efficient integrity checking.",
            "Machine learning based malicious payload identification in software-defined networking.",
            "Deep learning for online AC False Data Injection Attack detection in smart grids: An approach using LSTM-Autoencoder.",
            "A provably secure ECC-based access and handover authentication protocol for space information networks.",
            "Multicast-aware optimization for resource allocation with edge computing and caching.",
            "OpenPATH: Application aware high-performance software-defined switching framework.",
            "A lightweight and secure handover authentication scheme for 5G network using neighbour base stations.",
            "SoftIoT: A resource-aware SDN/NFV-based IoT network.",
            "A selective ensemble model for cognitive cybersecurity analysis.",
            "CREME: A toolchain of automatic dataset collection for machine learning in intrusion detection.",
            "A Survey of Channel Modeling Techniques for Visible Light Communications.",
            "A survey on deep learning for challenged networks: Applications and trends.",
            "A QoS-Based routing algorithm over software defined networks.",
            "Reinforcement learning-based dynamic routing using mobile sink for data collection in WSNs and IoT applications.",
            "A radio map self-updating algorithm based on mobile crowd sensing.",
            "Design, implementation, and performance evaluation of a drone wakeup and data collection system for smart meters.",
            "Graph partition based privacy-preserving scheme in social networks.",
            "VNF-based network service consistent reconfiguration in multi-domain federations: A distributed approach.",
            "Detecting the impact of software vulnerability on attacks: A case study of network telescope scans.",
            "A systematic review of blockchain scalability: Issues, solutions, analysis and future research.",
            "Multi-objective particle swarm optimization based rendezvous point selection for the energy and delay efficient networked wireless sensor data acquisition.",
            "A novel ICMetric public key framework for secure communication.",
            "HOPASS: A two-layer control framework for bandwidth and delay guarantee in datacenters.",
            "RICH: Strategy-proof and efficient coflow scheduling in non-cooperative environments.",
            "Towards development of IoT-ML driven healthcare systems: A survey.",
            "A Survey on Blockchain in Robotics: Issues, Opportunities, Challenges and Future Directions.",
            "Blockchain-based solutions for cloud computing: A survey.",
            "R-gram: Inferring message formats of service protocols with relative positional n-grams.",
            "Flow control oriented forwarding and caching in cache-enabled networks."
        ]
    },
    {
        "name": "JNCA",
        "year": "2020",
        "info": "2020: Volumes\n149,\n150,\n151,\n152,\n153,\n154,\n155,\n156,\n157,\n158,\n159,\n160,\n161,\n162,\n163,\n164,\n165,\n166,\n167,\n168,\n169,\n170,\n171,\n172",
        "count": 188,
        "papers": [
            "Social-aware cooperative caching mechanism in mobile social networks.",
            "Survey of the low power wide area network technologies.",
            "CMI: An online multi-objective genetic autoscaler for scientific and engineering workflows in cloud infrastructures with unreliable virtual machines.",
            "SBAC: A secure blockchain-based access control framework for information-centric networking.",
            "Sidechain technologies in blockchain networks: An examination and state-of-the-art review.",
            "Survey and taxonomy of MAC, routing and cross layer protocols using wake-up radio.",
            "An analytical model to estimate the performance metrics of a finite multihop network deployed in a rectangular region.",
            "Multimodal big data affective analytics: A comprehensive survey using text, audio, visual and physiological signals.",
            "Efficient dynamic multi-keyword fuzzy search over encrypted cloud data.",
            "A Comprehensive Survey on Attacks, Security Issues and Blockchain Solutions for IoT and IIoT.",
            "Efficient measurement of round-trip link delays in software-defined networks.",
            "An efficient reinforcement learning-based Botnet detection approach.",
            "Optimal caching policy for wireless content delivery in D2D networks.",
            "A robust multimedia traffic SDN-Based management system using patterns and models of QoE estimation with BRNN.",
            "An energy, performance efficient resource consolidation scheme for heterogeneous cloud datacenters.",
            "A versatile Key Management protocol for secure Group and Device-to-Device Communication in the Internet of Things.",
            "Real-time throughput prediction for cognitive Wi-Fi networks.",
            "LAM-CIoT: Lightweight authentication mechanism in cloud-based IoT environment.",
            "Channel-reserved medium access control for edge computing based IoT.",
            "An Empirical Survey of Functions and Configurations of Open-Source Capture the Flag (CTF) Environments.",
            "Efficient computation of loop-free alternates.",
            "On-demand resource provision based on load estimation and service expenditure in edge cloud environment.",
            "A hybrid machine learning approach for malicious behaviour detection and recognition in cloud computing.",
            "CTRA: A complex terrain region-avoidance charging algorithm in Smart World.",
            "ECN+: A marking-aware optimization for ECN threshold via per-Port in Data Center Networks.",
            "Energy conservation strategies in Named Data Networking based MANET using congestion control: A review.",
            "Load balance based workflow job scheduling algorithm in distributed cloud.",
            "PGFit: Static permission analysis of health and fitness apps in IoT programming frameworks.",
            "A microservice recommendation mechanism based on mobile architecture.",
            "The source-multicast: A sender-initiated multicast member management mechanism in SRv6 networks.",
            "Reality shock in virtual network embedding: Flexibilizing demands for dealing with multiple operational requirements in SDNs.",
            "Corrigendum to \"COIN: A fast packet inspection method over compressed traffic\" [J. Netw. Comput. Appl. 127(2019) 122-134].",
            "The rise of machine learning for detection and classification of malware: Research developments, trends and challenges.",
            "Fog-based smart homes: A systematic review.",
            "Performance evaluation of equivalent forwarding sets in software defined networking.",
            "FSFC: An input filter-based secure framework for smart contract.",
            "A novel reward and penalty trust evaluation model based on confidence interval using Petri Net.",
            "A Survey of Exploitation Techniques and Defenses for Program Data Attacks.",
            "Reliability-aware virtual network function placement in carrier networks.",
            "The rise of traffic classification in IoT networks: A survey.",
            "Survey and taxonomy of clustering algorithms in 5G.",
            "Large-volume data dissemination for cellular-assisted automated driving with edge intelligence.",
            "Software-Defined Networking load distribution technique for an internet service provider.",
            "Temporal Differential Privacy in Wireless Sensor Networks.",
            "An Adaptive Security Data Collection and Composition Recognition method for security measurement over LTE/LTE-A networks.",
            "Novel resource allocation mechanism for SDN-based data center networks.",
            "QCM2R: A QoS-aware cross-layered multichannel multisink routing protocol for stream based wireless sensor networks.",
            "Smart world systems, applications, and technologies.",
            "A comprehensive survey of interface protocols for software defined networks.",
            "A high-performance framework for a network programmable packet processor using P4 and FPGA.",
            "The path planning scheme for joint charging and data collection in WRSNs: A multi-objective optimization method.",
            "An enhanced probabilistic fairness-aware group recommendation by incorporating social activeness.",
            "Artificial Immune Systems approaches to secure the internet of things: A systematic review of the literature and recommendations for future research.",
            "Resource slicing and customization in RAN with dueling deep Q-Network.",
            "Decentralized asynchronous optimization for dynamic adaptive multimedia streaming over information centric networking.",
            "Machine learning for intelligent optical networks: A comprehensive survey.",
            "Bot recognition in a Web store: An approach based on unsupervised learning.",
            "Pleasure or pain? An evaluation of the costs and utilities of bloatware applications in android smartphones.",
            "IoT for energy efficient green highway lighting systems: Challenges and issues.",
            "Smart collaborative video caching for energy efficiency in cognitive Content Centric Networks.",
            "JPAS: Job-progress-aware flow scheduling for deep learning clusters.",
            "A survey on QoE-oriented wireless resources scheduling.",
            "Hybrid End-to-End VPN Security Approach for Smart IoT Objects.",
            "An evaluation method of channel state information fingerprinting for single gateway indoor localization.",
            "Collaborative resource allocation for Cloud of Things systems.",
            "MuSC: A multi-stage service chains embedding approach.",
            "Security in SDN: A comprehensive survey.",
            "On the classification of fog computing applications: A machine learning perspective.",
            "A survey on security issues of 5G NR: Perspective of artificial dust and artificial rain.",
            "Application deployment using containers with auto-scaling for microservices in cloud environment.",
            "A dynamic and hierarchical access control for IoT in multi-authority cloud storage.",
            "A comprehensive survey on resource allocation for CRAN in 5G and beyond networks.",
            "EUMD: Efficient slot utilization based missing tag detection with unknown tags.",
            "Security and privacy protection in cloud computing: Discussions and challenges.",
            "Machine learning based solutions for security of Internet of Things (IoT): A survey.",
            "Enhancing collaborative intrusion detection via disagreement-based semi-supervised learning in IoT environments.",
            "An adversarial attack on DNN-based black-box object detectors.",
            "A novel syntax-aware automatic graphics code generation with attention-based deep neural network.",
            "Belief and fairness: A secure two-party protocol toward the view of entropy for IoT devices.",
            "A comprehensive analytical framework for VoD services in hybrid CDN-P2P systems.",
            "Low-cost and high-efficiency privacy-protection scheme for distributed compressive video sensing in wireless multimedia sensor networks.",
            "Secure two-factor lightweight authentication protocol using self-certified public key cryptography for multi-server 5G networks.",
            "Retraction notice to \"Flow online identification method for the encrypted Skype\" [YJNCA (2019) 75-85].",
            "Adversarial attacks on deep-learning-based SAR image target recognition.",
            "Multi-domain virtual network embedding with dynamic flow migration in software-defined networks.",
            "Lightweight privacy preservation for secondary users in cognitive radio networks.",
            "When SDN meets C-RAN: A survey exploring multi-point coordination, interference, and performance.",
            "Blockchain-based decentralized storage networks: A survey.",
            "Spatio-temporal heterogeneous bandwidth allocation mechanism against DDoS attack.",
            "Confidence guided anomaly detection model for anti-concept drift in dynamic logs.",
            "Group motion of autonomous vehicles with anti-disturbance protection.",
            "R-Dedup: Secure client-side deduplication for encrypted data without involving a third-party entity.",
            "Security of Cryptocurrencies in blockchain technology: State-of-art, challenges and future prospects.",
            "Composing and deploying parallelized service function chains.",
            "Performance analyses of the IEEE 802.15.6 Wireless Body Area Network with heterogeneous traffic.",
            "A priority based greedy path assignment mechanism in OpenFlow based datacenter networks.",
            "Robust green Wireless Local Area Networks: A matheuristic approach.",
            "Detecting Internet of Things attacks using distributed deep learning.",
            "A-Z survey of Internet of Things: Architectures, protocols, applications, recent advances, future directions and recommendations.",
            "Optimizing AP and Beacon Placement in WiFi and BLE hybrid localization.",
            "A robust multicast communication protocol for Low power and Lossy networks.",
            "Automatic deployment and control of network services in NFV environments.",
            "Spectrum utilization efficiency in the cognitive radio enabled 5G-based IoT.",
            "A network intrusion detection method based on semantic Re-encoding and deep learning.",
            "Mitigating LFA through segment rerouting in IoT environment with traceroute flow abnormality detection.",
            "MARIO: A spatio-temporal data mining framework on Google Cloud to explore mobility dynamics from taxi trajectories.",
            "Edge-centric inferential modeling & analytics.",
            "QoS-aware service provisioning in fog computing.",
            "Aggregating and disaggregating packets with various sizes of payload in P4 switches at 100 Gbps line rate.",
            "The road to BOFUSS: The basic OpenFlow userspace software switch.",
            "A swipe-based unlocking mechanism with supervised learning on smartphones: Design and evaluation.",
            "SmartSteganogaphy: Light-weight generative audio steganography model for smart embedding application.",
            "A bibliometric overview of the Journal of Network and Computer Applications between 1997 and 2019.",
            "Secrecy capacity against adaptive eavesdroppers in a random wireless network using friendly jammers and protected zone.",
            "Using perceived direction information for anchorless relative indoor localization.",
            "Adaptive priority-based cache replacement and prediction-based cache prefetching in edge computing environment.",
            "Towards efficient motion-blurred public security video super-resolution based on back-projection networks.",
            "Blockchain for 5G and beyond networks: A state of the art survey.",
            "MultiCloud Tournament: A cloud federation approach to prevent Free-Riders by encouraging resource sharing.",
            "UAV assistance paradigm: State-of-the-art in applications and challenges.",
            "Encrypted traffic classification based on Gaussian mixture models and Hidden Markov Models.",
            "Applications of link prediction in social networks: A review.",
            "Blockchain-based identity management systems: A review.",
            "On the use of big data frameworks for big service composition.",
            "Leveraging energy saving capabilities of current EEE interfaces via pre-coalescing.",
            "Achieving forward unforgeability in keyword-field-free conjunctive search.",
            "Special issue on advanced techniques for security and privacy of internet-of-things with machine learning.",
            "Indoor static localization based on Fresnel zones model using COTS Wi-Fi.",
            "A secure and efficient data sharing scheme based on blockchain in industrial Internet of Things.",
            "A dynamic distributed boundary node detection algorithm for management zone delineation in Precision Agriculture.",
            "PODEM: A low-cost property-based design modification for detecting Hardware Trojans in resource-constraint IoT devices.",
            "RCBAC: A risk-aware content-based access control model for large-scale text data.",
            "Data-intensive application scheduling on Mobile Edge Cloud Computing.",
            "A review and categorization of techniques on device-free human activity recognition.",
            "An automated implementation of hybrid cloud for performance evaluation of distributed databases.",
            "A system call refinement-based enhanced Minimum Redundancy Maximum Relevance method for ransomware early detection.",
            "Secure multiparty learning from the aggregation of locally trained models.",
            "RNN-DP: A new differential privacy scheme base on Recurrent Neural Network for Dynamic trajectory privacy protection.",
            "RAN-aware adaptive video caching in multi-access edge computing networks.",
            "Communication and networking technologies for UAVs: A survey.",
            "Online DDoS attack detection using Mahalanobis distance and Kernel-based learning algorithm.",
            "Energy efficient transmission trends towards future green cognitive radio networks (5G): Progress, taxonomy and open challenges.",
            "Progressive researches on IoT security: An exhaustive analysis from the perspective of protocols, vulnerabilities, and preemptive architectonics.",
            "ABC-RuleMiner: User behavioral rule-based machine learning method for context-aware intelligent services.",
            "Fine-grained flow classification using deep learning for software defined data center networks.",
            "Energy-efficient activity recognition framework using wearable accelerometers.",
            "A deep stochastical and predictive analysis of users mobility based on Auto-Regressive processes and pairing functions.",
            "End-to-end CNN-based dueling deep Q-Network for autonomous cell activation in Cloud-RANs.",
            "A survey on technologies and security protocols: Reference for future generation IoT.",
            "P4-based implementation of BIER and BIER-FRR for scalable and resilient multicast.",
            "Traffic routing in stochastic network function virtualization networks.",
            "Deep learning methods in network intrusion detection: A survey and an objective comparison.",
            "Influential nodes selection to enhance data dissemination in mobile social networks: A survey.",
            "A survey on computation offloading modeling for edge computing.",
            "Fog computing systems: State of the art, research issues and future trends, with a focus on resilience.",
            "Flow aggregation for large-scale SDNs with scattered address space allocation.",
            "Performance comparison of container orchestration platforms with low cost devices in the fog, assisting Internet of Things applications.",
            "Sequential bargaining based incentive mechanism for collaborative Internet access.",
            "Fault tolerance in SDN data plane considering network and application based metrics.",
            "RFLS - Resilient Fault-proof Localization System in IoT and Crowd-based Sensing Applications.",
            "Scalable edge cloud platforms for IoT services.",
            "Kullback-Leibler distance criterion consolidation in cloud.",
            "Dynamic Security Metrics for Software-Defined Network-based Moving Target Defense.",
            "Detecting false data attacks using machine learning techniques in smart grid: A survey.",
            "A review on reversible quantum adders.",
            "Smart contracts for blockchain-based reputation systems: A systematic literature review.",
            "Building multi-subtopic Bi-level network for micro-blog hot topic based on feature Co-Occurrence and semantic community division.",
            "Privacy preserving based logistic regression on big data.",
            "Security in product lifecycle of IoT devices: A survey.",
            "Cloud-based elastic architecture for distributed video encoding: Evaluating H.265, VP9, and AV1.",
            "CDA: Coordinating data dissemination and aggregation in heterogeneous IoT networks using CTC.",
            "Opportunistic routing metrics: A timely one-stop tutorial survey.",
            "An efficient pipeline processing scheme for programming Protocol-independent Packet Processors.",
            "Privacy enhancing technologies for solving the privacy-personalization paradox: Taxonomy and survey.",
            "A multi-objective optimized replication using fuzzy based self-defense algorithm for cloud computing.",
            "SmartDR: A device-to-device communication for post-disaster recovery.",
            "ReFSM: Reverse engineering from protocol packet traces to test generation by extended finite state machines.",
            "Blockchain technology in Named Data Networks: A detailed survey.",
            "Multimedia communication over cognitive radio networks from QoS/QoE perspective: A comprehensive survey.",
            "Collaborative hierarchical caching and transcoding in edge network with CE-D2D communication.",
            "A survey of link flooding attacks in software defined network ecosystems.",
            "Investigating Asian Parti-colored bats using the BatTalk internet of things approach.",
            "Master-slave chain based trusted cross-domain authentication mechanism in IoT.",
            "A three-stage incentive formation for optimally pricing social data offloading.",
            "JavaSim-IBFD-CRNs: Novel java simulator for in-band Full-Duplex cognitive radio networks over Internet of Things environment.",
            "DNA computing and table based data accessing in the cloud environment.",
            "Blockchain for Internet of things applications: A review and open issues.",
            "AI-driven data security and privacy."
        ]
    },
    {
        "name": "JNCA",
        "year": "2019",
        "info": "2019: Volumes\n125,\n126,\n127,\n128,\n129,\n130,\n131,\n132,\n133,\n134,\n135,\n136,\n137,\n138,\n139,\n140,\n141,\n142,\n143,\n144,\n145,\n146,\n147,\n148",
        "count": 219,
        "papers": [
            "Design, analysis and implementation of a time-bounded spectrum handoff algorithm for real-time industrial wireless sensor and actuator networks.",
            "Fuzzy based priority aware scheduling technique for dense industrial IoT networks.",
            "A nature - inspired approach based on Forest Fire model for modeling rumor propagation in social networks.",
            "A socio-inspired CALM approach to channel assignment performance prediction and WMN capacity estimation.",
            "MIH-SPFP: MIH-based secure cross-layer handover protocol for Fast Proxy Mobile IPv6-IoT networks.",
            "APPA: An anonymous and privacy preserving data aggregation scheme for fog-enhanced IoT.",
            "A survey on location privacy protection in Wireless Sensor Networks.",
            "Interference and QoS aware cell switch-off strategy for software defined LTE HetNets.",
            "Routing as a service (RaaS): An open framework for customizing routing services.",
            "P-AUV: Position aware routing and medium access for ad hoc AUV networks.",
            "Time-optimized management of mobile IoT nodes for pervasive applications.",
            "A Semantic Concast service for data discovery, aggregation and processing on NDN.",
            "RBA: Region Based Algorithm for secure harvesting in Ultra Dense Network.",
            "Mobile app traffic flow feature extraction and selection for improving classification robustness.",
            "DoS vulnerabilities and mitigation strategies in software-defined networks.",
            "Session persistence for dynamic web applications in Named Data Networking.",
            "MalInsight: A systematic profiling based malware detection framework.",
            "Blockchain's adoption in IoT: The challenges, and a way forward.",
            "Location-based trustworthy services recommendation in cooperative-communication-enabled Internet of Vehicles.",
            "Effective algorithm for optimizing compressive sensing in IoT and periodic monitoring applications.",
            "A packet-reordering covert channel over VoLTE voice and video traffics.",
            "Publicly verifiable privacy-preserving aggregation and its application in IoT.",
            "A survey on privacy protection in blockchain system.",
            "A survey on network formation and scheduling algorithms for time slotted channel hopping in industrial networks.",
            "Adaptive security-related data collection with context awareness.",
            "The wireless control plane: An overview and directions for future research.",
            "A robust trust inference algorithm in weighted signed social networks based on collaborative filtering and agreement as a similarity metric.",
            "SDN-based and multitenant-aware resource provisioning mechanism for cloud-based big data streaming.",
            "A review on security challenges of wireless communications in disaster emergency response and crisis management situations.",
            "A taxonomy of software-based and hardware-based approaches for energy efficiency management in the Hadoop.",
            "Bit allocation approach of spatial modulation for multi-user scenario.",
            "A probabilistic multivariate copula-based technique for faulty node diagnosis in wireless sensor networks.",
            "Potential and pitfalls of Multi-Armed Bandits for decentralized Spatial Reuse in WLANs.",
            "Cryptographic primitives in blockchains.",
            "Privacy-preserving public auditing for secure data storage in fog-to-cloud computing.",
            "A Distributed Evolutionary algorithm for detecting minimum vertex cuts for wireless ad hoc and sensor networks.",
            "Network selection criterion for ubiquitous communication provisioning in smart cities for smart energy system.",
            "Inference attack in Android Activity based on program fingerprint.",
            "A real-time power monitoring and energy-efficient network/interface selection tool for android smartphones.",
            "COIN: A fast packet inspection method over compressed traffic.",
            "Mobility-assisted offloading in centrally-coordinated cellular networks.",
            "Tc-PEDCKS: Towards time controlled public key encryption with delegatable conjunctive keyword search for Internet of Things.",
            "Securing content-centric networks with content-based encryption.",
            "A holistic review of Network Anomaly Detection Systems: A comprehensive survey.",
            "Design of multi-view based email classification for IoT systems via semi-supervised learning.",
            "Meta heuristic-based task deployment mechanism for load balancing in IaaS cloud.",
            "Routing, spectrum and core assignment algorithms for protection of space division multiplexing elastic optical networks.",
            "Fog data analytics: A taxonomy and process model.",
            "Internet of Things (IoT), mobile cloud, cloudlet, mobile IoT, IoT cloud, fog, mobile edge, and edge emerging computing paradigms: Disambiguation and research directions.",
            "Smart Chinese medicine for hypertension treatment with a deep learning model.",
            "A dynamic content distribution scheme for decentralized sharing in tourist hotspots.",
            "Efficient decentralized multi-authority attribute based encryption for mobile cloud data storage.",
            "Layered adaptive compression design for efficient data collection in industrial wireless sensor networks.",
            "Cost-effective replication management and scheduling in edge computing.",
            "User stateless privacy-preserving TPA auditing scheme for cloud storage.",
            "Device to device communication: A survey.",
            "Efficient DDoS attacks mitigation for stateful forwarding in Internet of Things.",
            "Towards agent-based petri net decision making modelling for cloud service composition: A literature survey.",
            "On the performance analysis of distributed caching systems using a customizable Markov chain model.",
            "Multi-worker multi-task selection framework in mobile crowd sourcing.",
            "Enhancing the fidelity of network emulation through direct access to device buffers.",
            "Performance modeling and analysis of TCP and UDP flows over software defined networks.",
            "In-network context inference in IoT sensory environment for efficient network resource utilization.",
            "Emerging Networked Computer Applications for Telemedicine.",
            "Dynamic multi-user computation offloading for wireless powered mobile edge computing.",
            "DDC: Dynamic duty cycle for improving delay and energy efficiency in wireless sensor networks.",
            "An approach for SDN traffic monitoring based on big data techniques.",
            "A new network paradigm for low-cost and lightweight real-time communication between train and rail track to detect missing and faulty rail blocks.",
            "Towards dependable and trustworthy outsourced computing: A comprehensive survey and tutorial.",
            "Lightweight remote user authentication protocol for multi-server 5G networks using self-certified public key cryptography.",
            "Receiver-driven fair congestion control for TCP outcast in data center networks.",
            "The application of Software Defined Networking on securing computer networks: A survey.",
            "Energy conservation of content routing through wireless broadcast control in NDN based MANET: A review.",
            "Predicting content consumption from content-to-content relationships.",
            "Countering passive cyber attacks against sink nodes in tactical sensor networks using reactive route obfuscation.",
            "Adaptive and Beacon-based multi-channel protocol for Industrial Wireless Sensor Networks.",
            "A protocol for detecting missing target tags in RFID systems.",
            "An SDN-based framework for improving the performance of underprovisioned IP Video Surveillance networks.",
            "Academic social networks: Modeling, analysis, mining and applications.",
            "Energy management in harvesting enabled sensing nodes: Prediction and control.",
            "A scalable network-aware framework for cloud monitoring orchestration.",
            "A mobile malware detection method using behavior features in network traffic.",
            "An Efficient Cooperative Medium Access Control Protocol for Wireless IoT networks in Smart World System.",
            "Vital nodes extracting method based on user's behavior in 5G mobile social networks.",
            "LCC: Towards efficient label completion and correction for supervised medical image learning in smart diagnosis.",
            "An efficient symbiotic organisms search algorithm with chaotic optimization strategy for multi-objective task scheduling problems in cloud computing environment.",
            "An energy-aware computation offloading method for smart edge computing in wireless metropolitan area networks.",
            "Cyber-ARGUS - A mission assurance framework.",
            "Design and implementation of efficient control for incoming inter-domain traffic with Information-Centric Networking.",
            "Opportunistic topology control for ad hoc wireless network survivability enhancement based on LIMOS model.",
            "A reliable reputation computation framework for online items in E-commerce.",
            "Cloud storage auditing with deduplication supporting different security levels according to data popularity.",
            "Efficient resource assignment in mobile edge computing: A dynamic congestion-aware offloading approach.",
            "AEP-PPA: An anonymous, efficient and provably-secure privacy-preserving authentication protocol for mobile services in smart cities.",
            "Domain-specific data mining for residents' transit pattern retrieval from incomplete information.",
            "Efficient, dynamic and identity-based Remote Data Integrity Checking for multiple replicas.",
            "Security and privacy preservation in fog-based crowd sensing on the internet of vehicles.",
            "RMTS: A robust clock synchronization scheme for wireless sensor networks.",
            "Coupling resource management based on fog computing in smart city systems.",
            "An energy-efficient data collection protocol with AUV path planning in the Internet of Underwater Things.",
            "Implementation of deep packet inspection in smart grids and industrial Internet of Things: Challenges and opportunities.",
            "Joint optimization of tasks placement and routing to minimize Coflow Completion Time.",
            "Blockchain in healthcare applications: Research challenges and opportunities.",
            "Intrusion detection in smart cities using Restricted Boltzmann Machines.",
            "Energy-aware and adaptive fog storage mechanism with data replication ruled by spatio-temporal content popularity.",
            "A Context-aware Radio Access Technology selection mechanism in 5G mobile network for smart city applications.",
            "Towards 5G and beyond for the internet of UAVs, vehicles, smartphones, Sensors and Smart Objects.",
            "HRCal: An effective calibration system for heart rate detection during exercising.",
            "Influence maximization by leveraging the crowdsensing data in information diffusion network.",
            "Analytical Modelling of Software and Hardware Switches with Internal Buffer in Software-Defined Networks.",
            "Exploring interoperability assessment for Future Internet Architectures roll out.",
            "Cooperative motion parameter estimation using RSS measurements in robotic sensor networks.",
            "Implementing an intrusion detection and prevention system using software-defined networking: Defending against port-scanning and denial-of-service attacks.",
            "Collaborative joint caching and transcoding in mobile edge networks.",
            "rDBF: A r-Dimensional Bloom Filter for massive scale membership query.",
            "Traffic-flow analysis for source-side DDoS recognition on 5G environments.",
            "An economic framework for analysis of network architectures: SDN and MPLS cases.",
            "SmartEdge: An end-to-end encryption framework for an edge-enabled smart city application.",
            "Message forwarding for WSN-Assisted Opportunistic Network in disaster scenarios.",
            "Evaluating the impact of transport mechanisms on web performance for effective web access.",
            "Multi-objective accelerated particle swarm optimization with a container-based scheduling for Internet-of-Things in cloud environment.",
            "A survey on software defined networking enabled smart buildings: Architecture, challenges and use cases.",
            "Towards service-oriented soft spectrum slicing for 5G TDD networks.",
            "Special issue on advances in security and privacy in IoT.",
            "Trust models of internet of smart things: A survey, open issues, and future directions.",
            "Delay-aware content distribution via cell clustering and content placement for multiple tenants.",
            "A survey of energy efficiency in SDN: Software-based methods and optimization models.",
            "Spatiotemporal diversification by moving-target defense through benign employment of false-data injection for dynamic, secure cognitive radio network.",
            "Long-term secure management of large scale Internet of Things applications.",
            "Cost-optimal cloudlet placement frameworks over fiber-wireless access networks for low-latency applications.",
            "SDN-enabled recovery for Smart Grid teleprotection applications in post-disaster scenarios.",
            "DA-DRLS: Drift adaptive deep reinforcement learning based scheduling for IoT resource management.",
            "Retraction notice to Prevailing and emerging cyber threats and security practices in IoT-Enabled smart grids: A survey [J. Netw. Comput. Appl. 132 (2019) 118-148].",
            "Editorial: New editors 2019.",
            "A scalable multiagent architecture for monitoring IoT devices.",
            "Network security situation: From awareness to awareness-control.",
            "Recent research in cloud radio access network (C-RAN) for 5G cellular systems - A survey.",
            "Comments on a lightweight cloud auditing scheme: Security analysis and improvement.",
            "Policy-based access control for constrained healthcare resources in the context of the Internet of Things.",
            "Edge computing for Internet of Things: A survey, e-healthcare case study and future direction.",
            "Optimal location of supplementary node in UAV surveillance system.",
            "A trustworthiness-enhanced reliable forwarding scheme in mobile Internet of Things.",
            "Privacy-preserving aggregation for cooperative spectrum sensing.",
            "An alternative minimum cost route setup algorithm in a large EON for long-haul traffic under dynamic traffic grooming.",
            "The role of the Weibull distribution in modelling traffic in Internet access and backbone core networks.",
            "Challenges and solutions in Software Defined Networking: A survey.",
            "A light weight smartphone based human activity recognition system with high accuracy.",
            "Improve MPTCP with SDN: From the perspective of resource pooling.",
            "Scalable explicit path control in software-defined networks.",
            "Customizable network update planning in SDN.",
            "Editorial: 2018 best paper awards.",
            "SpeCH: A scalable framework for data placement of data-intensive services in geo-distributed clouds.",
            "A reversible sketch-based method for detecting and mitigating amplification attacks.",
            "Multipath aware scheduling for high reliability and fault tolerance in low power industrial networks.",
            "MAPLE: A Machine Learning Approach for Efficient Placement and Adjustment of Virtual Network Functions.",
            "Recognizing the content types of network traffic based on a hybrid DNN-HMM model.",
            "Analytical composite performance models for Big Data applications.",
            "An autonomous resource provisioning framework for massively multiplayer online games in cloud environment.",
            "High-speed data-plane packet aggregation and disaggregation by P4 switches.",
            "Cluster-based routing protocols in wireless sensor networks: A survey based on methodology.",
            "A comprehensive survey for scheduling techniques in cloud computing.",
            "A novel selective cross layer based routing scheme using ACO method for vehicular networks.",
            "Progression on spectrum sensing for cognitive radio networks: A survey, classification, challenges and future research issues.",
            "Wi-Run: Device-free step estimation system with commodity Wi-Fi.",
            "Composition of heterogeneous web services: A systematic review.",
            "A walkthrough of the emerging IoT paradigm: Visualizing inside functionalities, key features, and open issues.",
            "Energy-efficient fault-tolerant replica management policy with deadline and budget constraints in edge-cloud environment.",
            "BlockSecIoTNet: Blockchain-based decentralized security architecture for IoT network.",
            "A comprehensive review of wireless body area network.",
            "Probability-based opportunity dynamic adaptation (PODA) of contention window for home M2M networks.",
            "Blockchain for smart communities: Applications, challenges and opportunities.",
            "Optimized deployment of drone base station to improve user experience in cellular networks.",
            "QoS-aware secure transaction framework for internet of things using blockchain mechanism.",
            "Access control in Internet-of-Things: A survey.",
            "A scalable and accurate distributed traffic generator with Fourier transformed distribution over multiple commodity platforms.",
            "Delay aware energy efficient reliable routing for data transmission in heterogeneous mobile sink wireless sensor network.",
            "MsM: A microservice middleware for smart WSN-based IoT application.",
            "NBP: Namespace-based privacy to counter timing-based attack in named data networking.",
            "Fog-assisted IoT-enabled scalable network infrastructure for wildfire surveillance.",
            "A load-balanced cross-layer design for energy-harvesting sensor networks.",
            "REACT: reactive resilience for critical infrastructures using graph-coloring techniques.",
            "A fog-driven dynamic resource allocation technique in ultra dense femtocell networks.",
            "SEAL: SDN based secure and agile framework for protecting smart city applications from DDoS attacks.",
            "Trust and reputation for Internet of Things: Fundamentals, taxonomy, and open research challenges.",
            "Using malware for the greater good: Mitigating data leakage.",
            "Secure and transparent audit logs with BlockAudit.",
            "A survey on secure routing protocols for satellite network.",
            "Corrigendum to \"Recognizing the content types of network traffic based on a hybrid DNN-HMM model\" [J. Netw. Comput. Appl. 142 (2019) 51-62].",
            "Autonomic protection of multi-tenant 5G mobile networks against UDP flooding DDoS attacks.",
            "A robust uncertainty-aware cluster-based deployment approach for WSNs: Coverage, connectivity, and lifespan.",
            "Performance analysis of multi-channel MAC with single transceiver for the next generation WLAN.",
            "Formally specifying and checking policies and anomalies in service function chaining.",
            "Generic resource allocation metrics and methods for heterogeneous cloud infrastructures.",
            "Towards a virtual network function research agenda: A systematic literature review of VNF design considerations.",
            "CRIMP: Here crisis mapping goes offline.",
            "Fault tolerant internet computing: Benchmarking and modelling trade-offs between availability, latency and consistency.",
            "TCP incast solutions in data center networks: A classification and survey.",
            "HSIRD: A model for characterizing dynamics of malware diffusion in heterogeneous WSNs.",
            "Three-dimensional robot localization using cameras in wireless multimedia sensor networks.",
            "Retraction notice to \"An approach for predicting health status in IoT health care\" [YJNCA 134 (2019) 100-113].",
            "Pricing strategies of IoT wide area network service providers with complementary services included.",
            "Distributed intrusion detection scheme for next generation networks.",
            "A survey of emotion recognition methods with emphasis on E-Learning environments.",
            "Optimal placement of virtual network functions in software defined networks: A survey.",
            "Clustering-based many-field packet classification in Software-Defined Networking.",
            "QWRP: Query-driven virtual wheel based routing protocol for wireless sensor networks with mobile sink.",
            "Joint optimization of service request routing and instance placement in the microservice system.",
            "TELPAC: A time and energy efficient protocol for locating and patching coverage holes in WSNs.",
            "Semantic-aware multi-keyword ranked search scheme over encrypted cloud data.",
            "BCON: Blockchain based access CONtrol across multiple conflict of interest domains.",
            "A Lightweight Forwarding Strategy for Named Data Networking in Low-end IoT.",
            "Security modelling and assessment of modern networks using time independent Graphical Security Models.",
            "FASTSCALE: A fast and scalable evolutionary algorithm for the joint placement and chaining of virtualized services.",
            "Resource needs prediction in virtualized systems: Generic proactive and self-adaptive solution.",
            "Network anomaly detection based on logistic regression of nonlinear chaotic invariants.",
            "An intelligent, time-optimized monitoring scheme for edge nodes.",
            "A survey of unmanned aerial sensing solutions in precision agriculture.",
            "Hybrid delay tolerant network routing protocol for heterogeneous networks.",
            "Survey on high reliability wireless communication for underwater sensor networks."
        ]
    },
    {
        "name": "JNCA",
        "year": "2018",
        "info": "2018: Volumes\n101,\n102,\n103,\n104,\n105,\n106,\n107,\n108,\n109,\n110,\n111,\n112,\n113,\n114,\n115,\n116,\n117,\n118,\n119,\n120,\n121,\n122,\n123,\n124",
        "count": 231,
        "papers": [
            "CoDRA: Context-based dynamically reconfigurable access control system for android.",
            "Data exfiltration: A review of external attack vectors and countermeasures.",
            "Security for 4G and 5G cellular networks: A survey of existing authentication and privacy-preserving schemes.",
            "Concealed in web surfing: Behavior-based covert channels in HTTP.",
            "On reliable communication in transmit-only networks for home automation.",
            "SentiRelated: A cross-domain sentiment classification algorithm for short texts through sentiment related index.",
            "EGHR: Efficient group-based handover authentication protocols for mMTC in 5G wireless networks.",
            "Analytics in/for cloud-an interdependence: A review.",
            "Secure and efficient protocol for fast handover in 5G mobile Xhaul networks.",
            "Structures and data preserving homomorphic signatures.",
            "Time triggered handoff schemes in cognitive radio networks: A survey.",
            "Distributed data stream processing and edge computing: A survey on resource elasticity and future directions.",
            "Efficient key generation leveraging wireless channel reciprocity for MANETs.",
            "A comprehensive survey on spectrum sharing: Architecture, energy efficiency and security issues.",
            "Multi-objective optimization technique for resource allocation and task scheduling in vehicular cloud architecture: A hybrid adaptive nature inspired approach.",
            "REHDFS: A random read/write enhanced HDFS.",
            "A survey on software defined networking with multiple controllers.",
            "DDSE: A novel evolutionary algorithm based on degree-descending search strategy for influence maximization in social networks.",
            "Multi-classification approaches for classifying mobile app traffic.",
            "Search locations safely and accurately: A location privacy protection algorithm with accurate service.",
            "On location-privacy in opportunistic mobile networks, a survey.",
            "Failure prediction by relevance vector regression with improved quantum-inspired gravitational search.",
            "Quantum technique for access control in cloud computing II: Encryption and key distribution.",
            "Blockchain-based publicly verifiable data deletion scheme for cloud storage.",
            "A three-factor anonymous authentication scheme for wireless sensor networks in internet of things environments.",
            "Resource-utilization-aware energy efficient server consolidation algorithm for green computing in IIOT.",
            "A shortest path routing algorithm for unmanned aerial systems based on grid position.",
            "Deployment optimization for 3D industrial wireless sensor networks based on particle swarm optimizers with distributed parallelism.",
            "An intelligent power distribution service architecture using cloud computing and deep learning techniques.",
            "Countering cyber threats for industrial applications: An automated approach for malware evasion detection and analysis.",
            "A survey on FinTech.",
            "Quality-of-sensing aware budget constrained contaminant detection sensor deployment in water distribution system.",
            "MATEM: A unified framework based on trust and MCDM for assuring security, reliability and QoS in DTN routing.",
            "Mobility-aware medium access control protocols for wireless sensor networks: A survey.",
            "PAVE: Personalized Academic Venue recommendation Exploiting co-publication networks.",
            "CROP: Cognitive radio ROuting Protocol for link quality channel diverse cognitive networks.",
            "Multicasting in software defined networks: A comprehensive survey.",
            "Device-free human localization and tracking with UHF passive RFID tags: A data-driven approach.",
            "DIPOR: An IDA-based dynamic proof of retrievability scheme for cloud storage systems.",
            "Smart resource allocation for improving QoE in IP Multimedia Subsystems.",
            "A trust-based method for mitigating cache poisoning in Name Data Networking.",
            "An untraceable and anonymous password authentication protocol for heterogeneous wireless sensor networks.",
            "Zero-queue ethernet congestion control protocol based on available bandwidth estimation.",
            "A sequential pattern mining model for application workload prediction in cloud environment.",
            "SCoT: A secure content-oriented transport.",
            "An energy-efficient fault-aware core mapping in mesh-based network on chip systems.",
            "Detection of app collusion potential using logic programming.",
            "Data collection for attack detection and security measurement in Mobile Ad Hoc Networks: A survey.",
            "A time synchronization protocol for large-scale distributed embedded systems with low-precision clocks and neighbor-to-neighbor communications.",
            "Practical feasibility, scalability and effectiveness of coordinated scheduling algorithms in cellular networks towards 5G.",
            "Influence analysis in social networks: A survey.",
            "Adaptive forwarding strategies to reduce redundant Interests and Data in named data networks.",
            "Application of wireless sensor network for environmental monitoring in underground coal mines: A systematic review.",
            "A hardware testbed for learning-based spectrum handoff in cognitive radio networks.",
            "Model driven design and evaluation of security level in orchestrated cloud services.",
            "A remotely keyed file encryption scheme under mobile cloud computing.",
            "Outsourced privacy-preserving classification service over encrypted data.",
            "An improved payload-based anomaly detector for web applications.",
            "Cloud-aided lightweight certificateless authentication protocol with anonymity for wireless body area networks.",
            "Powerless security for Cardiac Implantable Medical Devices: Use of Wireless Identification and Sensing Platform.",
            "Performance evaluation of different techniques to estimate subjective quality in live video streaming applications over LTE-Advance mobile networks.",
            "On the performance of sink placement in WSNs considering energy-balanced compressive sensing-based data aggregation.",
            "A framework for enhancing the performance of Internet of Things applications based on RFID and WSNs.",
            "A root privilege management scheme with revocable authorization for Android devices.",
            "A novel efficient MAKA protocol with desynchronization for anonymous roaming service in Global Mobility Networks.",
            "Enhanced class based dynamic priority scheduling to support uplink IoT traffic in LTE-A networks.",
            "Dynamic Fully Homomorphic encryption-based Merkle Tree for lightweight streaming authenticated data structures.",
            "The role of Information and Communication Technologies in healthcare: taxonomies, perspectives, and challenges.",
            "Recent advancements in garbled computing: How far have we come towards achieving secure, efficient and reusable garbled circuits.",
            "Reducing transport latency for short flows with multipath TCP.",
            "Attribute based encryption in cloud computing: A survey, gap analysis, and future directions.",
            "Interconnecting isolated network segments through intermittent links.",
            "Effective fine-grained location prediction based on user check-in pattern in LBSNs.",
            "Scheduling framework for distributed intrusion detection systems over heterogeneous network architectures.",
            "Community detection in networks: A multidisciplinary review.",
            "Practical attribute-based encryption: Outsourcing decryption, attribute revocation and policy updating.",
            "Interoperable, dynamic and privacy-preserving access control for cloud data storage when integrating heterogeneous organizations.",
            "Towards load-balanced service chaining by Hash-based Traffic Steering on Softswitches.",
            "Wise-PRoPHET: A Watchdog supervised PRoPHET for reliable dissemination of post disaster situational information over smartphone based DTN.",
            "Continuous authentication of smartphone users based on activity pattern recognition using passive mobile sensing.",
            "Self-adaptive implicit contention window adjustment mechanism for QoS optimization in wireless sensor networks.",
            "Performance evaluation of IoT middleware.",
            "Coordinated detection of forwarding faults in Wireless Community Networks.",
            "Privacy-aware data publishing against sparse estimation attack.",
            "DetLogic: A black-box approach for detecting logic vulnerabilities in web applications.",
            "Optimization of live virtual machine migration in cloud computing: A survey and future directions.",
            "Provenance Inference Techniques: Taxonomy, comparative analysis and design challenges.",
            "Cooperation-based multi-hop routing protocol for cognitive radio networks.",
            "Resilient virtual communication networks using multi-commodity flow based local optimal mapping.",
            "A systematic literature review on QoS-aware service composition and selection in cloud environment.",
            "A survey on Proof of Retrievability for cloud data integrity and availability: Cloud storage state-of-the-art, issues, solutions and future trends.",
            "SU-MIMO based uplink non-orthogonal multiple access for 5G.",
            "Special issue on security in cloud computing.",
            "Stackelberg games for modeling defense scenarios against cloud security threats.",
            "Location and trajectory privacy preservation in 5G-Enabled vehicle social network services.",
            "DPDRM: A decentralized post-disaster resource management scheme using energy efficient smart phone based DTN.",
            "Hierarchical cache-aided transmission cooperation in 5G user-centric network: Performance analysis and design insights.",
            "A fairness-based MAC protocol for 5G Cognitive Radio Ad Hoc Networks.",
            "DNS weighted footprints for web browsing analytics.",
            "D-FACE: An anomaly based distributed approach for early detection of DDoS attacks and flash events.",
            "Two-stage coalition formation and radio resource allocation with Nash bargaining solution for inband underlaid D2D communications in 5G networks.",
            "Energy conservation strategies in Host Centric Networking based MANET: A review.",
            "Pending interest table control management in Named Data Network.",
            "Hybrid covert channel in LTE-A: Modeling and analysis.",
            "Resource management in cellular base stations powered by renewable energy sources.",
            "WiFi offloading using the device-to-device (D2D) communication paradigm based on the Software Defined Network (SDN) architecture.",
            "Attack localization task allocation in wireless sensor networks based on multi-objective binary particle swarm optimization.",
            "Surveillance of sensitive fenced areas using duty-cycled wireless sensor networks with asymmetrical links.",
            "Rise of spam and compromised accounts in online social networks: A state-of-the-art review of different combating approaches.",
            "Multi-authority fine-grained access control with accountability and its application in cloud.",
            "User behavior analytics-based classification of application layer HTTP-GET flood attacks.",
            "SGMA: Semi-granted multiple access for non-orthogonal multiple access (NOMA) in 5G networking.",
            "An ensemble learning based approach for impression fraud detection in mobile advertising.",
            "Toward efficient parallel routing optimization for large-scale SDN networks using GPGPU.",
            "A fine-grained rule partition algorithm in cloud data centers.",
            "L-CAQ: Joint link-oriented channel-availability and channel-quality based channel selection for mobile cognitive radio networks.",
            "A comprehensive survey on internet outages.",
            "On minimizing total energy consumption in the scheduling of virtual machine reservations.",
            "Utility-optimized bandwidth and power allocation for non-orthogonal multiple access in software defined 5G networks.",
            "Wireless Sensor Networks in oil and gas industry: Recent advances, taxonomy, requirements, and open challenges.",
            "Supporting fast and fair rendezvous for cognitive radio networks.",
            "Fault tolerant storage and data access optimization in data center networks.",
            "Performance modeling and comparison of NFV integrated with SDN: Under or aside?",
            "Shedding Light on the Dark Corners of the Internet: A Survey of Tor Research.",
            "Latency-aware cost optimization of the service infrastructure placement in 5G networks.",
            "An efficient error prevention and recovery scheme for multicast traffic in data center networks.",
            "GRBC-based Network Security Functions placement scheme in SDS for 5G security.",
            "A Pareto optimization-based approach to clustering and routing in Wireless Sensor Networks.",
            "An introduction to cyber peacekeeping.",
            "A SDN-SFC-based service-oriented load balancing for the IoT applications.",
            "Video encoding adaptation for QoE maximization over 5G cellular networks.",
            "Multi-objective scheduling for scientific workflow in multicloud environment.",
            "An efficient scheduling scheme for mobile charger in on-demand wireless rechargeable sensor networks.",
            "Verifiable database outsourcing supporting join.",
            "An alignment-free cancelable fingerprint template for bio-cryptosystems.",
            "Mining productive-periodic frequent patterns in tele-health systems.",
            "An inverse Bayesian scheme for the denoising of ECG signals.",
            "A smartphone-based point-of-care quantitative urinalysis device for chronic kidney disease patients.",
            "Mobile cloud computing: Challenges and future research directions.",
            "Reliable service delivery in Tele-health care systems.",
            "5G Virtualized Multi-access Edge Computing Platform for IoT Applications.",
            "User-centric content sharing via cache-enabled device-to-device communication.",
            "Distributed learning of deep neural network over multiple agents.",
            "A survey on network data collection.",
            "Performance based user-centric dynamic mode switching and mobility management scheme for 5G networks.",
            "Balancing latency and cost in software-defined vehicular networks using genetic algorithm.",
            "BSeIn: A blockchain-based secure mutual authentication with fine-grained access control system for industry 4.0.",
            "Energy-efficient DRX scheduling for D2D communication in 5G networks.",
            "An OpenNCP-based Solution for Secure eHealth Data Exchange.",
            "An optimal dynamic sleeping control policy for single base stations in green cellular networks.",
            "TouchWB: Touch behavioral user authentication based on web browsing on smartphones.",
            "PEA: Parallel electrocardiogram-based authentication for smart healthcare systems.",
            "A clinical decision support system to increase appropriateness of diagnostic imaging prescriptions.",
            "An Integrated Planning Approach Towards Home Health Care, Telehealth and Patients Group Based Care.",
            "OF-EC: A novel energy consumption aware objective function for RPL based on fuzzy logic.",
            "Building an IaaS cloud with droplets: a collaborative experience with OpenStack.",
            "Two-layer compressive sensing based video encoding and decoding framework for WMSN.",
            "Cooperative video caching scheme over software defined passive optical network.",
            "A survey on energy efficient 5G green network with a planned multi-tier architecture.",
            "An Improved LISP Mobile Node Architecture.",
            "A survey on key fields of context awareness for mobile devices.",
            "Velox VM: A safe execution environment for resource-constrained IoT applications.",
            "Advanced telemonitoring of Left Ventricular Assist Device patients for the early detection of thrombosis.",
            "Reliable location aware and Cluster-Tap Root based data collection protocol for large scale wireless sensor networks.",
            "Privacy-preserving composite modular exponentiation outsourcing with optimal checkability in single untrusted cloud server.",
            "A survey of detection methods for XSS attacks.",
            "Building packet length covert channel over mobile VoIP traffics.",
            "Genetic Programming-based induction of a glucose-dynamics model for telemedicine.",
            "Differential evolution algorithm applied to wireless sensor distribution on different geometric shapes with area and energy optimization.",
            "A realistic performance evaluation of privacy-preserving protocols for smart grid AMI networks.",
            "Software-defined wireless sensor networks: A survey.",
            "LAPGN: Accomplishing information consistency under OSPF in General Networks (an extension).",
            "AmoebaNet: An SDN-enabled network service for big data science.",
            "Partitioning and offloading in smart mobile devices for mobile cloud computing: State of the art and future directions.",
            "Application deployment using Microservice and Docker containers: Framework and optimization.",
            "Distributed coordination control of traffic network flow using adaptive genetic algorithm based on cloud computing.",
            "FriendShare: A secure and reliable framework for file sharing on network.",
            "A framework for healthcare support in the rural and low income areas of the developing world.",
            "Using social network analysis to model palliative care.",
            "A survey study on Internet of Things resource management.",
            "Service composition approaches in IoT: A systematic review.",
            "Survey on sybil attack defense mechanisms in wireless ad hoc networks.",
            "Self-adaptive resource allocation for energy-aware virtual machine placement in dynamic computing cloud.",
            "QoE-aware distributed cloud-based live streaming of multisourced multiview videos.",
            "Hierarchical architecture and protocol for mobile object authentication in the context of IoT smart cities.",
            "A cache-aware social-based QoS routing scheme in Information Centric Networks.",
            "FB-APSP: A new efficient algorithm for computing all-pairs shortest-paths.",
            "Adaptive topologies against jamming attacks in wireless networks: A game-theoretic approach.",
            "Deep mobile traffic forecast and complementary base station clustering for C-RAN optimization.",
            "Classical and bio-inspired mobility in sensor networks for IoT applications.",
            "Anatomizing the robustness of multichannel MAC protocols for WSNs: An evaluation under MAC oriented design issues impacting QoS.",
            "Novel Light Weight Compressed Data Aggregation using sparse measurements for IoT networks.",
            "EMPIOT: An energy measurement platform for wireless IoT devices.",
            "Wireless energy harvesting: Empirical results and practical considerations for Internet of Things.",
            "Data integrity verification of the outsourced big data in the cloud environment: A survey.",
            "Multiple-target tracking based on compressed sensing in the Internet of Things.",
            "Modelling Software-Defined Networking: Software and hardware switches.",
            "Novel optimized link state routing protocol based on quantum genetic strategy for mobile learning.",
            "Privacy-preserving communication and power injection over vehicle networks and 5G smart grid slice.",
            "Revocable attribute-based access control in mutli-autority systems.",
            "A lightweight protocol for consistent policy update on software-defined networking with multiple controllers.",
            "MC-VAP: A multi-connection virtual access point for high performance software-defined wireless networks.",
            "Towards scalable mobile crowdsensing through device-to-device communication.",
            "Improvised dynamic network connectivity model for Vehicular Ad-Hoc Networks (VANETs).",
            "Parallelization of space-aware applications: Modeling and performance analysis.",
            "Learning automaton based topology control protocol for extending wireless sensor networks lifetime.",
            "Retraction notice to \"A comprehensive survey on 5G: The prospect of future communications\" [J. Netw. Comput. Appl. 94 (2017) 1-32].",
            "An authenticated asymmetric group key agreement based on attribute encryption.",
            "Starfish routing for sensor networks with mobile sink.",
            "Next-generation RF-powered networks for Internet of Things: Architecture and research perspectives.",
            "A multidimensional trust evaluation model for MANETs.",
            "A cognitive chronometry strategy associated with a revised cloud model to deal with the dishonest recommendations attacks in wireless sensor networks.",
            "GopJam: Key-less jamming mitigation via gossiping.",
            "Wireless powered Public Safety IoT: A UAV-assisted adaptive-learning approach towards energy efficiency.",
            "Game theory based distributed clustering approach to maximize wireless sensors network lifetime.",
            "Secure smart health with privacy-aware aggregate authentication and access control in Internet of Things.",
            "Dual-side privacy-preserving task matching for spatial crowdsourcing.",
            "Authenticated key management protocol for cloud-assisted body area sensor networks.",
            "Collision risk assessment in Flying Ad Hoc aerial wireless networks.",
            "Ransomware early detection by the analysis of file sharing traffic.",
            "A new adaptive trust and reputation model for Mobile Agent Systems.",
            "Maximizing heterogeneous coverage in over and under provisioned visual sensor networks.",
            "Anomaly analysis and visualization for dynamic networks through spatiotemporal graph segmentations.",
            "Towards an FPGA-Accelerated programmable data path for edge-to-core communications in 5G networks.",
            "Dynamic workload patterns prediction for proactive auto-scaling of web applications.",
            "Maximizing streaming efficiency of multiple streams in peer-to-peer networks.",
            "Online power aware coordinated virtual network embedding with 5G delay constraint.",
            "A new analytical model of TCP Hybla for satellite IP networks.",
            "An IoT-Oriented data placement method with privacy preservation in cloud environment.",
            "Constraint-based scheduling algorithm with the non-adjacency requirement for multi-flow AWG switches.",
            "Multimedia big data computing and Internet of Things applications: A taxonomy and process model."
        ]
    },
    {
        "name": "JNCA",
        "year": "2017",
        "info": "2017: Volumes\n77,\n78,\n79,\n80,\n81,\n82,\n83,\n84,\n85,\n86,\n87,\n88,\n89,\n90,\n91,\n92,\n93,\n94,\n95,\n96,\n97,\n98,\n99,\n100",
        "count": 269,
        "papers": [
            "A survey on parametric QoE estimation for popular services.",
            "Intrusion detection techniques in cloud environment: A survey.",
            "A survey on hybrid routing mechanisms in mobile ad hoc networks.",
            "SINR based shortest link scheduling with oblivious power control in wireless networks.",
            "Cloud services recommendation: Reviewing the recent advances and suggesting the future research directions.",
            "Federated cloud resource management: Review and discussion.",
            "A survey on green routing protocols using sleep-scheduling in wired networks.",
            "Compressive sensing based data quality improvement for crowd-sensing applications.",
            "Enhancing collaborative intrusion detection networks against insider attacks using supervised intrusion sensitivity-based trust management model.",
            "A data integrity verification scheme in mobile cloud computing.",
            "Energy-efficient cloud radio access networks by cloud based workload consolidation for 5G.",
            "A survey on device-to-device (D2D) communication: Architecture and security issues.",
            "A distributed real-time approach for mitigating CSO and flooding in urban drainage systems.",
            "Novel fuzzy multi objective DVFS-aware consolidation heuristics for energy and SLA efficient resource management in cloud data centers.",
            "Delay-cost tradeoff for virtual machine migration in cloud data centers.",
            "An energy efficient and optimized load balanced localization method using CDS with one-hop neighbourhood and genetic algorithm in WSNs.",
            "E-eco: Performance-aware energy-efficient cloud data center orchestration.",
            "A survey of adaptation techniques in computation offloading.",
            "Tradeoff design of radio resource scheduling for power and spectrum utilizations in LTE uplink systems.",
            "Scalable multicasting with multiple shared trees in software defined networking.",
            "InFreD: Intelligent Free Rider Detection in collaborative distributed systems.",
            "Prototype for multidisciplinary research in the context of the Internet of Things.",
            "A bayesian inference-based detection mechanism to defend medical smartphone networks against insider attacks.",
            "Performance study of block ACK and reverse direction in IEEE 802.11n using a Markov chain model.",
            "Restoration methods for cloud multicast virtual networks.",
            "Reliability modeling and analysis of communication networks.",
            "Secure key design approaches using entropy harvesting in wireless sensor network: A survey.",
            "QQIGSA: A quadrivalent quantum-inspired GSA and its application in optimal adaptive design of wireless sensor networks.",
            "Routing protocols based on node mobility for Underwater Wireless Sensor Network (UWSN): A survey.",
            "Quokka: Latency-Aware Middlebox Scheduling with dynamic resource allocation.",
            "An analysis of fault detection strategies in wireless sensor networks.",
            "Using epidemic betweenness to measure the influence of users in complex networks.",
            "Data gathering problem with the data importance consideration in Underwater Wireless Sensor Networks.",
            "Towards next-generation heterogeneous mobile data stream mining applications: Opportunities, challenges, and future research directions.",
            "Decentralized content sharing among tourists in visiting hotspots.",
            "Malicious accounts: Dark of the social networks.",
            "Semantic aware processing of user defined inference rules to manage home networks.",
            "Cloud security issues and challenges: A survey.",
            "Distributed sampling rate allocation for data quality maximization in rechargeable sensor networks.",
            "Design and analysis of collision free MAC for wireless sensor networks with or without data retransmission.",
            "Kerberos: A real-time fraud detection system for IMS-enabled VoIP networks.",
            "An adaptive prediction approach based on workload pattern discrimination in the cloud.",
            "Elimination of policy conflict to improve the PDP evaluation performance.",
            "A privacy-preserving reputation system with user rewards.",
            "A sleep scheduling approach based on learning automata for WSN partial coverage.",
            "Markov chain-based evaluation of the certificate status validations in hybrid MANETs.",
            "Joint multicast routing and channel assignment for multi-radio multi-channel wireless mesh networks with hybrid traffic.",
            "Design and evaluation of a dual dynamic adaptive reservation approach in media production networks.",
            "Damage prediction for wind turbines using wireless sensor and actuator networks.",
            "From mapping to indoor semantic queries: Enabling zero-effort indoor environmental sensing.",
            "Identifying cyber-attacks on software defined networks: An inference-based intrusion detection approach.",
            "Virtual machine management system based on the power saving algorithm in cloud.",
            "Location attestation and access control for mobile devices using GeoXACML.",
            "HSecGR: Highly Secure Geographic Routing.",
            "Quality of Service (QoS) in Software Defined Networking (SDN): A survey.",
            "A fast hybrid multi-site computation offloading for mobile cloud computing.",
            "Information-Centric Networking in next-generation communications scenarios.",
            "Transition to congestion in communication/computation networks for near-optimal and sub-optimal resource management via Monte Carlo simulations.",
            "Towards repeatability & verifiability in networking experiments: A stochastic framework.",
            "Comprehensive and systematic review of the service composition mechanisms in the cloud environments.",
            "A load balance oriented cost efficient scheduling method for parallel tasks.",
            "Evaluating the impact of network loads and message size on mobile opportunistic networks in challenged environments.",
            "Engineering future interoperable and open IoT systems.",
            "plexi: Adaptive re-scheduling web-service of time synchronized low-power wireless networks.",
            "Enabling IoT interoperability through opportunistic smartphone-based mobile gateways.",
            "Making system of systems interoperable - The core components of the arrowhead framework.",
            "Enabling synergy in IoT: Platform to service and beyond.",
            "Semantic interoperability in the Internet of Things: An overview from the INTER-IoT perspective.",
            "A survey on non-linear optimization problems in wireless sensor networks.",
            "A power-aware MAC layer protocol for real-time communication in wireless embedded systems.",
            "SEM-PPA: A semantical pattern and preference-aware service mining method for personalized point of interest recommendation.",
            "Improving time synchronization in Wireless Sensor Networks using Bayesian Inference.",
            "Light-weight and privacy-preserving secure cloud auditing scheme for group users via the third party medium.",
            "Distributed in-network processing and resource optimization over mobile-health systems.",
            "Constructing event-driven partial barriers with resilience in wireless mobile sensor networks.",
            "Survey on prediction models of applications for resources provisioning in cloud.",
            "A novel key generation method for wireless sensor networks based on system of equations.",
            "Protecting trajectory privacy: A user-centric analysis.",
            "Opportunity prediction at MAC-layer sensing for ad-hoc cognitive radio networks.",
            "MIST: Fog-based data analytics scheme with cost-efficient resource provisioning for IoT crowdsensing applications.",
            "PETAL: A fully distributed location service for wireless ad hoc networks.",
            "A framework for automating security analysis of the internet of things.",
            "T-Hoarder: A framework to process Twitter data streams.",
            "Energy efficient clustering protocol based on improved metaheuristic in wireless sensor networks.",
            "FSQCN: Fast and simple quantized congestion notification in data center ethernet.",
            "A proxy signature-based handover authentication scheme for LTE wireless networks.",
            "An optimized approach to video traffic splitting in heterogeneous wireless networks with energy and QoE considerations.",
            "Modeling and performance analysis for multimedia data flows scheduling in software defined networks.",
            "Cardinality estimation using collective interference for large-scale RFID systems.",
            "Centralized connectivity restoration in multichannel wireless sensor networks.",
            "Technologies and challenges in developing Machine-to-Machine applications: A survey.",
            "Using dynamic programming to solve the Wireless Sensor Network Configuration Problem.",
            "Renewable-aware geographical load balancing of web applications for sustainable data centers.",
            "LaCoDa: Layered connected topology for massive data centers.",
            "Impact of time synchronization error on the mode-shape identification and damage detection/localization in WSNs for structural health monitoring.",
            "A hybrid method for the QoS analysis and parameter optimization in time-critical random access wireless sensor networks.",
            "Discovering time-dependent shortest path on traffic graph for drivers towards green driving.",
            "DeMS: A hybrid scheme of task scheduling and load balancing in computing clusters.",
            "RITS-MHT: Relative indexed and time stamped Merkle hash tree based data auditing protocol for cloud computing.",
            "BDI2DoS: An application using collaborating BDI agents to combat DDoS attacks.",
            "A survey of intrusion detection in Internet of Things.",
            "Security and privacy challenges in mobile cloud computing: Survey and way ahead.",
            "Tracking pedestrians and emergent events in disaster areas.",
            "Compatibility-based static VM placement minimizing interference.",
            "Multi-agent learning based routing for delay minimization in Cognitive Radio Networks.",
            "Communication and networking of UAV-based systems: Classification and associated architectures.",
            "Towards two-phase scheduling of real-time applications in distributed systems.",
            "A green framework for DBMS based on energy-aware query optimization and energy-efficient query processing.",
            "Intelligent systems for heterogeneous networks.",
            "Joint flow and virtual machine placement in hybrid cloud data centers.",
            "Resilient application placement for geo-distributed cloud networks.",
            "CIT: A Cloud Inter-operation Toolkit to enhance elasticity and tolerate shut down of external clouds.",
            "Bandwidth scheduling for big data transfer using multiple fixed node-disjoint paths.",
            "GBC-based caching function group selection algorithm for SINET.",
            "Mobile anchor nodes path planning algorithms using network-density-based clustering in wireless sensor networks.",
            "A software defined network routing in wireless multihop network.",
            "Fifth generation (5G)cellular and the network for tomorrow: cognitive and cooperative approach for energy savings.",
            "Intelligent deployment of UAVs in 5G heterogeneous communication environment for improved coverage.",
            "Fast game-based handoff mechanism with load balancing for LTE/LTE-A heterogeneous networks.",
            "A congestion avoidance game for information exchange on intersections in heterogeneous vehicular networks.",
            "DLM: Delayed location management in network mobility (NEMO)-based public transportation systems.",
            "A flocking-inspired algorithm for fair resource allocation in vehicle-mounted mobile relays.",
            "Special issue on pervasive social networking.",
            "Efficient searchable symmetric encryption for storing multiple source dynamic social data on cloud.",
            "Scalable influence maximization under independent cascade model.",
            "Pervasive social networking forensics: Intelligence and evidence from mobile device extracts.",
            "User-defined privacy location-sharing system in mobile online social networks.",
            "CloudFile: A cloud data access control system based on mobile social trust.",
            "Hypergraph partitioning for social networks based on information entropy modularity.",
            "Social behavior study under pervasive social networking based on decentralized deep reinforcement learning.",
            "Peer discovery for D2D communications based on social attribute and service attribute.",
            "Analyzing and modeling dynamics of information diffusion in microblogging social network.",
            "Editorial: New Editors 2017.",
            "A survey and taxonomy of the authentication schemes in Telecare Medicine Information Systems.",
            "Robust dynamic network traffic partitioning against malicious attacks.",
            "Multi-domain Software Defined Networking: Research status and challenges.",
            "ParaFlow: Fine-grained parallel SDN controller for large-scale networks.",
            "Frequent traffic flow identification through probabilistic bloom filter and its GPU-based acceleration.",
            "NDNrel: A mechanism based on relations among objects to improve the performance of NDN.",
            "Improving fairness between close Wi-Fi access points.",
            "Real-time scheduling based on optimized topology and communication traffic in distributed real-time computation platform of storm.",
            "Pre-caching: A proactive scheme for caching video traffic in named data mesh networks.",
            "A Monte-Carlo approach to lifespan failure performance analysis of the network fabric in modular data centers.",
            "Fractal: An advanced multidimensional range query lookup protocol on nested rings for distributed systems.",
            "Social-based energy-aware multicasting in delay tolerant networks.",
            "Generating realistic intrusion detection system dataset based on fuzzy qualitative modeling.",
            "Proxy Re-Encryption: Analysis of constructions and its application to secure access delegation.",
            "MDP: Minimum delay hot-spot parking.",
            "Design and performance analysis of a MAC protocol for wireless LANs supporting multipacket reception.",
            "Novel unequal clustering routing protocol considering energy balancing based on network partition & distance for mobile education.",
            "Internet of Things security: A survey.",
            "Cache-based transport protocols in wireless sensor networks: A survey and future directions.",
            "Load-balancing algorithms in cloud computing: A survey.",
            "A Multi-Aware Query Driven (MAQD) routing protocol for mobile wireless sensor networks based on neuro-fuzzy inference.",
            "Load balancing in grid computing: Taxonomy, trends and opportunities.",
            "An integrated prefetching/caching scheme in multimedia servers.",
            "An efficient method for evaluating the end-to-end transmission time reliability of a switched Ethernet.",
            "Smart context-aware QoS-based admission control for biomedical wireless sensor networks.",
            "Emerging services for Internet of Things.",
            "Efficient location privacy algorithm for Internet of Things (IoT) services and applications.",
            "Energy efficient wireless communication technique based on Cognitive Radio for Internet of Things.",
            "Lightweight distributed secure data management system for health internet of things.",
            "A new elastic trickle timer algorithm for Internet of Things.",
            "An efficient power saving polling scheme in the internet of energy.",
            "A bio-signal based framework to secure mobile devices.",
            "An efficient authentication and key agreement scheme for multi-gateway wireless sensor networks in IoT deployment.",
            "An inferential real-time falling posture reconstruction for Internet of healthcare things.",
            "An energy-aware service composition algorithm for multiple cloud-based IoT applications.",
            "Augmented and virtual reality based monitoring and safety system: A prototype IoT platform.",
            "Optimization of non-functional properties in Internet of Things applications.",
            "ARKHAM: An Advanced Refinement toolkit for Handling Service Level Agreements in Software-Defined Networking.",
            "UD-WCMA: An energy estimation and forecast scheme for solar powered wireless sensor networks.",
            "Model order selection and eigen similarity based framework for detection and identification of network attacks.",
            "HARD: Hybrid Adaptive Resource Discovery for Jungle Computing.",
            "Cache sharing using bloom filters in named data networking.",
            "Live migration improvements by related dirty memory prediction in cloud computing.",
            "Stealthy Denial of Service (DoS) attack modelling and detection for HTTP/2 services.",
            "Distributed-SOM: A novel performance bottleneck handler for large-sized software-defined networks under flooding attacks.",
            "A non-cooperative non-zero-sum game-based dependability assessment of heterogeneous WSNs with malware diffusion.",
            "Key management in wireless Body Area Network: Challenges and issues.",
            "Transmitter authentication using hierarchical modulation in dynamic spectrum sharing.",
            "A survey on cloud service description.",
            "Crossed Cube Ring: A k-connected virtual backbone for wireless sensor networks.",
            "Throwboxes in delay tolerant networks: A survey of placement strategies, buffering capacity, and mobility models.",
            "An integrated MIH-FPMIPv6 mobility management approach for evolved-packet system architectures.",
            "Special issue on Underwater Acoustic Sensor Networks: Emerging trends and current perspectives.",
            "Cross-layer protocol stack development for three-dimensional underwater Acoustic Sensor Network.",
            "Performance comparison of TDMA variants for underwater acoustic sensor networks.",
            "Region based cooperative routing in underwater wireless sensor networks.",
            "Energy efficient chain based routing protocol for underwater wireless sensor networks.",
            "AREP: An asymmetric link-based reverse routing protocol for underwater acoustic sensor networks.",
            "Design of optical-acoustic hybrid underwater wireless sensor network.",
            "An efficient communication scheme for solving merge conflicts in maritime transportation.",
            "Node stability-based routing in Wireless Mesh Networks.",
            "A generic controller for managing TCP transfers in IEEE 802.11 infrastructure WLANs.",
            "Distributed asteroid discovery system for large astronomical data.",
            "LPCN: Least polar-angle connected node algorithm to find a polygon hull in a connected euclidean graph.",
            "Resource management in D2D communication: An optimization perspective.",
            "Delay constrained relay node placement in two-tiered wireless sensor networks: A set-covering-based algorithm.",
            "Congestion avoidance algorithm using ARIMA(2, 1, 1) model-based RTT estimation and RSS in heterogeneous wired-wireless networks.",
            "Positioning technology of mobile vehicle using self-repairing heterogeneous sensor networks.",
            "Enabling Adaptive Routing Service Customization via the integration of SDN and NFV.",
            "Active request management in stateful forwarding networks.",
            "Ubiquitous sensor network simulation and emulation environments: A survey.",
            "A dynamic Tenant-Defined Storage system for efficient resource management in cloud applications.",
            "Design and evaluation of schemes for provisioning service function chain with function scalability.",
            "Enabling in-network aggregation by diffusion units for urban scale M2M networks.",
            "A self-organizing network coordination framework enabling collision-free and congestion-less wireless sensor networks.",
            "Wi-Fi Direct Research ‐ Current Status and Future Perspectives.",
            "Cross-VM cache-based side channel attacks and proposed prevention mechanisms: A survey.",
            "Enabling network innovation in data center networks with software defined networking: A survey.",
            "Trustworthy data: A survey, taxonomy and future trends of secure provenance schemes.",
            "A distributed solution for cooperative spectrum sensing scheduling in multi-band cognitive radio networks.",
            "A machine learning-based framework for preventing video freezes in HTTP adaptive streaming.",
            "Supporting mobility-aware computational offloading in mobile cloud environment.",
            "Editorial: 2016 Best Paper Awards.",
            "A comprehensive survey on multichannel routing in wireless sensor networks.",
            "Auto-scaling web applications in clouds: A cost-aware approach.",
            "A fast robust optimization-based heuristic for the deployment of green virtual network functions.",
            "A survey on ultra-dense network and emerging technologies: Security challenges and possible solutions.",
            "Location-aware brokering for consumers in multi-cloud computing environments.",
            "Affinity aware scheduling model of cluster nodes in private clouds.",
            "A congestion-aware and robust multicast protocol in SDN-based data center networks.",
            "Number of channels adjustment for cognitive radio networks.",
            "A fault-tolerant self-organizing flocking approach for UAV aerial survey.",
            "An analytical model for delay bound of OpenFlow based SDN using network calculus.",
            "A survey on green communication and security challenges in 5G wireless communication networks.",
            "Preservation of temporal privacy in body sensor networks.",
            "Operator calculus approach for route optimizing and enhancing wireless sensor network.",
            "Alert correlation framework for malware detection by anomaly-based packet payload analysis.",
            "Data aggregation mechanisms in the Internet of things: A systematic review of the literature and recommendations for future research.",
            "Cloud storage reliability for Big Data applications: A state of the art survey.",
            "A review of smart home applications based on Internet of Things.",
            "Towards port-knocking authentication methods for mobile cloud computing.",
            "Energy efficient device discovery for reliable communication in 5G-based IoT and BSNs using unmanned aerial vehicles.",
            "Survey and systematic mapping of industrial Wireless Sensor Networks.",
            "A resource allocation framework for adaptive video streaming over LTE.",
            "A survey of cognitive radio handoff schemes, challenges and issues for industrial wireless sensor networks (CR-IWSN).",
            "Device free localization technology for human detection and counting with RF sensor networks: A review.",
            "ERA: Towards privacy preservation and verifiability for online ad exchanges.",
            "Cloud monitoring: A review, taxonomy, and open research issues.",
            "Survey on fog computing: architecture, key technologies, applications and open issues.",
            "A taxonomic survey on load balancing in cloud.",
            "A validation model for non-lexical routing protocols.",
            "An algorithm for network and data-aware placement of multi-tier applications in cloud data centers.",
            "Efficient and privacy-aware multi-party classification protocol for human activity recognition.",
            "SmartITS: Smartphone-based identification and tracking using seamless indoor-outdoor localization.",
            "Cross layer optimization for outage minimizing routing in cognitive radio ad hoc networks with primary users' outage protection.",
            "Effective and efficient collection of control messages for opportunistic routing algorithms.",
            "A nonparametric approach to the automated protocol fingerprint inference.",
            "Securing range free localization against wormhole attack using distance estimation and maximum likelihood estimation in Wireless Sensor Networks.",
            "TBDClust: Time-based density clustering to enable free browsing of sites in pay-per-use mobile Internet providers.",
            "A goodput distribution model for planning IEEE 802.11 WBNs in built environments.",
            "Selective AP probing for indoor positioning in a large and AP-dense environment.",
            "Two birds, one stone: Using mobility behavioral profiles both as destinations and as a routing tool.",
            "Routing protocols in wireless body sensor networks: A comprehensive survey.",
            "Hybrid ToF and RSSI real-time semantic tracking with an adaptive industrial internet of things architecture.",
            "A cooperative scheduling method based on the device load feedback for multiple tasks scheduling.",
            "Distributed radio resource allocation for device-to-device communications underlaying cellular networks.",
            "Encrypted token based authentication with adapted SAML technology for cloud web services.",
            "Epidemic data survivability in Unattended Wireless Sensor Networks: New models and results.",
            "100 Volumes of JNCA.",
            "Design of a novel dynamic trust model for spectrum management in WRANs of TV white space.",
            "Towards defending eavesdropping on NFC.",
            "Privacy-respecting auctions and rewarding mechanisms in mobile crowd-sensing applications.",
            "A survey: Hybrid SDN.",
            "Lostrego: A distributed stream-based infrastructure for the real-time gathering and analysis of heterogeneous educational data.",
            "Enhanced tree routing protocols for multi-hop and multi-channel cognitive radio network (EMM-TRP).",
            "Information collection centric techniques for cloud resource management: Taxonomy, analysis and challenges."
        ]
    },
    {
        "name": "JNCA",
        "year": "2016",
        "info": "2016: Volumes\n59,\n60,\n61,\n62,\n63,\n64,\n65,\n66,\n67,\n68,\n69,\n70,\n71,\n72,\n73,\n74,\n75,\n76",
        "count": 277,
        "papers": [
            "Special issue on green networking, computing, and software systems.",
            "Geographic multipath routing based on geospatial division in duty-cycled underwater wireless sensor networks.",
            "A new energy-aware task scheduling method for data-intensive applications in the cloud.",
            "Manufacturing service composition method based on networked collaboration mode.",
            "An energy-efficient SDN based sleep scheduling algorithm for WSNs.",
            "Dynamic energy-aware cloudlet-based mobile cloud computing model for green computing.",
            "A novel green algorithm for sampling complex networks.",
            "An energy-optimization-based method of task scheduling for a cloud video surveillance center.",
            "Orchestration of energy efficiency capabilities in networks.",
            "BTRES: Beta-based Trust and Reputation Evaluation System for wireless sensor networks.",
            "Energy-aware and quality-driven sensor management for green mobile crowd sensing.",
            "Termination analysis with recursive calling graphs.",
            "A resource-efficient multimedia encryption scheme for embedded video sensing system based on unmanned aircraft.",
            "An energy efficient authenticated key agreement protocol for SIP-based green VoIP networks.",
            "Optimization/simulation-based risk mitigation in resilient green communication networks.",
            "Improving consolidation of virtual machine based on virtual switching overhead estimation.",
            "A semantic framework for configurable business process as a service in the cloud.",
            "Energy efficiency aware load distribution and electricity cost volatility control for cloud service providers.",
            "New order preserving encryption model for outsourced databases in cloud environments.",
            "Adding long-term availability, obfuscation, and encryption to multi-cloud storage systems.",
            "Semantic relation computing theory and its application.",
            "Enabling end-to-end CoAP-based communications for the Web of Things.",
            "Making social networks a means to save energy.",
            "Smart grid communications: Modeling and validation.",
            "Reactive power control for an energy storage system: A real implementation in a Micro-Grid.",
            "A network model for the real-time communications of a smart grid prototype.",
            "Network and power-grid co-simulation framework for Smart Grid wide-area monitoring networks.",
            "Measurement and simulation framework for throughput evaluation of narrowband power line communication links in low-voltage grids.",
            "Policy enforcement system for secure interoperable control in distributed Smart Grid systems.",
            "A robust distributed system incremental cost estimation algorithm for smart grid economic dispatch with communications information losses.",
            "Puppet attack: A denial of service attack in advanced metering infrastructure network.",
            "Preserving privacy and efficiency in data communication and aggregation for AMI network.",
            "Formal modelling and analysis of DNP3 secure authentication.",
            "Network computing and applications for Big Data analytics.",
            "A personalized information recommendation system for R&D project opportunity finding in big data contexts.",
            "MuDi-Stream: A multi density clustering algorithm for evolving data stream.",
            "HCube: Routing and similarity search in Data Centers.",
            "A mathematical model to analyze the utilization of a cloud datacenter middleware.",
            "Evolutionary optimization: A big data perspective.",
            "Editorial.",
            "Trustworthy and effective person-to-person payments over multi-hop MANETs.",
            "A survey of network anomaly detection techniques.",
            "RESTful service composition at a glance: A survey.",
            "Availability in the cloud: State of the art.",
            "Comparison-based system-level fault diagnosis protocols for mobile ad-hoc networks: A survey.",
            "A survey on mobility-assisted localization techniques in wireless sensor networks.",
            "Web application protection techniques: A taxonomy.",
            "Review and analysis of networking challenges in cloud computing.",
            "Case studies of performance evaluation of cryptographic algorithms for an embedded system and a general purpose computer.",
            "A novel asymmetric three-party based authentication scheme in wearable devices environment.",
            "Differentiated forwarding and caching in named-data networking.",
            "A survey of grid-based searching techniques for large scale distributed data.",
            "I2CC: Interleaving two-level cache with network coding in peer-to-peer VoD system.",
            "Applications of wireless sensor networks for urban areas: A survey.",
            "Traffic matrix estimation: A neural network approach with extended input and expectation maximization iteration.",
            "Collaborative distributed communication in heterogeneous environments: A comprehensive survey.",
            "A comparative analysis of node replica detection schemes in wireless sensor networks.",
            "A novel IPv6 address configuration for a 6LoWPAN-based WBAN.",
            "Design and performance evaluation of distributed mobility management schemes for network mobility.",
            "Authentication in mobile cloud computing: A survey.",
            "A survey of fault tolerance architecture in cloud computing.",
            "3D space detection and coverage of wireless sensor network based on spatial correlation.",
            "Energy-balanced compressive data gathering in Wireless Sensor Networks.",
            "Secure Group Communication in Wireless Sensor Networks: A survey.",
            "Null-frequency jamming of a proactive routing protocol in wireless mesh networks.",
            "A fully-decentralized semantic mechanism for autonomous wireless sensor nodes.",
            "Spectrum handoff in cognitive radio networks: A classification and comprehensive survey.",
            "A multi-RAT bandwidth aggregation mechanism with software-defined networking.",
            "Secure and dependable software defined networks.",
            "Adaptive marking threshold method for delay-sensitive TCP in data center network.",
            "An efficient mutual authentication and key agreement scheme preserving strong anonymity of the mobile user in global mobility networks.",
            "A multi-level intrusion detection method for abnormal network behaviors.",
            "Cloudlet deployment in local wireless networks: Motivation, architectures, applications, and open challenges.",
            "Enabling group communication for public safety in LTE-Advanced networks.",
            "Intrusion response systems: Foundations, design, and challenges.",
            "Sociopsychological trust model for Wireless Sensor Networks.",
            "Using a wireless visual sensor network to harmonically navigate multiple low-cost wheelchairs in an indoor environment.",
            "RIM: Relative-importance based data forwarding in people-centric networks.",
            "Light-weight trust-enhanced on-demand multi-path routing in mobile ad hoc networks.",
            "Accuracy-aware wireless indoor localization: Feasibility and applications.",
            "A survey on data leakage prevention systems.",
            "Secure and reliable certificate chains recovery protocol for mobile ad hoc networks.",
            "Recent progress in routing protocols of mobile opportunistic networks: A clear taxonomy, analysis and evaluation.",
            "A new approach to mitigating security risks of phone clone co-location over mobile clouds.",
            "Radient: Scalable, memory efficient name lookup algorithm for named data networking.",
            "Towards wireless sensor, actuator and robot networks: Conceptual framework, challenges and perspectives.",
            "Survey on key revocation mechanisms in wireless sensor networks.",
            "An exploration of broader influence maximization in timeliness networks with opportunistic selection.",
            "Efficient scheduling algorithm for multiple mobile subscriber stations with unsolicited grant service in an IEEE 802.16e network.",
            "Scheduled-links multicast routing protocol in MANETs.",
            "A cost analysis framework for claimer reporter witness based clone detection schemes in WSNs.",
            "Lifespan prolonging location-wise predetermined deployment strategy for visual sensor networks.",
            "Design and implementation of WiMesh: A tool for the performance evaluation of multi-radio wireless mesh networks.",
            "Joint flow routing-scheduling for energy efficient software defined data center networks: A prototype of energy-aware network management platform.",
            "A page-granularity wear-leveling (PGWL) strategy for NAND flash memory-based sink nodes in wireless sensor networks.",
            "Efficient image deployment in cloud environments.",
            "AIPISteg: An active IP identification based steganographic method.",
            "Physics and microeconomics-based metrics for evaluating cloud computing elasticity.",
            "A cyber-resilient architecture for critical security services.",
            "A secure IoT management architecture based on Information-Centric Networking.",
            "Network anomaly detection using IP flows with Principal Component Analysis and Ant Colony Optimization.",
            "An efficient and secure privacy-preserving approach for outsourced data of resource constrained mobile devices in cloud computing.",
            "Resource provision algorithms in cloud computing: A survey.",
            "Reducing the energy consumption at the user equipment through multi-stream cross-carrier-aware discontinuous reception (DRX) in LTE-advanced systems.",
            "Smartphone-based crowdsourcing for estimating the bottleneck capacity in wireless networks.",
            "Combined Banzhaf & Diversity Index (CBDI) for critical node detection.",
            "Cooperative energy-efficient localization with node lifetime extension in mobile long-thin networks.",
            "Energy efficient cloud service pricing: A two-timescale optimization approach.",
            "Channel selection using a multiple radio model.",
            "Optimal virtual network migration: A step closer for seamless resource mobility.",
            "When things matter: A survey on data-centric internet of things.",
            "Fusion-based surveillance WSN deployment using Dempster-Shafer theory.",
            "Network coding-based multisource content delivery in Content Centric Networking.",
            "Corona based deployment strategies in wireless sensor network: A survey.",
            "Coding based wireless broadcast scheduling in real time applications.",
            "Network coding with crowdsourcing-based trajectory estimation for vehicular networks.",
            "A DTN routing strategy based on neural networks for urban bus transportation system.",
            "A comprehensive review of the data replication techniques in the cloud environments: Major trends and future directions.",
            "Optimal placement of relay nodes in wireless sensor network using artificial bee colony algorithm.",
            "Editorial: 2015 Best Paper Awards.",
            "E-MAC: An evolutionary solution for collision avoidance in wireless ad hoc networks.",
            "An adaptive mobile cloud computing framework using a call graph based model.",
            "Name prefix matching using bloom filter pre-searching for content centric network.",
            "The power of swarming in personal clouds under bandwidth budget.",
            "A discovery scheme based on carrier sensing in self-organizing Bluetooth Low Energy networks.",
            "Heuristic solutions to the target identifiability problem in directional sensor networks.",
            "Survey of load balancing techniques for Grid.",
            "A survey of routing and channel assignment in multi-channel multi-radio WMNs.",
            "Economic metric to improve spam detectors.",
            "Virtual resource prediction in cloud environment: A Bayesian approach.",
            "Power trading in cognitive radio networks.",
            "A reliable and cost-efficient auto-scaling system for web applications using heterogeneous spot instances.",
            "Ensemble based collaborative and distributed intrusion detection systems: A survey.",
            "Comparative analysis of cloud data integrity auditing protocols.",
            "User context recognition using smartphone sensors and classification models.",
            "HRSPC: a hybrid redundancy scheme via exploring computational locality to support fast recovery and high reliability in distributed storage systems.",
            "Towards workflow scheduling in cloud computing: A comprehensive analysis.",
            "Machine-to-Machine (M2M) communications: A survey.",
            "An overview of virtual machine placement schemes in cloud computing.",
            "Approaching green sensor field using queue-based optimization technique.",
            "Mobile crowdsourcing in peer-to-peer opportunistic networks: Energy usage and response analysis.",
            "Restoring connectivity in a resource constrained WSN.",
            "A likelihood ratio anomaly detector for identifying within-perimeter computer network attacks.",
            "PSUM: Peer-to-peer multimedia content distribution using collusion-resistant fingerprinting.",
            "Secure routing for internet of things: A survey.",
            "Network forensics: Review, taxonomy, and open challenges.",
            "Big data analytic architecture for intruder detection in heterogeneous wireless sensor networks.",
            "Flexible service provisioning based on context constraint for enhancing user experience in service oriented mobile cloud.",
            "Software defined networks: A survey.",
            "Impact of redundant sensor deployment over data gathering performance: A model based approach.",
            "A novel transmission range adjustment strategy for energy hole avoiding in wireless sensor networks.",
            "The next generation of passive optical networks: A review.",
            "Survey of challenges and towards a unified architecture for location systems.",
            "Modeling energy-aware web services and application.",
            "State-of-the-art, challenges, and open issues in the integration of Internet of things and cloud computing.",
            "Characterizing power saving for device-to-device browser cache cooperation.",
            "A survey of routing and data dissemination in Delay Tolerant Networks.",
            "Distributed denial of service (DDoS) resilience in cloud: Review and conceptual cloud DDoS mitigation framework.",
            "Neural networks in wireless networks: Techniques, applications and guidelines.",
            "Hybrid multi-tenant cache management for virtualized ISP networks.",
            "Energy efficient techniques for M2M communication: A survey.",
            "TCP congestion control algorithm for heterogeneous Internet.",
            "SD-Anti-DDoS: Fast and efficient DDoS defense in software-defined networks.",
            "Energy-aware data center networks.",
            "Fraud detection system: A survey.",
            "MSAR: A metric self-adaptive routing model for Mobile Ad Hoc Networks.",
            "A survey on OpenFlow-based Software Defined Networks: Security challenges and countermeasures.",
            "Analysis for TCP in data center networks: Outcast and Incast.",
            "A Real-time scheduling algorithm for on-demand wireless XML data broadcasting.",
            "A spectrum allocation scheme based on first-last-exact fit policy for elastic optical networks.",
            "Resource scheduling for infrastructure as a service (IaaS) in cloud computing: Challenges and opportunities.",
            "JuiceCaster: Towards automatic juice filming attacks on smartphones.",
            "Mining social networks for anomalies: Methods and challenges.",
            "Two-phase load balancing of In-Memory Key-Value Storages using Network Functions Virtualization (NFV).",
            "Coordinated node and link mapping VNE using a new paths algebra strategy.",
            "Fault tolerant distributed estimation in wireless sensor networks.",
            "Multimedia prefetching with optimal Markovian policies.",
            "An Administrative Cluster-based Cooperative Caching (ACCC) strategy for Mobile Ad Hoc Networks.",
            "A power efficient cluster-based routing algorithm for wireless sensor networks: Honeybees swarm intelligence based approach.",
            "A combined energy-bandwidth approach to allocate resilient virtual software defined networks.",
            "Flexible indoor localization and tracking system based on mobile phone.",
            "Power management in virtualized datacenter - A survey.",
            "A model-driven approach for engineering trust and reputation into software services.",
            "Dynamics of service selection and provider pricing game in heterogeneous cloud market.",
            "How physical network topologies affect virtual network embedding quality: A characterization study based on ISP and datacenter networks.",
            "An approach for designing cognitive engines in cognitive peer-to-peer networks.",
            "FUIR: Fusing user and item information to deal with data sparsity by using side information in recommendation systems.",
            "Towards next-generation routing protocols for pocket switched networks.",
            "MIRACLE: A multiple independent random walks community parallel detection algorithm for big graphs.",
            "Cloud based Video-on-Demand service model ensuring quality of service and scalability.",
            "Novel relay node placement algorithms for establishing connected topologies.",
            "Multi-path TCP performance evaluation in dual-homed (wired/wireless) devices.",
            "Empowering networking research and experimentation through Software-Defined Networking.",
            "Characteristics analysis at prefix granularity: A case study in an IPv6 network.",
            "Bit-level n-gram based forensic authorship analysis on social media: Identifying individuals from linguistic profiles.",
            "Towards fair and low latency next generation high speed networks: AFCD queuing.",
            "iPersea: Towards improving the Sybil-resilience of social DHT.",
            "A survey of security issues for cloud computing.",
            "Routing in wireless multimedia sensor networks: A survey and challenges ahead.",
            "Channel-aware routing and priority-aware multi-channel scheduling for WSN-based smart grid applications.",
            "PAgIoT - Privacy-preserving Aggregation protocol for Internet of Things.",
            "Energy-efficiency and reliability in MAC and routing protocols for underwater wireless sensor network: A survey.",
            "Load balancing mechanisms and techniques in the cloud environments: Systematic literature review and future trends.",
            "Device-to-Device Communication in Cellular Networks: A Survey.",
            "Adaptive event sensing in networks of autonomous mobile agents.",
            "A survey on interference management for Device-to-Device (D2D) communication and its challenges in 5G networks.",
            "A survey of big data management: Taxonomy and state-of-the-art.",
            "TCP-FIT: An improved TCP algorithm for heterogeneous networks.",
            "2P-Lookup: Popularity and Proximity based P2P Lookup mechanism over MANETs.",
            "An IoT-based mobile gateway for intelligent personal assistants on mobile health environments.",
            "Game model to optimally combine electric vehicles with green and non-green sources into an end-to-end smart grid architecture.",
            "User profiling in intrusion detection: A review.",
            "Routing protocols in cognitive radio ad hoc networks: A comprehensive review.",
            "GRS: A Group-Based Recruitment System for Mobile Crowd Sensing.",
            "A survey on cloud federation architectures: Identifying functional and non-functional properties.",
            "On balanced k-coverage in visual sensor networks.",
            "Traffic and mobility aware resource prediction using cognitive agent in mobile ad hoc networks.",
            "ERGID: An efficient routing protocol for emergency response Internet of Things.",
            "Review of channel assignment approaches in multi-radio multi-channel wireless mesh network.",
            "Supporting secure spectrum sensing data transmission against SSDH attack in cognitive radio ad hoc networks.",
            "Data popularity measurements in distributed systems: Survey and design directions.",
            "Distributed topology construction algorithm to improve link quality and energy efficiency for wireless sensor networks.",
            "The impact of node position on outage performance of RF energy powered wireless sensor communication links in overlaid deployment scenario.",
            "Fairness in Cognitive Radio Networks: Models, measurement methods, applications, and future research directions.",
            "x-Folded TM: An efficient topology for interconnection networks.",
            "Enhancing energy efficiency and load balancing in mobile ad hoc network using dynamic genetic algorithms.",
            "Hierarchical-game-based algorithm for downlink joint subchannel and power allocation in OFDMA femtocell networks.",
            "Data quality in internet of things: A state-of-the-art survey.",
            "An environment-friendly spectrum decision strategy for underwater acoustic networks.",
            "Corrigendum to: \"Cross-layer QoE-driven admission control and resource allocation for adaptive multimedia services in LTE\" [J. Netw. Comput. Appl. 46(2014) 336-351].",
            "Corrigendum to \"Modelling opportunistic spectrum renting in mobile cellular networks\" [J. Netw. Comput. Appl. 52(2015) 129-138].",
            "High-performance IPv6 address lookup in GPU-accelerated software routers.",
            "Navigation-driven handoff minimization in wireless networks.",
            "Uncertainty-aware RFID network planning for target detection and target location.",
            "Large profits or fast gains: A dilemma in maximizing throughput with applications to network processors.",
            "Privacy-preserving data sharing scheme over cloud for social applications.",
            "Exploiting anomalous slots for multiple channel access in IEEE 802.11 networks.",
            "Reliability and energy efficiency in cloud computing systems: Survey and taxonomy.",
            "A framework and risk assessment approaches for risk-based access control in the cloud.",
            "On cloud security attacks: A taxonomy and intrusion detection and prevention as a service.",
            "Multipath QoS-driven routing protocol for industrial wireless networks.",
            "Communication technologies for smart grid applications: A survey.",
            "Adaptive router node placement with gateway positions and QoS constraints in dynamic wireless mesh networks.",
            "The coverage problem in visual sensor networks: A target oriented approach.",
            "Optimal drone placement and cost-efficient target coverage.",
            "Block Negative Acknowledgement protocol for reliable multicast in IEEE 802.11.",
            "Cost-aware service brokering and performance sentient load balancing algorithms in the cloud.",
            "The rise of \"malware\": Bibliometric analysis of malware study.",
            "A novel hybrid medium access control protocol for inter-M2M communications.",
            "Piconet construction and restructuring mechanisms for interference avoiding in bluetooth PANs.",
            "Towards an open source architecture for multi-operator LTE core networks.",
            "GOSPF: An energy efficient implementation of the OSPF routing protocol.",
            "High throughput graphics processing unit based Fano decoder.",
            "A survey on service function chaining.",
            "Towards scalable security analysis using multi-layered security models.",
            "A new explicit congestion notification scheme for satellite IP networks.",
            "Efficient event handling in Wireless Sensor and Actor Networks: An on-line computation approach.",
            "A survey on cloud computing security: Issues, threats, and solutions.",
            "To move or not to move: Cost optimization in a dual cloud-based storage architecture.",
            "The past, present, and future of transport-layer multipath.",
            "Copy-move forgery detection: Survey, challenges and future directions.",
            "Optimization based spectral partitioning for node criticality assessment.",
            "Survey on low power real-time wireless MAC protocols.",
            "Buyer seller watermarking protocols issues and challenges - A survey.",
            "Towards native code offloading based MCC frameworks for multimedia applications: A survey.",
            "Workflow-supported social networks: Discovery, analyses, and system.",
            "A virtual replica node-based flash crowds alleviation method for sensor overlay networks.",
            "PRADD: A path reliability-aware data delivery protocol for underwater acoustic sensor networks.",
            "Survey of approaches and features for the identification of HTTP-based botnet traffic.",
            "Traffic matrix prediction and estimation based on deep learning in large-scale IP backbone networks.",
            "A survey of smart grid architectures, applications, benefits and standardization.",
            "An untraceable temporal-credential-based two-factor authentication scheme using ECC for wireless sensor networks.",
            "Khorramshahr: A scalable peer to peer architecture for port warehouse management system.",
            "High performance traffic classification based on message size sequence and distribution.",
            "On analyzing user location discovery methods in smart homes: A taxonomy and survey.",
            "SocialHide: A generic distributed framework for location privacy protection.",
            "N-FIB: Scalable, memory efficient name-based forwarding."
        ]
    },
    {
        "name": "JNCA",
        "year": "2015",
        "info": "2015: Volumes\n47,\n48,\n49,\n50,\n51,\n52,\n53,\n54,\n55,\n56,\n57,\n58",
        "count": 166,
        "papers": [
            "A survey of routing protocols based on link-stability in mobile ad hoc networks.",
            "On-demand scheduling for concurrent multipath transfer using the stream control transmission protocol.",
            "Comparison of local lossless compression algorithms for Wireless Sensor Networks.",
            "Dynamic packet beaconing for GPSR mobile ad hoc position-based routing protocol using fuzzy logic.",
            "A Study on the Critical Analysis of Computational Offloading Frameworks for Mobile Cloud Computing.",
            "Forwarder smart selection protocol for limitation of broadcast storm problem.",
            "Accurate DNS query characteristics estimation via active probing.",
            "Scalable data replication in content-centric networking based on alias names.",
            "Cloud resource management: A survey on forecasting and profiling models.",
            "A comprehensive survey on Carrier Ethernet Congestion Management mechanism.",
            "Channel availability for mobile cognitive radio networks.",
            "Range-free localization approach for M2M communication system using mobile anchor nodes.",
            "Design of an Archimedes' spiral based node deployment scheme targeting enhancement of network lifetime in wireless sensor networks.",
            "Improving area coverage of wireless sensor networks via controllable mobile nodes: A greedy approach.",
            "A new method for reliability allocation of avionics connected via an airborne network.",
            "A novel framework to mitigate the negative impacts of green techniques on BGP.",
            "Coverage hole and boundary nodes detection in wireless sensor networks.",
            "Man-At-The-End attacks: Analysis, taxonomy, human aspects, motivation and future directions.",
            "Reader level filtering for efficient query processing in RFID middleware.",
            "Energy-efficient algorithms for distributed storage system based on block storage structure reconfiguration.",
            "A recursive Byzantine-resilient protocol.",
            "Application partitioning algorithms in mobile cloud computing: Taxonomy, review and future directions.",
            "Perspective of space and time based replica population organizing strategy in unstructured peer-to-peer networks.",
            "A comprehensive survey of modern symmetric cryptographic solutions for resource constrained environments.",
            "Data fusion prolongs the lifetime of mobile sensing networks.",
            "NFRA-C, neighbor friendly reader to reader anti-collision protocol with counters for dense reader environments.",
            "Location-based mobility support for 6LoWPAN wireless sensor networks.",
            "Efficient distributed semantic based data and service unified discovery with one-dimensional semantic space.",
            "Data placement using Dewey Encoding in a hierarchical data grid.",
            "Shared resource network-aware impact determination algorithms for service workflow deployment with partial cloud offloading.",
            "Autonomic schemes for threat mitigation in Internet of Things.",
            "Toward secure group communication in wireless mobile environments: Issues, solutions, and challenges.",
            "Integration of Cognitive Radio Technology with unmanned aerial vehicles: Issues, opportunities, and future research challenges.",
            "A convex optimization-based traffic matrix estimation approach in IP-over-WDM backbone networks.",
            "An integrated task computation and data management scheduling strategy for workflow applications in cloud environments.",
            "An efficient confidentiality-preserving Proof of Ownership for deduplication.",
            "Special issue on information-centric network architecture, protocols, algorithms and applications.",
            "Challenges and solutions for secure information centric networks: A case study of the NetInf architecture.",
            "An integrated authentication and authorization approach for the network of information architecture.",
            "SIONA: A Service and Information Oriented Network Architecture.",
            "A reliable multicast transport protocol for information-centric networks.",
            "Cache capacity-aware content centric networking under flash crowds.",
            "Combining data naming and context awareness for pervasive networks.",
            "Scalability of information centric networking using mediated topology management.",
            "NDNBrowser: An extended web browser for named data networking.",
            "Forwarding strategies in named data wireless ad hoc networks: Design and evaluation.",
            "Design and implementation of ICN-enabled IEEE 802.11 access points as nano data centers.",
            "Skewly replicating hot data to construct a power-efficient storage cluster.",
            "An improved virtualization layer to support distribution of multimedia contents in pervasive social applications.",
            "Optimizing the mobility management task in networks of four world capital cities.",
            "QoE/QoS-aware LTE downlink scheduler for VoIP with power saving.",
            "Memory-efficient IP lookup using trie merging for scalable virtual routers.",
            "Network-coded cooperative information recovery in cellular/802.11 mobile Networks.",
            "Topology control models and solutions for signal irregularity in mobile underwater wireless sensor networks.",
            "Investigations on enhanced power saving mechanism for IEEE 802.16m network with heterogeneous traffic.",
            "Modeling low-power wireless communications.",
            "Editorial.",
            "Corrigendum to \"Optimal deployment in randomly deployed heterogeneous WSNs: A connected coverage approach\" [J. Network and Computer Applications 46, (2014), 182-197].",
            "Information centric network: Research challenges and opportunities.",
            "A survey on virtual machine migration and server consolidation frameworks for cloud data centers.",
            "Two-tier project and job scheduling for SaaS cloud service providers.",
            "Robot communication link using 802.11n or 900 MHz OFDM.",
            "Application optimization in mobile cloud computing: Motivation, taxonomies, and open challenges.",
            "Effective link interference model in topology control of wireless Ad hoc and sensor networks.",
            "CrowdSensing: A crowd-sourcing based indoor navigation using RFID-based delay tolerant network.",
            "SA-PSO based optimizing reader deployment in large-scale RFID Systems.",
            "Congestion control mechanisms in wireless sensor networks: A survey.",
            "Two-tier particle swarm optimization protocol for clustering and routing in wireless sensor network.",
            "Modelling opportunistic spectrum renting in mobile cellular networks.",
            "Adaptive security management of real-time storage applications over NAND based storage systems.",
            "Seamless application execution in mobile cloud computing: Motivation, taxonomy, and open challenges.",
            "Neighbor discovery in traditional wireless networks and cognitive radio networks: Basics, taxonomy, challenges and future research directions.",
            "QoS aware green routing and wavelength assignment in core WDM networks.",
            "Training network administrators in a game-like environment.",
            "D3M: Multicast listener mobility support mechanisms over distributed mobility anchoring architectures.",
            "A systematic review on heterogeneous routing protocols for wireless sensor network.",
            "A fast privacy-preserving framework for continuous location-based queries in road networks.",
            "A review paper on preserving privacy in mobile environments.",
            "Multi-point relay selection strategies to reduce topology control traffic for OLSR protocol in MANETs.",
            "DC-Vegas: A delay-based TCP congestion control algorithm for datacenter applications.",
            "Student-oriented planning of e-learning contents for Moodle.",
            "Implementing multiple biometric features for a recall-based graphical keystroke dynamics authentication system on a smart phone.",
            "Adaptive multi-objective artificial immune system based virtual network embedding.",
            "Analyzing and modeling mobility for infrastructure-less communication.",
            "On dynamic signaling congestion mitigation by overlapping tracking area lists.",
            "Cost-aware demand scheduling for delay tolerant applications.",
            "FLBA: A fuzzy algorithm for load balancing in IEEE 802.11 networks.",
            "Monitoring IPTV quality of experience in overlay networks using utility functions.",
            "Optimal scheduling for multi-flow update in Software-Defined Networks.",
            "An efficient distributed max-flow algorithm for Wireless Sensor Networks.",
            "Game theory for energy efficiency in Wireless Sensor Networks: Latest trends.",
            "Identification of contamination zones for sinkhole detection in MANETs.",
            "Speculative parallel pattern matching using stride-k DFA for deep packet inspection.",
            "Cooperation stimulation mechanisms for wireless multihop networks: A survey.",
            "State-of-the-art survey on P2P overlay networks in pervasive computing environments.",
            "QoS in IEEE 802.11-based wireless networks: A contemporary review.",
            "The impact of node velocity diversity on mobile opportunistic network performance.",
            "A trust-based probabilistic recommendation model for social networks.",
            "Routing in Neighborhood Area Networks: A survey in the context of AMI communications.",
            "Distributed power control for wireless networks via the alternating direction method of multipliers.",
            "ORCEF: Online response cost evaluation framework for intrusion response system.",
            "User-side cloud service management: State-of-the-art and future directions.",
            "FREME: A pattern partition based engine for fast and scalable regular expression matching in practice.",
            "NationTelescope: Monitoring and visualizing large-scale collective behavior in LBSNs.",
            "Agile-SD: A Linux-based TCP congestion control algorithm for supporting high-speed and short-distance networks.",
            "AME-WPC: Advanced model for efficient workload prediction in the cloud.",
            "ENTICE: Agent-based energy trading with incomplete information in the smart grid.",
            "Pervasive gaming: Status, trends and design principles.",
            "ACCPndn: Adaptive Congestion Control Protocol in Named Data Networking by learning capacities using optimized Time-Lagged Feedforward Neural Network.",
            "A novel adaptive spectrum allocation scheme for multi-channel multi-radio wireless mesh networks.",
            "A survey of computation offloading strategies for performance improvement of applications running on mobile devices.",
            "Energy efficiency of elastic frequency grids in multilayer IP/MPLS-over-flexgrid networks.",
            "Survey on caching approaches in Information Centric Networking.",
            "Impact of the distribution quality of file replicas on replication strategies.",
            "Network tomography application in mobile ad-hoc network using stitching algorithm.",
            "Lifespan and propagation of information in On-line Social Networks: A case study based on Reddit.",
            "A novel federated strong mobile signature service - The Finnish case.",
            "Modeling and predicting temporal patterns of web content changes.",
            "Distributed and scalable embedding of virtual networks.",
            "Utility-aware social network graph anonymization.",
            "A passive self-configuration MAC protocol for supporting network management in IEEE 802.11-based multi-hop mobile ad hoc networks.",
            "SOLS: A scheme for outsourced location based service.",
            "Performance modeling and analysis of virtualized multi-tier applications under dynamic workloads.",
            "A sliding window based Self-Learning and Adaptive Load Balancer.",
            "Dynamic anchor points selection for mobility management in Software Defined Networks.",
            "A PCA based optimization approach for IP traffic matrix estimation.",
            "Scalable and efficient file sharing in information-centric networking.",
            "Energy-aware cache management at the wireless network edge for information-centric operation.",
            "A new TCP/AQM system analysis.",
            "Design adaptive task allocation scheduler to improve MapReduce performance in heterogeneous clouds.",
            "Network defense: Approaches, methods and techniques.",
            "Fault resilience in sensor networks: Distributed node-disjoint multi-path multi-sink forwarding.",
            "A Petri net-based decision-making framework for assessing cloud services adoption: The use of spot instances for cost reduction.",
            "Multiple feature points representation in target localization of wireless visual sensor networks.",
            "Constructing perimeter barrier coverage with bistatic radar sensors.",
            "Efficient data collecting and target parameter estimation in wireless sensor networks.",
            "A study on impact of wired access networks for green Internet.",
            "Critical density for coverage and connectivity in two-dimensional fixed-orientation directional sensor networks using continuum percolation.",
            "A collaborative multi-hop routing algorithm for maximum achievable rate.",
            "Spread spectrum-based coordination design for spectrum-agile wireless ad hoc networks.",
            "A Weighted Semi-Distributed Routing Algorithm for LEO satellite networks.",
            "A hybrid exact approach for maximizing lifetime in sensor networks with complete and partial coverage constraints.",
            "Forward link quality estimation in VANETs for sender-oriented alert messages broadcast.",
            "A Review on mobile application energy profiling: Taxonomy, state-of-the-art, and open research issues.",
            "Empirical models of the communications performance of Multi-hop Cellular Networks using D2D.",
            "A survey on lightweight block ciphers for low-resource devices: Comparative study and open issues.",
            "Copy limited flooding over opportunistic networks.",
            "A survey of incentive mechanisms in static and mobile P2P systems.",
            "Improvement of SCTP congestion control in the LTE-A network.",
            "Network traffic application identification based on message size analysis.",
            "BotFlex: A community-driven tool for botnet detection.",
            "DS-MAC: An energy efficient demand sleep MAC protocol with low latency for wireless sensor networks.",
            "Taxonomy of Distributed Denial of Service mitigation approaches for cloud computing.",
            "S-PMIPv6: An intra-LMA model for IPv6 mobility.",
            "Green network protocols and algorithms.",
            "Smartphone-based data collection from wireless sensor networks in an urban environment.",
            "An ant colonization routing algorithm to minimize network power consumption.",
            "An Energy-Aware Cross-Layer Cooperative MAC Protocol for Wireless Ad Hoc Networks.",
            "Energy-efficient quality of service aware forwarding scheme for Content-Centric Networking.",
            "On the trade-off between power-efficiency and blocking probability in fault-tolerant WDM networks.",
            "Green partial packet recovery in wireless sensor networks.",
            "Frame-based mapping mechanism for energy-efficient MPEG-4 video transmission over IEEE 802.11e networks with better quality of delivery.",
            "Energy evaluation of AID protocol in Mobile Ad Hoc Networks.",
            "Green vehicle traffic routing system using ant-based algorithm.",
            "EDHRP: Energy efficient event driven hybrid routing protocol for densely deployed wireless sensor networks.",
            "PARS: A scheduling of periodically active rank to optimize power efficiency for main memory."
        ]
    },
    {
        "name": "JNCA",
        "year": "2014",
        "info": "2014: Volumes\n37,\n38,\n39,\n40,\n41,\n42,\n43,\n44,\n45,\n46",
        "count": 249,
        "papers": [
            "Advances in multimedia services over emerging wireless networks.",
            "Exploiting multiple description coding for intermediate recovery in wireless mesh networks.",
            "A multi-channel architecture for IPv6-enabled wireless sensor and actuator networks featuring PnP support.",
            "Multimedia contents adaptation by modality conversion with user preference in wireless network.",
            "Peer-assisted video on-demand streaming system in practical WiFi-based mobile opportunistic networks.",
            "Agent-oriented computing for distributed systems and networks.",
            "Expanded Borel Cayley Graphs (Ex-BCGs): A novel communication topology for multi-agent systems.",
            "Self-reliant mobile code: a new direction of agent security.",
            "Domain-independent multi-agent plan repair.",
            "A new fuzzy negotiation protocol for grid resource allocation.",
            "An agent-based approach for the design and analysis of content delivery networks.",
            "A real-life application of multi-agent systems for fault diagnosis in the provision of an Internet business service.",
            "Interaction relationships of caches in agent-based HD video surveillance: Discovery and utilization.",
            "Using bio-inspired algorithms for energy levels assessment in energy efficient wired communication networks.",
            "Domatic partition in homogeneous wireless sensor networks.",
            "Data summarization for network traffic monitoring.",
            "A decentralized minislot scheduling protocol (DMSP) in TDMA-based wireless mesh networks.",
            "HOCA: Healthcare Aware Optimized Congestion Avoidance and control protocol for wireless sensor networks.",
            "Design of structure-free and energy-balanced data aggregation in wireless sensor networks.",
            "Congestion control in IPTV over PON using Digital Fountain forward error correction.",
            "Potential bargaining for resource allocation in cognitive relay transmission.",
            "Fault-tolerant routing mechanism based on network coding in wireless mesh networks.",
            "A novel cache size optimization scheme based on manifold learning in Content Centric Networking.",
            "Suitability of chaotic iterations schemes using XORshift for security applications.",
            "An ID-based approach to the caching and distribution of peer-to-peer, proxy-based video content.",
            "Distributed power optimization for spectrum-sharing femtocell networks: A fictitious game approach.",
            "Bloom filter based processing algorithms for the multi-dimensional event query in wireless sensor networks.",
            "Bandwidth-adaptive partitioning for distributed execution optimization of mobile applications.",
            "Active XML (AXML) research: Survey on the representation, system architecture, data exchange mechanism and query evaluation.",
            "VoIP: State of art for global connectivity - A critical review.",
            "A comprehensive survey on vehicular Ad Hoc network.",
            "Advanced technologies for homeland defense and security.",
            "A simulation study of ad hoc networking of UAVs with opportunistic resource utilization networks.",
            "Text analysis for detecting terrorism-related articles on the web.",
            "A botnet-based command and control approach relying on swarm intelligence.",
            "Cognitive systems and bio-inspired computing in homeland security.",
            "Detecting mobile malware threats to homeland security through static analysis.",
            "Low-cost prioritization of image blocks in wireless sensor networks for border surveillance.",
            "A trusted versioning file system for passive mobile storage devices.",
            "A semantic authorization model for pervasive healthcare.",
            "A multi-issued tag key agreement with time constraint for homeland defense sub-department in NFC environment.",
            "An improved side channel attack using event information of subtraction.",
            "Enhancement of wireless sensor network lifetime by deploying heterogeneous nodes.",
            "Balancing trajectory privacy and data utility using a personalized anonymization model.",
            "Efficient and effective realtime prediction of drive-by download attacks.",
            "An efficient algorithm for scheduling sensor data collection through multi-path routing structures.",
            "Channel assignment in multi-radio wireless mesh networks using an improved gravitational search algorithm.",
            "Synchronous contention-based MAC protocols for delay-sensitive wireless sensor networks: A review and taxonomy.",
            "A survey on intelligent routing protocols in wireless sensor networks.",
            "Automatic services instantiation based on a process specification.",
            "Fair uplink bandwidth allocation and latency guarantee for mobile WiMAX using fuzzy adaptive deficit round robin.",
            "A defense against clock skew replication attacks in wireless sensor networks.",
            "Bloom filter-based workflow management to enable QoS guarantee in wireless sensor networks.",
            "A dynamic strategy for packet scheduling and bandwidth allocation based on channel quality in IEEE 802.16e OFDMA system.",
            "A channel estimation based opportunistic scheduling scheme in wireless bidirectional networks.",
            "A robust topology control solution for the sink placement problem in WSNs.",
            "Adaptive blacklist-based packet filter with a statistic-based approach in network intrusion detection.",
            "Spatio-temporal multicast grouping for content-based routing in vehicular networks: A distributed approach.",
            "DMVL: An I/O bandwidth dynamic allocation method for virtual networks.",
            "A link-state QoS routing protocol based on link stability for Mobile Ad hoc Networks.",
            "Rate adaptation scheme for IEEE 802.11-based MANETs.",
            "ANFIS and agent based bandwidth and delay aware anycast routing in mobile ad hoc networks.",
            "KEDGEN2: A key establishment and derivation protocol for EPC Gen2 RFID systems.",
            "PileCast: Multiple bit rate live video streaming over BitTorrent.",
            "An efficient and scalable ranking technique for mashups involving RSS data sources.",
            "Simulation framework for real-time database on WSNs.",
            "Voronoi-based coverage improvement approach for wireless directional sensor networks.",
            "A self-organizing P2P framework for collective service discovery.",
            "Performance analysis of distributed mapping system in ID/locator separation architectures.",
            "Integrated system for control and monitoring industrial wireless networks for labor risk prevention.",
            "Effects of physical channel separation on application flows in a multi-radio multi-hop wireless mesh network: An experimental study on BilMesh testbed.",
            "Reliable resources brokering scheme in wireless grids based on non-cooperative bargaining game.",
            "A fuzzy k-coverage approach for RFID network planning using plant growth simulation algorithm.",
            "Designing an Anti-swindle Mahjong Leisure Prototype System using RFID and ontology theory.",
            "Contact quality based forwarding strategy for delay tolerant network.",
            "Ant colony optimization with greedy migration mechanism for node deployment in wireless sensor networks.",
            "Mobile recommender systems in tourism.",
            "Information management in vehicular ad hoc networks: A review.",
            "A survey of secure protocols in Mobile IPv6.",
            "Volunteer computing: requirements, challenges, and solutions.",
            "An energy efficient hierarchical clustering index tree for facilitating time-correlated region queries in the Internet of Things.",
            "Simple models of the content duration and the popularity of television content.",
            "Reducing view inconsistency by predicting avatars' motion in multi-server distributed virtual environments.",
            "Counteracting security attacks in virtual machines in the cloud using property based attestation.",
            "Multi-rate multicast routing in multi-gateway multi-channel multi-radio wireless mesh networks.",
            "Niched ant colony optimization with colony guides for QoS multicast routing.",
            "Community detection in social networks using hybrid merging of sub-communities.",
            "Collaborative caching priority for processing requests in MANETs.",
            "Robustness of Internet under targeted attack: A cascading failure perspective.",
            "Design and evaluation of mobile offloading system for web-centric devices.",
            "Toward efficient estimation of available bandwidth for IEEE 802.11-based wireless networks.",
            "Mobile Internet access over intermittent network connectivity.",
            "An electronic voting mechanism for fighting bribery and coercion.",
            "Metric-based taxonomy of routing protocols for cognitive radio ad hoc networks.",
            "Localization-free and energy-efficient hole bypassing techniques for fault-tolerant sensor networks.",
            "Google Drive: Forensic analysis of data remnants.",
            "Benford's law behavior of Internet traffic.",
            "Optimization on content service with local search in cloud of clouds.",
            "Evaluating the benefit of the core-edge separation on intradomain traffic engineering under uncertain traffic demand.",
            "Energy-delay tradeoff analysis of user state transition mechanism for mobile web services.",
            "Push or pull? Toward optimal content delivery using cloud storage.",
            "Performance analysis of quantization-based approximation algorithms for precomputing the supported QoS.",
            "A formal framework for modelling complex network management systems.",
            "Energy-aware routing for biomedical wireless sensor networks.",
            "JDER: A history-based forwarding scheme for delay tolerant networks using Jaccard distance and encountered ration.",
            "A transform domain-based anomaly detection approach to network-wide traffic.",
            "Network attacks: Taxonomy, tools and systems.",
            "A survey on vehicular cloud computing.",
            "Rich Mobile Applications: Genesis, taxonomy, and open issues.",
            "Vehicular communication ad hoc routing protocols: A survey.",
            "A distributed aggregation and fast fractal clustering approach for SOAP traffic.",
            "A new connection degree calculation and measurement method for large scale network monitoring.",
            "Unmanned aerial vehicle-aided communications system for disaster recovery.",
            "An ultralightweight RFID authentication protocol with CRC and permutation.",
            "Incentive mechanism for P2P file sharing based on social network and game theory.",
            "Mobile application to provide personalized sightseeing tours.",
            "Experience applying language processing techniques to develop educational software that allow active learning methodologies by advising students.",
            "Fast dynamic clustering SOAP messages based compression and aggregation model for enhanced performance of Web services.",
            "A novel enhancement of TCP for on-board IP networks with wireless cellular connectivity.",
            "Adaptive energy-efficient scheduling algorithm for parallel tasks on homogeneous clusters.",
            "Probe-based end-to-end overload control for networks of SIP servers.",
            "Real time enhanced random sampling of online social networks.",
            "Accurate positioning using long range active RFID technology to assist visually impaired people.",
            "Network resource management in support of QoS in ubiquitous learning.",
            "Dynamic spectrum access with packet size adaptation and residual energy balancing for energy-constrained cognitive radio sensor networks.",
            "Probabilistic location-free addressing in wireless networks.",
            "Randomized Anagram revisited.",
            "Randomness testing of non-cryptographic hash functions for real-time hash table based storage and look-up of URLs.",
            "Adaptive deployment and configuration for mobile augmented reality in the cloudlet.",
            "Bounds on end-to-end statistical delay and jitter in multiple multicast coded packet networks.",
            "Network latency hiding in thin client systems through server-centric speculative display updating.",
            "SENSE: A collaborative selfish node detection and incentive mechanism for opportunistic networks.",
            "Cloud voice service as over-the-top solution for seamless voice call continuity in a heterogeneous network environment.",
            "Update schedules for improving consistency in multi-server distributed virtual environments.",
            "A comparative simulation study of TCP/AQM systems for evaluating the potential of neuron-based AQM schemes.",
            "Energy and trust aware mobile agent migration protocol for data aggregation in wireless sensor networks.",
            "A GreedyZero algorithm to minimise the conflicts in an Optical Multistage Interconnection Network.",
            "Performance assessment of multiobjective approaches in optical Traffic Grooming.",
            "An analytical study of distributed mobility management schemes with a flow duration based model.",
            "Space4time: Optimization latency-sensitive content service in cloud.",
            "A new high-performance TCP friendly congestion control over wireless networks.",
            "Joint power control and spectrum access in cognitive radio networks.",
            "Resource discovery mechanisms in grid systems: A survey.",
            "A survey of protocols for Intermittently Connected Delay-Tolerant Wireless Sensor Networks.",
            "Resource management for Infrastructure as a Service (IaaS) in cloud computing: A survey.",
            "Effectiveness of a replica mechanism to improve availability with Arrangement Graph-Based Overlay.",
            "TOSSIM and distributed binary consensus algorithm in wireless sensor networks.",
            "A survey on access technologies for broadband optical and wireless networks.",
            "Information theoretic feature space slicing for statistical anomaly detection.",
            "A meticulous study of various medium access control protocols for wireless sensor networks.",
            "Ambient noise in wireless mesh networks: Evaluation and proposal of an adaptive algorithm to mitigate link removal.",
            "Routing protocol design for secure WSN: Review and open research issues.",
            "An efficient caching algorithm for peer-to-peer 3D streaming in distributed virtual environments.",
            "A simple active queue management based on the prediction of the packet arrival rate.",
            "Label switched protocol routing with guaranteed bandwidth and end to end path delay in MPLS networks.",
            "Constructing credential-based E-voting systems from offline E-coin protocols.",
            "Human mobility in opportunistic networks: Characteristics, models and prediction methods.",
            "Lightweight decentralized multicast-unicast key management method in wireless IPv6 networks.",
            "The impacts of mobility models on DV-hop based localization in Mobile Wireless Sensor Networks.",
            "In-cluster vector evaluated particle swarm optimization for distributed regression in WSNs.",
            "Dynamic Clustering Protocol for coordinated tethering over cellular networks.",
            "Co-FAIS: Cooperative fuzzy artificial immune system for detecting intrusion in wireless sensor networks.",
            "Internet of things: Smart things network and communication.",
            "A survey on trust management for Internet of Things.",
            "RFID seeking: Finding a lost tag rather than only detecting its missing.",
            "Cooperative artificial bee colony algorithm for multi-objective RFID network planning.",
            "Optimization of the logical topology for mobile MEMS networks.",
            "Vitruvius: An expert system for vehicle sensor tracking and managing application generation.",
            "Heterogeneous-belief based incentive schemes for crowd sensing in mobile social networks.",
            "Predicting the content dissemination trends by repost behavior modeling in mobile social networks.",
            "Primary radio user activity models for cognitive radio networks: A survey.",
            "Network selection and resource allocation for multicast in HetNets.",
            "Energy Aware Two Disjoint Paths Routing.",
            "Generating temporal semantic context of concepts using web search engines.",
            "Detecting spamming activities in a campus network using incremental learning.",
            "Comparative study of high-speed Linux TCP variants over high-BDP networks.",
            "Accurate acoustic energy-based localization with beacon position uncertainty in wireless sensor networks.",
            "A review on interworking and mobility techniques for seamless connectivity in mobile cloud computing.",
            "Middleware proposals for mobile ad hoc networks.",
            "A review on remote data auditing in single cloud server: Taxonomy and open issues.",
            "Leveraging client-side storage techniques for enhanced use of multiple consumer cloud storage services on resource-constrained mobile devices.",
            "Cross-layer congestion control model for urban vehicular environments.",
            "A novel scheduling approach to concurrent multipath transmission of high definition video in overlay networks.",
            "A context and application-aware framework for resource management in dynamic collaborative wireless M2M networks.",
            "On demand-driven movement strategy for moving beacons in sensor localization.",
            "Precise relative clock synchronization for distributed control using TSC registers.",
            "Server implementations for improving the performance of CAR systems based on mobile phones.",
            "Data mining in mobile ECG based biometric identification.",
            "Delivery ratio- and buffered time-constrained: Multicasting for Delay Tolerant Networks.",
            "Calibrating parameters and formulas for process-level energy consumption profiling in smartphones.",
            "A block-aware hybrid data dissemination with hotspot elimination in wireless sensor network.",
            "Semantic web services: Standards, applications, challenges and solutions.",
            "Achieving optimal admission control with dynamic scheduling in energy constrained network systems.",
            "TRADER: A reliable transmission scheme to video conferencing applications over the internet.",
            "Scalable nearest neighbor query processing based on Inverted Grid Index.",
            "Garbled Routing (GR): A generic framework towards unification of anonymous communication systems.",
            "Using Dead Ants to improve the robustness and adaptability of AntNet routing algorithm.",
            "Learning automata-based multi-constrained fault-tolerance approach for effective energy management in smart grid communication network.",
            "A sensor based indoor localization through fingerprinting.",
            "Efficient content delivery scheme for layered video streaming in large-scale networks.",
            "An apropos signal report and adaptive period (ASAP) scheme for fast handover in the fourth-generation wireless networks.",
            "The optimal joint sequence design in the feedback-based two-stage switch.",
            "On modeling and optimization for composite network-Cloud service provisioning.",
            "Multicasting in cognitive radio networks: Algorithms, techniques and protocols.",
            "Congestion control for high-speed wired network: A systematic literature review.",
            "Clustering algorithms for Cognitive Radio networks: A survey.",
            "Bidirectional data verification for cloud storage.",
            "SLA-based virtual machine management for heterogeneous workloads in a cloud datacenter.",
            "Secure and efficient random functions with variable-length output.",
            "Cloud service selection: State-of-the-art and future research directions.",
            "ANTALG: An Innovative ACO based Routing Algorithm for MANETs.",
            "Adaptive failure detection in low power lossy wireless sensor networks.",
            "Distributed FPGA-based architecture to support indoor localisation and orientation services.",
            "Conditional clustered matrix factorization based network coordinate system.",
            "LIANA: Live incremental time synchronization of traces for distributed systems analysis.",
            "A survey of collaborative services and security-related issues in modern wireless Ad-Hoc communications.",
            "A comprehensive view of Hadoop research - A systematic literature review.",
            "Heuristic methods to maximize network lifetime in directional sensor networks with adjustable sensing ranges.",
            "Sensor selection for tracking multiple groups of targets.",
            "Communication performances of IEEE 802.15.4 wireless sensor motes for data-intensive applications: A comparison of WaspMote, Arduino MEGA, TelosB, MicaZ and iMote2 for image surveillance.",
            "PHAODV: Power aware heterogeneous routing protocol for MANETs.",
            "Multi-granularity resource virtualization and sharing strategies in cloud manufacturing.",
            "Transport layer performance analysis and optimization for smart metering infrastructure.",
            "A new Lagrange solution to the privacy-preserving general geometric intersection problem.",
            "eHealth: Survey on research projects, comparative study of telemonitoring architectures and main issues.",
            "Efficient broadcasting in slow fading wireless ad-hoc networks.",
            "An RDF-based P2P overlay network supporting range and wildcard queries.",
            "Dynamic adjustment of sensing range for event coverage in wireless sensor networks.",
            "A decentralized approach for information dissemination in Vehicular Ad hoc Networks.",
            "A survey on network coding: From traditional wireless networks to emerging cognitive radio networks.",
            "Optimal deployment in randomly deployed heterogeneous WSNs: A connected coverage approach.",
            "Clustering in sensor networks: A literature survey.",
            "A network-aware framework for energy-efficient data acquisition in wireless sensor networks.",
            "OASys: An opportunistic and agile system to detect free on-street parking using intelligent boards embedded in surveillance cameras.",
            "Special issue on \"quality of service in wireless and mobile networking\".",
            "Low latency scheduling for convergecast in ZigBee tree-based wireless sensor networks.",
            "LA-EEHSC: Learning automata-based energy efficient heterogeneous selective clustering for wireless sensor networks.",
            "Distributed joint resource and power allocation in self-organized femtocell networks: A potential game approach.",
            "Reliable multi-channel scheduling for timely dissemination of aggregated data in wireless sensor networks.",
            "Performance analysis and enhancement for a cooperative wireless diversity network with spatially random mobile helpers.",
            "Credibility-based cloud media resource allocation algorithm.",
            "An enhanced fast handover with seamless mobility support for next-generation wireless networks.",
            "Cross-layer QoE-driven admission control and resource allocation for adaptive multimedia services in LTE.",
            "A novel resource allocation scheme for LTE network in the presence of mobility.",
            "Investigation and performance analysis of MAC protocols for WBAN networks.",
            "Epidemiological approach for data survivability in unattended wireless sensor networks.",
            "EAF: Energy-aware adaptive free viewpoint video wireless transmission.",
            "How MIMO cross-layer design enables QoS while detecting non-cooperative nodes in wireless multi-hop networks.",
            "Delay minimization by exploring full-duplex capacity and relay-based cooperative scheduling in WLANs."
        ]
    },
    {
        "name": "JNCA",
        "year": "2013",
        "info": "Volume 36: 2013",
        "count": 156,
        "papers": [
            "Wireless sensor networks for rehabilitation applications: Challenges and opportunities.",
            "Intrusion detection system: A comprehensive review.",
            "An intrusion detection and prevention system in cloud computing: A systematic review.",
            "A survey of intrusion detection techniques in Cloud.",
            "A survey on interference management techniques in femtocell self-organizing networks.",
            "Seamless handover integrated solution for video transmission over proxy mobile IPv6 in a micro mobility domain.",
            "A gradient based routing scheme for street lighting wireless sensor networks.",
            "Relay technologies and technical issues in IEEE 802.16j Mobile Multi-hop Relay (MMR) networks.",
            "Mobile guides: Taxonomy of architectures, context awareness, technologies and applications.",
            "An initiative for a classified bibliography on TCP/IP congestion control.",
            "Wireless Sensor Network transport protocol: A critical review.",
            "A SIP servlets-based framework for service provisioning in stand-alone MANETs.",
            "Low latency and energy efficient routing tree for wireless sensor networks with multiple mobile sinks.",
            "MDiag: Mobility-assisted diagnosis for wireless sensor networks.",
            "Towards secure and communication-efficient broadcast encryption systems.",
            "An efficient single-iteration single-bit request scheduling algorithm for input-queued switches.",
            "Handling large-scale node failures in mobile sensor/robot networks.",
            "Multi-manifold model of the Internet delay space.",
            "Towards a predictive cache replacement strategy for multimedia content.",
            "Multi-target indoor localization and tracking on video monitoring system in a wireless sensor network.",
            "A framework for preservation of cloud users' data privacy using dynamic reconstruction of metadata.",
            "An applications perspective into the Future Internet.",
            "Development and performance evaluation of a new RSS tool for a Web-based system: RSS_PROYECT.",
            "Sensing task assignment via sensor selection for maximum target coverage in WSNs.",
            "RETENTION: A reactive trust-based mechanism to detect and punish malicious nodes in ad hoc grid environments.",
            "A secure and efficient batch binding update scheme for route optimization of nested NEtwork MObility (NEMO) in VANETs.",
            "Benefits of using parallelized non-progressive network coding.",
            "DLS: A dynamic local stitching mechanism to rectify transmitting path fragments in wireless sensor networks.",
            "A temporal-credential-based mutual authentication and key agreement scheme for wireless sensor networks.",
            "A multi-tier phishing detection and filtering approach.",
            "Software-based serverless endpoint video combiner architecture for high-definition multiparty video conferencing.",
            "Available bandwidth estimation for the network paths with multiple tight links and bursty traffic.",
            "Quantifying connectivity in wireless sensor networks with grid-based deployments.",
            "Practical Internet voting system.",
            "Replica-aided load balancing in overlay networks.",
            "Cloning mechanisms to improve agent performances.",
            "Visual sensor network lifetime maximization by prioritized scheduling of nodes.",
            "Survivable power efficiency oriented integrated grooming in green networks.",
            "A new cloud computing architecture for music composition.",
            "Energy consumption bounds analysis and its applications for grid based wireless sensor networks.",
            "Performance of IP-forwarding of Linux hosts with multiple network interfaces.",
            "On the peak-to-average power ratio reduction in mobile WiMAX: A discrete cosine transform matrix precoding based random-interleaved orthogonal frequency division multiple access uplink system.",
            "A provision aware proportional fair sharing three colour marker.",
            "COINS: COalitions and INcentiveS for effective Peer-to-Peer downloads.",
            "An novel three-party authenticated key exchange protocol using one-time key.",
            "Swarm optimisation algorithms applied to large balanced communication networks.",
            "Opportunistic medium access control for maximizing packet delivery rate in dynamic access networks.",
            "A personalized e-course composition based on a genetic algorithm with forcing legality in an adaptive learning system.",
            "Market_based grid resource allocation using new negotiation model.",
            "A survey of network flow applications.",
            "Securing DSR against wormhole attacks in multirate ad hoc networks.",
            "A survey and tutorial of wireless relay network protocols based on network coding.",
            "Dynamic key management in wireless sensor networks: A survey.",
            "A systematic review on clustering and routing techniques based upon LEACH protocol for wireless sensor networks.",
            "Classification of malware based on integrated static and dynamic features.",
            "Fast and deterministic hash table lookup using discriminative bloom filters.",
            "Dynamic ARF for throughput improvement in 802.11 WLAN via a machine-learning approach.",
            "Windows Mobile LiveSD Forensics.",
            "Position-based routing in vehicular networks: A survey.",
            "Topology forming and optimization framework for heterogeneous wireless back-haul networks supporting unidirectional technologies.",
            "Combination of data replication and scheduling algorithm for improving data availability in Data Grids.",
            "Modelling and performance study of finite-buffered blocking multistage interconnection networks supporting natively 2-class priority routing traffic.",
            "TSOIA: An efficient node selection algorithm facing the uncertain process for Internet of Things.",
            "A multipath routing strategy to prevent flooding disruption attacks in link state routing protocols for MANETs.",
            "Intelligent multi-sensor control system based on innovative technology integration via ZigBee and Wi-Fi networks.",
            "Re-examining the performance bottleneck in a NIDS with detailed profiling.",
            "Quantitative survivability evaluation of three virtual machine-based server architectures.",
            "A novel model for user clicks identification based on hidden semi-Markov.",
            "Research on social relations cognitive model of mobile nodes in Internet of Things.",
            "A virtual square grid-based coverage algorithm of redundant node for wireless sensor network.",
            "Virtual machine power measuring technique with bounded error in cloud environments.",
            "Discovering fuzzy association rule patterns and increasing sensitivity analysis of XML-related attacks.",
            "An efficient joint channel assignment and QoS routing protocol for IEEE 802.11 multi-radio multi-channel wireless mesh networks.",
            "On the use of a full information feedback to stabilize RED.",
            "Evaluating opportunistic networks in disaster scenarios.",
            "AGRIB-BHF: A sustainable and fault tolerant aggregation.",
            "A qualitative comparison evaluation of the greedy forwarding strategies in Mobile Ad Hoc Network.",
            "A power laws-based reconstruction approach to end-to-end network traffic.",
            "A hybrid approach to minimize state space explosion problem for the solution of two stage tandem queues.",
            "New identity-based three-party authenticated key agreement protocol with provable security.",
            "A comprehensive survey on scheduler for VoIP over WLAN.",
            "A novel solution to the energy hole problem in sensor networks.",
            "Guest Editorial on Vehicular Networking Protocols.",
            "Applicability of position-based routing for VANET in highways and urban environment.",
            "Structure-free message aggregation and routing in traffic information system (SMART).",
            "Bee life-based multi constraints multicast routing optimization for vehicular ad hoc networks.",
            "Design and evaluation of a fast MAC layer handoff management scheme for WiFi-based multichannel Vehicular Mesh Networks.",
            "Network coding-based cooperative ARQ scheme for VANETs.",
            "Power management in SMAC-based energy-harvesting wireless sensor networks using queuing analysis.",
            "Performance improvement of QO-STBC over time-selective channel for wireless network.",
            "Group-based protocol and mobility model for VANETs to offer internet access.",
            "Efficient route optimization scheme for nested-NEMO.",
            "Mobility analysis in vehicular ad hoc network (VANET).",
            "Protection based on backup radios and backup fibers for survivable Fiber-Wireless (FiWi) access network.",
            "Position-based automatic reverse engineering of network protocols.",
            "Using mobile node speed changes for movement direction change prediction in a realistic category of mobility models.",
            "Importance sampling for Jackson networks with customer impatience until the end of service.",
            "Model-driven approach supporting formal verification for web service composition protocols.",
            "A dual-direction technique for fast file downloads with dynamic load balancing in the Cloud.",
            "Social-connectivity-aware vertical handover for heterogeneous wireless networks.",
            "Self adaptive routing for dynamic spectrum access in cognitive radio networks.",
            "A high performance link layer mobility management strategy for professional private broadband networks.",
            "Can: A context-aware NAT traversal scheme.",
            "Fault tolerance in wireless sensor network using hand-off and dynamic power adjustment approach.",
            "Distributed topology control algorithm on broadcasting in wireless sensor network.",
            "A Pareto-based hybrid multiobjective evolutionary approach for constrained multipath traffic engineering optimization in MPLS/GMPLS networks.",
            "Booting, browsing and streaming time profiling, and bottleneck analysis on android-based systems.",
            "SRA-MSDU: Enhanced A-MSDU frame aggregation with selective retransmission in 802.11n wireless networks.",
            "Portable wireless-networking protocol evaluation.",
            "Analysis of Secure LEACH-Based Clustering Protocols in Wireless Sensor Networks.",
            "Adaptive policy framework: A systematic review.",
            "Guest editorial on vehicular communications and applications.",
            "Augmenting Vehicle-to-Roadside connectivity in multi-channel vehicular Ad Hoc Networks.",
            "The insights of message delivery delay in VANETs with a bidirectional traffic model.",
            "Traffic congestion detection in large-scale scenarios using vehicle-to-vehicle communications.",
            "CATS: An adaptive traffic signal system based on car-to-car communication.",
            "Research on adaptive target tracking in vehicle sensor networks.",
            "Performance evaluation of user applications in the ITS scenario: An analytical assessment of the NeMHIP.",
            "COACH: COllaborative certificate stAtus CHecking mechanism for VANETs.",
            "Privacy preserving broadcast message authentication protocol for VANETs.",
            "An enhanced smart card based remote user password authentication scheme.",
            "Constructing rings overlay for robust data collection in wireless sensor networks.",
            "Propagation modeling of active P2P worms based on ternary matrix.",
            "Dynamic Prediction based Multi Queue (DPMQ) drop policy for probabilistic routing protocols of delay tolerant network.",
            "Collaboration technologies and applications.",
            "Automated context dissemination for autonomic collaborative networks through semantic subscription filter generation.",
            "Research on an active knowledge push service based on collaborative intent capture.",
            "A distributed collaborative product design environment based on semantic norm model and role-based access control.",
            "Intelligent patent recommendation system for innovative design collaboration.",
            "Discovering collaborative knowledge-intensive processes through e-mail mining.",
            "An end-user approach to business process modeling.",
            "Integration, optimization and usability of enterprise applications.",
            "Modeling and performance analysis of product development process network.",
            "Collaborative design and analysis of supply chain network management key processes model.",
            "A group Undo/Redo method in 3D collaborative modeling systems with performance evaluation.",
            "A collisions evaluation method in virtual environment for collaborativeassembly.",
            "Opportunistic IoT: Exploring the harmonious interaction between human and the internet of things.",
            "A new approach for predicting and collaborative evaluating the cutting force in face milling based on gene expression programming.",
            "A model-driven and task-oriented method for the development of collaborative systems.",
            "Collaborative learning in multi-user virtual environments.",
            "Collaboration computing technologies and applications.",
            "VNET6: IPv6 virtual network for the collaboration between applications and networks.",
            "Investigation on uplink collaborative contention-based bandwidth request for WiMAX three hop relay networks.",
            "Cooperative pseudonym change scheme based on the number of neighbors in VANETs.",
            "Analyzing locality over a P2P computing architecture.",
            "Cooperative scheduling mechanism for large-scale peer-to-peer computing systems.",
            "An efficient and secure approach for a cloud collaborative editing.",
            "Div-clustering: Exploring active users for social collaborative recommendation.",
            "Discovering associations between news and contents in social network sites with the D-Miner service framework.",
            "A novel sequential watermark detection model for efficient traceback of secret network attack flows.",
            "A network accountability based verification mechanism for detecting inter-domain routing path inconsistency.",
            "An agent-based hybrid service delivery for coordinating internet of things and 3rd party service providers.",
            "Resource virtualization and service selection in cloud logistics.",
            "Zero-Degree algorithm for Internet GateWay placement in backbone wireless mesh networks.",
            "Virtual network mapping algorithm in the cloud infrastructure.",
            "A novel paths algebra-based strategy to flexibly solve the link mapping stage of VNE problems."
        ]
    },
    {
        "name": "JNCA",
        "year": "2012",
        "info": "Volume 35: 2012",
        "count": 181,
        "papers": [
            "Collaborative computing and applications.",
            "Social interaction regulation in virtual web environments using the Social Theatres model.",
            "An overlay multicast protocol for live streaming and delay-guaranteed interactive media.",
            "An agent-assisted QoS-based routing algorithm for wireless sensor networks.",
            "Practical data compression in wireless sensor networks: A survey.",
            "An interval centroid based spread spectrum watermarking scheme for multi-flow traceback.",
            "Winnowing: Protecting P2P systems against pollution through cooperative index filtering.",
            "Proactive replication for rare objects in unstructured peer-to-peer networks.",
            "A model-driven workflow fragmentation framework for collaborative workflow architectures and systems.",
            "Creating shared design thinking process for collaborative design.",
            "Frame-based ontological view for semantic integration.",
            "Ontology-based interoperation model of collaborative product development.",
            "High level MANET protocol: Enhancing the communication support for mobile collaborative work.",
            "Scheduling mobile collaborating workforce for multiple urgent events.",
            "Distributed constraint optimization with MULBS: A case study on collaborative meeting scheduling.",
            "Discovering the campus together: A mobile and computer-based learning experience.",
            "Taking advantage of collective knowledge in emergency response systems.",
            "A framework for awareness maintenance.",
            "Service-oriented middleware: A survey.",
            "Review of multicast routing mechanisms in mobile ad hoc networks.",
            "Packet-level traffic analysis of online games from the genre characteristics perspective.",
            "Reinforcement learning for context awareness and intelligence in wireless networks: Review, new features and open issues.",
            "Certification-based trust models in mobile ad hoc networks: A survey and taxonomy.",
            "Performance estimation of banyan semi layer networks with drop resolution mechanism.",
            "Mobility management for IP-based next generation mobile networks: Review, challenge and perspective.",
            "Adaptive load balancing algorithm for multiple homing mobile nodes.",
            "Beyond network simulators: Fostering novel distributed applications and protocols through extendible design.",
            "Identity-based online/offline signcryption for low power devices.",
            "A utility-based algorithm for joint uplink/downlink scheduling in wireless cellular networks.",
            "IPv6 based relay gateway protocol in hybrid networks.",
            "Redundancy-aware SOAP messages compression and aggregation for enhanced performance.",
            "NeuralSens: A neural network based framework to allow dynamic adaptation in wireless sensor and actor networks.",
            "MSDP with ACO: A maximal SRLG disjoint routing algorithm based on ant colony optimization.",
            "A middleware architecture for disseminating delay-constrained information in wireless sensor networks.",
            "A hybrid policy for fault tolerant load balancing in grid computing environments.",
            "Program Ultra-Dispatcher for launching applications in a customization manner on cloud computing.",
            "Hash caching mechanism in source-based routing for wireless ad hoc networks.",
            "An FEC scheme combined with weighted scheduling to reduce multicast packet loss in IPTV over PON.",
            "Routing with multiple quality-of-services constraints: An approximation perspective.",
            "Extracting trust information from security system of a service.",
            "A framework for avoiding steganography usage over HTTP.",
            "Load-balanced three-stage switch.",
            "MIMO two-way relay channel with superposition coding and imperfect channel estimation.",
            "In memory of Mieso Denko.",
            "Cognitive maritime wireless mesh/ad hoc networks.",
            "A testbed for coverage control using mixed wireless sensor networks.",
            "A wireless mesh sensing network for early warning.",
            "Post-processing in wireless sensor networks: Benchmarking sensor trace files for in-network data aggregation.",
            "Knowledge-Aware and Service-Oriented Middleware for deploying pervasive services.",
            "Similarity search in sensor networks using semantic-based caching.",
            "An overview of the Internet of Things for people with disabilities.",
            "A1: An energy efficient topology control algorithm for connected area coverage in wireless sensor networks.",
            "A comparison of wavelength reservation protocols for WDM optical networks.",
            "A survey on coverage and connectivity issues in wireless sensor networks.",
            "OSIA: Out-of-order Scheduling for In-order Arriving in concurrent multi-path transfer.",
            "A scatternet formation algorithm for Bluetooth networks with a non-uniform distribution of devices.",
            "Throughput and delay scaling laws for mobile overlaid wireless networks.",
            "CORM: A reference model for future computer networks.",
            "Stochastic traffic engineering for real-time applications over wireless networks.",
            "Using fuzzy logic applied to software metrics and test cases to assess programming assignments and give advice.",
            "Coordination of cooperation policies in a peer-to-peer system using swarm-based RL.",
            "Topology aware feedback transmission for real-time control protocol.",
            "MR-BART: Multi-Rate Available Bandwidth Estimation in Real-Time.",
            "Accumulating error-free frame blocks to improve throughput for IEEE 802.11-based WLAN.",
            "An efficient and robust content delivery solution for IEEE 802.11p vehicular environments.",
            "An efficient and security dynamic identity based authentication protocol for multi-server architecture using smart cards.",
            "Social feature-based enterprise email classification without examining email contents.",
            "A medium access control protocol that supports a seamless handover in wireless sensor networks.",
            "A novel architecture for Web service composition.",
            "Using data envelopment analysis to evaluate the efficiency of web caching object replacement strategies.",
            "A power-saving data storage scheme for wireless sensor networks.",
            "Privacy-friendly synchronized ultralightweight authentication protocols in the storm.",
            "Localized motion-based connectivity restoration algorithms for wireless sensor and actor networks.",
            "CARED: Cautious Adaptive RED gateways for TCP/IP networks.",
            "Special issue on trusted computing and communications.",
            "Trust mechanisms in wireless sensor networks: Attack analysis and countermeasures.",
            "Reputation rating modeling for open environment lack of communication by using online social cognition.",
            "A standards-based interoperable single sign-on framework in ARC Grid middleware.",
            "Public key distribution scheme for delay tolerant networks based on two-channel cryptography.",
            "SONR: A reliable reputation system of self-organized network.",
            "Secure and privacy preserving keyword searching for cloud storage services.",
            "TRIP, a trust and reputation infrastructure-based proposal for vehicular ad hoc networks.",
            "On-demand multicast routing protocol with efficient route discovery.",
            "An incentive mechanism to reinforce truthful reports in reputation systems.",
            "Flexible service selection with user-specific QoS support in service-oriented architecture.",
            "Security model oriented attestation on dynamically reconfigurable component-based systems.",
            "Achieving reliable system performance by fast recovery of branch miss prediction.",
            "Generating regular expression signatures for network traffic classification in trusted network management.",
            "Modeling and analysis of trust management with trust chain optimization in mobile ad hoc networks.",
            "Real-time data management on wireless sensor networks: A survey.",
            "Detecting node replication attacks in wireless sensor networks: A survey.",
            "Free Search with Adaptive Differential Evolution Exploitation and Quantum-Inspired Exploration.",
            "A peer-to-peer collaboration framework for multi-sensor data fusion.",
            "An efficient continuous tracking system in real-time surveillance application.",
            "Neighbor supported reliable multipath multicast routing in MANETs.",
            "A model-driven development method for collaborative modeling tools.",
            "Comparison of recovery schemes to maximize restorable throughput in multicast networks.",
            "Hiding co-occurring prioritized sensitive patterns over distributed progressive sequential data streams.",
            "Fighting against packet dropping misbehavior in multi-hop wireless ad hoc networks.",
            "Mobile telemedicine for moving vehicle scenarios: Wireless technology options and challenges.",
            "Multi-agent systems for protecting critical infrastructures: A survey.",
            "Performance improvements for network-wide broadcast with instantaneous network information.",
            "Intelligent algorithms for data-centric sensor networks.",
            "VIBE: An energy efficient routing protocol for dense and mobile sensor networks.",
            "Data transformation and query management in personal health sensor networks.",
            "The Future Internet convergence of IMS and ubiquitous smart environments: An IMS-based solution for energy efficiency.",
            "Edge betweenness centrality: A novel algorithm for QoS-based topology control over wireless sensor networks.",
            "W-Grid: A scalable and efficient self-organizing infrastructure for multi-dimensional data management, querying and routing in wireless data-centric sensor networks.",
            "Dynamic ID-based remote user password authentication schemes using smart cards: A review.",
            "Security threats and solutions in MANETs: A case study using AODV and SAODV.",
            "Eventual strong consensus with fault detection in the presence of dual failure mode on processors under dynamic networks.",
            "Using a dynamic backbone for efficient data delivery in solar-powered WSNs.",
            "M-Dimension: Multi-characteristics based routing protocol in human associated delay-tolerant networks with improved performance over one dimensional classic models.",
            "A dynamic replica management strategy in data grid.",
            "Rigorous development of composite grid services.",
            "Performance evaluation of network lifetime spatial-temporal distribution for WSN routing protocols.",
            "On-demand channel reservation scheme for common traffic in wireless mesh networks.",
            "Software-defined GPS receiver on USRP-platform.",
            "M2I2tswTCM: A new efficient optimization marker algorithm to improve fairness bandwidth in DiffServ networks.",
            "Privacy enhanced data outsourcing in the cloud.",
            "Corrigendum to \"Hiding co-occurring prioritized sensitive patterns over distributed progressive sequential data streams\" [J. Network Comput. Appl. 35 (3) (2012) 1116-1129].",
            "Special issue on service delivery management in broadband networks.",
            "A cross layer architecture for multicast and unicast video transmission in mobile broadband networks.",
            "A self-adapting connection admission control solution for mobile WiMAX: Enabling dynamic switching of admission control algorithms based on predominant network usage profiles.",
            "Unified architecture for network measurement: The case of available bandwidth.",
            "Delays in a series of queues with correlated service times.",
            "Performance evaluation of an efficient fault tolerant service discovery protocol for vehicular networks.",
            "Exploiting a meeting channel to interconnect mobile robots.",
            "Enhancing meta-portals using dynamic user context personalization techniques.",
            "Evaluation of MANEMO route optimization schemes.",
            "A survey on solutions and main free tools for privacy enhancing Web communications.",
            "A survey and taxonomy of name systems in mobile ad hoc networks.",
            "Classical and swarm intelligence based routing protocols for wireless sensor networks: A survey and comparison.",
            "Reliable spatial window aggregation query processing algorithm in wireless sensor networks.",
            "Systematic selection of cluster heads for data collection.",
            "Real-time GPS track simplification algorithm for outdoor navigation of visually impaired.",
            "Modeling and analysis of multi-channel P2P VoD systems.",
            "Transaction-based authentication and key agreement protocol for inter-domain VoIP.",
            "Distributed patching for mobile wireless sensor networks.",
            "An on-demand routing protocol for improving channel use efficiency in multichannel ad hoc networks.",
            "A weight-value algorithm for finding connected dominating sets in a MANET.",
            "Automatic fine-grained area detection for thin client systems.",
            "Mobility prediction in mobile wireless networks.",
            "A dynamic password-based user authentication scheme for hierarchical wireless sensor networks.",
            "Performance comparison of end-to-end mobility management protocols for TCP.",
            "Bandwidth aggregation in heterogeneous wireless networks: A survey of current approaches and issues.",
            "Cognitive radio network security: A survey.",
            "Energy-aware performance analysis methodologies for HPC architectures - An exploratory study.",
            "Broadcasting based on dominated connecting sets with MPR in a realistic environment for WSNs & ad hoc.",
            "Power-saving mechanisms for energy efficient IEEE 802.16e/m.",
            "Using incremental subspace and contour template for object tracking.",
            "Optimized query-driven appointment routing based on Expectation-Maximization in wireless sensor networks.",
            "Traffic management strategy for delay-tolerant networks.",
            "Multiagent driven dynamic clustering of vehicles in VANETs.",
            "Inference of network anomaly propagation using spatio-temporal correlation.",
            "Efficient autonomous signature exchange on ubiquitous networks.",
            "Kernel-based particle filtering for indoor tracking in WLANs.",
            "HPM: A novel hierarchical Peer-to-Peer model for lookup acceleration with provision of physical proximity.",
            "A combined approach to ensure data security in cloud computing.",
            "A lightweight conditional privacy-preserving authentication and access control scheme for pervasive computing environments.",
            "An optimized approach for storing and accessing small files on cloud storage.",
            "Deep packet inspection tools and techniques in commodity platforms: Challenges and trends.",
            "An overview of the internet of underwater things.",
            "VEACON: A Vehicular Accident Ontology designed to improve safety on the roads.",
            "Termite-hill: Performance optimized swarm intelligence based routing algorithm for wireless sensor networks.",
            "Real time query propagation strategies with Lightweight Coordination Calculus (LCC) for ad hoc networks of geospatial databases.",
            "A flexible building management framework based on wireless sensor and actuator networks.",
            "Topology control algorithm for underwater wireless sensor networks using GPS-free mobile sensor nodes.",
            "Ant colony algorithms in MANETs: A review.",
            "An aggregate marker for bandwidth fairness in DiffServ.",
            "A systematic method for network topology reconfiguration with limited link additions.",
            "A hierarchical overlay with cluster-based reputation tree for dynamic peer-to-peer systems.",
            "An autonomic bio-inspired algorithm for wireless sensor network self-organization and efficient routing.",
            "Content-aware rate allocation for efficient video streaming via dynamic network utility maximization.",
            "A distributed resource discovery algorithm for P2P grids.",
            "An ontology-based semantic service for cooperative urban equipments.",
            "Link stability estimation based on link connectivity changes in mobile ad-hoc networks.",
            "PUF-enhanced offline RFID security and privacy.",
            "Performance evaluation of selective and adaptive heads clustering algorithms over wireless sensor networks.",
            "A structural approach for modelling the hierarchical dynamic process of Web workload in a large-scale campus network.",
            "A best block exploring algorithm for two-dimensional downlink burst construction in IEEE 802.16 networks."
        ]
    },
    {
        "name": "JNCA",
        "year": "2011",
        "info": "Volume 34: 2011",
        "count": 185,
        "papers": [
            "A survey on security issues in service delivery models of cloud computing.",
            "Efficient vehicle ownership identification scheme based on triple-trapdoor chameleon hash function.",
            "Coordinated session-based admission control with statistical learning for multi-tier internet applications.",
            "Capacity and interference aware link scheduling with channel assignment in wireless mesh networks.",
            "A game theoretic trust model for on-line distributed evolution of cooperation inMANETs.",
            "A lightweight adaptive compression scheme for energy-efficient mobile-to-mobile file sharing applications.",
            "Capacity assignment in multiservice packet networks with soft maximum waiting time guarantees.",
            "Cryptanalysis and improvement of a biometrics-based remote user authentication scheme using smart cards.",
            "A mutual-healing key distribution scheme in wireless sensor networks.",
            "A dynamic management scheme for DVEs.",
            "An efficient skyline framework for matchmaking applications.",
            "A frequency domain subspace blind channel estimation method for trailing zero OFDM systems.",
            "User-provided multimedia content distribution architecture in mobile and ubiquitous communication networks.",
            "Peer-to-peer multipoint video conferencing with layered video.",
            "Biofeedback data visualization for body sensor networks.",
            "A feature level multimodal approach for palmprint identification using directional subband energies.",
            "Rapid development of distributed applications using high-level communication support.",
            "A performance model for differentiated service over single-hop passive star coupled WDM optical networks.",
            "A pervasive assistive environment for visually impaired people using wireless sensor network infrastructure.",
            "VWCA: An efficient clustering algorithm in vehicular ad hoc networks.",
            "Improving rate allocation for ephemeral traffic using a second-order algorithm.",
            "Universal connection architecture for interactive applications to achieve distributed computing.",
            "Randomized load balancing strategies with churn resilience in peer-to-peer networks.",
            "An efficient public key encryption with conjunctive-subset keywords search.",
            "Lessons from research on interaction with virtual environments.",
            "Faster person identification using compressed ECG in time critical wireless telecardiology applications.",
            "A mobile network operator-independent mobile signature service.",
            "Multi-granularity context model for dynamic Web service composition.",
            "An ant-based rate allocation algorithm for media streaming in peer to peer networks: Extension to multiple sessions and dynamic networks.",
            "Empirical tests of anonymous voice over IP.",
            "Study and performance of localization methods in IP based networks: Vivaldi algorithm.",
            "Implementation and analysis of the BitTorrent protocol with a multi-agent model.",
            "Efficient cluster-based group key agreement protocols for wireless ad hoc networks.",
            "Reliable service provisioning in converged multimedia network environment.",
            "mPHASiS: Mobile patient healthcare and sensor information system.",
            "A novel node level security policy framework for wireless sensor networks.",
            "Special issue on: Efficient and robust security and services of wireless mesh networks.",
            "Security analysis of wireless mesh backhauls for mobile networks.",
            "Providing survivability against jamming attack for multi-radio multi-channel wireless mesh networks.",
            "Improving security in WMNs with reputation systems and self-organizing maps.",
            "A novel linear multi-secret sharing scheme for group communication in wireless mesh networks.",
            "Proxy encryption based secure multicast in wireless mesh networks.",
            "Wireless mesh network security: A traffic engineering management approach.",
            "Two secure and energy-saving spontaneous ad-hoc protocol for wireless mesh client networks.",
            "Using fuzzy link cost and dynamic choice of link quality metrics to achieve QoS and QoE in wireless mesh networks.",
            "A survey of memory error correcting techniques for improved reliability.",
            "A survey on cross-layer solutions for wireless sensor networks.",
            "A reputation system for wireless mesh networks using network coding.",
            "Improved flooding of broadcast messages using extended multipoint relaying.",
            "Multi-objective zone mapping in large-scale distributed virtual environments.",
            "Cooperative caching versus proactive replication for location dependent request patterns.",
            "Enhanced Fast Spread Replication strategy for Data Grid.",
            "A heuristic adaptive QoS prediction scheme in single-hop passive star coupled WDM optical networks.",
            "Towards nature-inspired pervasive service ecosystems: Concepts and simulation experiences.",
            "Optimization between security and delay of quality-of-service.",
            "A secure dynamic identity based authentication protocol for multi-server architecture.",
            "A service concept recommendation system for enhancing the dependability of semantic service matchmakers in the service ecosystem environment.",
            "A coordinated multiple channel assignment scheme and AP deployment for channel reuse in metropolitan scale wireless networks.",
            "Joint admission and power control for quality-of-service in the wireless downlink.",
            "Achieving autonomous fair exchange in ubiquitous network settings.",
            "Solving ring loading problems using bio-inspired algorithms.",
            "H.264/AVC standard: A proposal for selective intra- and optimized inter-prediction.",
            "On the wide diameter of directed double-loop networks.",
            "An overlay network for autonomous information discovery in the post-composition registries of ambient networks.",
            "A robust fault-tolerant control strategy for networked control systems.",
            "A provision-aware fair bandwidth distribution marker algorithm for DiffServ networks.",
            "Using clustering to improve the KNN-based classifiers for online anomaly network traffic identification.",
            "Performance analysis of Bluetooth asynchronous connection-less service.",
            "Two-level market solution for services composition optimization in mobile grid.",
            "Design of parameter tunable robust controller for active queue management based on H∞ control theory.",
            "Cross-layer QoS support framework and holistic opportunistic scheduling for QoS in single carrier WiMAX system.",
            "Context aware service provisioning in mobile grid.",
            "Risk-based adaptive scheduling in randomly deployed video sensor networks for critical surveillance applications.",
            "RFID technology, systems, and applications.",
            "Leveraging complex event processing for smart hospitals using RFID.",
            "Load-balancing mechanism for the RFID middleware applications over grid networking.",
            "Probabilistic DCS: An RFID reader-to-reader anti-collision protocol.",
            "Flaws on RFID grouping-proofs. Guidelines for future sound protocols.",
            "Improved security for commercial container transports using an innovative active RFID system.",
            "An optimal probabilistic solution for information confinement, privacy, and security in RFID systems.",
            "On the optimal frame-length configuration on real passive RFID systems.",
            "Design of a secure distance-bounding channel for RFID.",
            "RFID network planning using a multi-swarm optimizer.",
            "RFID-assisted indoor localization and the impact of interference on its performance.",
            "The optimal k-covering tag deployment for RFID-based localization.",
            "An efficient distributed discovery service for EPCglobal network in nested package scenarios.",
            "Hybrid Zigbee RFID sensor network for humanitarian logistics centre management.",
            "Business process analysis and simulation for the RFID and EPCglobal Network enabled supply chain: A proof-of-concept approach.",
            "Business-aware framework for supporting RFID-enabled applications in EPC Network.",
            "eCloudRFID - A mobile software framework architecture for pervasive RFID-based applications.",
            "Real-time location and inpatient care systems based on passive RFID.",
            "Radio-Mama: An RFID based business process framework for asset management.",
            "SOARware: Treading through the crossroads of RFID middleware and SOA paradigm.",
            "Enabling through life product-instance management: Solutions and challenges.",
            "Advanced topics in cloud computing.",
            "Optimization of sub-query processing in distributed data integration systems.",
            "Verifying mediated service interactions considering expected behaviours.",
            "Ripple: A publish/subscribe service for multidata item updates propagation in the cloud.",
            "Efficient dynamic task scheduling in virtualized data centers with fuzzy prediction.",
            "SHARC: A scalable 3D graphics virtual appliance delivery framework in cloud.",
            "Optimizing the live migration of virtual machine by CPU scheduling.",
            "Cloud security defence to protect cloud computing against HTTP-DoS and XML-DoS attacks.",
            "Layered video multicast with a P2P cooperation approach.",
            "Secure virtualization for cloud computing.",
            "Task assignment policies in distributed server systems: A survey.",
            "An efficient anonymous authentication protocol for mobile pay-TV.",
            "Building a trusted route in a mobile ad hoc network considering communication reliability and path length.",
            "Seamless integration of dependability and security concepts in SOA: A feedback control system based framework and taxonomy.",
            "Location-based authentication protocol for first cognitive radio networking standard.",
            "Systematic design of secure Mobile Grid systems.",
            "Mutual information-based feature selection for intrusion detection systems.",
            "A model-based framework to automate the analysis of users' activity in collaborative systems.",
            "Super-peer-based coordinated service provision.",
            "A survey on quality of service support in wireless sensor and actor networks: Requirements and challenges in the context of critical infrastructure protection.",
            "Message scheduling with reduced matrix cycle and evenly distributed sparse allocation for time-triggered CAN.",
            "Dynamic Congestion Control through backup relay in Bluetooth scatternet.",
            "A bidding model and cooperative game-based vertical handoff decision algorithm.",
            "Group mobility support in mobile WiMAX networks.",
            "Minimalist approach to show emotions via a flock of smileys.",
            "Using one-time passwords to prevent password phishing attacks.",
            "Anomaly detection in wireless sensor networks: A survey.",
            "INtERCEDE: An algorithmic approach to networked control system design.",
            "Applying a usage control model in an operating system kernel.",
            "Joint opportunistic power and rate allocation for wireless ad hoc networks: An adaptive particle swarm optimization approach.",
            "Client/server messaging protocols in serverless environments.",
            "Secure and efficient disjoint multipath construction for fault tolerant routing in wireless sensor networks.",
            "Swarm behavior control of mobile multi-robots with wireless sensor networks.",
            "A framework for collaborative remote experimentation for a physical laboratory using a low cost embedded web server.",
            "Hybrid congestion control for high-speed networks.",
            "A link stability-based multicast routing protocol for wireless mobile ad hoc networks.",
            "Email FI identification and resolution with model checking.",
            "Dependable multimedia communications: Systems, services, and applications.",
            "Intelligent rate control for supporting real-time traffic in WLAN mesh networks.",
            "Robust several-speaker speech recognition with highly dependable online speaker adaptation and identification.",
            "PSSB: Priority enforced slow-start backoff algorithm for multimedia transmission in wireless ad-hoc networks.",
            "Mobile TV services through IP Datacast over DVB-H: Dependability of the quality of experience on the IP-based distribution network quality of service.",
            "A perceptual macroblock layer power control for energy scalable video encoder based on just noticeable distortion principle.",
            "Using bee algorithm for peer-to-peer file searching in mobile ad hoc networks.",
            "A novel 3D streaming protocol supported multi-mode display.",
            "Multimedia applications over metropolitan area networks (MANs).",
            "Policy controlled self-configuration in unattended wireless sensor networks.",
            "A dependable privacy protection for end-to-end VoIP via Elliptic-Curve Diffie-Hellman and dynamic key changes.",
            "A passive image authentication scheme for detecting region-duplication forgery with rotation.",
            "Enhanced HCCA mechanism for multimedia traffics with QoS support in IEEE 802.11e networks.",
            "A survey of schemes for Internet-based video delivery.",
            "Energy efficient wireless unicast routing alternatives for machine-to-machine networks.",
            "Adaptive e-mails intention finding system based on words social networks.",
            "Orthogonal feedback scheme for network coding.",
            "Modeling architecture for collaborative virtual objects based on services.",
            "Fast quarantining of proactive worms in unstructured P2P networks.",
            "TTL based routing in opportunistic networks.",
            "Linear wireless sensor networks: Classification and applications.",
            "An adaptive-predictive architecture for video streaming servers.",
            "Enhanced statistics-based rate adaptation for 802.11 wireless networks.",
            "Application of the Java Message Service in mobile monitoring environments.",
            "Social network analysis of web links to eliminate false positives in collaborative anti-spam systems.",
            "New identity-based key-insulated convertible multi-authenticated encryption scheme.",
            "Monitoring abnormal network traffic based on blind source separation approach.",
            "Computational geometry based distributed coverage hole detection protocol for the wireless sensor networks.",
            "CARSA: A context-aware reasoning-based service agent model for AI planning of web service composition.",
            "Control and optimization over wireless networks.",
            "Information quality model and optimization for 802.15.4-based wireless sensor networks.",
            "Lifetime extension for surveillance wireless sensor networks with intelligent redeployment.",
            "Using an evolutionary algorithm to optimize the broadcasting methods in mobile ad hoc networks.",
            "Design and analysis of a multi-candidate selection scheme for greedy routing in wireless sensor networks.",
            "Optimal control of mobile monitoring agents in immune-inspired wireless monitoring networks.",
            "A clique-based secure admission control scheme for mobile ad hoc networks (MANETs).",
            "Congestion prevention in broadband wireless access systems: An economic approach.",
            "Multi-sector multi-range control for self-organizing wireless networks.",
            "A cross-layer resource allocation scheme for ICIC in LTE-Advanced.",
            "A mathematical formulation for joint channel assignment and multicast routing in multi-channel multi-radio wireless mesh networks.",
            "A communication infrastructure to ease the development of mobile collaborative applications.",
            "A novel Parzen probabilistic neural network based noncoherent detection algorithm for distributed ultra-wideband sensors.",
            "Providing security vertical handoff in SARAH for heterogeneous networks.",
            "A survey on routing techniques in underwater wireless sensor networks.",
            "Cross-layer signalling and middleware: A survey for inelastic soft real-time applications in MANETs.",
            "Security on VANETs: Privacy, misbehaving nodes, false information and secure data aggregation.",
            "Survey of network coding-aware routing protocols in wireless networks.",
            "An adaptive approach for information dissemination in Vehicular Ad hoc Networks.",
            "Dual-key-binding cancelable palmprint cryptosystem for palmprint protection and information security.",
            "Multi-core application performance optimization using a constrained tandem queueing model.",
            "A family of simple distributed minimum connected dominating set-based topology construction algorithms.",
            "An efficient metric-based (EM-B) location management scheme for wireless cellular networks.",
            "Networking without Dynamic Host Configuration Protocol server in Ethernet and Wireless Local Area Network.",
            "IDFC: A new approach to control bifurcation in TCP/RED."
        ]
    },
    {
        "name": "JNCA",
        "year": "2010",
        "info": "Volume 33: 2010",
        "count": 63,
        "papers": [
            "An efficient biometrics-based remote user authentication scheme using smart cards.",
            "Performance evaluation comparison of Snort NIDS under Linux and Windows Server.",
            "A framework for identity privacy in SIP.",
            "An efficient secure proxy verifiably encrypted signature scheme.",
            "Self-configured multiple-network-interface socket.",
            "A novel model of adaptation decision-taking engine in multimedia adaptation.",
            "An authentication scheme for locating compromised sensor nodes in WSNs.",
            "Wireless sensor network key management survey and taxonomy.",
            "A trusted decentralized access control framework for the client/server architecture.",
            "Interest based selection of user generated content for rich communication services.",
            "Performance study of online batch-based digital signature schemes.",
            "A path-traceable query routing mechanism for search in unstructured peer-to-peer networks.",
            "Flexible and secure service discovery in ubiquitous computing.",
            "An efficient reconstruction approach for improving Bluetree scatternet formation in personal area networks.",
            "Discovery and prevention of attack episodes by frequent episodes mining and finite state machines.",
            "A cache invalidation strategy for mobile networks.",
            "On the self-organization of a hybrid peer-to-peer system.",
            "Special issue on: Recent advances and future directions in biometrics personal identification.",
            "An alignment-free fingerprint cryptosystem based on fuzzy vault scheme.",
            "Minutiae and modified Biocode fusion for fingerprint-based key generation.",
            "Cancelable fingerprint templates using minutiae-based bit-strings.",
            "A novel image hiding approach based on correlation analysis for secure multimodal biometrics.",
            "Combining features for distorted fingerprint matching.",
            "Improving the accuracy and storage cost in biometric remote authentication schemes.",
            "Finger vein recognition with manifold learning.",
            "Teeth recognition based on multiple attempts in mobile device.",
            "Individual identification using personality traits.",
            "Robust iris indexing scheme using geometric hashing of SIFT keypoints.",
            "Incremental two-dimensional linear discriminant analysis with applications to face recognition.",
            "An adaptively weighted sub-pattern locality preserving projection for face recognition.",
            "Visual-based online signature verification using features extracted from video.",
            "Characteristic trade-offs in designing large-scale biometric-based identity management systems.",
            "A vEB-tree-based architecture for interactive video on demand services in peer-to-peer networks.",
            "Coverage-aware connectivity restoration in mobile sensor networks.",
            "A genetic algorithm with switch-device encoding for optimal partition of switched industrial Ethernet networks.",
            "A clique base node scheduling method for wireless sensor networks.",
            "Enabling inter-PMIPv6-domain handover with traffic distributors.",
            "Adaptation of RSS feeds based on the user profile and on the end device.",
            "Network coding based reliable disjoint and braided multipath routing for sensor networks.",
            "Better network traffic identification through the independent combination of techniques.",
            "Real-time hands, face and facial features detection and tracking: Application to cognitive rehabilitation tests monitoring.",
            "An efficient bandwidth allocation algorithm for real-time VBR stream transmission under IEEE 802.16 wireless networks.",
            "An efficient cluster-based CDMA/TDMA scheme for wireless mobile ad-hoc networks: A learning automata approach.",
            "Critical infrastructure protection: Resource efficient sampling to improve detection of less frequent patterns in network traffic.",
            "FrameIDTV: A framework for developing interactive applications on digital television environments.",
            "QoS multicast tree construction in IP/DWDM optical internet by bio-inspired algorithms.",
            "Middleware trends for network applications.",
            "Context- and social-aware middleware for opportunistic networks.",
            "A methodology for engineering collaborative and ad-hoc mobile applications using SyD middleware.",
            "Enabling portability in advanced information-centric services over structured peer-to-peer systems.",
            "Adaptive security protocol selection for mobile computing.",
            "Moving routing protocols to the user space in MANET middleware.",
            "Voice interactive classroom, a service-oriented software architecture for speech-enabled learning.",
            "Middleware support for service discovery in special operations mobile ad hoc networks.",
            "Development of Web-Telecom based hybrid services orchestration and execution middleware over convergence networks.",
            "Advances on agent-based network management.",
            "Agent-based artificial immune system approach for adaptive damage detection in monitoring networks.",
            "A cost matrix agent for shortest path routing in ad hoc networks.",
            "Distributed autonomic management: An approach and experiment towards managing service-centric networks.",
            "Advanced mobile agent security models for code integrity and malicious availability check.",
            "A dynamic resource management in mobile agent by artificial neural network.",
            "A resource-awareness information extraction architecture on mobile grid environment.",
            "QUIET: A Methodology for Autonomous Software Deployment using Mobile Agents."
        ]
    },
    {
        "name": "JNCA",
        "year": "2009",
        "info": "Volume 32: 2009",
        "count": 96,
        "papers": [
            "Bottleneck Active Node Detouring for capsule-based active network.",
            "Fast intrusion detection based on a non-negative matrix factorization model.",
            "Resilient and efficient load balancing in distributed hash tables.",
            "An engineering approach to the design of a BcN control network.",
            "A lightweight web-based vulnerability scanner for small-scale computer network security assessment.",
            "A distributed mobile database implementation on Pocket PC mobile devices communicating over Bluetooth.",
            "Towards Anonymous Mobile Community services.",
            "A hierarchical control protocol for group-oriented playbacks supported by content distribution networks.",
            "The implementation and evaluation of a recovery system for workflows.",
            "A virtual environment for network testing.",
            "Performance evaluation study for QoS-aware triple play services over entry-level xDSL connections.",
            "Robust t-out-of-n oblivious transfer mechanism based on CRT.",
            "A spam rejection scheme during SMTP sessions based on layer-3 e-mail classification.",
            "Multicast routing for delay variation bound using a modified ant colony algorithm.",
            "An overlapping communication protocol using improved time-slot leasing for Bluetooth WPANs.",
            "IDEWEP: Web service for astronomical parallel image deconvolution.",
            "QoS-enabled multicast for delivering live events in a Digital Cinema scenario.",
            "Network and system security.",
            "Profit-aware overload protection in E-commerce Web sites.",
            "An innovative analyser for multi-classifier e-mail classification based on grey list analysis.",
            "One-way queuing delay measurement and its application on detecting DDoS attack.",
            "Using mobile agents to recover from node and database compromise in path-based DoS attacks in wireless sensor networks.",
            "A user-centric federated single sign-on system.",
            "CRBAC: Imposing multi-grained constraints on the RBAC model in the multi-application environment.",
            "A policy-based authorization model for workflow-enabled dynamic process management.",
            "A novel fault-tolerant execution model by using of mobile agents.",
            "Special issue on service oriented computing and advanced network applications.",
            "Mobile service oriented architectures for NN-queries.",
            "Fast autonomous system traceback.",
            "A class-based scheme for E-commerce web servers: Formal specification and performance evaluation.",
            "Towards automating overlay network management.",
            "A new system architecture for crowd simulation.",
            "Quantitative analysis of location management and QoS in wireless networks.",
            "Enhanced cross-layer based middleware for mobile ad hoc networks.",
            "Topological network design: A survey.",
            "Adaptive middleware supporting scalable performance for high-end network services.",
            "Three-layer control policy for grid resource management.",
            "Email licensing.",
            "Reducing query overhead through route learning in unstructured peer-to-peer network.",
            "Novel delay-range-dependent stability analysis of the second-order congestion control algorithm with heterogonous communication delays.",
            "ML-Chord: A multi-layered P2P resource sharing model.",
            "An incentive-based electronic payment scheme for digital content transactions over the Internet.",
            "A secure and anonymous voter-controlled election scheme.",
            "Configurable symbol synchronizers for software-defined radio applications.",
            "A platform for transcoding heterogeneous markup documents using ontology-based metadata.",
            "Autonomic hierarchical reconfiguration for wireless access networks.",
            "An efficient design for fast memory registration in RDMA.",
            "A relay node deployment method for disconnected wireless sensor networks: Applied in indoor environments.",
            "Video Data Delivery using Slotted Patching.",
            "Principles and performance analysis of SeCond: A system for epidemic peer-to-peer content distribution.",
            "Pandora: An SMS-oriented m-informational system for educational realms.",
            "Effective RED: An algorithm to improve RED's performance by reducing packet loss rate.",
            "Janus: A dual-purpose analytical model for understanding, characterizing and countermining multi-stage collusive attacks in enterprise networks.",
            "Predicting intrusion goal using dynamic Bayesian network with transfer probability estimation.",
            "A fast and reliable multi-sender algorithm for peer-to-peer networks.",
            "Design, implementation, and evaluation of a Programmable Bandwidth Aggregation System for home networks.",
            "Resource scheduling with conflicting objectives in grid environments: Model and evaluation.",
            "Adaptive hierarchical scheduling policy for enterprise grid computing systems.",
            "Security bootstrap model of key pre-sharing by polynomial group in mobile Ad Hoc Network.",
            "A pixel-based scrambling scheme for digital medical images protection.",
            "Identifying best practices for supporting broadband growth: Methodology and analysis.",
            "Performance analysis of a cross-layer SSO mechanism for a roaming infrastructure.",
            "Network fault detection with Wiener filter-based agent.",
            "Enhancement of anticipative recursively adjusting mechanism for redundant parallel file transfer in data grids.",
            "A system based on mobile agents to test mobile computing applications.",
            "On target coverage in wireless heterogeneous sensor networks with multiple sensing units.",
            "Performance evaluation of wireless sensor network with hybrid channel access mechanism.",
            "Supporting asynchronous update for distributed data cubes.",
            "Content and overlay-aware scheduling for peer-to-peer streaming in fluctuating networks.",
            "A phenotype reputation estimation function and its study of resilience to social attacks.",
            "HTTP-MPLEX: An enhanced hypertext transfer protocol and its performance evaluation.",
            "Next generation content networks.",
            "A survey on dynamic Web content generation and delivery techniques.",
            "BitDew: A data management and distribution service with multi-protocol file transfer and metadata abstraction.",
            "Resource discovery and request-redirection for dynamic load sharing in multi-provider peering content delivery networks.",
            "Study and performance of a group-based Content Delivery Network.",
            "A negotiation framework for content distribution in mobile transient networks.",
            "MetaCDN: Harnessing 'Storage Clouds' for high performance content delivery.",
            "Application classification using packet size distribution and port association.",
            "Impact of bounded delay on throughput in multi-hop networks.",
            "Comparative packet-forwarding measurement of three popular operating systems.",
            "An adaptive latency mitigation scheme for massively multiuser virtual environments.",
            "Deconstructing Network Attached Storage systems.",
            "A novel network mobility handoff scheme using SIP and SCTP for multimedia applications.",
            "Language engineering techniques for the development of e-learning applications.",
            "Decentralized multi-dimensional alert correlation for collaborative intrusion detection.",
            "Survey of multipath routing protocols for mobile ad hoc networks.",
            "Power-saving scheduling with a QoS guarantee in a mobile WiMAX system.",
            "A reliable QoS aware routing protocol with slot assignment for mobile ad hoc networks.",
            "Providing early resource allocation during emergencies: The mobile triage tag.",
            "BARC: A Battery Aware Reliable Clustering algorithm for sensor networks.",
            "KEPPAN: Knowledge exploitation for proactively-planned ad-hoc networks.",
            "Integration of a speech activated control system and a wireless interworking unit for a CAN-based distributed application.",
            "A program-based anomaly intrusion detection scheme using multiple detection engines and fuzzy inference.",
            "A H-QoS-demand personalized home physiological monitoring system over a wireless multi-hop relay network for mobile home healthcare applications.",
            "Autonomic microcell assignment in massively distributed online virtual environments."
        ]
    },
    {
        "name": "JNCA",
        "year": "2008",
        "info": "Volume 31: 2008",
        "count": 52,
        "papers": [
            "Intelligent and situation-aware pervasive system to support debris-flow disaster prediction and alerting in Taiwan.",
            "Monte Carlo simulation-based algorithms for estimating the reliability of mobile agent-based systems.",
            "Performance comparisons of load balancing algorithms for I/O-intensive workloads on clusters.",
            "Multicast routing and wavelength assignment with delay constraints in WDM networks with heterogeneous capabilities.",
            "Design and implementation scheme for deploying IPv4 over IPv6 tunnel.",
            "Trends in peer to peer and service oriented computing.",
            "Patterns of message interchange in decoupled hypermedia systems.",
            "The service discovery methods issue: A web services UDDI specification framework integrated in a grid environment.",
            "Techniques to support Web Service selection and consumption with QoS characteristics.",
            "An ontologically principled service-oriented architecture for managing distributed e-government nodes.",
            "Balanced distributed web service lookup system.",
            "Dynamic proxy assisted mobility support for third generation peer-to-peer networks.",
            "Exploiting tourism destinations' knowledge in an RDF-based P2P network.",
            "Congestion control of bluetooth radio system by piconet restructuring.",
            "CADeComp: Context-aware deployment of component-based applications.",
            "Cross-layer optimization policy for QoS scheduling in computational grid.",
            "VGITS: ITS based on intervehicle communication networks and grid technology.",
            "Multicast protection scheme in survivable WDM optical networks.",
            "Edge-limited scalable QoS flow set-up.",
            "Modeling and analysis of value added services using message sequence charts.",
            "Hands-free vision-based interface for computer accessibility.",
            "A scalable authentication model based on public keys.",
            "Data aggregation in wireless sensor networks using ant colony algorithm.",
            "Activity routing in a distributed supply chain: Performance evaluation with two inputs.",
            "A framework to determine bounds of maximum loss rate parameter of RED queue for next generation routers.",
            "Trust-based evolutionary game model assisting AODV routing against selfishness.",
            "A distributed expansible authentication model based on Kerberos.",
            "Securing dynamic itineraries for mobile agent applications.",
            "A collaborative defense mechanism against SYN flooding attacks in IP networks.",
            "Novel route maintenance protocols for the Bluetooth ad hoc network with mobility.",
            "Process-context aware matchmaking for web service composition.",
            "An efficient resource allocation scheme for multimedia applications in MANET.",
            "An upper bound model for TCP and UDP throughput in IPv4 and IPv6.",
            "User Profile Modeling in the context of web-based learning management systems.",
            "Human activity recognition in pervasive health-care: Supporting efficient remote collaboration.",
            "Multi-constraint QoS routing using a new single mixed metrics.",
            "Visualizing the evolution of a web-based social network.",
            "Analysis of mobile agents in network fault management.",
            "The troubleshooting task implementation in automotive chassis using virtual interactive technique and knowledge-based approach.",
            "A new adaptive digital audio watermarking based on support vector machine.",
            "Performance evaluation for DRED discrete-time queueing network analytical model.",
            "SIP-based proactive and adaptive mobility management framework for heterogeneous networks.",
            "NectaRSS, an intelligent RSS feed reader.",
            "An asynchronous MAC protocol for wireless sensor networks.",
            "PeerCast: Churn-resilient end system multicast on heterogeneous overlay networks.",
            "Secure DACS Scheme.",
            "Computing in social networks with relationship algebra.",
            "Interconnection of CAN segments through IEEE 802.16 wireless MAN.",
            "Cataclysm: Scalable overload policing for internet applications.",
            "Assessing readiness of IP networks to support desktop videoconferencing using OPNET.",
            "A novel ANN-based service selection model for ubiquitous computing environments.",
            "On the properties of spam-advertised URL addresses."
        ]
    },
    {
        "name": "JNCA",
        "year": "2007",
        "info": "Volume 30: 2007",
        "count": 80,
        "papers": [
            "Network and information security: A computational intelligence approach: Special Issue of Journal of Network and Computer Applications.",
            "VQ-based watermarking scheme with genetic codebook partition.",
            "The semipublic encryption for visual cryptography using Q'tron neural networks.",
            "Towards secure information sharing using role-based delegation.",
            "Adaptive anomaly detection with evolving connectionist systems.",
            "D-SCIDS: Distributed soft computing intrusion detection system.",
            "Intrusion detection by integrating boosting genetic fuzzy classifier and data mining criteria for rule pre-screening.",
            "Modeling intrusion detection system using hybrid intelligent systems.",
            "High-speed routers design using data stream distributor unit.",
            "Design and performance evaluation of a multi-agent-based dynamic lifetime security scheme for AODV routing protocol.",
            "The case for a dynamic proxy framework with voluntary/incentive-based client hosting scheme.",
            "A scalable group communication mechanism for mobile agents.",
            "Distributed middleware architectures for scalable media services.",
            "Mobile agents for information retrieval in hybrid simulation environment.",
            "Optimized streaming media proxy and its applications.",
            "Dynamic survivable algorithm for meshed WDM optical networks.",
            "Design and implementation of Blog Rendering and Accessing INstantly system (BRAINS).",
            "Detection of wormhole attacks in multi-path routed wireless ad hoc networks: A statistical analysis approach.",
            "Real-time network monitoring scheme based on SNMP for dynamic information.",
            "Quality-of-service differentiation on the Internet: A taxonomy.",
            "An analytical model for interval caching in interactive video servers.",
            "Intrusion detection using a fuzzy genetics-based learning algorithm.",
            "Dynamic service-level-agreement aware shared-path protection in WDM mesh networks.",
            "The design and implementation of an agent-based framework for acceptable usage policy monitoring and enforcement.",
            "Web search engine based on DNS.",
            "A video streaming application for urban traffic management.",
            "Embedded web server-based home appliance networks.",
            "Efficient algorithms of video replication and placement on a cluster of streaming servers.",
            "Representing and analysing composed web services using Cress.",
            "A web content manipulation technique based on page Fragmentation.",
            "Designing interaction protocols using noughts and crosses type games.",
            "A location routing protocol based on smart antennas for ad hoc networks.",
            "A new technique for minimizing network loss from users' perspective.",
            "A new shared-risk link groups (SRLG)-disjoint path provisioning with shared protection in WDM optical networks.",
            "Simple efficient mutual anonymity protocols for peer-to-peer network based on primitive roots.",
            "A novel recursive shared segment protection algorithm in survivable WDM networks.",
            "Protections for multicast session in WDM optical networks under reliability constraints.",
            "On-demand utility-based power control routing for energy-aware optimization in mobile ad hoc networks.",
            "Relay reduction and disjoint routes construction for scatternet over Bluetooth radio system.",
            "P2P transfer of partial stream in multimedia multicast.",
            "Detecting feature interactions in CPL.",
            "Building an interconnection between PROFIBUS and ATM networks.",
            "Distributed denial-of-service and intrusion detection.",
            "Stateful DDoS attacks and targeted filtering.",
            "Enhanced Internet security by a distributed traffic control service based on traffic ownership.",
            "Provider-based deterministic packet marking against distributed DoS attacks.",
            "Information sharing for distributed intrusion detection systems.",
            "A network access control approach based on the AAA architecture and authorization attributes.",
            "Key management for role hierarchy in distributed systems.",
            "Secure and efficient key management in mobile ad hoc networks.",
            "Intelligence-based adaptation for ubiquitous multimedia communications.",
            "Knowledge-based multimedia adaptation for ubiquitous multimedia consumption.",
            "Dynamic content-based adaptation of streamed multimedia.",
            "Delivering adaptivity through context-awareness.",
            "Reinforcement learning for dynamic multimedia adaptation.",
            "Usage derived recommendations for a video digital library.",
            "Innovations in agent collaboration, cooperation and Teaming, Part 2.",
            "Innovations in multi-agent systems.",
            "Internet collaboration and service composition as a loose form of teamwork.",
            "A framework for the design and automated implementation of communication aspects in multi-agent systems.",
            "GCS-MA: A group communication system for mobile agents.",
            "A protocol for multi-agent negotiation in a group-choice decision making process.",
            "Specifying the intertwining of cooperation and autonomy in agent-based systems.",
            "Privacy-preserving collaborative association rule mining.",
            "A security protocol for mobile agents based upon the cooperation of sedentary agents.",
            "A network of sensor-based framework for automated visual surveillance.",
            "Editorial.",
            "Capability-based egress network access control by using DNS server.",
            "Extending metadata with scenarios in adaptive distributed system.",
            "Client-server architecture for collaborative remote experimentation.",
            "On-demand Virtual Neonatal Intensive Care units supporting rural, remote and urban healthcare with Bush Babies Broadband.",
            "Region-based license plate detection.",
            "Bi-modal emotion recognition from expressive face and body gestures.",
            "A new digital implementation of ridgelet transform for images of dyadic length.",
            "Voting ensembles for spoken affect classification.",
            "A two-layered multi-agent reinforcement learning model and algorithm.",
            "Secure communications for cluster-based ad hoc networks using node identities.",
            "Optimal XOR hashing for non-uniformly distributed address lookup in computer networks.",
            "Design and analysis of a stable set-up protocol for transcoding multicast trees in active networks.",
            "Improving the multicast state scalability in internet routers by integrating hash algorithm with recursive unicast."
        ]
    },
    {
        "name": "JNCA",
        "year": "2006",
        "info": "Volume 29: 2006",
        "count": 20,
        "papers": [
            "Fractional alpha stable network traffic model and its application in QoS routing.",
            "Robot teleoperation featuring commercially available wireless network cards.",
            "Assessing the efficiency of stream reuse techniques in P2P video-on-demand systems.",
            "Practical and efficient fair document exchange over networks.",
            "Facial feature tracking for cursor control.",
            "Editorial.",
            "Cards-to-presentation on the web: generating multimedia contents featuring agent animations.",
            "A future framework for interfacing BDI agents in a real-time teaming environment.",
            "Distributed agent paradigm for soft and hard computation.",
            "Teams of intelligent agents which learn using artificial immune systems.",
            "A team-based holonic approach to robotic assembly cell control.",
            "An evolutionary approach to prototyping pedagogical agents: from simulation to integrated system.",
            "Supporting teachers' intervention in collaborative knowledge building.",
            "Performance analysis of double buffer technique (DBT) model for mobility support in wireless IP networks.",
            "An efficient quality-of-service MAC protocol for infrastructure WLANs.",
            "A study for control of client value using cluster analysis.",
            "Towards pervasive learning: WeLearn.Mobile. A CPS package viewer for handhelds.",
            "Real-time data attack isolation for commercial database applications.",
            "Collaborative distributed environments for learning design tasks by means of modelling and simulation.",
            "Application-level network emulation: the EmuSocket toolkit."
        ]
    },
    {
        "name": "JNCA",
        "year": "2005",
        "info": "Volume 28: 2005",
        "count": 15,
        "papers": [
            "A service-oriented middleware for building context-aware services.",
            "ACAI: agent-based context-aware infrastructure for spontaneous applications.",
            "A new method for transferring CAN messages using wireless ATM.",
            "Using service brokers for accessing backend servers for web applications.",
            "Hierarchical task topology for retrieving information from within a simulated information ecosystem.",
            "Learnable topic-specific web crawler.",
            "Panoramic View System for extracting key sentences based on viewpoints and application to a search engine.",
            "The BankSearch web document dataset: investigating unsupervised clustering and category similarity.",
            "Intelligent web traffic mining and analysis.",
            "Intrusion detection using an ensemble of intelligent paradigms.",
            "An agent-based approach to security service.",
            "Application on demand system over the Internet.",
            "Towards a flexible service discovery.",
            "Pricing and brokering services over interconnected IP networks.",
            "Service level agreements for DiffServ-based services' provisioning."
        ]
    },
    {
        "name": "JNCA",
        "year": "2004",
        "info": "Volume 27: 2004",
        "count": 13,
        "papers": [
            "Constructing the hallucinations of psychosis in Virtual Reality.",
            "J2ME application-layer end-to-end security for m-commerce.",
            "An agent-based approach to flexible commerce in intermediary-centric electronic markets.",
            "A unified approach to analyze multiple access protocols for buffered finite users.",
            "TSDLMRA: an efficient multicast routing algorithm based on Tabu search.",
            "Distributed virtual reality: building a multi-user layer for the EVE Platform.",
            "Performance comparison of remote procedure calling and mobile agent approach to control and data transfer in distributed computing environment.",
            "Performance analysis of buffered R-ALOHA systems using tagged user approach.",
            "A comparison of two optimal approaches for the MCOP problem.",
            "Knowledge transfer processes in a modern WBT system.",
            "Constructing identity-based cryptosystems for discrete logarithm based cryptosystems.",
            "A cooperative agent-based model for active security systems.",
            "A flexible communications protocol for a distributed surveillance system."
        ]
    },
    {
        "name": "JNCA",
        "year": "2003",
        "info": "Volume 26: 2003",
        "count": 17,
        "papers": [
            "Publisher's Note.",
            "Structural computing: research directions, systems and issues.",
            "Relationships among structural computing and other fields.",
            "Searching for revolution in structural computing.",
            "Structural templates and transformations: the Themis structural computing environment.",
            "Visualizing and interacting with hypermedia-based process-centric enterprise models.",
            "Discussions at the data border: from generalised hypertext to structural computing.",
            "Cooperation services in the Construct structural computing environment.",
            "Structuring primitives in the Callimachus component-based open hypermedia system.",
            "Experiences with an object-level scalable web framework.",
            "Security for XML messaging services - a component-based approach.",
            "Architectures of assistive software applications for Windows-based computers.",
            "GBF: a grammar based filter for Internet applications.",
            "Robot teleoperation environments featuring WAP-based wireless devices.",
            "A framework for multicast video streaming over IP networks.",
            "Design and implementation of MP3-music on demand system using streaming technology.",
            "Apply agent to build grid service management."
        ]
    },
    {
        "name": "JNCA",
        "year": "2002",
        "info": "Volume 25: 2002",
        "count": 19,
        "papers": [
            "A heuristic approach to resource locations in broadband networks.",
            "Technology on social issues of videoconferencing on the Internet: a survey.",
            "Connection management for QoS service on the Web.",
            "Intruder tracing through dynamic extension of a security domain.",
            "An unlinkably divisible and intention attachable ticket scheme for runoff elections.",
            "A new paradigm for analysis of MPEG compressed videos.",
            "Blink detection for real-time eye tracking.",
            "Hybrid quality adaptation mechanism for layered multicast over the internet.",
            "Active route-maintenance protocol for signal-based communication path in ad hoc networks.",
            "A neural network based real-time gaze tracker.",
            "Retrieval of software components using a distributed web system.",
            "Managing data flow in a DAC supporting security system.",
            "Preface to 'smart spaces'.",
            "Problem driven CVE technology development.",
            "Design of 'Ba' for successful Knowledge Management - how enterprises should design the places of interaction to gain competitive advantage.",
            "A multimedia service composition scheme for ubiquitous networks.",
            "Creating genetic applications for informal science learning in multi-user virtual environments.",
            "QoS-based media retrieval for networked digital archives.",
            "TAO: Temporal Algebraic Operators for modeling multimedia presentations."
        ]
    },
    {
        "name": "JNCA",
        "year": "2001",
        "info": "Volume 24: 2001",
        "count": 20,
        "papers": [
            "Preface to 'Hypermedia extensibility mechanisms and scripting languages'.",
            "A framework for classifying extensibility mechanisms in hypermedia systems.",
            "Extensibility in component-based open hypermedia systems.",
            "Specifying process-oriented hypertext for organizational computing.",
            "Extensibility via a meta-level architecture.",
            "The extensibility mechanisms of the Chimera open hypermedia system.",
            "CONUGA: Constrained User-Group Assignment.",
            "Implementing reactive closed-system specifications.",
            "ABR services for overcoming misbehaving sources in a heterogeneous environment.",
            "Wireless messaging services for mobile users.",
            "Digital watermarking in the fractional Fourier transformation domain.",
            "e-Learning through distributed virtual environments.",
            "Deployment of personalized e-catalogues: An agent-based framework integrated with XML metadata and user models.",
            "Design of a starvation-free storage system for a multicast video-on-demand system using a double-rate batching policy.",
            "Exploiting GSM short message service for ubiquitous accessing.",
            "Special Issue on 'Structural Computing'.",
            "MUSLI: A hypermedia interface for dynamic, interactive, and symbolic communication.",
            "Augmenting text and voice conversations with dynamic, interactive abstractions using P2P networking.",
            "A generic tool to federate WAN servers.",
            "An automatic English-Arabic HTML page translation system."
        ]
    },
    {
        "name": "JNCA",
        "year": "2000",
        "info": "Volume 23: 2000",
        "count": 28,
        "papers": [
            "User interfaces for telepresentations - Input devices, interaction concepts and design issues.",
            "Instructors' choices for a WWW-based course-support environment.",
            "On-line learning migration: from social learning theory to social presence theory in a CMC environment.",
            "Critical examination of factors affecting interaction on CMC.",
            "An efficient interconnection network for large-scale computer communications applications.",
            "The design of an interface for student note annotation in a networked electronic classroom.",
            "A simulated network management information base.",
            "Active Security - A proactive approach for computer security systems.",
            "CoFIND - An experiment in N-dimensional collaborative filtering.",
            "Power LAN MIB for management of intelligent telecommunication equipment.",
            "Preface to 'Developing New Network-based Storage Services for Internet-supported Collaborative Communities'.",
            "Preface to 'Virtual Environments'.",
            "Distributed network storage service with quality-of-service guarantees.",
            "The data grid: Towards an architecture for the distributed management and analysis of large scientific datasets.",
            "Performance analysis of a scaleable design for replicating file collections in wide-area networks.",
            "Open video: A framework for a test collection.",
            "Language and design in text-based virtual worlds.",
            "The design and implementation of a MOO.",
            "A pattern language for virtual environments.",
            "A QoS model for collaboration through Distributed Virtual Environments.",
            "Preface for the special issue 'Support for flexible e-Learning on the WWW'.",
            "Support for flexible e-Learning on the WWW: A special issue.",
            "Supporting Tele-Teaching: visualization aspects.",
            "Hypermedia-based support for cooperative learning of process knowledge.",
            "Multimedia application to support distance learning and other social interactions in real-time.",
            "A coordination framework and architecture for internet groupware.",
            "MUSiCAL: An object-oriented hypermedia data model for the reuse of museum information for computer-aided learning and the World-Wide Web.",
            "Document icon bar for the support of authoring, learning and navigation on the Web: Usability issues."
        ]
    },
    {
        "name": "JNCA",
        "year": "1999",
        "info": "Volume 22: 1999",
        "count": 18,
        "papers": [
            "A framework of decision support systems for use on the World Wide Web.",
            "Introducing hypermedia composites to WWW.",
            "HydraNet: Network support for scaling of large-scale services.",
            "Web-based training, performance and controlling.",
            "Special issue on: 'Support for Open and Distance Learning on the WWW'.",
            "Safety, liveness and real-time in embedded system design.",
            "Information access and QoS issues in a mobile computing environment.",
            "Managing Windows NT®file system permissions - A security tool to master the complexity of Microsoft Windows NT®file system permissions.",
            "Enabling professional learning in distributed communities of practice: Descriptors for multimedia objects.",
            "CALL FOR PAPERS: Special Issue on: Hypermedia Extensibility Mechanisms and Scripting Languages.",
            "Adapting instruction in search of 'a significant difference'.",
            "Virtual environments for education.",
            "Design issues of multimedia information indexing and retrieval systems.",
            "Towards role-based administration in network information services.",
            "Micro: A normalization tool for relational database designers.",
            "Web-based learning environments (WBLE): Current implementation and evolving trends.",
            "Dynamic generation of adaptive Internet-based courses.",
            "The Web-OEM approach to Web information extraction."
        ]
    },
    {
        "name": "JNCA",
        "year": "1998",
        "info": "Volume 21: 1998",
        "count": 18,
        "papers": [
            "An efficient communication scheme for media on-demand services with hard QoS guarantees.",
            "Using speech and touch to enable blind people to access schematic diagrams.",
            "An efficient multicast approach in an ATM switching network for multimedia applications.",
            "Deployment of VCR services on a computer network.",
            "Using MBone technology to support a framework for a remote advisory service, .",
            "Adaptive information agents using competitive learning.",
            "Categorizing Web pages on the subject of neural networks.",
            "Experiences with multimedia applications over native ATM.",
            "Interfacing reprogrammable universal remote controller with multimedia PC.",
            "The use of macroprocessing for Web site standardization.",
            "Optimal multimedia transport on the Internet.",
            "A framework for a World Wide Web-based Data Mining system.",
            "A performance comparison of token- and tree-based mutual exclusion algorithms on Chordal Rings.",
            "Enhancing the quality of Internet voice communication for Internet telephony systems.",
            "User interface for video observation over the internet.",
            "Traffic engineering using a class ofM/G/1models.",
            "An effective model for VBR video with application to an ATM multiplexer.",
            "Patient-centered computer simulation in hospital management."
        ]
    }
]