[
    {
        "year": "2021",
        "name": "18th MASS 2021",
        "info": "Denver, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2021",
                "sub_name": "IEEE 18th International Conference on Mobile Ad Hoc and Smart Systems, MASS 2021, Denver, CO, USA, October 4-7, 2021.",
                "count": 92,
                "papers": [
                    "Deep Reinforcement Learning for Scheduling in Multi-Hop Wireless Networks : Invited Paper.",
                    "QoS-Aware Load Balancing in Wireless Networks using Clipped Double Q-Learning.",
                    "Mobility-Aware Resource Allocation for mmWave IAB Networks via Multi-Agent RL.",
                    "Adaptive Deep Neural Network Ensemble for Inference-as-a-Service on Edge Computing Platforms.",
                    "Repetitive Activity Monitoring from Multivariate Time Series: A Generic and Efficient Approach.",
                    "Frequency Hopping Signal Modulation Recognition Based on Time-Frequency Analysis.",
                    "Analytical Optimal Solution of Selfish Node Detection with 2-hop Constraints in OppNets.",
                    "Mobile Charger Coverage Problem for Specific Heterogeneous Wireless Sensor Networks.",
                    "Environment-independent In-baggage Object Identification Using WiFi Signals.",
                    "Entropic Sensing for Energy Efficiency.",
                    "SENSELET++: A Low-cost Internet of Things Sensing Platform for Academic Cleanrooms.",
                    "Fine-grained Multi-user Device-Free Gesture Tracking on Today's Smart Speakers.",
                    "Minimizing Delay in Network Function Visualization with Quantum Computing.",
                    "AoI-minimizing Scheduling in UAV-relayed IoT Networks.",
                    "A Reward Response Game in the Federated Learning System.",
                    "DQ-SGD: Dynamic Quantization in SGD for Communication-Efficient Distributed Learning.",
                    "Network intrusion detection based on BiSRU and CNN.",
                    "Optimal Variable Momentum Factor Algorithm for NPCA in Blind Source Separation.",
                    "A New Architecture of Underwater Acoustic Radiation Simulator Based on ARM.",
                    "ST-CFSFDP algorithm based on Euclidean distance constraint.",
                    "Fusion positioning based on WiFi and Bluetooth for the area around the corner of stairs.",
                    "MetaGater: Fast Learning of Conditional Channel Gated Networks via Federated Meta-Learning.",
                    "Certifiably-Robust Federated Adversarial Learning via Randomized Smoothing.",
                    "Federated Learning with Fair Worker Selection: A Multi-Round Submodular Maximization Approach.",
                    "Scaling Resilient Adversarial Patch.",
                    "Mesh Network Reliability Analysis for Ultra-Reliable Low-Latency Services.",
                    "A Model for Coherent Communication Gain in Distributed Wireless Networks.",
                    "Distributed Game-Theoretical Task Offloading for Mobile Edge Computing.",
                    "Online Resource Allocation in Edge Computing Using Distributed Bidding Approaches.",
                    "A Resilient and Robust Edge-Cloud Network System Supporting CPS.",
                    "Energy-Efficient Interactive 360° Video Streaming with Real-Time Gaze Tracking on Mobile Devices.",
                    "Edge Learning for Low-Latency Video Analytics: Query Scheduling and Resource Allocation.",
                    "Uncovering Value of Correlated Data: Trading Data based on Iterative Combinatorial Auction.",
                    "Blockchain Meets COVID-19: A Framework for Contact Information Sharing and Risk Notification System.",
                    "A Novel Internet-of-Drones and Blockchain-based System Architecture for Search and Rescue.",
                    "Stackelberg Game Based Resource Pricing and Scheduling in Edge-Assisted Blockchain Networks.",
                    "Malice-Aware Transaction Forwarding in Payment Channel Networks.",
                    "Achieving Physical Security through k-Barrier Coverage in Three-Dimensional Stealthy Lattice Wireless Sensor Networks.",
                    "How to Get Away with MoRTr: MIMO Beam Altering for Radio Window Privacy.",
                    "A UWB-Based Solution to the Distance Enlargement Fraud Using Hybrid ToF and RSS Measurements.",
                    "PLIO: Physical Layer Identification using One-shot Learning.",
                    "A Measurement Study of TVWS Wireless Channels in Crop Farms.",
                    "Experimental Study of Lifecycle Management Protocols for Batteryless Intermittent Communication.",
                    "Examination of Indoor Localization Techniques and Their Model Parameters.",
                    "np-CECADA: Enhancing Ubiquitous Connectivity of LoRa Networks.",
                    "Efficient Vehicle Counting Based On Time-Spatial Images By Neural Networks.",
                    "EDIR: Efficient Distributed Image Retrieval of Novel Objects in Mobile Networks.",
                    "MultiSense: Cross Labelling and Learning Human Activities Using Multimodal Sensing Data.",
                    "Preventing Handheld Phone Distraction for Drivers by Sensing the Gripping Hand.",
                    "Crashing Waves: An Empirical Vehicle-to-Barrier Communication Channel Model via Crash Tests.",
                    "MultiVTrain: Collaborative Multi-View Active Learning for Segmentation in Connected Vehicles.",
                    "Efficient Route Selection for Drone-based Delivery Under Time-varying Dynamics.",
                    "Hybrid Analog-Digital Sensing Approach for Low-power Real-time Anomaly Detection in Drones.",
                    "DeepDMC: A Traffic Context Independent Deep Driving Maneuver Classification Framework.",
                    "A Control Policy based Driving Safety System for Autonomous Vehicles.",
                    "An Electric Vehicle Battery State-of-Health Estimation System with Aging Propagation Consideration.",
                    "Decentralized Multi-AGV Task Allocation based on Multi-Agent Reinforcement Learning with Information Potential Field Rewards.",
                    "CWmin Estimation and Collision Identification in Wi-Fi Systems.",
                    "Boosting Home WiFi Throughputs via Adaptive DAS Clustering of PLC Extenders.",
                    "Multi-Agent Reinforcement Learning-Based Cooperative Beam Selection in mmWave Vehicular Networks.",
                    "Joint Computing and Radio Resource Allocation in Cloud Radio Access Networks.",
                    "Occlusion Resilient Adversarial Attack for Person Re-identification.",
                    "Efficient Black-Box Adversarial Attacks for Deep Driving Maneuver Classification Models.",
                    "A Transfer Learning based Abnormal CAN Bus Message Detection System.",
                    "A Method of Flow Compensation Incentive based on Q-Learning for User Privacy Protection.",
                    "A Deep Learning-Based Intelligent Receiver for OFDM.",
                    "Research on Automatic Modulation Classification Technology under α Stable Distribution Noise.",
                    "Wi-Fi Based Indoor Location With Multi-parameter AP Selection and Device Heterogeneity Weakening.",
                    "Poster Abstract: The Effect of Digital Modulation Type on Radio Fingerprint Identification.",
                    "Entropy Change Rate for Traffic Anomaly Detection.",
                    "Digital Phenotyping for Spinal Cord Injury: Smartphone-based monitors for clinical utility.",
                    "Sustainability and Impactness of Smart-Agri Architecture on Environment.",
                    "A QoS-aware Routing based on Bandwidth Management in Software-Defined IoT Network.",
                    "TASLT: Triangular Area Segmentation based Localization Technique for Wireless Sensor Networks using AoA and RSSI Measures - A New Approach.",
                    "An Intrusion Detection System on Fog Architecture.",
                    "Congestion Control utilizing Software Defined Control Architecture at the Traffic Light Intersection.",
                    "Impact of Clustering Algorithms and Energy Harvesting Scheme on IoT/WSN Infrastructures.",
                    "Hardware Speculation Vulnerabilities and Mitigations.",
                    "Blockchain-Based Double Auction for Edge Cloud Resource Trading with Differential Privacy.",
                    "Privacy-Enhanced Crowdsourcing Data Trading based on Blockchain and Stackelberg Game.",
                    "FedDCS: Federated Learning Framework based on Dynamic Client Selection.",
                    "Pyrenote: a Web-based, Manual Annotation Tool for Passive Acoustic Monitoring.",
                    "Improvements to Worker Assignment in Bike Sharing Systems.",
                    "WiFi-based Contactless Gesture Recognition Using Lightweight CNN.",
                    "Safety Challenges and Solutions in Bike-Sharing Systems.",
                    "Enter At Your Own Risk: The Impacts of Joining a Hateful Subreddit.",
                    "Woolery: Toward Semantic Annotation of Structured Documents with FrameNet.",
                    "Toxic Comment Detection: Analyzing the Combination of Text and Emojis.",
                    "Platform for Comparative Study of Focus and Retention in Virtual Reality and Online Learning.",
                    "Analyzing Race and Citizenship Bias in Wikidata.",
                    "Pictures as a Form of Protest: A Survey and Analysis of Images Posted During the Stop Asian Hate Movement on Twitter.",
                    "Poster: A Vehicular Visible Light Communication Testbed Platform for Research and Teaching."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th MASS 2020",
        "info": "Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2020",
                "sub_name": "17th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2020, Delhi, India, December 10-13, 2020.",
                "count": 82,
                "papers": [
                    "A Malware Detection Approach Using Malware Images and Autoencoders.",
                    "Outdoor Playground Localization System for Tracking Young Children Using Ubisense Sensor Network.",
                    "FLaPS: Federated Learning and Privately Scaling.",
                    "Identification of Defective Nodes in Cyber-Physical Systems.",
                    "A Trustworthy Blockchain based framework for Impregnable IoV in Edge Computing.",
                    "Role of Blockchain in Forestalling Pandemics.",
                    "Tracing the Source of Fake News using a Scalable Blockchain Distributed Network.",
                    "Direction Finding with UWB and BLE: A Comparative Study.",
                    "Blockchain meets IoT: A Scalable Architecture for Security and Maintenance.",
                    "A Blockchain-based System for Secure Image Protection Using Zero-watermark.",
                    "DRE2: Achieving Data Resilience in Wireless Sensor Networks: A Quadratic Programming Approach.",
                    "UAVs-Based Mobile Radars for Real-Time Highways Surveillance.",
                    "Centralized active tracking of a Markov chain with unknown dynamics.",
                    "A Self-adaptive Low Delay MAC Protocol For Event-driven Industrial Wireless Networks.",
                    "A Data-Driven Reinforcement Learning Based Multi-Objective Route Recommendation System.",
                    "A Dynamic Taxi Ride Sharing System Using Particle Swarm Optimization.",
                    "DOSP: Data Dissemination with Optimized and Secured Path for Ad-hoc Vehicular Communication Networks.",
                    "A WiFi-based Home Security System.",
                    "Adaptive Policy Tree Algorithm to Approach Collision-Free Transmissions in Slotted ALOHA.",
                    "Adaptive ViFi: A Dynamic Protocol for IoT Nodes in Challenged WiFi Network Conditions.",
                    "DTLS based secure group communication scheme for Internet of Things.",
                    "Aerial-DeepSearch: Distributed Multi-Agent Deep Reinforcement Learning for Search Missions.",
                    "ALOHA with Queue Sharing.",
                    "An Advanced Black-Box Adversarial Attack for Deep Driving Maneuver Classification Models.",
                    "CD-Guide: A Reinforcement Learning based Dispatching and Charging Approach for Electric Taxicabs.",
                    "Deep Learning Based Prediction Towards Designing A Smart Building Assistant System.",
                    "Deployment Scalability in Exposed Buffer Processing.",
                    "Distributed and Privacy Preserving Routing of Connected Vehicles to Minimize Congestion.",
                    "Dynamic Multi-level Privilege Control in Behavior-based Implicit Authentication Systems Leveraging Mobile Devices.",
                    "Effective Subcarrier Pairing for Hybrid Delivery in Relay Networks.",
                    "Towards Secure and Scalable UWB-based Positioning Systems.",
                    "FD-UWA: Full-Duplex Underwater Acoustic Comms via Self-Interference Cancellation in Space.",
                    "Fine-grained Urban Prediction via Sparse Mobile CrowdSensing.",
                    "GSAN: Graph Self-Attention Network for Interaction Measurement in Autonomous Driving.",
                    "A TORA-based Wireless Protocol for MANET with Low Routing Overhead at Link Layer.",
                    "An Adaptive Multi-objective Salp Swarm Algorithm for Efficient Demand Side Management.",
                    "Game Theoretic Storage Outsourcing in the Mobile Blockchain Mining Network.",
                    "Jointly Optimizing Sensing Pipelines for Multimodal Mixed Reality Interaction.",
                    "CTDMA: Color-aware TDMA Network System For Low latency and High Throughput in Dense D2D Wireless Network.",
                    "FSDM: Fast Recovery Saturation Attack Detection and Mitigation Framework in SDN.",
                    "Machine Learning on Camera Images for Fast mmWave Beamforming.",
                    "Multi-Armed-Bandit-based Shilling Attack on Collaborative Filtering Recommender Systems.",
                    "Multi-UAV Situational Awareness via Distributed and Approximate Computing Techniques.",
                    "Performance Evaluation of Wireless real-time Communication in Mobile Wearable Applications.",
                    "NoiseSenseDNN: Modeling DNN for Sensor Data to Mitigate the Effect of Noise in Edge Devices.",
                    "Out-of-Band Multiple Path Discovery Protocol for Robust In-Band Millimeter Wave Links.",
                    "Reducing Makespans of DAG Scheduling through Interleaving Overlapping Resource Utilization.",
                    "Reinforcement Learning based Scheduling for Cooperative EV-to-EV Dynamic Wireless Charging.",
                    "Enabling Secure RESTful Web Services in IoT using OpenStack.",
                    "Request and Share then Assign (RASTA): Task Assignment for Networked Multi-Robot Teams.",
                    "Reverse Auction-based Demand Response Program: A Truthful Mutually Beneficial Mechanism.",
                    "Dynamic Scheduling of an Autonomous PTZ Camera for Effective Surveillance.",
                    "Measuring and Optimizing Cell Selection of NB-IoT Network.",
                    "Multi-Agent Reinforcement Learning for Cooperative Edge Caching in Internet of Vehicles.",
                    "Autonomous Reckless Driving Detection Using Deep Learning on Embedded GPUs.",
                    "Fine-grained Frequencies for Simultaneous Intra-Group One-to-All Dissemination.",
                    "New Algorithm of QoS Constrained Routing for Node Energy Optimization of Edge Computing.",
                    "Offloading Federated Learning Task to Edge Computing with Trust Execution Environment.",
                    "Design of Temperature-Aware Routing for IEEE 802.15.6 Based Wireless Body Area Networks.",
                    "Online Energy-efficient Scheduling Algorithm for Renewable Energy-powered Roadside units in VANETs.",
                    "Online Trip Planning for Public Bike Systems.",
                    "Posture Tracking Meets Fitness Coaching: A Two-Phase Optimization Approach with Wearable Devices.",
                    "Scalable, Memory-efficient Pending Interest Table of Named Data Networking.",
                    "Routing via Multiple Paths and Multiple Technologies in IoT Networks: Proof-of-Concept Demonstration.",
                    "TinyCSI: A Rapid Development Framework for CSI-based Sensing Applications.",
                    "Robust, Fine-Grained Occupancy Estimation via Combined Camera & WiFi Indoor Localization.",
                    "Secure and Privacy-preserving Traffic Monitoring in VANETs.",
                    "Secure and User Efficient EAP-based Authentication Protocol for IEEE 802.11 Wireless LANs.",
                    "Service Function Chain Deployment with Guaranteed Resilience.",
                    "Sherlock: A Crowd-sourced System For Automatic Tagging Of Indoor Floor Plans.",
                    "Slimmer: Accelerating 3D Semantic Segmentation for Mobile Augmented Reality.",
                    "Towards a Unified Trust Framework for Detecting IoT Device Attacks in Smart Homes.",
                    "Deep Reinforcement Learning for Computation Offloading and Caching in Fog-Based Vehicular Networks.",
                    "Spectrum Sharing in CBRS Using Blockchain.",
                    "Station Correlation Attention Learning for Data-driven Bike Sharing System Usage Prediction.",
                    "Virtual Step PIN Pad: Towards Foot-input Authentication Using Geophones.",
                    "Virtual Inertial Sensors with Fine Time Measurements.",
                    "Towards Environment-independent Behavior-based User Authentication Using WiFi.",
                    "Vehicular Edge Computing Based Driver Recommendation System Using Federated Learning.",
                    "Vision Powered Conversational AI for Easy Human Dialogue Systems.",
                    "Voice Liveness Detection for Voice Assistants using Ear Canal Pressure.",
                    "ZCNET: Achieving High Capacity in Low Power Wide Area Networks."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th MASS 2019",
        "info": "Monterey, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2019",
                "sub_name": "16th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2019, Monterey, CA, USA, November 4-7, 2019.",
                "count": 55,
                "papers": [
                    "System Level Analysis for ITS-G5 and LTE-V2X Performance Comparison.",
                    "Recognizing Driver Talking Direction in Running Vehicles with a Smartphone.",
                    "Optimizing In-Motion Wireless Charging Service Efficiency for Electric Vehicles: A Game Theoretic Approach.",
                    "Challenges of Designing Computer Vision-Based Pedestrian Detector for Supporting Autonomous Driving.",
                    "On Decision Making In Human-Machine Networks.",
                    "Sitara: Spectrum Measurement Goes Mobile Through Crowd-Sourcing.",
                    "Incentive Mechanisms for Spatio-Temporal Tasks in Mobile Crowdsensing.",
                    "Cost-Efficient Worker Trajectory Planning Optimization in Spatial Crowdsourcing Platforms.",
                    "Achieving Sensing k-Coverage Using Hexagonal Tiling: Are We Done Yet?",
                    "Towards Accurate Bit Error Simulation in Wireless Sensor Networks Including Environmental Influences.",
                    "A BLE-Based Multi-Gateway Network Infrastructure with Handover Support for Mobile BLE Peripherals.",
                    "Multiple Resolution Bit Tracking Protocol for Continuous RFID Tag Identification.",
                    "SHAD: Privacy-Friendly Shared Activity Detection and Data Sharing.",
                    "A Privacy-Preserving Order Dispatch Scheme for Ride-Hailing Services.",
                    "FDTLS: Supporting DTLS-Based Combined Storage and Communication Security for IoT Devices.",
                    "Falcon - A Flexible Architecture For Accelerating Cryptography.",
                    "Securing ADS-B with Multi-Point Distance-Bounding for UAV Collision Avoidance.",
                    "Enabling the Mobile IoT: Wake-up Unmanned Aerial Systems for Long-Lived Data Collection.",
                    "AirBeam: Experimental Demonstration of Distributed Beamforming by a Swarm of UAVs.",
                    "Evaluating LTE Coverage and Quality from an Unmanned Aircraft System.",
                    "KALOHA: ike i ke ALOHA.",
                    "Improving Carrier-Sense Multiple Access Using Cues of Channel Utilization.",
                    "Cross-Technology Clear Channel Assessment for Low-Power Wide Area Networks.",
                    "AWARE: Adaptive Wi-Fi Power Save Operation Coexisting with LTE-U.",
                    "GaaS: Adaptive Cross-Platform Gateway for IoT Applications.",
                    "rIoT: Enabling Seamless Context-Aware Automation in the Internet of Things.",
                    "ForeSee: A Cross-Layer Vulnerability Detection Framework for the Internet of Things.",
                    "Congestion-Tolerant Framework for IoT Applications.",
                    "Towards Wireless Environment Cognizance Through Incremental Learning.",
                    "Evaluating and Boosting Reinforcement Learning for Intra-Domain Routing.",
                    "Deep Neural Network Ensembles Against Deception: Ensemble Diversity, Accuracy and Robustness.",
                    "Using Graphical Models as Explanations in Deep Neural Networks.",
                    "Privacy-Preserving MEC-Enabled Contextual Online Learning via SDN for Service Selection in IoT.",
                    "Energy-Latency-Aware Task Offloading and Approximate Computing at the Mobile Edge.",
                    "QoS Provisioning in 60 GHz Communications by Physical and Transport Layer Coordination.",
                    "EV-CAST: Interference and Energy-Aware Video Multicast Exploiting Collaborative Relays.",
                    "Bio-DRN: Robust and Energy-Efficient Bio-Inspired Disaster Response Networks.",
                    "Mobile Energy Balancing in Heterogeneous Opportunistic Networks.",
                    "Identifying User Communities Using Deep Learning and Its Application to Opportunistic Networking.",
                    "Age of Information for Wireless Energy Harvesting Secondary Users in Cognitive Radio Networks.",
                    "Storage on the Edge: Evaluating Cloud Backed Edge Storage in Cyberphysical Systems.",
                    "DeepHeart: Accurate Heart Rate Estimation from PPG Signals Based on Deep Learning.",
                    "UW-SVC: Scalable Video Coding Transmission for In-Network Underwater Imagery Analysis.",
                    "QBT: Queue-Size Based Busy Tones for Protecting Multihop Low-Power Networks.",
                    "Multicast Scheduling Algorithms for Battery-Free Wireless Sensor Networks.",
                    "Facility Location Strategy for Minimizing Cost in Edge-Based Mobile Crowdsensing.",
                    "Liam: An Architectural Framework for Decentralized IoT Networks.",
                    "Distributed Dataset Synchronization in Disruptive Networks.",
                    "RadioLoc: Learning Vehicle Locations with FM Signal in All-Terrain Environments.",
                    "Device-Free Acoustic Motion Tracking over Targets with Large Sizes.",
                    "Solar-TK: A Data-Driven Toolkit for Solar PV Performance Modeling and Forecasting.",
                    "Securing IoT Protocol Implementations Through Hardware Monitoring.",
                    "DeepWiTraffic: Low Cost WiFi-Based Traffic Monitoring System Using Deep Learning.",
                    "LAD: Learning Access Control Polices and Detecting Access Anomalies in Smart Environments.",
                    "AMAZE: Recognizing Speakers with Amazon's Echo Dot Device."
                ]
            },
            {
                "sub_name_abbr": "conf/mass/2019w",
                "sub_name": "16th IEEE International Conference on Mobile Ad Hoc and Sensor Systems Workshops, MASS Workshops 2019, Monterey, CA, USA, November 4-7, 2019.",
                "count": 42,
                "papers": [
                    "Using Deep-Learning-Based Memory Analysis for Malware Detection in Cloud.",
                    "Machine Learning for Security at the IoT Edge - A Feasibility Study.",
                    "Kin Genomic Data Inference Attacks Through Factor Graph.",
                    "The Adversarial Attacks Threats on Computer Vision: A Survey.",
                    "Pattern-Adaptive Time Series Prediction via Online Learning and Paralleled Processing using CUDA.",
                    "Detecting Abnormal Behaviors in Smart Home.",
                    "On the Generality of Facial Forgery Detection.",
                    "Assuring the Integrity of Videos from Wireless-Based IoT Devices using Blockchain.",
                    "Server-Side Fingerprint-Based Indoor Localization Using Encrypted Sorting.",
                    "Creating Simple Adversarial Examples for Speech Recognition Deep Neural Networks.",
                    "Adaptive Sampling for Low-Power Wearable and Implantable Devices.",
                    "Multiplatform Stereoscopic 3D Terrain Mapping for UAV Localization.",
                    "Cognitive Distraction to Improve Cybersickness in Virtual Reality Environment.",
                    "Autonomous Refueling Strategies using Vehicle-to-Infrastructure Communication in Smart Cities.",
                    "Efficient Safe Learning for Robotic Systems in Unstructured Environments.",
                    "Automated Dynamic Detection of Self-Hiding Behavior.",
                    "Motion Tracking for Volumetric Motion Capture Data.",
                    "Secure Over-The-Air Firmware Updates for Sensor Networks.",
                    "D-SEA: The Underwater Depth Sensing Device for Standalone Time-Averaged Measurements.",
                    "Using Transfer Learning, SVM, and Ensemble Classification to Classify Baby Cries Based on Their Spectrogram Images.",
                    "Graphics Card Based Fuzzing.",
                    "Dual Output Isolated DC-DC Full-Bridge Converter with Six Power Switches.",
                    "Intrusion Detection For Controller Area Network Using Support Vector Machines.",
                    "Optimizing Traditional Transforms for Vehicular Network Sign Classification.",
                    "HYLOC - A Hybrid Localization and Communication System for Vehicles in Mixed Terrain Environments.",
                    "The Design and Implementation of a RESTful IoT Service Using the MERN Stack.",
                    "Performance Modeling and Verification of Load Balancing in Cloud Systems Using Formal Methods.",
                    "MACH-2K Architecture: Building Mobile Device Trust and Utility for Emergency Response Networks.",
                    "Dynamic Timer Based on Expected Link Duration in Mobile Ad Hoc Networks.",
                    "Implementation of AODV-UU on Linux 4.15 Kernel.",
                    "Offloading Tasks to Vehicular Virtual Edge Servers.",
                    "Lane Change Advisory by Vehicular Micro Clouds.",
                    "A Geo-Obfuscation Approach to Protect Worker Location Privacy in Spatial Crowdsourcing Systems.",
                    "Drone Noise Reduction using Deep Convolutional Autoencoder for UAV Acoustic Sensor Networks.",
                    "Implementation of Low-Latency Message Delivery for Serverless Based Workflow.",
                    "Demo: Towards the Development of a Differentially Private Lightweight and Scalable Blockchain for IoT.",
                    "An Experimental Study of Cellular Data Offloading in Urban and University Scenarios.",
                    "Performance Evaluation of Sensors Lightweight Security Mechanism.",
                    "Software-Based Implementation of Dual Connectivity for LTE.",
                    "Demo Abstract: Cost-Effective Crowdsensing: Spectrum Monitoring with Sitara.",
                    "SCoRe: Scheduling Commands and Responses for Multihop Low-Power Wireless Network.",
                    "Topology Update Algorithm for Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th MASS 2018",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2018",
                "sub_name": "15th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2018, Chengdu, China, October 9-12, 2018.",
                "count": 75,
                "papers": [
                    "Privacy Enabled Noise Free Data Collection in Vehicular Networks.",
                    "Efficient and Privacy-Preserving Ad Conversion for V2X-Assisted Proximity Marketing.",
                    "WDMTI: Wireless Device Manufacturer and Type Identification Using Hierarchical Dirichlet Process.",
                    "Defending Against Voice Spoofing: A Robust Software-Based Liveness Detection System.",
                    "Multi-person Sleeping Respiration Monitoring with COTS WiFi Devices.",
                    "SecT: A Lightweight Secure Thing-Centered IoT Communication System.",
                    "Q-Learning Based Edge Caching Optimization for D2D Enabled Hierarchical Wireless Networks.",
                    "MRDroid: A Multi-act Classification Model for Android Malware Risk Assessment.",
                    "Dynamic Service Caching in Mobile Edge Networks.",
                    "Placement of Highly Available Virtual Network Functions Through Local Rerouting.",
                    "A Dynamic Resource Overbooking Mechanism in Fog Computing.",
                    "LPDA-EC: A Lightweight Privacy-Preserving Data Aggregation Scheme for Edge Computing.",
                    "Performance Evaluation of Rate Adaptation Algorithms in IEEE802.11p Heterogeneous Vehicular Networks.",
                    "Cloud-Based Collision-Aware Energy-Minimization Vehicle Velocity Optimization.",
                    "Achieving Stable and Optimal Passenger-Driver Matching in Ride-Sharing System.",
                    "inLaneCom: Enabling In-lane Vehicular Communication Using on-Board Smartphones.",
                    "The Energy Replenishment Problem in Mobile WRSNs.",
                    "Multi-node Mobile Charging Scheduling with Deadline Constraints.",
                    "Enhancing Smartphone-Based Multi-modal Indoor Localization with Camera and WiFi Signal.",
                    "Content-Aware Caching in SDN-Enabled Virtualized Wireless D2D Networks to Reduce Visiting Latency.",
                    "A Spectrum Aware Routing Protocol in Cognitive Radio Ad Hoc Networks.",
                    "Hierarchical Routing for Unmanned Aerial Vehicle Relayed Tactical Ad Hoc Networks.",
                    "Deep Learning Based Urban Post-Accidental Congestion Prediction.",
                    "Design and Implementation of an Integrated Visible Light Communication and WiFi System.",
                    "Top-Down Indoor Localization with Wi-Fi Fingerprints Using Deep Q-Network.",
                    "Achieving Energy Efficiency Through Dynamic Computing Offloading in Mobile Edge-Clouds.",
                    "Randomized Single-Path Flow Routing on SDN-Aware Wi-Fi Mesh Networks.",
                    "Cloud Control to Optimize Real-Time Video Transmission in Dense IEEE 802.11aa/ax Networks.",
                    "Improving Neighbor Discovery by Operating at the Quantum Scale.",
                    "Using Wireless Tags to Monitor Bodily Oscillation.",
                    "Evaluation of Suitable Radio Frequencies for Data Transmission in Potato Warehouses.",
                    "Enabling Edge Intelligence for Activity Recognition in Smart Homes.",
                    "Low-Latency Authentication Against Satellite Compromising for Space Information Network.",
                    "Voiceprint-Based Access Control for Wireless Insulin Pump Systems.",
                    "BF-IoT: Securing the IoT Networks via Fingerprinting-Based Device Authentication.",
                    "Minimum Cost Seed Selection for Multiple Influences Diffusion in Communities.",
                    "Leveraging Smart Lights for Passive Localization.",
                    "Embracing Spatial Awareness for Reliable WiFi-Based Indoor Location Systems.",
                    "RF-Brush: 3D Human-Computer Interaction via Linear Tag Array.",
                    "Low-Cost Mapping of RFID Tags Using Reader-Equipped Smartphones.",
                    "SmartRetro: Blockchain-Based Incentives for Distributed IoT Retrospective Detection.",
                    "Space-Efficient and Dynamic Caching for D2D Networks of Heterogeneous Users.",
                    "Delay Efficient Data Aggregation Scheduling in Multi-channel Duty-Cycled WSNs.",
                    "Theoretical Round Modification Fault Analysis on AEGIS-128 with Algebraic Techniques.",
                    "Fast Interference-Aware Scheduling of Multiple Wireless Chargers.",
                    "Alano: An Efficient Neighbor Discovery Algorithm in an Energy-Restricted Large-Scale Network.",
                    "Multi-hop Deflection Routing Algorithm Based on Q-Learning for Energy-Harvesting Nanonetworks.",
                    "Cloud Assisted Traffic Redundancy Elimination for Power Efficiency in Smartphones.",
                    "WSN Scheduling for Energy-Efficient Correction of Environmental Modelling.",
                    "A Hint-Based Random Access Protocol for mMTC in 5G Mobile Network.",
                    "Sense and Deploy: Blockage-Aware Deployment of Reliable 60 GHz mmWave WLANs.",
                    "CREAM: Unauthorized Secondary User Detection in Fading Environments.",
                    "CORTEN: A Real-Time Accurate Indoor White Space Prediction Mechanism.",
                    "Holmes: Tackling Data Sparsity for Truth Discovery in Location-Aware Mobile Crowdsensing.",
                    "Multi-expertise Aware Participant Selection in Mobile Crowd Sensing via Online Learning.",
                    "Privacy Preserving and Cost Optimal Mobile Crowdsensing Using Smart Contracts on Blockchain.",
                    "GreenMap: Approximated Filtering Towards Energy-Aware Crowdsensing for Indoor Mapping.",
                    "Robust State Prediction with Incomplete and Noisy Measurements in Collaborative Sensing.",
                    "Error Analysis on RSS Range-Based Localization Based on General Log-Distance Path Loss Model.",
                    "Joint Optimization of Traffic and Computation Offloading in UAV-Assisted Wireless Networks.",
                    "A Privacy-User-Friendly Scheme for Wearable Smart Sensing Devices Based on Blockchain.",
                    "Distributed Kalman Filter with Consensus Strategies for Internet of Things Network.",
                    "An Improved Characters Recognition Approach Using Fast Determinant Recursion.",
                    "A Method of Linear Regression Model Building for Healthy Pupae Number Based on Common Characters Indicators.",
                    "A Fusion Method of Multiple Sensors Data on Panorama Video for Airport Surface Surveillance.",
                    "Physical Intrusion Detection System Based on Behavioral Sign Recognition.",
                    "Quantifying the Reversibility of Protocol Format.",
                    "Five Important Attack in Round Function Using SIMECK Algorithm.",
                    "A Web Attack Detection Technology Based on Bag of Words and Hidden Markov Model.",
                    "A Framework to Data Delivery Security for Big Data Annotation Delivery System.",
                    "Data Scheduling Based on Data Label in Hybrid Storage Architecture.",
                    "A Comparison of Moving Target Defense Strategies.",
                    "Iterative Anomaly Detection Algorithm Based on Time Series Analysis.",
                    "A Solution for Mobility Management in Software Defined VANET.",
                    "Scalable and Privacy Preserving Routing in Mobile Social Networks."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th MASS 2017",
        "info": "Orlando, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2017",
                "sub_name": "14th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2017, Orlando, FL, USA, October 22-25, 2017.",
                "count": 98,
                "papers": [
                    "ActDetector: Detecting Daily Activities Using Smartwatches.",
                    "M^2G: A Monitor of Monitoring Systems with Ground Truth Validation Features for Research-Oriented Residential Applications.",
                    "Private Space Monitoring with SoC-Based Smart Cameras.",
                    "Predictability and Prediction of Human Mobility Based on Application-Collected Location Data.",
                    "Protecting Glossy-Based Wireless Networks from Packet Injection Attacks.",
                    "Multi-message Authentication over Noisy Channel with Polar Codes.",
                    "BAN-GZKP: Optimal Zero Knowledge Proof Based Scheme for Wireless Body Area Networks.",
                    "Providing Trust in Ubiquitous and Pervasive IoT Network.",
                    "QUAC: Quality-Aware Contract-Based Incentive Mechanisms for Crowdsensing.",
                    "SalsaAsst: Beat Counting System Empowered by Mobile Devices to Assist Salsa Dancers.",
                    "SubTrack: Enabling Real-Time Tracking of Subway Riding on Mobile Devices.",
                    "A Robust Sign Language Recognition System with Sparsely Labeled Instances Using Wi-Fi Signals.",
                    "An Evolutionary Multi-player Game Model for Two-Hop Routing in Delay Tolerant Networks.",
                    "A Relay Selection Strategy Based on Power-Law and Exponentially Distributed Contacts in DTNs.",
                    "Neighborhood-Aware Opportunistic Networking on Smartphones.",
                    "A Delay-Guaranteed Geographic Routing Protocol with Hole Avoidance in WSNs.",
                    "Energy-Aware Advertising Through Quality-Aware Prefetching on Smartphones.",
                    "Kinaara: Distributed Discovery and Allocation of Mobile Edge Resources.",
                    "Capitalizing on the Promise of Ad Prefetching in Real-World Mobile Systems.",
                    "Mobile Crowd Sensing via Online Communities: Incentive Mechanisms for Multiple Cooperative Tasks.",
                    "SSFB: Signal-Space-Frequency Beamforming for Underwater Acoustic Video Transmission.",
                    "On AP Assignment and Transmission Scheduling for Multi-AP 60 GHz WLAN.",
                    "OppoScan: Enabling Fast Handoff in Dense 802.11 WMNs via Opportunistic Probing with Virtual Radio.",
                    "Relay Selection and Scheduling for Millimeter Wave Backhaul in Urban Environments.",
                    "A Protocol for Link Blockage Mitigation in mm-Wave Networks.",
                    "Cooperative Wireless Charging Vehicle Scheduling.",
                    "LISIC: A Link Stability-Based Protocol for Vehicular Information-Centric Networks.",
                    "Evaluating the Accuracy of Vehicular Channel Models in a Large-Scale DSRC Test.",
                    "Vehicle-to-Vehicle LOS Large-Scale Doppler Channel Model Using GSCM.",
                    "WHARP: A Wake-Up Radio and Harvesting-Based Forwarding Strategy for Green Wireless Networks.",
                    "Context-Aware Configuration and Management of WiFi Direct Groups for Real Opportunistic Networks.",
                    "Harmonious Coexistence and Efficient Spectrum Sharing for LTE-U and Wi-Fi.",
                    "ASPIS: A Holistic and Practical Mechanism for Efficient MTC Support over Mobile Networks.",
                    "AWuR: An Adaptive Routing Protocol for Energy Efficient Two-Platform Nodes in Wireless DTNs.",
                    "Joint Optimization in Software Defined Wireless Networks with Network Coded Opportunistic Routing.",
                    "Indoor Localization with Smart Antenna System: Multipath Mitigation with MIMO Beamforming Scheme.",
                    "Maintaining Connectivity in Ad Hoc Networks Through WiFi Direct.",
                    "Efficient Management of Certificate Revocation Lists in Smart Grid Advanced Metering Infrastructure.",
                    "Convex Polyhedral Space-Fillers Based Connected k-Coverage in Three-Dimensional Wireless Sensor Networks.",
                    "PMViewer: A Crowdsourcing Approach to Fine-Grained Urban PM2.5 Monitoring in China.",
                    "Large-Scale Trip Planning for Bike-Sharing Systems.",
                    "ABAid: Navigation Aid for Blind People Using Acoustic Signal.",
                    "A Convolutional Neural Network for Transportation Mode Detection Based on Smartphone Platform.",
                    "A Neural Network Approach for Truth Discovery in Social Sensing.",
                    "Preserving Graph Utility in Anonymized Social Networks? A Study on the Persistent Homology.",
                    "3-Dimensional Localization via RFID Tag Array.",
                    "BridgeLoc: Bridging Vision-Based Localization for Robots.",
                    "A Graphical Model Approach for Efficient Geomagnetism-Pedometer Indoor Localization.",
                    "Robust Target Localization Based on Squared Range Iterative Reweighted Least Squares.",
                    "Situated Wireless Networks Optimisation Through Model-Based Relocation of Nodes.",
                    "Analog Signal Compression and Multiplexing Techniques for Healthcare Internet of Things.",
                    "Impact of the Aggregated Data Sizes on the Optimality of Multi-level Clustering.",
                    "Accurate and Timely Situation Awareness Retrieval from a Bandwidth Constrained Camera Network.",
                    "Cross-Environmentally Robust Intruder Discrimination in Radar Motes.",
                    "Opportunistic Multiparty Calibration for Robust Participatory Sensing.",
                    "Estimation of Time Variant System Clock Period for Wireless Sensor Network Applications.",
                    "Dynamic Sensor Selection for Reliable Spectrum Sensing via E-Optimal Criterion.",
                    "Mobee: Mobility-Aware Energy-Efficient Coded Caching in Cloud Radio Access Networks.",
                    "Elastic-Net: Boosting Energy Efficiency and Resource Utilization in 5G C-RANs.",
                    "On the Understanding of Interdependency of Mobile App Usage.",
                    "An Adaptive Handover Trigger Strategy for 5G C/U Plane Split Heterogeneous Network.",
                    "PreDA: Preference-Based Double Auction for Heterogeneous Multi-channel DSA Networks.",
                    "LILI Version2: A Low-Cost Robot that Tells Interactive Stories and Recognizes Objects.",
                    "Action Recognition Through Device Sensors.",
                    "Battery-Free Sensor Network Based Navigation Systems: Theory and Applications.",
                    "Crowdsourcing-Based Musical Predictions.",
                    "NFC Unlock: Secure Two-Factor Computer Authentication Using NFC.",
                    "Performance Analysis of Routing Protocols in Delay Tolerant Networks.",
                    "Real-Time Operating Hand Detection for the Optimization of Mobile Web Interfaces.",
                    "Hyperprofile-Based Computation Offloading for Mobile Edge Networks.",
                    "Predicting Zillow Estimation Error Using Linear Regression and Gradient Boosting.",
                    "Are Recent Terrorism Trends Reflected in Social Media?",
                    "The Effect of Relay Node and Power Control on Performance in Multi-hop Wireless Network.",
                    "A Cancellable and Privacy-Preserving Facial Biometric Authentication Scheme.",
                    "Exposing Vulnerabilities in Mobile Networks: A Mobile Data Consumption Attack.",
                    "Using Persistent Homology to Represent Online Social Network Graphs.",
                    "Digital Immunization Surveillance: Monitoring Flu Vaccination Rates Using Online Social Networks.",
                    "An Authentication Framework for Electric Vehicle-to-Electric Vehicle Charging Applications.",
                    "TETRIS: Smartphone-to-Smartphone Screen-Based Visible Light Communication.",
                    "Indoor Localization Through Visible Light Characterization Using Front-Facing Smartphone Camera.",
                    "Cybergrenade: Automated Exploitation of Local Network Machines via Single Board Computers.",
                    "Integration of Dynamic Road Condition Updates for Real-Time Ridesharing Systems.",
                    "Can Architecture Design Help Eliminate Some Common Vulnerabilities?",
                    "Reducing Frequency of Request Communications with Pro-Active and Aggregated Power Management for the Controlled Delivery Power Grid.",
                    "A Survey of Buffer Management Strategies in Delay Tolerant Networks.",
                    "A Novel Distributed Fog-Based Networked Architecture to Preserve Energy in Fog Data Centers.",
                    "Green Path: Optimization Model for Network Energy Efficiency Using Adaptive Link Rate.",
                    "Energy - Service Trade-Off Model for Mobile Cloud Computing.",
                    "Dos and Donts Integrated System Based on GPS and Cloud Technologies for Pilgrims.",
                    "Using Logistic Regression to Improve Virtual Machines Management in Cloud Computing Systems.",
                    "Autonomous Workload Balancing in Cloud Federation Environments with Different Access Restrictions.",
                    "Biomedical Epilepsy Multiprocessor Network on Chip EEG Utilizing IEEE802.11n Systems.",
                    "Enhanced Stability Routing Scheme against Radio Jamming Based on NDL in Multi-hop Wireless Networks.",
                    "Live VM Migration Across Cloud Data Centers.",
                    "ORSIN: One-Request Scheme for Smart Urban Sensing in Software-Defined IoT Networks.",
                    "Study of Internet-of-Things Messaging Protocols Used for Exchanging Data with External Sources.",
                    "Optimization of Garbage Collection Using Genetic Algorithm.",
                    "A Simulation Study of Response Times in Cloud Environment for IoT-Based Healthcare Workloads."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th MASS 2016",
        "info": "Brasília, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2016",
                "sub_name": "13th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2016, Brasília, Brazil, October 10-13, 2016.",
                "count": 53,
                "papers": [
                    "Mobile Traffic Data Decomposition for Understanding Human Urban Activities.",
                    "Slow Start Transition in Participatory Sensing Applications.",
                    "Resource-Aware Approaches for Truth Analysis in Crowdsourcing.",
                    "Efficient NC-OFDM-Based Control Channel Establishment in Cognitive Radio Networks.",
                    "TrafficVision: A Case for Pushing Software Defined Networks to Wireless Edges.",
                    "Hybrid MAC Protocols for Low-Delay Scheduling.",
                    "Sleeping Beauty: Efficient Communication for Node Scheduling.",
                    "Administrative Regions Discovery Based on Human Mobility Patterns and Spatio-Temporal Clustering.",
                    "Mutually Exclusive Data Dissemination in the Mobile Publish/Subscribe System.",
                    "An Efficient Walking Safety Service for Distracted Mobile Users.",
                    "Measurement-Driven Capability Modeling for Mobile Network in Large-Scale Urban Environment.",
                    "Energy Balance with Peer-to-Peer Wireless Charging.",
                    "Event Detection through Differential Pattern Mining in Internet of Things.",
                    "Into the SMOG: The Stepping Stone to Centralized WSN Control.",
                    "Fault-Tolerant and Constrained Relay Node Placement in Wireless Sensor Networks.",
                    "Efficient Online Collaborative Caching in Cellular Networks with Multiple Base Stations.",
                    "More is Better? Measurement of MPTCP Based Cellular Bandwidth Aggregation in the Wild.",
                    "Octopus: A Cooperative Hierarchical Caching Strategy for Cloud Radio Access Networks.",
                    "Directional Antennas for Convergecast in Wireless Sensor Networks: Are They a Good Idea?",
                    "Energy Harvesting Wireless Sensor Networks: From Characterization to Duty Cycle Dimensioning.",
                    "FlushMF: A Transport Protocol Using Multiple Frequencies for Wireless Sensor Network.",
                    "Track Your Foot Step: Anchor-Free Indoor Localization Based on Sensing Users' Foot Steps.",
                    "Calibration-Free Signal-Strength Localization Using Product-Moment Correlation.",
                    "WaveLoc: Wavelet Signatures for Ubiquitous Localization.",
                    "KickLoc: Simple, Distributed Localization for Wireless Sensor Networks.",
                    "A Multi-Copy Delegation Forwarding Based on Short-Term and Long-Term Speed in DTNs.",
                    "Amphisbaena: A Two-Platform DTN Node.",
                    "PASOR: A Packet Salvaging Model for Opportunistic Routing Protocols.",
                    "Gamma Deployment: Designing the Communication Infrastructure in Vehicular Networks Assuring Guarantees on the V2I Inter-Contact Time.",
                    "A Decentralized Network with Fast and Lightweight Autonomous Channel Selection in Vehicle Platoons for Collision Avoidance.",
                    "TOP: Vehicle Trajectory Based Driving Speed Optimization Strategy for Travel Time Minimization and Road Congestion Avoidance.",
                    "UniCoor: A Smartphone Unified Coordinate System for ITS Applications.",
                    "A Privacy-Preserving Multi-Authority Attribute-Based Encryption Approach for Mobile Healthcare.",
                    "BANZKP: A Secure Authentication Scheme Using Zero Knowledge Proof for WBANs.",
                    "Fully Distributed Public Key Management through Digital Signature Chains for Delay and Disrupt Tolerant Networks.",
                    "A Review on Big Data Analysis and Internet of Things.",
                    "Toward Anonymizing IoT Data Streams via Partitioning.",
                    "Data Provenance in Environmental Monitoring.",
                    "A Testbed for Security and Privacy Analysis of IoT Devices.",
                    "Visual Analytics Improving Data Understandability in IoT Projects: An Overview of the U. S. DOE ARM Program Data Science Tools.",
                    "Sensing and Actuation in IoT: An Autonomous Rule Based Approach.",
                    "IEEE 802.15.4e TSCH Mode Performance Analysis.",
                    "Smart Surveillance with Context and Location Sensitivity and Quality Control.",
                    "Demonstration of the Wireless Two-Platform DTN Node Amphisbaena.",
                    "Effects of Interference on the Performance of Dual-Hop Fixed-Gain Relaying with Antenna Array at Destination.",
                    "A Framework for Implementing the Concept of Citizen as a Sensor.",
                    "Software Defined Mobile Network for Flexible Deployments of Various IoT Applications.",
                    "Cloud Robotic Clone-Based in Mobile Ad-Hoc Network of CellBot Team.",
                    "On the Performance of DF Relay Selection with Optimum Combining and Co-Channel Interference.",
                    "Aggregating Small Packets in M2M Networks: An OM2M Implementation.",
                    "Recurrent Neural Networks for Transmission Opportunity Forecasting.",
                    "Anomalies Detection in Wireless Sensor Networks Using Bayesian Changepoints.",
                    "Fog Networks in Healthcare Application."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th MASS 2015",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2015",
                "sub_name": "12th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2015, Dallas, TX, USA, October 19-22, 2015.",
                "count": 100,
                "papers": [
                    "Rado: A Randomized Auction Approach for Data Offloading via D2D Communication.",
                    "Rally: Device-to-Device Content Sharing in LTE Networks as a Game.",
                    "Device-to-Device Load Balancing for Cellular Networks.",
                    "Integration of Spectrum Database and Sensing Results for Hybrid Spectrum Access Systems.",
                    "What Goes Around Comes Around: Mobile Bandwidth Sharing and Aggregation.",
                    "Cloud-CFFR: Coordinated Fractional Frequency Reuse in Cloud Radio Access Network (C-RAN).",
                    "An Energy Efficient and Restricted Tour Construction for Mobile Sink in Wireless Sensor Networks.",
                    "A Context Aware Energy-Saving Scheme for Smart Camera Phones Based on Activity Sensing.",
                    "An Energy-Efficient and Distributed Cooperation Mechanism for k-Coverage Hole Detection and Healing in WSNs.",
                    "Adaptive Distributed Reader Activation Approach for Large-Scale RFID Systems.",
                    "MQCC: Maximum Queue Congestion Control for Multipath Networks with Blockage.",
                    "A Percolation-Based Approach to Model DTN Congestion Control.",
                    "A Novel Wireless Resource Allocation Algorithm in Hybrid Data Center Networks.",
                    "Dynamic Radio Cooperation for Downlink Cloud-RANs with Computing Resource Sharing.",
                    "Quality-Aware Online Task Assignment in Mobile Crowdsourcing.",
                    "Dynamic Participant Recruitment of Mobile Crowd Sensing for Heterogeneous Sensing Tasks.",
                    "Combining Map-Based Inference and Crowd-Sensing for Detecting Traffic Regulators.",
                    "Towards Time-Sensitive Truth Discovery in Social Sensing Applications.",
                    "Retraining and Dynamic Privilege for Implicit Authentication Systems.",
                    "CLIP: Continuous Location Integrity and Provenance for Mobile Phones.",
                    "Achieving Bilateral Utility Maximization and Location Privacy Preservation in Database-Driven Cognitive Radio Networks.",
                    "Black SDN for the Internet of Things.",
                    "GreedyFlow: Distributed Greedy Packet Routing between Landmarks in DTNs.",
                    "Software Defined Mobile Multicast.",
                    "Enhanced Time-Slotted Channel Hopping in WSNs Using Non-intrusive Channel-Quality Estimation.",
                    "Smartphones and BLE Services: Empirical Insights.",
                    "Shine: A Step Towards Distributed Multi-Hop Visible Light Communication.",
                    "Improved 5.9GHz V2V Short Range Path Loss Model.",
                    "Improving Neighbor Discovery with Slot Index Synchronization.",
                    "Scaling Laws of Social-Broadcast Capacity for Mobile Ad Hoc Social Networks.",
                    "Sparsity-Cognizant Multiple-Access Schemes for Large Wireless Networks with Node Buffers.",
                    "Numerical Analysis of Complex Physical Systems on Networked Mobile Devices.",
                    "Enabling TCP in Mobile Cyber-Physical Systems.",
                    "BraceAssertion: Runtime Verification of Cyber-Physical Systems.",
                    "Interference Cancellation in Multiuser Acoustic Underwater Networks Using Probabilistic SDMA.",
                    "Harmonizing SIC and MIMO DoF Interference Cancellation for Efficient Network-Wide Resource Allocation.",
                    "Reliable Broadcast with Joint Forward Error Correction and Erasure Codes in Wireless Communication Networks.",
                    "Sensor-Assisted Codebook-Based Beamforming for Mobility Management in 60 GHz WLANs.",
                    "On Demand Beaconless Planar Backbone Construction for Quasi Unit Disk Graphs.",
                    "Connecting Robots with Concurrent Exploration of Control and Communications.",
                    "Energy-Efficient Selective Activation in Femtocell Networks.",
                    "Self-Adaptive Resource Allocation for Event Monitoring with Uncertainty in Sensor Networks.",
                    "Dynamic Mobile Charger Scheduling in Heterogeneous Wireless Sensor Networks.",
                    "A Novel Dual Traffic/Flash Flood Monitoring System Using Passive Infrared/Ultrasonic Sensors.",
                    "Pushing Towards the Limit of Sampling Rate: Adaptive Chasing Sampling.",
                    "AirLoc: Mobile Robots Assisted Indoor Localization.",
                    "BarFi: Barometer-Aided Wi-Fi Floor Localization Using Crowdsourcing.",
                    "PerLoc: Enabling Infrastructure-Free Indoor Localization with Perspective Projection.",
                    "RTS Assisted Mobile Localization: Mitigating Jigsaw Puzzle Problem of Fingerprint Space with Extra Mile.",
                    "Vehicle Detection and Classification Using Passive Infrared Sensing.",
                    "A Range-Free Localization of Passive RFID Tags Using Mobile Readers.",
                    "Protocol Evaluation in Multihop Wireless Networks with Controllable Node Sparsity or Density (Extended Abstract).",
                    "KCN: Guaranteed Delivery via K-Cooperative-Nodes in Duty-Cycled Sensor Networks.",
                    "Location-Based Routing for Opportunistic Networks.",
                    "Fast Compressive Sensing Based on Dominant Frequency Estimation.",
                    "Optimal Time and Channel Assignment for Data Collection in Wireless Sensor Networks.",
                    "Localization in a Rayleigh Fading Environment Using RSS Based Methodologies.",
                    "Context-Aware Distributed Storage in Mobile Cloud Computing.",
                    "Link Scheduling in Wireless Cooperative Communication Networks.",
                    "Dynamic Mobile Charger Scheduling in Heterogeneous Wireless Sensor Networks.",
                    "GoFAST: A Group-Based Emergency Guiding System with Dedicated Path Planning for Mobile Users Using Smartphones.",
                    "Phonemeter: Bringing EMF Detection to Smartphones.",
                    "Dynamic Provisioning for High Energy Efficiency and Resource Utilization in Cloud RANs.",
                    "GRB: Greedy Routing Protocol with Backtracking for Mobile Ad-Hoc Networks.",
                    "Wireless Sensing: What Simplicity Has to Offer?",
                    "Context-Aware Crowd-Sensing in Opportunistic Mobile Social Networks.",
                    "Time-Aware Truth Discovery in Social Sensing.",
                    "Novel Adaptive Queue Intelligent Management Algorithm.",
                    "MBDMAC: A MAC Protocol for Multi-beam Directional Antennas in Wireless Networks.",
                    "Study of Hadoop-MapReduce on Google N-Gram Datasets.",
                    "New Dv-Distance Algorithm Based on Path for Wireless Sensor Network.",
                    "New Directions in Content Centric Networking.",
                    "List Interest: Packing Interests for Reduction of Router Workload in CCN 1.0.",
                    "Secure Fragmentation for Content Centric Networking.",
                    "On Energy Reduction and Green Networking Enhancement Due to In-Network Caching.",
                    "Improving the Expected Quality of Experience in Cloud-Enabled Wireless Access Networks.",
                    "The Story of ChronoShare, or How NDN Brought Distributed Secure File Sharing Back.",
                    "A Performance Analysis of End-to-End Fragmentation in Content-Centric Networking.",
                    "A Comparison of Name-Based Content Routing Protocols.",
                    "A Measurement Study on Media Streaming over Wi-Fi in Named Data Networking.",
                    "Efficient Privacy-Preserving Fingerprint-Based Indoor Localization Using Crowdsourcing.",
                    "Colorful Math: Developing Algorithmic Methodology to Visualize and Analyze the Dynamics of a Deciduous Tree.",
                    "Backscatter-Modulation Constellation for Full-Duplex Wireless Communication.",
                    "Ferry Enhanced Improved PRoPHET Routing Protocol.",
                    "Dense Optical Flow Based Emotion Recognition Classifier.",
                    "Survey of Smartphone-Based Police Monitoring Apps.",
                    "Detecting Driver Drowsiness Using Wireless Wearables.",
                    "WeSeeYou: Adapting Video Streaming for Surveillance Applications.",
                    "What's on Tap? Transforming Stormwater Survey Data into Visually Appealing Educational Tools.",
                    "Joint Route Discovery and Localization in Heterogeneous Wireless Sensor Networks.",
                    "An Efficient Graph Search Algorithm for Backbone Discovery in Wireless Linear Sensor Networks.",
                    "Game Theoretical Method for Sum-Rate Maximization in Full-Duplex Massive MIMO Heterogeneous Networks.",
                    "Target Detection Using 3-D Sparse Underwater Senor Array Network.",
                    "Place Identification in Location Based Urban VANETs.",
                    "Social Signal Processing for Real-Time Situational Understanding: A Vision and Approach.",
                    "Using Intelligent Agents for Social Sensing across Disadvantaged Networks.",
                    "Long-Term Privacy Profiling through Smartphone Sensors.",
                    "Work-in-Progress, PupilWare-M: Cognitive Load Estimation Using Unmodified Smartphone Cameras.",
                    "Toward a System for Longitudinal Emotion Sensing.",
                    "Querying Hidden Attributes in an Online Community Network."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th MASS 2014",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2014",
                "sub_name": "11th IEEE International Conference on Mobile Ad Hoc and Sensor Systems, MASS 2014, Philadelphia, PA, USA, October 28-30, 2014.",
                "count": 124,
                "papers": [
                    "Finding Nemo: Finding Your Lost Child in Crowds via Mobile Crowd Sensing.",
                    "Grace: Recognition of Proximity-Based Intentional Groups Using Collaborative Mobile Devices.",
                    "GUI: GPS-Less Traffic Congestion Avoidance in Urban Areas with Inter-Vehicular Communication.",
                    "QoS Driven Multi-user Video Streaming in Cellular CRNs: The Case of Multiple Channel Access.",
                    "\"Cocktail Party in the Cloud\": Blind Source Separation for Co-Operative Cellular Communication in Cloud RAN.",
                    "Joint User Scheduling, User Association, and Resource Partition in Heterogeneous Cellular Networks.",
                    "SmartSensing: Sensing Through Walls with Your Smartphone!",
                    "Navigating in Signal Space: A Crowd-Sourced Sensing Map Construction for Navigation.",
                    "FailureSense: Detecting Sensor Failure Using Electrical Appliances in the Home.",
                    "Pickup Game: Acquainting Neighbors Quickly and Efficiently in Crowd.",
                    "CLAN: An Efficient Distributed Temporal Community Detection Protocol for MANETs.",
                    "Efficient Decentralized Context Sharing via Smart Aggregation.",
                    "Fusion of Radio and Camera Sensor Data for Accurate Indoor Positioning.",
                    "Fast and Accurate Indoor Localization Based on Spatially Hierarchical Classification.",
                    "B-Loc: Scalable Floor Localization Using Barometer on Smartphone.",
                    "Optimal Prizes for All-Pay Contests in Heterogeneous Crowdsourcing.",
                    "Profit-Maximizing Stochastic Control for Mobile Crowd Sensing Platforms.",
                    "Fast Information Cascade Prediction Through Spatiotemporal Decompositions.",
                    "GasNet: Efficient Residential Building Gas Leak Monitoring via Opportunistic Networking.",
                    "Accurate Pipeline Blockage Detection with Low-Cost Multi-modal Sensing.",
                    "Self-Motivated Relay Selection for a Generalized Power Line Monitoring Network.",
                    "BRVST: Efficient and Content-Expressive Information Matching Overlay in Wireless Networks.",
                    "Expertise-Based Data Access in Content-Centric Mobile Opportunistic Networks.",
                    "Community Clinic: Economizing Mobile Cloud Service Cost via Cloudlet Group.",
                    "Low Complexity Target Coverage Heuristics Using Mobile Cameras.",
                    "Secure and Efficient Video Surveillance in Cloud Computing.",
                    "Towards Smart Routing: Exploiting User Context for Video Delivery in Mobile Networks.",
                    "Impromptu Deployment of Wireless Relay Networks: Experiences Along a Forest Trail.",
                    "Sleep-Route: Assured Sensing with Aggressively Sleeping Nodes.",
                    "Delay Aware Resource Allocation Scheme for a Cognitive LTE Based Radio Network.",
                    "Understanding Multiple Features with Hypercube for Distinguishing Uncertain Objects in Mobile Crowdsensing.",
                    "Auction-Based Spectrum Leasing for Secure Information Transfer in Cognitive Radio Networks.",
                    "Distributed Hole Detection Algorithms for Wireless Sensor Networks.",
                    "Delay and Energy-Efficient STDMA for Grid Wireless Sensor Networks: ORCHID.",
                    "Low Expected Latency Routing in Dynamic Networks.",
                    "To Carry or To Forward? A Traffic-Aware Data Collection Protocol in VANETs.",
                    "A Theoretical Analysis of Path Loss Based Activity Recognition.",
                    "User-Driven Idle Energy Save for 802.11x Mobile Devices.",
                    "High-Performance, Energy-Efficient Mobile Wireless Networking in 802.11 Infrastructure Mode.",
                    "Boe: Context-Aware Global Power Management for Mobile Devices Balancing Battery Outage and User Experience.",
                    "Capacity of Cache Enabled Content Distribution Wireless Ad Hoc Networks.",
                    "Asymptotically-Optimal Incentive-Based En-Route Caching Scheme.",
                    "A Framework for Mobile Data Offloading to Leased Cache-Endowed Small Cell Networks.",
                    "Mitigating the Adverse Effects of Temperature on Low-Power Wireless Protocols.",
                    "Multi Channel Performance of Dual Band Low Power Wireless Network.",
                    "LearJam: An Energy-Efficient Learning-Based Jamming Attack against Low-Duty-Cycle Networks.",
                    "MobileDeluge: Mobile Code Dissemination for Wireless Sensor Networks.",
                    "Opportunistic Coding for Multi-Packet Flooding in Wireless Sensor Networks with Correlated Links.",
                    "A General Data and Acknowledgement Dissemination Scheme in Mobile Social Networks.",
                    "An Online Algorithm for Fingerprint-Based Location Tracking.",
                    "EPcloak: An Efficient and Privacy-Preserving Spatial Cloaking Scheme for LBSs.",
                    "A Unified Approach for Fast and Accurate Cardinality Estimation in RFID Systems.",
                    "Toward Fast and Deterministic Clone Detection for Large Anonymous RFID Systems.",
                    "Building Cross-Layer Corridors in Wireless Multihop Networks.",
                    "Using Radio Connectivity to Define Transmission Schedules in Multihop Wireless Networks.",
                    "Multi-channel Data Collection for Throughput Maximization in Wireless Sensor Networks.",
                    "Coordinating Robots for Connectivity in Wireless Sensor Networks.",
                    "Guaranteeing Stability and Delay in Dynamic Networks Based on Infinite Games.",
                    "From Task Graphs to Concrete Actions: A New Task Mapping Algorithm for the Future Internet of Things.",
                    "Minimum Power Broadcast: Fast Variants of Greedy Approximations.",
                    "Throughput-Optimal Robotic Message Ferrying for Wireless Networks Using Backpressure Control.",
                    "Optimal Hierarchical Power Scheduling for Cooperative Microgrids.",
                    "PPG Sensor and Device for Continuous Mobile Human Vital Signs Monitoring.",
                    "An Efficient Routing Algorithm to Optimize the Lifetime of Sensor Network Using Wireless Charging Vehicle.",
                    "Modeling the Expected Data Collection Time for Vehicular Networks Using Random Walks on a Torus.",
                    "Target Counting with Binary Proximity Sensors Based on Sensor-Cluster Identification.",
                    "Design and Development of WINGSNET (Wireless Intelligent GPS-Based Sensor Network) System for Monitoring Air Pollution and Radiation Based on WiFi & WiMAX Communication Network.",
                    "Reliable Cross-Layer Data Transport Protocol for MANETs.",
                    "Development of a High-Speed Simulator for Sensor Network Protocols Using GPGPU.",
                    "Maximizing Data Preservation Time in Linear Sensor Networks.",
                    "Recommendation-Based Trust Management in Body Area Networks for Mobile Healthcare.",
                    "Concurrent Wireless Channel Survey on Dual Band Sensor Network Testbed.",
                    "Temperature Aware Probabilistic Sleep Cycle Management for Body Area Sensor Networks.",
                    "Methods for Node Localization in Wireless Sensor Networks.",
                    "A Quantum Diffie-Hellman Protocol.",
                    "Android Controlled Zigbee Motes for Wireless Sensor Networks.",
                    "Cellular Vehicular Networks (CVN): ProSe-Based ITS in Advanced 4G Networks.",
                    "Cognitive GSM OpenBTS.",
                    "Towards A Reconfigurable Cyber Physical System.",
                    "WiFiScout: A Crowdsensing WiFi Advisory System with Gamification-Based Incentive.",
                    "Scientific Experiments with the Large Scale Open Testbed IoT-LAB: Broadcast with Network Coding.",
                    "MobileDeluge: A Novel Mobile Code Dissemination Tool for WSNs.",
                    "EMD-Based Multi-Model Prediction for Network Traffic in Software-Defined Networks.",
                    "Security-Awareness in Network Virtualization: A Classified Overview.",
                    "Streaming Multicast Video over Software-Defined Networks.",
                    "OFBGP: A Scalable, Highly Available BGP Architecture for SDN.",
                    "Multipath Dissemination for Collaborative Mobile Internet Access.",
                    "An Indoor Hybrid WiFi-VLC Internet Access System.",
                    "Area-Based Dissemination in Vehicular Networks.",
                    "Evaluation of Seed Selection Strategies for Vehicle to Vehicle Epidemic Information Dissemination.",
                    "Offloading through Opportunistic Networks with Dynamic Content Requests.",
                    "A Localized Efficient Forwarding Algorithm in Large-Scale Delay Tolerant Networks.",
                    "Heterogeneous Community-Based Routing in Opportunistic Mobile Social Networks.",
                    "Backbone Discovery In Thick Wireless Linear Sensor Networks.",
                    "Trust Models in Wireless Sensor Networks and Online Social Networks: A Comparative Study.",
                    "An Advanced Anti-Collision Algorithm Based on Inter-Tag Communication Mechanism in RFID-Sensor Network.",
                    "Virtual Adaptive Modulation Trunk Link in Mobile Sink assisted Wireless Sensor Networks.",
                    "A Hierarchical Authentication Scheme in Wireless Sensor Networks.",
                    "Identifying Malicious Attacks to Wireless Localization in Bad Channel Conditions.",
                    "On Probabilistic Data Collection in the NOTICE Architecture.",
                    "Towards Building Asset Registry in Emergency Response.",
                    "Should Smartphone Users Mock Apps?",
                    "Towards City-Scale Smartphone Sensing of Potentially Unsafe Pedestrian Movements.",
                    "Sparse Erroneous Vehicular Trajectory Compression and Recovery via Compressive Sensing.",
                    "Distributed Compressive Detection with Perfect Secrecy.",
                    "CS-Based Framework for Sparse Signal Transmission over Lossy Link.",
                    "Image Separation Based on Augmented Lagrange Multiplier Using Rank Prior.",
                    "A Range-Free Multiple Target Localization Algorithm Using Compressive Sensing Theory in Wireless Sensor Networks.",
                    "An Improved Joint Sparse Representation of Array Covariance Matrices Approach in Multi-source Direct Position.",
                    "Improving Virtual Machine Migration via Deduplication.",
                    "Bandwidth Prediction on a WiMAX Network.",
                    "Analysis and Implementation of Internet Based Remote Voting.",
                    "Geofit: Verifiable Fitness Challenges.",
                    "Automated Forensic Data Acquisition in the Cloud.",
                    "Lehigh Instrument for Learning Interaction (LILI): An Interactive Robot to Aid Development of Social Skills for Autistic Children.",
                    "An Experimental Study of Effective Jamming in Underwater Acoustic Links.",
                    "Comparison of the Ranging Function of Three Types of Underwater Acoustic Modems.",
                    "Android Smartphone Third Party Advertising Library Data Leak Analysis.",
                    "Application of Low Cost Optical Communication Systems to Underwater Acoustic Networks.",
                    "Wireless Image Transmission for AUV Applications.",
                    "Small Unmanned Aerial Vehicle System for Wildlife Radio Collar Tracking.",
                    "Manilyzer: Automated Android Malware Detection through Manifest Analysis.",
                    "Setup and Configuration of MapReduce in a Cloud Environment.",
                    "Emulation Performance Study of Traffic-Aware Policy Enforcement in Software Defined Networks."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th MASS 2013",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2013",
                "sub_name": "IEEE 10th International Conference on Mobile Ad-Hoc and Sensor Systems, MASS 2013, Hangzhou, China, October 14-16, 2013.",
                "count": 92,
                "papers": [
                    "Efficient Topology Design in Time-Evolving and Energy-Harvesting Wireless Sensor Networks.",
                    "Near Optimal Charging and Scheduling Scheme for Stochastic Event Capture with Rechargeable Sensors.",
                    "Routing Renewable Energy Using Electric Vehicles in Mobile Electrical Grid.",
                    "On-demand Charging in Wireless Sensor Networks: Theories and Applications.",
                    "On Throughput Maximization for a Multi-hop MIMO Network.",
                    "Critical Power for Vanishing of Isolated Nodes in Wireless Networks with Log-Normal Shadowing.",
                    "Optimizing Event-Driven Localization.",
                    "ACC: Anonymous Cooperative Caching in Wireless Ad Hoc Networks.",
                    "P2IT: Predicting Packet Interarrival Time in Asynchronous Duty-Cycling Sensor Networks.",
                    "UPS: A United Cooperative Paradigm for Primary and Secondary Networks.",
                    "Less is More: Efficient RFID-Based 3D Localization.",
                    "Time- and Energy-Efficient Detection of Unknown Tags in Large-Scale RFID Systems.",
                    "Effective Relay Selection for Underwater Cooperative Acoustic Networks.",
                    "SLICER: A Slicing-Based K-Anonymous Privacy Preserving Scheme for Participatory Sensing.",
                    "TACO: Temperature-Aware Compensation for Time Synchronization in Wireless Sensor Networks.",
                    "Neighbor Discovery in Multichannel Wireless Clique Networks: An Epidemic Approach.",
                    "HyCare: Hybrid Coding-Aware Routing with ETOX Metric in Multi-hop Wireless Networks.",
                    "Resource Allocation with Non-deterministic Demands and Profits.",
                    "Fairness for All, Rate Allocation for Mobile Wireless Networks.",
                    "Energy-Efficient Broadcast Scheduling with Minimum Latency for Low-Duty-Cycle Wireless Sensor Networks.",
                    "Semi-Structure Routing and Performance Analysis for Cognitive Radio Networks.",
                    "NETWRAP: An NDN Based Real Time Wireless Recharging Framework for Wireless Sensor Networks.",
                    "EDAL: An Energy-Efficient, Delay-Aware, and Lifetime-Balancing Data Collection Protocol for Wireless Sensor Networks.",
                    "An Efficient Cooperative Retransmission MAC Protocol for IEEE 802.11n Wireless LANs.",
                    "SmokeGrenade: A Key Generation Protocol with Artificial Interference in Wireless Networks.",
                    "FastForward: High-Throughput Dual-Radio Streaming.",
                    "A Framework for Information Propagation in Mobile Sensor Networks.",
                    "Barrier Coverage in Hybrid Directional Sensor Networks.",
                    "On Opportunistic Coverage for Urban Sensing.",
                    "Topology Control for Maximizing Network Lifetime in Wireless Sensor Networks with Mobile Sink.",
                    "Energy-Balanced Matching and Sequence Dispatch of Robots to Events: Pairwise Exchanges and Sensor Assisted Robot Coordination.",
                    "Throughput Optimization in Energy Sharing Wireless Sensor Networks.",
                    "A Synergy of the Wireless Sensor Network and the Data Center System.",
                    "Efficient Distribution of Sensing Queries in Public Sensing Systems.",
                    "ECPC: Preserve Downtime Data Persistence in Disruptive Sensor Networks.",
                    "Healthy: A Diary System Based on Activity Recognition Using Smartphone.",
                    "COUPON: Cooperatively Building Sensing Maps in Mobile Opportunistic Networks.",
                    "Constrained Artificial Fish-Swarm Based Area Coverage Optimization Algorithm for Directional Sensor Networks.",
                    "On Multi-round Sensor Deployment for Barrier Coverage.",
                    "Two Families of Algorithms to Film Sport Events with Flying Robots.",
                    "Enabling Real-Time In-Situ Processing of Ubiquitous Mobile-Application Workflows.",
                    "Incentive-Driven and Freshness-Aware Content Dissemination in Selfish Opportunistic Mobile Networks.",
                    "Collaborative Computing On-demand: Harnessing Mobile Devices in Executing On-the-Fly Jobs.",
                    "P-Match: Priority-Aware Friend Discovery for Proximity-Based Mobile Social Networks.",
                    "Adaptive Backbone-Based Routing in Delay Tolerant Networks.",
                    "Change Awareness in Opportunistic Networks.",
                    "Energy-Efficient Opportunistic Collaborative Sensing.",
                    "CAVD: A Traffic-Camera Assisted Live Video Streaming Delivery Strategy in Vehicular Ad Hoc Networks.",
                    "Wi-Fi Fingerprint Based Indoor Localization without Indoor Space Measurement.",
                    "Improving GPS Service via Social Collaboration.",
                    "The Virtue of Patience: Offloading Topical Cellular Content through Opportunistic Links.",
                    "Distributed Resource Discovery in the Machine-to-Machine Applications.",
                    "Fine-Grained Landmark Based Greedy Geographic Routing with Guaranteed Delivery Under Uncertain Locations.",
                    "Energy-Efficient Target Coverage Algorithm for Wireless Sensor Networks.",
                    "A New DTN Routing Protocol for Sparse Airborne Networks.",
                    "Relative Localization of Sensors Based on their Responses to Moving Objects.",
                    "Originator Data Security for Collaborative Task Execution among Weak Devices.",
                    "WX-MAC: An Energy Efficient MAC Protocol for Wireless Sensor Networks.",
                    "Reality Mining: Digging the Impact of Friendship and Location on Crowd Behavior.",
                    "Extremal Optimization Approach to Joint Routing and Scheduling for Industrial Wireless Networks.",
                    "Optimal Spectrum Leasing with the Constraints of User Admission Rate and Quality of Service.",
                    "An Iterative Method of Sensor Calibration in Participatory Sensing Network.",
                    "Virtual Mobile Ad-hoc Networks.",
                    "Keep up with Me: A Gesture Guided Moving Robot with Microsoft Kinect.",
                    "Wireless Mesh Network Simulator for Studying Cross-Layer Jamming Effects.",
                    "Determining Athlete's Injury with Wireless Body Area Sensor Network-Based Overhead Squat Testing.",
                    "AWSAN: A Realtime Wireless Sensor Array Platform.",
                    "Survival of the Fittest: Data Dissemination with Selective Negotiation in Wireless Sensor Networks.",
                    "STAGGER: Improving Channel Utilization for Convergecast in Wireless Sensor Networks.",
                    "Reprogramming over Low Power Link Layer in Wireless Sensor Networks.",
                    "Context-Aware Handoff on Smartphones.",
                    "Direct Localization of Multiple Sources in Sensor Array Networks: A Joint Sparse Representation of Array Covariance Matrices Approach.",
                    "Link-Layer Multicast in Smart Antenna Based 802.11n Wireless LANs.",
                    "On Modeling the Coexistence of WiFi and Wireless Sensor Networks.",
                    "Boundary Helps: Efficient Routing Protocol Using Directional Antennas in Cognitive Radio Networks.",
                    "Adaptive Sampling and Duty Cycling for Smartphone Accelerometer.",
                    "MISS: Multi-dimensional Information Sensing Surveillance for Cold Chain Logistics.",
                    "Multi-layer Video Streaming with Helper Nodes Using Network Coding.",
                    "Exploiting Space Syntax for Deployable Mobile Opportunistic Networking.",
                    "Droplet: A New Denial-of-Service Attack on Low Power Wireless Sensor Networks.",
                    "Uno: A Privacy-Aware Distributed Storage and Replication Middleware for Heterogeneous Computing Platforms.",
                    "MeshJam: Intelligent Jamming Attack and Defense in IEEE 802.11s Wireless Mesh Networks.",
                    "How Environmental Factors Impact Outdoor Wireless Sensor Networks: A Case Study.",
                    "Understanding Routing Dynamics in a Large-Scale Wireless Sensor Network.",
                    "End-to-End Delay Measurement in Wireless Sensor Networks without Synchronization.",
                    "Mobile Anchor Assisted Error Bounded Sensing in Sensor Networks: An Implementation Perspective.",
                    "Simultaneous Sensing Matrix and Sparsifying Dictionary Optimization for Block-sparse Compressive Sensing.",
                    "A Direct Wideband Direction of Arrival Estimation under Compressive Sensing.",
                    "Wideband DOA estimation of frequency sparse sources with one receiver.",
                    "Deployment and Routing Method for Fast Localization Based on RSSI in Hierarchical Wireless Sensor Network.",
                    "Measurement-based Analysis of the Effect of Duty Cycle in IEEE 802.15.4 MAC Performance.",
                    "Demo: Modular Wireless Technology Gateway."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th MASS 2012",
        "info": "Las Vegas, NV, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2012",
                "sub_name": "9th IEEE International Conference on Mobile Ad-Hoc and Sensor Systems, MASS 2012, Las Vegas, NV, USA, October 8-11, 2012.",
                "count": 63,
                "papers": [
                    "On tracking multiple indistinguishable targets.",
                    "Correlating mobility with social encounters: Distributed localization in sparse mobile networks.",
                    "DHT-based localized service discovery in wireless mesh networks.",
                    "Mobile barrier coverage for dynamic objects in wireless sensor networks.",
                    "RSAA: Reliable Splitting Aware ALOHA to capture passing tags.",
                    "Complete and fast unknown tag identification in large RFID systems.",
                    "A framework for frameless TDMA using slot chains.",
                    "Fast identification of mobile RFID tags.",
                    "Pro-Energy: A novel energy prediction model for solar and wind energy-harvesting wireless sensor networks.",
                    "Collaborative mobile charging for sensor networks.",
                    "ZigBee-assisted Power Saving Management for mobile devices.",
                    "SmartMote: Energy and VoI aware solar-powered sensor network design for environment monitoring.",
                    "Netbrick: A high-performance, low-power hardware platform for wireless and hybrid sensor networks.",
                    "LOOP: A location based routing scheme for opportunistic networks.",
                    "A scalable analytical framework for deriving optimum scheduling and routing in underwater sensor networks.",
                    "VICO: A framework for configuring indoor visible light communication networks.",
                    "End-to-end fairness over non-convex capacity region in IEEE 802.11-based wireless networks.",
                    "Optimizations for route discovery in asynchronous duty-cycling wireless networks.",
                    "Credit routing for source-location privacy protection in wireless sensor networks.",
                    "Enhancing wireless communication privacy with artificial fading.",
                    "You unlocked the Mt. Everest badge on foursquare! Countering location fraud in Geosocial Networks.",
                    "Social closeness based clone attack detection for mobile healthcare system.",
                    "Closing the Pandora's box: Defenses for thwarting epidemic outbreaks in mobile adhoc networks.",
                    "CodeMP: Network coded multipath to support TCP in disruptive MANETs.",
                    "Data elevators: Applying the bundle protocol in Delay Tolerant Wireless Sensor Networks.",
                    "Eagle eye: A dual-radio architecture in delay tolerant networks.",
                    "Sensory-data-enhanced authentication for RFID-based access control systems.",
                    "Detecting spectrum misuse in wireless networks.",
                    "Enhancing the accuracy of radio tomographic imaging using channel diversity.",
                    "The Monitoring Core: A framework for sensor security application development.",
                    "Capacity and delay tradeoffs in mobile networks under Gaussian channel model.",
                    "Achievable throughput in duty-cycled wireless networks.",
                    "WiFu: A composable toolkit for experimental wireless transport protocols.",
                    "Error minimizing jammer localization through smart estimation of ambient noise.",
                    "Bankrupting the jammer in WSN.",
                    "STIR-ing the wireless medium with self-tuned, inference-based, real-time jamming.",
                    "Efficient and timely jamming detection in wireless sensor networks.",
                    "Goodput maximization in opportunistic spectrum access radio links with imperfect spectrum sensing and fec-based packet protection.",
                    "Content dissemination by pushing and sharing in mobile cellular networks: An analytical study.",
                    "Exploiting cooperation for delay optimization in cognitive networks.",
                    "Spectrum decision for efficient routing in cognitive radio network.",
                    "PathZip: Packet path tracing in wireless sensor networks.",
                    "Balanced spatio-temporal compressive sensing for multi-hop wireless sensor networks.",
                    "Cross-layer coordination for efficient contents delivery in LTE eMBMS traffic.",
                    "Fusion performance in long-haul sensor networks with message retransmission and retrodiction.",
                    "Path-loss fluctuations towards robust scheduling algorithms in the SINR model.",
                    "Collaborative assessment of functional reliability in wireless networks.",
                    "On the spanning ratio of partial Delaunay triangulation.",
                    "Collusion-resistant repeated double auctions for cooperative communications.",
                    "Maximizing data preservation in intermittently connected sensor networks.",
                    "Modeling spatial node density in waypoint mobility.",
                    "Observation vs statistics: Near optimal online channel access in cognitive radio networks.",
                    "Bugs or anomalies? Sequence mining based debugging in wireless sensor networks.",
                    "Fuseviz: A framework for web-based data fusion and visualization in smart environments.",
                    "Performance improvement by collision avoidance of control packets in receiver-driven multihop wireless mesh networks.",
                    "Dynamic configuration of mobile cloud middleware based on traffic load.",
                    "Immediate acknowledgement for single-channel full-duplex wireless networks.",
                    "A novel distributed scheme for building spontaneous social communities over manets.",
                    "Efficient mobile content dissemination through broadcast and opportunistic networks.",
                    "Exploiting long-range opportunistic links to improve delivery, delay and energy consumption in wireless sensor networks.",
                    "Using network virtualization and openflow to build large scale DTN evaluation testbed.",
                    "Demo of sensor deployment in detecting event's boundary.",
                    "Creating secured electronic medical record framework for mobile devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mass/2012s",
                "sub_name": "9th IEEE International Conference on Mobile Ad-Hoc and Sensor Systems, MASS 2012, Las Vegas, NV, USA, October 8-11, 2012 - Supplement Volume / Workshops.",
                "count": 28,
                "papers": [
                    "Byzantine Attack Isolation in IEEE 802.11 Wireless Ad-Hoc Networks.",
                    "Fast verification of an ID-based signature scheme for broadcast authentication inwireless sensor networks.",
                    "Evaluating design approaches for smart building systems.",
                    "Distributed kalman filtering for noisy consensus networks with time delays.",
                    "A game theoretic malicious nodes detection model in MANETs.",
                    "Online distributed synchronizability check for networks of interconnected systems.",
                    "Adaptive video transport over low bit-rate multihop WSNs.",
                    "Collaborative detection of DDoS attacks based on chord protocol.",
                    "Connecting the web with the web of things: lessons learned from implementing a CoAP-HTTP proxy.",
                    "Research on optimal stopping problem based opportunistic channel access.",
                    "Space-free localization for wireless sensor networks based on neighbor topology.",
                    "Heterogeneous multi-interface routing: networking stack and simulator extensions.",
                    "Bitwise sketch for lightweight reverse IP reconstruction in network anomaly detection.",
                    "Cooperative n-boundary tracking in large scale environments.",
                    "Codo: confidential data storage for wireless sensor networks.",
                    "APCAPT: Asymmetric power control against packet tracer attacks for base station location anonymity.",
                    "HTTP-CoAP cross protocol proxy: an implementation viewpoint.",
                    "A novel fuzzy HEED security using VEGK for wireless sensor networks.",
                    "T-Hex: true hexagonal regular topology formation in large scale wireless sensor networks.",
                    "In-orbit test method of shaped-reflector antenna on satellites.",
                    "CRASP: congestion control routing algorithm against selfish behavior based on pigeonhole principle in DTN.",
                    "A split protocol technique for web server migration.",
                    "A three-dimensional localization algorithm for wireless sensor networks using artificial neural networks.",
                    "Indoor wireless sensor localization using mobile robot and RSSI.",
                    "Cellular automaton based algorithms for depth adjustment in underwater mobile sensor networks.",
                    "Hierarchical group key management for wireless mesh networks using multivariate symmetric polynomials.",
                    "Data-centric anomalies in sensor network deployments: analysis and detection.",
                    "Orthogonal cut algorithm for value-based event localization in sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th MASS 2011",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2011",
                "sub_name": "IEEE 8th International Conference on Mobile Adhoc and Sensor Systems, MASS 2011, Valencia, Spain, October 17-22, 2011.",
                "count": 135,
                "papers": [
                    "Application-Aware Disruption Tolerant Network.",
                    "The Trajectory Exposure Problem in Location-Aware Mobile Networking.",
                    "GOT: Grid-Based On-Road Localization through Inter-Vehicle Collaboration.",
                    "Feasible Capacity of Distributed Beamforming in Multi-Hop Wireless Sensor Networks.",
                    "Constrained Relay Node Placement in Energy Harvesting Wireless Sensor Networks.",
                    "Secure Neighbor Discovery in Mobile Ad Hoc Networks.",
                    "SASHA: A Distributed Protocol for Secure Application Deployment in Shared Ad-Hoc Wireless Sensor Networks.",
                    "Fractional Frequency Reuse to Mitigate Interference in Self-Configuring LTE-Femtocells Network.",
                    "Joint Admission Control, Channel Assignment and QoS Routing for Coverage Optimization in Multi-Hop Cognitive Radio Cellular Networks.",
                    "Towards Energy Efficient Adaptive Error Control in Indoor WSN: A Fuzzy Logic Based Approach.",
                    "On Optimal Scheduling in Wireless Rechargeable Sensor Networks for Stochastic Event Capture.",
                    "TALB: A Traffic-Aware Load Balancer for Throughput Improvement in Wireless Mesh Networks.",
                    "Topology Control for Time-Evolving and Predictable Delay-Tolerant Networks.",
                    "Social-Based Cooperative Caching in DTNs: A Contact Duration Aware Approach.",
                    "Distributed Algorithms for Multipath Routing in Full-Duplex Wireless Networks.",
                    "Leveraging Social Networks for P2P Content-Based File Sharing in Mobile Ad Hoc Networks.",
                    "Experimental Performance Evaluation of ATP in a Wireless Mesh Network.",
                    "A Low Power Routing and Topology Control Protocol for Cluster-based Environmental Wireless Sensor Networks: The FLORA Project Case.",
                    "Reliable Network Coding for ZigBee Wireless Sensor Networks.",
                    "A Cooperative Routing Framework Based on Randomized Coding in Wireless Ad Hoc Networks.",
                    "An Effective Metaheuristic Approach to Node Localization in Wireless Sensor Networks.",
                    "Coding Opportunities from Similar Data in Wireless Cooperation Diversity Systems.",
                    "Curve-Based Planar Graph Routing in Multihop Wireless Networks.",
                    "Function Placement of Data Fusion for Active Networks Paradigm in Wireless Sensor Networks.",
                    "Improving Access Point Association Protocols through Channel Utilization and Adaptive Switching.",
                    "Performance Assessment of Aggregation and De-Aggregation Algorithms for Vehicular Delay-Tolerant Networks.",
                    "Power Efficient High Quality Multimedia Multicast in LTE Wireless Networks.",
                    "Street Lighting Network Formation Mechanism Based on IEEE 802.15.4.",
                    "TAGER: Trust-Aware Georouting Protocol for Wireless Sensor Networks.",
                    "Using Multiple Radios for Ad Hoc Backbone Construction and Maintenance.",
                    "A Sensing Platform to Support Smartphones Accessing into Wireless Sensor Networks.",
                    "Design and Implementation of an Integrated Network and Data Management System for Heterogeneous WSNs.",
                    "An Integrated Graphical Development Environment for the Implementation of WSN.",
                    "Hidden Terminal-Aware Contention Resolution with an Optimal Distribution.",
                    "Cellular Traffic Offloading through WiFi Networks.",
                    "Energy Efficient Offloading of 3G Networks.",
                    "Utility-Maximizing Data Dissemination in Socially Selfish Cognitive Radio Networks.",
                    "Continuous Data Collection Capacity of Wireless Sensor Networks under Physical Interference Model.",
                    "Throughput and Fairness Analysis of 802.11-Based Vehicle-to-Infrastructure Data Transfers.",
                    "A Unified Metric for Routing and Rate Adaptation in Multi-Rate Wireless Mesh Networks.",
                    "Heterogeneity-Aware Design for Automatic Detection of Problematic Road Conditions.",
                    "TCP Flow-Aware Channel Re-Assignment in Multi-Radio Multi-Channel Wireless Mesh Networks.",
                    "Buffer Sizing in 802.11 Wireless Mesh Networks.",
                    "Load Balanced Rendezvous Data Collection in Wireless Sensor Networks.",
                    "Dynamic Graph Properties of Mobile Networks under Levy Walk Mobility.",
                    "A Simple Mobility Model Realizing Designated Node Distributions and Natural Node Movement.",
                    "ProxiMol: Proximity and Mobility Estimation for Efficient Forwarding in Opportunistic Networks.",
                    "On the Invariance of Spatial Node Density for Realistic Mobility Modeling.",
                    "MAP: Authenticating Multiple-Tags.",
                    "Privacy-Preserving Collaborative Path Hiding for Participatory Sensing Applications.",
                    "Toward Reliable Actor Services in Wireless Sensor and Actor Networks.",
                    "Content-Aware Data Dissemination for Enhancing Privacy and Availability in Wireless Sensor Networks.",
                    "Detecting Route Attraction Attacks in Wireless Networks.",
                    "Optimal Time-Frequency Diversity Exploitation for Multichannel System under Rayleigh Fading.",
                    "Polynomial Time and Provably Efficient Network Coding Scheme for Lossy Wireless Networks.",
                    "Leveraging Multi-User Diversity, Channel Diversity and Spatial Reuse for Efficient Scheduling in Wireless Relay Networks.",
                    "Behavioral Detection and Containment of Proximity Malware in Delay Tolerant Networks.",
                    "Delay Efficient Link and Aggregation Scheduling under Physical Interference Model.",
                    "Target Tracking under Uncertainty in Wireless Sensor Networks.",
                    "Quorum-based Localized Scheme for Duty Cycling in Asynchronous Sensor Networks.",
                    "Collaborative Channel Equalization: Analysis and Performance Evaluation of Distributed Aggregation Algorithms in WSNs.",
                    "A Sensor Network Abstraction for Flexible Public Sensing Systems.",
                    "Boreas: Efficient Synchronization for Scalable Emulation of Sensor Networks.",
                    "Edge Verifiability: Characterizing Outlier Measurements for Wireless Sensor Network Localization.",
                    "Mobile-Beacon Assisted Sensor Localization with Dynamic Beacon Mobility Scheduling.",
                    "Collaborative Location Privacy.",
                    "Exploiting the Associated Information to Locate Mobile Users in Ubiquitous Computing Environment.",
                    "Efficient Spectrum Searching and Monitoring in Cognitive Radio Network.",
                    "Physical Layer Network Coding with Signal Alignment for MIMO Wireless Networks.",
                    "Distributed Spectrum Sensing in Cognitive Radio Networks with Fairness Consideration: Efficiency of Correlated Equilibrium.",
                    "Efficient Channel Assignment under Dynamic Source Routing in Cognitive Radio Networks.",
                    "On the Effects of Interference between Heterogeneous Sensor Network MAC Protocols.",
                    "Covert DCF: A DCF-Based Covert Timing Channel in 802.11 Networks.",
                    "Physical Carrier Sense in Vehicular Ad-Hoc Networks.",
                    "DART: Directional Anypath Routing in Wireless Mesh Networks.",
                    "Efficient Opportunistic Multicast via Tree Backbone for Wireless Mesh Networks.",
                    "SBGR: A Simple Self-Protected Beaconless Geographic Routing for Wireless Sensor Networks.",
                    "Secured Flooding Time Synchronization Protocol.",
                    "Service and Experiment: Towards a Perpetual Sensor Network Testbed without Backchannel.",
                    "Evaluation of a Real, Low Cost, Urban WSN Deployment for Accurate Environmental Monitoring.",
                    "Design and Evaluation of a Lightweight Tracking Algorithm using WSN.",
                    "Mobile Phone Enabled Social Community Extraction for Controlling of Disease Propagation in Healthcare.",
                    "Hardware for a Wireless Geophysical Monitoring Testbed.",
                    "Broadcasting in Multi-Radio Multi-Channel Wireless Networks using Simplicial Complexes.",
                    "Making Aggregation Scheduling Usable in Wireless Sensor Networks: An Opportunistic Approach.",
                    "CCD: Locating Event in Wireless Sensor Network without Locations.",
                    "Mobility-Aware Cooperative Content Caching in Social Wireless Networks.",
                    "Opportunistic Network Erasure Coding in Disruptive Sensor Networks.",
                    "Phoenix: Peer-to-Peer Location Based Notification in Mobile Networks.",
                    "Inherent Security Benefits of Analog Network Coding for the Detection of Byzantine Attacks in Multi-Hop Wireless Networks.",
                    "A Cross-Layer Approach towards Robustness of Mobile Peer-to-Peer Networks.",
                    "VeRA - Version Number and Rank Authentication in RPL.",
                    "Elliptic Curve Based Zero Knowledge Proofs and their Applicability on Resource Constrained Devices.",
                    "Distributed Duty Cycle Management (DDCM) for IEEE 802.15.4 Beacon-Enabled Wireless Mesh Sensor Networks.",
                    "Distributed Fast Beacon Scheduling for Mesh Networks.",
                    "Calibrating and Comparing Simulators for Wireless Sensor Networks.",
                    "Performance of Dual Wi-Fi Radios in Infrastructure-Supported Multi-Hop Networks.",
                    "Adaptive Channel Assignment for Wireless Mesh Networks using Game Theory.",
                    "Interference, Even with MCCA Channel Access Method in IEEE 802.11s Mesh Networks.",
                    "QoS-Aware Wireless Back-Haul Network for Rural Areas with Support for Broadcast Services in Practice.",
                    "An Aggregation Aware Multi-Path Forwarding Paradigm for Wireless Mesh Networks.",
                    "Studying Practical Any-to-Any Backpressure Routing in Wi-Fi Mesh Networks from a Lyapunov Optimization Perspective.",
                    "Flexibility of Routing Framework Architecture in IEEE 802.11s Mesh Networks.",
                    "Constrained-based Multiple Sink Placement for Wireless Sensor Networks.",
                    "Bluetooth Scatternet Tree Formation for Wireless Sensor Networks.",
                    "On the Complexity of the Multi-Robot, Multi-Depot Map Visitation Problem.",
                    "Extremely Low Power Indoor Localisation System.",
                    "Piggy-Backing Link Quality Measurements to IEEE 802.15.4 Acknowledgements.",
                    "The Effect of Bundle Aggregation on the Performance of Vehicular Delay-Tolerant Networks.",
                    "An Integrated Network and Data Management System for Heterogeneous WSNs.",
                    "IDEA1: A Validated System C-Based Simulator for Wireless Sensor Networks.",
                    "VITRO Architecture: Bringing Virtualization to WSN World.",
                    "SWAP Project: Beyond the State of the Art on Harvested Energy-Powered Wireless Sensors Platform Design.",
                    "Towards Real World Aware Enterprise Systems - Reflecting the Quality Information of Physical Resources in Services and Processes.",
                    "Dynamic and Heterogeneous Wireless Sensor Networks for Virtual Instrumentation Services: Application to Perishable Goods Surveillance.",
                    "A Low-Power CoAP for Contiki.",
                    "A Lightweight SOAP over CoAP Transport Binding for Resource Constraint Networks.",
                    "REST Enabled Wireless Sensor Networks for Seamless Integration with Web Applications.",
                    "RFID Based Acoustic Wake-Up System for Underwater Sensor Networks.",
                    "A GPS-free Passive Acoustic Localization Scheme for Underwater Wireless Sensor Networks.",
                    "Time Varying Doppler-Shift Compensation for OFDM-Based Shallow Underwater Acoustic Communication Systems.",
                    "Underwater Communications in Wireless Sensor Networks using WLAN at 2.4 GHz.",
                    "The SMO Project: A Submarine Multidisciplinary Observatory in Deep-Sea.",
                    "Development of a New Laser Beacon for Time Calibration in the ANTARES Neutrino Telescope.",
                    "Acoustic Array Calibration and Signal Processing for UHE Neutrinos Generation.",
                    "Development of a Compact Transmitter Array for the Acoustic Neutrino Detection Calibration.",
                    "Public Safety and ad hoc Networks: Coverage Extension and Interoperability.",
                    "MuSE: Novel Efficient Multi-Tier Communication Security Model for Emergency and Rescue Operations.",
                    "A Secure Multi-Party Protocol for Sharing Valuable Information in Public Safety Networks.",
                    "Emergency Management in the Highways of the Future - A Performance-based Multilayered ITS Architecture Design Proposal.",
                    "Multicast and Virtual Road Side Units for Multi Technology Alert Messages Dissemination.",
                    "Tendoc: A Network Coding Video Transmission for Public Safety.",
                    "Distributed Multi-Level Cooperative Scheme for QoS Support in Public Safety Networks.",
                    "Public Safety Situation Aware Services over Cognitive Radio Networks.",
                    "Wardrop Equilibrium Formulation of Resource-Constrained DTN Routing in Public Safety Networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th MASS 2010",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2010",
                "sub_name": "IEEE 7th International Conference on Mobile Adhoc and Sensor Systems, MASS 2010, 8-12 November 2010, San Francisco, CA, USA.",
                "count": 97,
                "papers": [
                    "OCP: Opportunistic Carrier Prediction for wireless networks.",
                    "A multi-channel cooperative MIMO MAC protocol for wireless sensor networks.",
                    "Adaptive exploitation of cooperative relay for high performance communications in MIMO ad hoc networks.",
                    "Outage probability of an optimal cooperative MAC protocol in Nakagami-m channels.",
                    "USD-FH: Jamming-resistant wireless communication using Frequency Hopping with Uncoordinated Seed Disclosure.",
                    "A decentralized key management scheme via neighborhood prediction in mobile wireless networks.",
                    "SpartanRPC: Secure WSN middleware for cooperating domains.",
                    "An identity-based authentication and key establishment scheme for multi-operator maintained Wireless Mesh Networks.",
                    "Efficient routing in delay tolerant networks with correlated node mobility.",
                    "A non-replication multicasting scheme in delay tolerant networks.",
                    "GeSoMo - A general social mobility model for delay tolerant networks.",
                    "Geography-aware active data dissemination in mobile social networks.",
                    "Hopping enhanced sensors for efficient sensor network connectivity and coverage.",
                    "Best and worst-case coverage problems for arbitrary paths in wireless sensor networks.",
                    "Fractured voronoi segments: Topology discovery for wireless sensor networks.",
                    "On the coverage process of random walk in wireless ad hoc and sensor networks.",
                    "Characterizing the impact of multi-frequency and multi-power on localization accuracy.",
                    "Robust localization in cluttered environments with NLOS propagation.",
                    "LSR: A location secure routing protocol for ad hoc networks.",
                    "Interactionless calendar-based training for 802.11 localization.",
                    "StreamShaper: Coordination algorithms for participatory mobile urban sensing.",
                    "Stride information monitoring and sensing in sports.",
                    "Trailing mobile sinks: A proactive data reporting protocol for Wireless Sensor Networks.",
                    "An hybrid wireless-wired monitoring system for real-time rock collapse forecasting.",
                    "Adaptive diversity based spectrum allocation in single-radio wireless ad hoc networks.",
                    "Routing and spectrum allocation for video on-demand streaming in cognitive wireless mesh networks.",
                    "An analysis of cognitive networks for unslotted time and reactive users.",
                    "Multicast capacity scaling for cognitive networks: General extended primary network.",
                    "A metric for routing in delay-sensitive wireless sensor networks.",
                    "A QoS-oriented distributed routing protocol for hybrid networks.",
                    "Exploiting geographic opportunistic routing for soft QoS provisioning in wireless sensor networks.",
                    "Mode switch - Adaptive use of delay-sensitive or energy-aware communication in IEEE 802.15.4-based networks.",
                    "Maximizing data gathering capacity of wireless sensor networks using mobile relays.",
                    "A cost minimization algorithm for mobile data gathering in wireless sensor networks.",
                    "Energy-constrained bi-objective data muling in underwater wireless sensor networks.",
                    "Cooperative caching for improving availability in Social Wireless Networks.",
                    "Energy-efficient data redistribution in sensor networks.",
                    "Understanding the interaction between packet forwarding and channel access in multi-hop wireless networks.",
                    "InterMR: Inter-MANET routing in heterogeneous MANETs.",
                    "Ordering in time: A new routing approach for wireless networks.",
                    "Know your neighborhood: A strategy for energy-efficient communication.",
                    "Optimization of critical data synchronization via link overlay RNG in mobile ad hoc networks.",
                    "Channel on demand: Optimal capacity for cooperative multi-channel multi-interface wireless mesh networks.",
                    "Efficient WiFi deployment algorithms based on realistic mobility characteristics.",
                    "A distributed Delay-balancing Slot Allocation algorithm for 802.11s Mesh Coordinated Channel Access under dynamic traffic conditions.",
                    "VAN: Vehicle-assisted shortest-time path navigation.",
                    "On-line adaptive compression in delay sensitive wireless sensor networks.",
                    "You can't get there from here: Sensor scheduling with refocusing delays.",
                    "A realistic model of co-located interference for wireless network packet simulation.",
                    "A feedback-driven timing synchronisation protocol for cellular sensornets.",
                    "Optimal code rate for wireless sensor networks using IR-UWB and non-coherent detection.",
                    "Improving anti-jamming capability and increasing jamming impact with mobility control.",
                    "Secure connectivity model in Wireless Sensor Networks (WSN) using first order Reed-Muller codes.",
                    "Perfectly anonymous data aggregation in wireless sensor networks.",
                    "Implementation and evaluation of distance-based message authentication.",
                    "A modular security architecture for managing security associations in MANETs.",
                    "Implicit certificates support in IEEE 1609 security services for Wireless Access in Vehicular Environment (WAVE).",
                    "On application of Host Identity Protocol in wireless sensor networks.",
                    "Sensor data boundary estimation for anomaly detection in wireless sensor networks.",
                    "Enhanced location based key pre-distribution scheme for secure communication in Wireless Sensor Network (WSN).",
                    "AntMesh: An efficient data forwarding scheme for load balancing in multi-radio infrastructure mesh networks.",
                    "Gateway-aware routing for wireless mesh networks.",
                    "Cooperative geographic routing in wireless mesh networks.",
                    "Optimal cooperative MAC protocol with efficient selection of relay terminals.",
                    "Distributed greedy scheduling for multihop wireless networks.",
                    "Adaptive hybrid contention and reservation for UWB mesh networks.",
                    "Lightweight key agreement with key chaining.",
                    "More capacity with the CSMA/IA MAC protocol in IEEE 802.11s wireless mesh networks.",
                    "Evaluation of commercial wireless mesh technologies in a public safety context: Methodology, analysis and experience.",
                    "Internet usage modeling of large wireless networks using self-organizing maps.",
                    "MoNoTrac - A mobility trace generator based on OpenStreetMap geo-data.",
                    "BEP analysis of M-ary PSK modulation schemes over double Rice fading channels with EGC.",
                    "STEP: A spatio-temporal mobility model for humans walks.",
                    "Real-time indoor mapping for mobile robots with limited sensing.",
                    "Precise time of flight measurements in IEEE 802.11 networks by cross-correlating the sampled signal with a continuous Barker code.",
                    "ProbIN: Probabilistic inertial navigation.",
                    "Pose estimation with radio-controlled visual markers.",
                    "Spatial extension of the Reality Mining Dataset.",
                    "Wireless positioning using the Signal Strength Difference on Arrival.",
                    "Location tracking of fast-paced mobile entity using CDS for VANETs.",
                    "A feasibility study of RIP using 2.4 GHz 802.15.4 radios.",
                    "Application level phase adjustment for maximizing the fairness in VANET.",
                    "A vehicle-density-based forwarding scheme for emergency message broadcasts in VANETs.",
                    "BRAVE: Beacon-less routing algorithm for vehicular environments.",
                    "Multi-subnets selection and rate allocation in a heterogeneous wireless network.",
                    "DIVERT for realistic simulation of heterogeneous vehicular networks.",
                    "Detecting lane markers in complex urban environments.",
                    "Active position security through dynamically tunable radar.",
                    "Privacy aware localization in VANET.",
                    "A data dissemination platform for vehicular networks.",
                    "Dynamic operator replacement in sensor networks.",
                    "Large scale geolocalization and routing experimentation with the SensLAB testbed.",
                    "Low-cost and wearable healthcare monitoring system for pulse analysis in Traditional Chinese Medicine.",
                    "Identifying patients and visualize their vitality data through augmented reality.",
                    "The design and implementation of a surveillance and self-driven cleanup system for blue-green algae blooms on Lake Tai.",
                    "A test-bed for secure hierarchical data aggregation in wireless sensor networks.",
                    "Self-Organizing Network with Intelligent Relaying (SONIR)."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th MASS 2009",
        "info": "Macao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2009",
                "sub_name": "IEEE 6th International Conference on Mobile Adhoc and Sensor Systems, MASS 2009, 12-15 October 2009, Macau (S.A.R.), China.",
                "count": 141,
                "papers": [
                    "Contention-Aware Data Caching in Wireless Multi-hop Ad Hoc Networks.",
                    "Hierarchical Distributed Data Classification in Wireless Sensor Networks.",
                    "Cooperative download in urban vehicular networks.",
                    "On Accuracy of Region-based Localization Algorithms for Wireless Sensor Networks.",
                    "Ratio-based Zero-profiling Indoor Localization.",
                    "Surviving Holes and Barriers in Geographic Data Reporting for Wireless Sensor Networks.",
                    "A Mobility and Congestion Resilient Data Management System for Mobile Distributed Networks.",
                    "Throughput Capacity of Mobility-assisted Data Collection in Wireless Sensor Networks.",
                    "Mobile Relay Configuration in Data-intensive Wireless Sensor Networks.",
                    "Who, When, Where: Timeslot Assignment to Mobile Clients.",
                    "A Multi-Rate Based Router Placement Scheme for Wireless Mesh Networks.",
                    "Molecular MAC for Multichannel Wireless Mesh Networks.",
                    "Almost Optimal Distributed M2M Multicasting in Wireless Mesh Networks.",
                    "A Generalized Markov Chain Model For Effective Analysis of Slotted IEEE 802.15.4.",
                    "Scalable Emulation of TinyOS Applications in Heterogeneous Network Scenarios.",
                    "A MAC Protocol For Real-Time Sensing Applications Using Asymmetric Tranceivers.",
                    "Reprogramming with Minimal Transferred Data on Wireless Sensor Network.",
                    "Erasure-Coding Based Utility Routing in Multi-hop Wireless Networks.",
                    "On Interest Locality in Content-Based Routing for Large-scale MANETs.",
                    "Scalable Integrated Routing Using Prefix Labels and Distributed Hash Tables for MANETs.",
                    "PaMeLA: A Joint Channel Assignment and Routing Algorithm for Multi-Radio Multi-Channel Wireless Mesh Networks with Grid Topology.",
                    "Level the Buffer Wall: Fair Channel Assignment in Wireless Sensor Networks.",
                    "Adaptive and Distributed Scheduling in Heterogeneous MIMO-based Ad hoc Networks.",
                    "Packet Scheduling with Joint Design of MIMO and Network Coding.",
                    "How to Break LU Matrix Based Key Predistribution Schemes for Wireless Sensor Networks.",
                    "Enlighten Me! Secure Key Assignment in Wireless Sensor Networks.",
                    "Secure Autoconfiguration and Public-key Distribution for Mobile Ad-hoc Networks.",
                    "ChainFarm: A Novel Authentication Protocol for High-rate Any Source Probabilistic Broadcast.",
                    "Multicast Capacity of Multihop Cognitive Networks.",
                    "Minimum Maintenance Cost Routing in Cognitive Radio Networks.",
                    "Joint QoS-aware Admission Control, Channel Assignment, and Power Allocation for Cognitive Radio Cellular Networks.",
                    "Cog Gap: A Cognitive and Opportunistic Gateway Access Algorithm in Wireless Mesh Networks.",
                    "Intrusion Detection in Gaussian Distributed Wireless Sensor Networks.",
                    "Measuring location privacy in V2X communication systems with accumulated information.",
                    "Providing Source Privacy in Mobile Ad Hoc Networks.",
                    "Multigrade Security Monitoring for Ad-Hoc Wireless Networks.",
                    "Efficient Data Aggregation in Multi-hop Wireless Sensor Networks under Physical Interference Model.",
                    "Multi-Channel Scheduling Algorithms for Fast Aggregated Convergecast in Sensor Networks.",
                    "Bounded Relay Hop Mobile Data Gathering in Wireless Sensor Networks.",
                    "Energy-efficient On-demand Active Contour Service for Sensor Networks.",
                    "Cross-layer Approach for Energy Efficient Routing in WANETs.",
                    "An Analytical Study of Subdividing Hexagon-Clustered WSN for Power Saving.",
                    "Message Forwarding in Cyclic MobiSpace: the Multi-copy Case.",
                    "Probabilistic Estimation of End-to-End Path Latency in Wireless Sensor Networks.",
                    "Probabilistic-based Message Dissemination in Ad-Hoc and Sensor Networks using Directional Antennas.",
                    "Cooperation Helps Power Saving.",
                    "An Improved Lightweight Synchronisation Primitive For Sensornets.",
                    "TPSS: A Two-phase Sleep Scheduling Protocol for Object Tracking in Wireless Sensor Networks.",
                    "Focused-Coverage by Mobile Sensor Networks.",
                    "Directed Coverage in Wireless Sensor Networks: Concept and Quality.",
                    "Target Coverage Problem in Wireless Sensor Networks: A Column Generation Based Approach.",
                    "Performance Analysis of Stochastic Network Coverage with Limited Mobility.",
                    "Reliable Multicast in Wireless Networks Using Network Coding.",
                    "Interference and Power Constrained Broadcasting and Multicasting in Wireless Ad Hoc Networks with Directional Antennas.",
                    "Fast Group Communications in Multihop Wireless Networks Subject to Physical Interference.",
                    "OppCast: Opportunistic Broadcast of Warning Messages in VANETs with Unreliable Links.",
                    "FOCUS: A Cost-Effective Approach for Large-Scale Crop Monitoring with Sensor Networks.",
                    "Dynamic Linking and Loading in Networked Embedded Systems.",
                    "DMRC: Distortion-Minimizing Rate Control for Wireless Multimedia Sensor Networks.",
                    "On the Minimum Number of Neighbours for Good Routing Performance in MANETs.",
                    "OWL: Towards Scalable Routing in MANETs Using Depth-First Search On Demand.",
                    "BDP: A Bloom Filters Based Dissemination Protocol in Wireless Sensor Networks.",
                    "Two Ray or not Two Ray this is the price to pay.",
                    "Ticket-based Reliable Routing in VANET.",
                    "Analysis of Aggregated Power Level and Rate-Power Control Designs for Status Update Messages in VANETs.",
                    "RF-GPS: RFID Assisted Localization in VANETs.",
                    "Real-Time Weather Notification System using Intelligent Vehicles and Smart Sensors.",
                    "LICP: A Look-ahead Intersection Control Policy with Intelligent Vehicles.",
                    "Design & Implementation of IEEE 802.11s Mesh Nodes with Enhanced Features.",
                    "Achieving Fairness in Lossy 802.11e Wireless Multi-Hop Mesh Networks.",
                    "Starvation Effect Study in IEEE 802.11 Mesh Networks.",
                    "Evaluation of a Potential Energy Methodology for Joint Routing and Scheduling in Wireless Mesh Networks.",
                    "Route Selection for Capacity Maximization in Multi-Rate TDMA-based Wireless Ad Hoc Networks.",
                    "Optimal Forwarder List Selection in Opportunistic Routing.",
                    "Multicast Routing and Channel Assignment in Wireless Mesh Networks.",
                    "Performance Evaluation of a WiMAX Multi-Hop Relay System to Support Multicast/Broadcast Service.",
                    "Quality-Aware Multiple Backbone Construction on Multi-interface Wireless Mesh Networks for P2P Streaming.",
                    "Detecting Privacy Infractions in Applications: A Framework and Methodology.",
                    "Extended Attribute Based Encryption for Private Information Retrieval.",
                    "A Fuzzy Comprehensive Evaluation Model for Harms of Computer Virus.",
                    "A Study on Read-Write Protection of a Digital Document by Cryptographic Techniques.",
                    "Security Considerations on Pervasive Real-time Collaboration.",
                    "A Strategy-proof Trust Mechanism for Pervasive Computing Environments.",
                    "Computational Model for Trust Management in RFID Supply Chains.",
                    "A New High-Performance Approach for Offline Replacement Attack Prevention in Trusted Clients.",
                    "A-Kad: an anonymous P2P protocol based on Kad network.",
                    "Intelligent Honeypot Agent for Blackhole Attack Detection in Wireless Mesh Networks.",
                    "A Directed Acyclic Graph based Detection for RBAC Based Secure.",
                    "RPROB - A Family of Binomial-Mix-based Anonymous Communication Systems.",
                    "Towards Neutral Trust Management Framework in Unstructured Networks.",
                    "Strong authentication with mobile phone as security token.",
                    "Operating System Mechanisms for TPM-Based Lifetime Measurement of Process Integrity.",
                    "Design of a Trust Model and Finding Key-Nodes in Rumor Spreading Based on Monte-Carlo Method.",
                    "Requirements for Evidential Value for the Assessment of the Trustworthiness of Digital Records over Time.",
                    "An Efficient Geographic Location-based Security Mechanism for Vehicular Adhoc Networks.",
                    "Adaptive Security and Trust Management for Autonomic Message-Oriented Middleware.",
                    "Strengthening Class1 Gen2 RFID Tags.",
                    "Improving the Reliability of Embedded Systems with Cache and SPM.",
                    "A Heuristic Policy-based System Call Interposition in Dynamic Binary Translation.",
                    "Pervasive Service Access with SIM-based VPN.",
                    "QoS-aware Optimization Strategy for Security Ranking in SSL Protocol.",
                    "CENDA-Camouflage Event Based Malicious Node Detection Architecture.",
                    "A Low-Frequency RFID to Challenge Security and Privacy Concerns.",
                    "Secure localization and location verification in wireless sensor networks.",
                    "Distributed Lightweight Target Tracking for Wireless Sensor Networks.",
                    "RRDD: Receiver-oriented Robust Data Delivery in Mobile Sensor Networks.",
                    "A new broadcast-Key Management Scheme for Distributed Wireless Sensor Networks.",
                    "A Price-based Adaptive Task Allocation for Wireless Sensor Network.",
                    "Anti-Sensornet: Intruders and Countermeasures.",
                    "Practical Location-based Routing Protocol in Vehicular Ad Hoc Networks.",
                    "EUCOW: Energy-Efficient Boundary Monitoring for Unsmoothed Continuous Objects in Wireless Sensor Network.",
                    "On Efficient Deployment of High-end Sensors in Large-scale Heterogeneous WSNs.",
                    "UD-TDMA: A Distributed TDMA Protocol for Underwater Acoustic Sensor Network.",
                    "A Proportional Fair Backoff Scheme for Wireless Sensor Networks.",
                    "A High-Accuracy Real-Time Localization Algorithm for Wireless Sensor Networks.",
                    "An Enhanced Query Tree Protocol for RFID Tag Collision Resolution with Progressive Population Estimation.",
                    "On Channel Usability of Wireless Mesh Networks -- When Stability Plays With You.",
                    "Throughput and Delay Analysis of the IEEE 802.15.3 CSMA/CA Mechanism.",
                    "A Cross-Layer Design for Dynamic Resource Block Allocation in 3G Long Term Evolution System.",
                    "An Enhanced Synchronization Approach for RFID Private Authentication.",
                    "A Note on the Study of Bluetooth Networks' Distributed Algorithms.",
                    "A kNN Search Protocol Using a Voronoi Diagram in Wireless Broadcast Environments.",
                    "Delay and Energy Efficiency Tradeoffs for Data Collections in Large Scale Wireless Sensor Networks.",
                    "A Force-Driven Evolutionary Approach for Multi-objective 3D Differentiated Sensor Network Deployment.",
                    "A new Group Key Management Scheme based on DMST for Wireless Sensor Networks.",
                    "Design and Implementation of a Security Manager for WirelessHART Networks.",
                    "A Per-Hop Security Scheme for Highly Dynamic Wireless Sensor Networks.",
                    "DiffUser: Differentiated User Access Control on Smartphone.",
                    "cooperative anonymity authentication in vehicular networks.",
                    "Quantum Communication in Distributed Wireless Sensor Networks.",
                    "Randomly Directed Exploration: An Efficient Node Clone Detection Protocol in Wireless Sensor Networks.",
                    "Performance Impact of and Protocol Interdependencies of IEEE 802.15.4 Security Mechanisms.",
                    "A Principal-Agent Method to Prevent Selfish MAC Layer Behavior in Wireless Networks.",
                    "Private Cluster Head Election in Wireless Sensor Networks.",
                    "SecMCL: A Secure Monte Carlo Localization Algorithm for Mobile Sensor Networks.",
                    "Accurate Power Profiling of Sensornets with the COOJA/MSPSim Simulator.",
                    "Design and implementation of non-autonomous mobile wireless sensor for debris flow monitoring.",
                    "iTracking: Accurate Light-based Location-tracking in Wireless Sensor Networks.",
                    "Quality Estimation based Data Fusion in Wireless Sensor Networks.",
                    "VS3: A Vehicular Surveillance and Sensing System for Security Applications.",
                    "Pattern Formation Using Multiple Robots."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th MASS 2008",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2008",
                "sub_name": "IEEE 5th International Conference on Mobile Adhoc and Sensor Systems, MASS 2008, 29 September - 2 October 2008, Atlanta, Georgia, USA.",
                "count": 132,
                "papers": [
                    "Scalable multicast routing in MANETs using sender-initiated multicast meshes.",
                    "Efficient monitoring in wireless mesh networks: Overheads and accuracy trade-offs.",
                    "On accurate and efficient statistical counting in sensor-based surveillance systems.",
                    "Towards a self-organizing stochastic-communications paradigm for wireless ad-hoc/sensor networks.",
                    "Coverage planning of Wireless Sensors for mobile target detection.",
                    "A phonological expression for physical movement monitoring in body sensor networks.",
                    "Connectivity monitoring in wireless sensor networks.",
                    "Informed network coding for minimum decoding delay.",
                    "A linear message distributed multicast algorithm with guaranteed directional communication lifetime in WANETs.",
                    "Optimal scaling of multicommodity flows in wireless ad hoc networks: Beyond the Gupta-Kumar barrier.",
                    "Broadcast capacity for wireless ad hoc networks.",
                    "Data gathering capacity of large scale multihop wireless networks.",
                    "Virtual Cord Protocol (VCP): A flexible DHT-like routing service for sensor networks.",
                    "Joint routing and navigation protocols for data harvesting in sensor networks.",
                    "Distributed online data aggregation for large scale sensor networks.",
                    "Performance evaluation of a wireless sensor network based tracking system.",
                    "A low-cost, low-data-rate rapid structural assessment network: Design, implementation, and experimentation.",
                    "Drift: A highly condensed emulation framework for mobile nodes in server clusters.",
                    "Minimizing multi-hop wireless routing state under application-based accuracy constraints.",
                    "Adaptive path accumulation for reactive routing protocols.",
                    "A physical model scheduler for multi-hop wireless networks based on local information.",
                    "An STDMA-based framework for QoS provisioning in wireless mesh networks.",
                    "Heterogeneous wireless access in large mesh networks.",
                    "Border landmark selection and applications in self-configurable wireless networks.",
                    "Dynamic spatial backoff in fading environments.",
                    "Node synchronization for minimizing delay and energy consumption in low-power-listening MAC protocols.",
                    "A cross-layer communication solution for multimedia applications in underwater acoustic sensor networks.",
                    "OPERA: Opportunistic packet relaying in disconnected Vehicular Ad Hoc Networks.",
                    "Topology characterization of high density airspace aeronautical ad hoc networks.",
                    "Automated sensor-specific power management for wireless sensor networks.",
                    "DECODE : Detecting co-moving wireless devices.",
                    "Seal-2-Seal: A delay-tolerant protocol for contact logging in wildlife monitoring sensor networks.",
                    "SpyMon: Hidden network monitoring for security in wireless sensor Networks.",
                    "On group target tracking with binary sensor networks.",
                    "Stateless and guaranteed geometric routing on virtual coordinate systems.",
                    "Distributed roadmap aided routing in sensor networks.",
                    "Performance evaluation of an encountered based multicast scheme for disruption tolerant networks.",
                    "Writing on water, a lightweight soft-state tracking framework for dense mobile ad hoc networks.",
                    "Radio teaming: Establishing communication when communication is not possible.",
                    "Using directionality in mobile routing.",
                    "A new approach for integrating proactive and reactive routing in MANETs.",
                    "Opportunistic routing in wireless ad hoc networks: Upper bounds for the packet propagation speed.",
                    "A scalable hybrid routing architecture with Off-Network Control Processing for very large sensor networks.",
                    "A framework for joint scheduling and diversity exploitation under physical interference in wireless mesh networks.",
                    "Modelling network selection and resource allocation in wireless access networks with non-cooperative games.",
                    "Adaptive QoS routing for significant events in wireless sensor networks.",
                    "Assured Forwarding in multi-hop wireless networks.",
                    "Opportunistic transmission based QoS topology control in wireless sensor networks.",
                    "Finger: An efficient policy system for body sensor networks.",
                    "AS-MAC: An asynchronous scheduled MAC protocol for wireless sensor networks.",
                    "The benefits of directional antennas in heterogeneouswireless ad-hoc networks.",
                    "Hop-by-hop multicast transport for mobile ad hoc wireless networks.",
                    "Enforcing cooperation in ad hoc networks with unreliable channel.",
                    "A queuing model-based incentive scheme for optimal data transmission in wireless networks with selfish nodes.",
                    "A probabilistic replication and storage scheme for large wireless networks of small devices.",
                    "GroupBeat: Wireless sensor networks made reliable.",
                    "Progressive joint coding, estimation and transmission censoring in energy-centric wireless data gathering networks.",
                    "LEAP: Localized Energy-Aware Prediction for data collection in wireless sensor networks.",
                    "Duty cycle control for low-power-listening MAC protocols.",
                    "Using node accountability in credential based routing for mobile ad-hoc networks.",
                    "Interference-aware distributed scheduling in TDMA Wireless Mesh Networks.",
                    "Achieving throughput fairness in Wireless Mesh Networks based on IEEE 802.11.",
                    "Improving QoS under lossy channels through adaptive redundancy.",
                    "In-network path planning for distributed sensor network navigation in dynamic environments.",
                    "More is more: The benefits of dense sensor deployment.",
                    "Interference aware multi-path routing in wireless networks.",
                    "Minimum interference multipath routing using multiple gateways in wireless mesh networks.",
                    "Using cable-based mobile sensors to assist environment surveillance.",
                    "Moving multiple sinks through wireless sensor networks for lifetime maximization.",
                    "RFMS: Real-time Flood Monitoring System with wireless sensor networks.",
                    "Cluster-based data transmission protocol in delay-tolerant mobile networks.",
                    "Swarm intelligence: Coverage and connectivity control for mobile sensors.",
                    "Fault-tolerant event region detection in wireless sensor networks using statistical hypothesis test.",
                    "Prototype of a social networking application in a multi-hop autonomous ad hoc network.",
                    "Sensors enabling automatic generation of electronic music.",
                    "SCOPE- service classified overlay for P2P environment, a service platform for P2P services over ad-hoc networks.",
                    "A software platform for developing multi-player pervasive games using small programmable object technologies.",
                    "DG-CastoR for query packets dissemination in VANET.",
                    "The vehicular environment and its effect on broadcast protocols in VANETs.",
                    "Scalable multicast routing for ad hoc networks.",
                    "Proactive path maintenance over regions of interests in MANETs.",
                    "GPEB: Power-efficient geographic broadcasting in sensor networks.",
                    "Cost-effective multidimensional publish/subscribe services in sensor networks.",
                    "An anti-storm approach for IP address auto-configuration in Mobile Ad Hoc Networks.",
                    "MANET mining: Mining step association rules.",
                    "Energy-efficient tracking strategy for wireless sensor networks.",
                    "Evaluating load balancing in peer-to-peer resource sharing algorithms for wireless mesh networks.",
                    "Intrusion detection systems for community wireless mesh networks.",
                    "Proxy Mobile IPv6 for Cluster Based Heterogeneous Wireless Mesh networks.",
                    "SINR-sensitive routing in wireless 802.11 mesh networks.",
                    "A load dependent metric for balancing Internet traffic in Wireless Mesh Networks.",
                    "A hybrid Multi Meshed Tree routing protocol for wireless ad hoc networks.",
                    "A novel approach to WLAN mesh interworking with multiple mesh portals.",
                    "Airtime Deficit Round Robin (ADRR) packet scheduling algorithm.",
                    "A framework for cooperative communications at the system level.",
                    "A cluster driven channel assignment mechanism for wireless mesh networks.",
                    "Autonomous and Intelligent Radio Switching for heterogeneous wireless networks.",
                    "OLSR enhancement for multi-interface multi-channel ad hoc networks.",
                    "Periodic packets in energy-aware wireless networks.",
                    "Simultaneous MultiRoutes QoS Routing for ad-hoc networks (SMRQR).",
                    "Optimal distributed algorithm for minimum connected dominating sets in Wireless Sensor Networks.",
                    "Performance of Wi-Fi and bluetooth in mobile ad hoc networks.",
                    "Challenges and perspectives in the implementation of NOTICE architecture for vehicular communications.",
                    "On cache invalidation for internet-based vehicular ad hoc networks.",
                    "SBRM: Score-Based Routing Mechanism for vehicle ad hoc network.",
                    "Optimizing CASCADE data aggregation for VANETs.",
                    "Quality of information: An empirical approach.",
                    "Context-aware QoI computation in multi-sensor systems.",
                    "A quality-of-information-aware framework for data models in wireless sensor networks.",
                    "Securing information flows: A metadata framework.",
                    "QoI for passive acoustic gunfire localization.",
                    "Adaptive sampling for transient signal detection in the presence of missing samples.",
                    "Quality-driven congestion control for target tracking in wireless sensor networks.",
                    "Data quality driven sensor reporting.",
                    "Energy-based task load balancing in wireless sensor networks.",
                    "The transport capacity of a wireless network is a subadditive euclidean functional.",
                    "Throughput analysis of Delay Tolerant Networks with finite buffers.",
                    "KeyLED - transmitting sensitive data over out-of-band channels in wireless sensor networks.",
                    "Why is IPSec a viable option for wireless sensor networks.",
                    "Requirements and objectives for secure Traffic Information Systems.",
                    "A framework for confronting key-swapping collusion attack on random pairwise key pre-distribution schemes for distributed sensor networks.",
                    "Securing coding based distributed storage in wireless sensor networks.",
                    "Analysis of mobile WiMAX security: Vulnerabilities and solutions.",
                    "Detecting sybil attacks inwireless and sensor networks using cluster analysis.",
                    "DHB-KEY: An efficient key distribution scheme for wireless sensor networks.",
                    "Authenticated symmetric key distribution for mobile ad hoc networks.",
                    "Pair-wise network topology authenticated hybrid cryptographic keys for Wireless Sensor Networks using vector algebra.",
                    "Study of a new physical layer encryption concept.",
                    "An intrusion detection system for wireless process control systems.",
                    "Protecting the DNS infrastructure of a top level domain: Real-time monitoring with network sensors.",
                    "Analysis the cooperation strategies in mobile ad hoc networks.",
                    "Harnessing delay tolerance to increase delivery ratios in mobile ad hoc networks with misbehaving nodes."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th MASS 2007",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2007",
                "sub_name": "IEEE 4th International Conference on Mobile Adhoc and Sensor Systems, MASS 2007, 8-11 October 2007, Pisa, Italy.",
                "count": 176,
                "papers": [
                    "Efficient and Adjustable Recipient Anonymity in Mobile Ad Hoc Networks.",
                    "Fault-Tolerant Topology Control for Heterogeneous Wireless Sensor Networks.",
                    "Routing Overhead as A Function of Node Mobility: Modeling Framework and Implications on Proactive Routing.",
                    "Performance Evaluation of a Hybrid Testbed for Wireless Mesh Networks.",
                    "Impact of Energy Models on Energy Efficient Sensor Network Routing.",
                    "A Reliability-oriented Transmission Service in Wireless Sensor Networks.",
                    "Comparison of Three Estimation Methods for RSSI-Based Localization with Multiple Transmit Antennas.",
                    "Network Connectivity under Probabilistic Communication Models in Wireless Sensor Networks.",
                    "Routing in Mobile Ad-hoc Networks: the Virtual Distance Vector Protocol.",
                    "Open-ZB: an open-source implementation of the IEEE 802.15.4/ZigBee protocol stack on TinyOS.",
                    "Optimizing the Internet Gateway Deployment in a Wireless Mesh Network.",
                    "SIDA: Self-organized ID Assignment in Wireless Sensor Networks.",
                    "Overhearing based relaying scheme in wireless sensor networks with mobile access points.",
                    "Low-Overhead Dominating Set based Algorithms for Maximizing Lifetime in Wireless Sensor Networks.",
                    "Real Time Communications over 802.11: RT-WMP.",
                    "On Intelligent Mobile Target Detection in a Mobile Sensor Network.",
                    "NBgossip - Neighborhood Gossip with Network Coding Based Message Aggregation.",
                    "A Graph Drawing Approach to Sensor Network Localization.",
                    "DYNAMMA: A DYNAmic Multi-channel Medium Access Framework for Wireless Ad Hoc Networks.",
                    "BOSS: Beacon-less On Demand Strategy for Geographic Routing inWireless Sensor Networks.",
                    "Distributed Information Storage and Collection for WSNs.",
                    "Mobility Aware Playout Algorithm for Interactive Audio Streaming over Wireless Ad-Hoc Networks.",
                    "Modeling Route Duration in Mobile Ad-Hoc Networks.",
                    "Efficient Mesh Router Placement in Wireless Mesh Networks.",
                    "Multicast QoS Support in IEEE 802.11 WLANs.",
                    "Energy-Efficient Routing in Linear Wireless Sensor Networks.",
                    "Forced Transmissions for Coping with the Effect of Blocked Stations in 802.11 Wireless Networks.",
                    "Retransmission or Redundancy: Transmission Reliability in Wireless Sensor Networks.",
                    "Localization Using Low-Resolution Optical Sensors.",
                    "Indoor Localization Using Multiple Wireless Technologies.",
                    "Understanding Performance for Two 802.11 Competing Flows.",
                    "Distributed MAC Strategy for Exploiting Multi-user Diversity in Multi-rate IEEE 802.11 Wireless LANs.",
                    "Securing Very Dynamic Groups and Data Aggregation in Wireless Sensor Networks.",
                    "A Receiver Oriented MAC Protocol for Wireless Sensor Networks.",
                    "A Decentralized Hole-Shape Regulation Technique for Enhancing Patrol and Deployment Tasks in Mobile WSNs.",
                    "Analysis and improvement of contention access protocol in IEEE 802.15.4 star network.",
                    "Topology Control and Channel Assignment in Multi-Radio Multi-Channel Wireless Mesh Networks.",
                    "Ultra-Low-Power Optimizations for the IEEE 802.15.4 Networking Protocol.",
                    "NARD: Neighbor-Assisted Route Discovery in Wireless Ad Hoc Networks.",
                    "Exploiting Reinforcement Learning for Multiple Sink Routing in WSNs.",
                    "Relay-based Multi-hop Access to Wireless Mesh Networks.",
                    "An Adaptive Delay-Minimized Route Design for Wireless Sensor-Actuator Networks.",
                    "A Network Protocol to Enhance Robustness in Tree-Based WSNs Using Data Aggregation.",
                    "ANDES: an Anomaly Detection System for Wireless Sensor Networks.",
                    "Distributed Localization Strategies for Sensor Networks.",
                    "Performance Comparison of Optimization Algorithms for Clustering in Wireless Sensor Networks.",
                    "Precise Admission Control for Bandwidth Reservation in Wireless Mesh Networks.",
                    "Constructing MANET Simulation Scenarios That Meet Standards.",
                    "Fair Capacity Sharing Among Multiple Sinks in Wireless Sensor Networks.",
                    "Experimental Study of Measurement-based Admission Control for Wireless Mesh Networks.",
                    "PANEL: Position-based Aggregator Node Election in Wireless Sensor Networks.",
                    "Polylogarithmic Store-Carry-Forward Routing using Mobile Nodes.",
                    "Non-Cooperative Coexistence of Co-located Independent Wireless Mesh Networks.",
                    "Destination-Region-Based Local Minimum Aware Geometric Routing.",
                    "Anti-Collusion Position Estimation in Wireless Sensor Networks.",
                    "Position Uncertainties in Range-free Wireless Sensor Network Localization.",
                    "E-MAC: Self-Organizing 802.11-Compatible MAC with Elastic Real-time Scheduling.",
                    "Exploiting Overhearing: Flow-Aware Routing for Improved Lifetime in Ad Hoc Networks.",
                    "An Adaptive QoS Architecture for IEEE 802.16 Broadband Wireless Networks.",
                    "Energy-aware Geographic Forwarding of Prioritized Messages in Wireless Sensor Networks.",
                    "Admission Control and Interference-Aware Scheduling in Multi-hop WiMAX Networks.",
                    "Availability Modeling and Analysis of Autonomous In-Door WSNs.",
                    "Enabling Scope-Based Interactions in Sensor Network Macroprogramming.",
                    "Repairing network partitions in Wireless Sensor Networks.",
                    "Throughput Optimization Routing Under Uncertain Demand for Wireless Mesh Networks.",
                    "Distributed Independent Reinforcement Learning (DIRL) Approach to Resource Management in Wireless Sensor Networks.",
                    "Flexible Sensor Network Reprogramming for Logistics.",
                    "Application of DHT-Inspired Routing for Object Tracking.",
                    "An Analysis of Handoff in Multi-band 802.11 Networks.",
                    "On the Asymptotic Behavior of Malware-Propagative Mobile Ad Hoc Networks.",
                    "A Distributed Sensor Relocatlon Scheme for Environmental Control.",
                    "Cluster-Enhanced Techniques for Pattern-Matching Localization Systems.",
                    "Coordinated Workload Scheduling in Hierarchical Sensor Networks for Data Fusion Applications.",
                    "Sensor Relocation with Mobile Sensors: Design, Implementation, and Evaluation.",
                    "ROPAS: Cross-layer Cognitive Architecture for Mobile UWB Networks.",
                    "An Epidemic Theoretic Framework for Evaluating Broadcast Protocols in Wireless Sensor Networks.",
                    "The Node Reliability Approach to Broadcasting in Manets: Raising Reliability With Low End-to-End Delay.",
                    "Network Coding-Based Protection of Many-to-One Flow Networks.",
                    "On Improving Data Accessibility in Storage Based Sensor Networks.",
                    "Trusted Application-Centric Ad-Hoc Networks.",
                    "A Case for Joint Routing, Scheduling, and Network Coding in TDMA-based Wireless Mesh Networks: A Cross-layer Approach.",
                    "TARP: A Trust-Aware Routing Protocol for Sensor-Actuator Networks.",
                    "Opportunistic Source Coding for Data Gathering in Wireless Sensor Networks.",
                    "Efficient P2P Service Control Overlay Construction to Support IP Telephony Services Over ad-hoc Networks.",
                    "Random and Periodic sleep schedules for target detection in sensor networks.",
                    "Controlled Interference Mitigation MAC for UWB Networks with Quality of Service Support.",
                    "Opportunistic Mobile Sensor Data Collection with SCAR.",
                    "Mitigating propagation errors for indoor positioning in wireless sensor networks.",
                    "Oscillations in a Bio-Inspired Routing Algorithm.",
                    "Empirical Study of Topology Effects on Diagnosis in Computer Networks.",
                    "A Biologically Inspired Denial of Service Detector Using the Random Neural Network.",
                    "Delayed Evolutionary Game Dynamics applied to Medium Access Control.",
                    "Information Dissemination using Epidemic Routing with Delayed Feedback.",
                    "Embedding Evolution in Epidemic-Style Forwarding.",
                    "Admission of Packet Flows in a Self-Aware Network.",
                    "IEEE 802.15.4a CSS-based Localization System for Wireless Sensor Networks.",
                    "Supply Chain Management Automation using Wireless Sensor Networks.",
                    "Mobile Network Supported Wireless Sensor Network Services.",
                    "Topological Estimation using Ultrasonic and Radio.",
                    "Design, Proposal, and Experiments of a Wireless Sensor Network Architecture for Urgent Information Transmission.",
                    "Demo: A Generic Platform for Sensor Network Applications.",
                    "Rapid prototyping suite of IEEE 802.15.4-compliant Sensor Networks.",
                    "Demonstrating the Resilience of Geographical Routing to Localization Errors.",
                    "Context-aware File Sharing for Opportunistic Networks.",
                    "Data-Centric Information Dissemination in Opportunistic Environments.",
                    "MobiMESH: a Complete Solution for Wireless Mesh Networking.",
                    "GeoAds: A Middleware Architecture for Music Service with Location-Aware Advertisement.",
                    "Adaptive Sampling for Energy Conservation in Wireless Sensor Networks for Snow Monitoring Applications.",
                    "Key Establishment Protocol for Wireless Sensor Networks.",
                    "Wireless Sensor Networks for Early Detection of Forest Fires.",
                    "Designing a Novel SOA Architecture for Security and Surveillance WSNs with COTS.",
                    "Fire Detection in the Urban Rural Interface through Fusion techniques.",
                    "Topology Control Algorithms: a qualitative study during the sensor networks life.",
                    "Lower-Priority-Triggered Distributed MAC-layer Priority Scheduling in Wireless Ad Hoc Networks.",
                    "Optimal Scheduling of Sensors' States to Maximize Network Lifetime in Wireless Sensor Networks.",
                    "Performance Enhancement in AODV with Accessibility Prediction.",
                    "A Hybrid Hierarchical Multi-Hop Wireless Network: From Wireless Sensors to the Fixed Infrastructure.",
                    "Semi-Beaconless Power and Cost Efficient Georouting with Guaranteed Delivery using Variable Transmission Radii for Wireless Sensor Networks.",
                    "Energy-aware On-demand Scatternet Formation and Routing.",
                    "A Novel Synchronization Algorithm for IEEE802.11 TDMA Ad Hoc Network.",
                    "Anycast-RPC for Wireless Sensor Networks.",
                    "Quantitative Evaluation of Location Systems Techniques for Short-Range RF-Based Sensor Networks.",
                    "IEEE 802.11s MAC Fundamentals.",
                    "A Distributed and Autonomous Beacon Scheduling Algorithm for IEEE 802.15.4/ZigBee Networks.",
                    "Impact of Directional Antennas in Wireless Sensor Networks.",
                    "Evaluation of VoIP Performance in Downlink Cellular Networks With Multihop Relaying.",
                    "End-to-End Bandwidth Reservation in IEEE 802.16 Mesh Networks.",
                    "On Indoor Multi-hopping capacity of Wireless Ad-Hoc Mesh Networks.",
                    "Update on the Hybrid Wireless Mesh Protocol of IEEE 802.11s.",
                    "A Statistic-Based Approach towards Routing in Mesh Networks.",
                    "Interference-aware Multipath Selection for Reliable Routing in Wireless Mesh Networks.",
                    "Monitoring assisted robust routing in wireless mesh networks.",
                    "MAYA: A Tool For Wireless Mesh Networks Management.",
                    "Measurement Campaign on Connectivity of Mesh Networks formed by Mobile Devices.",
                    "Augmented Tree-based Routing Protocol for Scalable Ad Hoc Networks.",
                    "GRAPE - Gradient based Routing for All PurposE.",
                    "Efficient CAC in Broadband Wireless Access Networks based on Hierarchical Structures.",
                    "Design and Implementation of Cross-layer Architecture for Seamless VoIP Handover.",
                    "A Tree-based Channel Assignment Scheme for Wireless Mesh Networks.",
                    "Query Domains: Grouping Heterogeneous Sensors Based on Proximity.",
                    "A Novel Contention-Free Medium Access Control Protocol for Inter-Vehicle Communication Systems.",
                    "Communication Density: A Channel Load Metric for Vehicular Communications Research.",
                    "A Cross Layered MAC and Clustering Scheme for Efficient Broadcast in VANETs.",
                    "Reliable roadside-to-roadside data transfer using vehicular traffic.",
                    "Performance Comparison of a Position-Based Routing Protocol for VANET.",
                    "Understanding Vehicular Mobility in Network Simulation.",
                    "Experimental Assessment of V2V and I2V Communications.",
                    "VIPER: A vehicle-to-infrastructure communication privacy enforcement protocol.",
                    "Anonymity Notions for Public-Key Infrastructures in Mobile Vehicular Networks.",
                    "On the Sybil attack detection in VANET.",
                    "A Study on Data Aggregation and Reliability in Managing Wireless Sensor Networks.",
                    "MVSINK: Incrementally Improving In-Network Aggregation.",
                    "Towards Energy Optimization in Environmental Wireless Sensor Networks for Lossless and Reliable Data Gathering.",
                    "Very High Speed Ordered Mesh Network of Seismic Sensors for Oil and Gas Exploration.",
                    "Improving many-to-one traffic flowing in multi-hop 802.15.4 WSNs using a MAC-level fair scheduling.",
                    "A Simple Active Congestion Control in Wireless Sensor Network.",
                    "TDMA-Schemes for Tree-Routing in Data Intensive Wireless Sensor Networks.",
                    "Data fusion in observer networks.",
                    "Opportunistic computing for wireless sensor networks.",
                    "Context Fusion: Dealing with Sensor Reliability.",
                    "Energy and Data Aware Clustering for Data Aggregation in Wireless Sensor Networks.",
                    "On Real Time Data-Gathering in Sensor Networks.",
                    "Exploiting Spatial Correlation in a three dimensional Wireless Sensor Network.",
                    "Discrete Radio Power Level Consumption Model in Wireless Sensor Networks.",
                    "Topology Control for Secured Coverage in Wireless Sensor Networks.",
                    "Assessment of Energy Consumption in Wireless Sensor Networks: A Case Study for Security Algorithms.",
                    "Distributed Node Revocation based on Cooperative Security.",
                    "ARPD: Asynchronous random key predistribution in the LEAP framework for Wireless Sensor Networks.",
                    "A Level-based Key Management for both In-Network Processing and Mobility in WSNs.",
                    "n-LQA: n-Layers Query Authentication in Sensor Networks.",
                    "Formal Analysis of Sensor Network Encryption Protocol (SNEP).",
                    "Secure k-Connectivity Properties of Wireless Sensor Networks.",
                    "The Security Proof of a Link-state Routing Protocol for Wireless Sensor Networks.",
                    "Impact of Packet Injection Models on Misbehaviour Detection Performance in Wireless Sensor Networks.",
                    "Authenticated key exchange with group support for wireless sensor networks.",
                    "Wireless and Sensor Networks Security (WSNS) A Retrospection."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd MASS 2006",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2006",
                "sub_name": "IEEE 3rd International Conference on Mobile Adhoc and Sensor Systems, MASS 2006, 9-12 October 2006, Vancouver, BC, Canada.",
                "count": 127,
                "papers": [
                    "Cross-Layer Optimization Framework for Rate Allocation in Wireless Multicast.",
                    "An Efficient Capacity Allocation Scheme of Periodic Polling Services for a Multimedia Traffic in an IEEE802.16 System.",
                    "Max-Min Fair Capacity of Wireless Mesh Networks.",
                    "Capacity Enhancement using Throwboxes in DTNs.",
                    "HIMAC: High Throughput MAC Layer Multicasting in Wireless Networks.",
                    "On the Fading and Shadowing Effects for Wireless Sensor Networks.",
                    "QoS Provision for Remote Sensing and Control in Heterogeneous Environments.",
                    "Channel Access Using Opportunistic Reservations in Ad Hoc Networks.",
                    "Time-Optimum Packet Scheduling for Many-to-One Routing in Wireless Sensor Networks.",
                    "Smart Gossip: An Adaptive Gossip-based Broadcasting Service for Sensor Networks.",
                    "Reliable Reporting of Delay-Sensitive Events in Wireless Sensor-Actuator Networks.",
                    "Efficient Sharing of Sensor Networks.",
                    "Cross-Layer Discovery and Routing in Reconfigurable Wireless Networks.",
                    "Cross Layer Ad hoc Multiple channel Multicasting Protocol.",
                    "An Integrated Scheme for Fully-Directional Neighbor Discovery and Topology Management in Mobile Ad hoc Networks.",
                    "Cross-layer Optimal Decision Policies for Spatial Diversity Forwarding in Wireless Ad Hoc Networks.",
                    "Energy Efficient Routing With Unreliable Links in Wireless Networks.",
                    "Distributed Adaptive Power Control in IEEE 802.11 Wireless Networks.",
                    "On the Energy Hole Problem of Nonuniform Node Distribution in Wireless Sensor Networks.",
                    "A New Power-Efficient Scheme to Deliver Time-Sensitive Data in Sensor Networks.",
                    "An Efficient Algorithm for Finding an Almost Connected Dominating Set of Small Size on Wireless Ad Hoc Networks.",
                    "QoS Routing for Real-time Applications in CDMA Based Ad Hoc Networks.",
                    "SSR: Segment-by-Segment Routing in Large-Scale Mobile Ad Hoc Networks.",
                    "Low Overhead and Scalable Proxied Adaptive Gateway Discovery for Mobile Ad Hoc Networks.",
                    "Robust Estimation and Detection in Ad Hoc and Sensor Networks.",
                    "PriorityCast: Efficient and Time-Critical Decision Making in First Responder Ad-Hoc Networks.",
                    "Two Standards for Rigorous MANET Routing Protocol Evaluation.",
                    "ODAR: On-Demand Anonymous Routing in Ad Hoc Networks.",
                    "A Push-based Paradigm for Environment Adaptive Application Reconfiguration in Clustered Sensor Networks.",
                    "Building Ring-Like Overlays on Wireless Ad Hoc and Sensor Networks.",
                    "Ad-hoc Storage Overlay System (ASOS): A Delay-Tolerant Approach in MANETs.",
                    "SENSTRAC: Scalable Querying of SENSor Networks from Mobile Platforms Using TRACking-Style Queries.",
                    "Distributed Boundary Estimation using Sensor Networks.",
                    "Virtual Ruler: Mobile Beacon Based Distance Measurements for Indoor Sensor Localization.",
                    "Communication Area Based Positioning.",
                    "Localization Algorithm using Expected Hop Progress in Wireless Sensor Networks.",
                    "An Intelligent Agent Routing over Wireless Sensor Networks.",
                    "RGP: Active Route Guiding Protocol for Wireless Sensor Networks with Obstacles.",
                    "Aligned Virtual Coordinates for Greedy Routing in WSNs.",
                    "Apples, Oranges, and Testbeds.",
                    "Energy-Efficient Target Coverage in Heterogeneous Wireless Sensor Networks.",
                    "Dropped Edges and Faces' Size in Gabriel and Relative Neighborhood Graphs.",
                    "Distributed Channel Assignment for Multi-radio Wireless Networks.",
                    "A Dual Approach for The Worst-Case-Coverage Deployment Problem in Ad-Hoc Wireless Sensor Networks.",
                    "PLUS: Parameterized and Localized trUst management Scheme for sensor networks security.",
                    "A Self-Configured Key Establishment Scheme for Large-Scale Sensor Networks.",
                    "S2RP: a Secure and Scalable Rekeying Protocol for Wireless Sensor Networks.",
                    "Dynamic Authentication-Key Re-assignment for Reliable Report Delivery.",
                    "SaFT: Reliable Transport in Mobile Networks.",
                    "Challenges of Secure Routing in MANETs: A Simulative Approach using AODV-SEC.",
                    "Cross-layered Hop-by-Hop Congestion Control for Multihop Wireless Networks.",
                    "A Scalable Quorum Based Location Service in Ad Hoc and Sensor Networks.",
                    "The Study of False Route Breakage in IEEE 802.11 based Ad Hoc Networks.",
                    "Extending Broadcast Lifetime in Ad Hoc Networks by Distributed and Smooth Backbone Update.",
                    "Quality of Service Routing and Admission Control for Mobile Ad-hoc Networks with a Contention-based MAC Layer.",
                    "Temporal Analysis of Routing Activity for Anomaly Detection in Ad hoc Networks.",
                    "Clustering Mesh-Like Wireless Sensor Networks with an Energy-Efficient Scheme (an Extended Abstract).",
                    "Max-min Fair Rate Allocation in Multi-hop Wireless Ad Hoc Networks.",
                    "Improving Accuracy in Available Bandwidth Estimation for IEEE 802.11-based Ad Hoc Networks.",
                    "Distributed Topology Control for Stationary and Mobile Ad Hoc Networks.",
                    "Location-aware ID Assignment in Wireless Sensor Networks.",
                    "Deterministic Data Reduction in Sensor Networks.",
                    "Adaptation of On-line Scheduling Strategies for Sensor Network Platforms.",
                    "Router Placement in Wireless Sensor Networks.",
                    "Lifetime Issues in Wireless Sensor Networks for Vineyard Monitoring.",
                    "Lifetime Enhancement of Wireless Sensor Networks by Differentiable Node Density Deployment.",
                    "AODV-DFR: Improving Ad Hoc Routing Scalability to Mobility and Load.",
                    "Multirate-aware Multicast Routing in MANETs.",
                    "On mitigating hot spots for clustering mechanisms in wireless sensor networks.",
                    "Adaptive Consensus Averaging for Information Fusion over Sensor Networks.",
                    "Coverage Time Characteristics in Sensor Networks.",
                    "Opportunistic Routing in Dynamic Ad Hoc Networks: the OPRAH protocol.",
                    "Dynamic Reconfiguration in the RUNES Middleware.",
                    "Dynamic Decision Support in Direct-Access Sensor Networks; A Demonstration.",
                    "Wireless Mesh Network Testbed Demo.",
                    "Load Balance and Energy Efficient Data Gathering in Wireless Sensor Networks.",
                    "Maximizing Throughput for Queries over Streaming Sensor Data.",
                    "MITECRO: a protocol for sensor networks to MInimize Total Energy consumption during each ROund of sensed data gathering.",
                    "Energy Efficient Thermal Aware Routing Algorithms for Embedded Biomedical Sensor Networks.",
                    "Optimal Placement of Wireless Sensor Nodes with Fault Tolerance and Minimal Energy Consumption.",
                    "SoNEA: Sensing Online Novelty Using Event Archives.",
                    "Design and Implementation of a Sensor Network Based Location Determination Service for use in Home Networks.",
                    "Anchor-Free Localization in Rapidly-Deployed Wireless Sensor Networks.",
                    "Over-hearing for Energy Efficient in Event-Driven Wireless Sensor Network.",
                    "An Application-Driven Architecture for Residential Energy Management with Wireless Sensor Networks.",
                    "P2P Multi-agent Data Transfer and Aggregation in Wireless Sensor Networks.",
                    "A Mobile-Agent-Based Collaborative Framework for Sensor Network Applications.",
                    "Adapting Sequential Monte-Carlo Estimation to Cooperative Localization in Wireless Sensor Networks.",
                    "Efficient Boundary Estimation for Practical Deployment of Mobile Sensors in Hybrid Sensor Networks.",
                    "Localized Hybrid Data Delivery Scheme using K-hop Clustering Algorithm in Ad Hoc Networks.",
                    "Directed Budget-Based Clustering for Wireless Sensor Networks.",
                    "Network-centric Actuation Control in Sensor/Actuator Networks based on Bio-inspired Technologies.",
                    "Mobility and Density Self-Adaptive Routing Strategies in Ad Hoc Networks.",
                    "A Prediction-based Handover Decision for Wireless Networks.",
                    "Multi-interfaces and Multi-channels Multi-hop Ad hoc Networks: Overview and Challenges.",
                    "Field trials of two 802.11 residual bandwidth estimation methods.",
                    "Hops-based Sleep Scheduling Algorithm for Enhancing Lifetime of Wireless Sensor Networks.",
                    "Bid Activation Multiple Access in Ad Hoc Networks.",
                    "Investment Function: Enhanced Fairness and Performance in Multi-hop Wireless Networks.",
                    "Providing Resource Oriented Security Solution for Heterogeneous Clustered Sensor Networks.",
                    "A Measurement-Based Study of WLAN to Cellular Handover.",
                    "Multipath Routing in Wireless Mesh Networks.",
                    "Connection Selection Scheme for Multi-hop Heterogeneous Wireless Networks.",
                    "Localized Movement-Assisted Sensor Deployment in Wireless Sensor Networks.",
                    "Fair Scheduling for Hybrid Mesh Network Interconnecting Video Sensors.",
                    "Analysis of Bottleneck Delay and Throughput in Wireless Mesh Networks.",
                    "Modeling Path Capacity in Multi-hop IEEE 802.11 Networks for QoS Services.",
                    "W2TS A novel IEEE 802.11 multi-hop mesh network for tracking systems.",
                    "Extended Model for Performance Analysis of Non-Saturated IEEE 802.11 DCF in Erroneous Channel.",
                    "Performance Evaluation of Scheduling in IEEE 802.16 Based Wireless Mesh Networks.",
                    "Simple and Effective Carrier Sensing Adaptation for Multi Rate Ad-Hoc MESH Networks.",
                    "A Mesh Routing Protocol using Cluster Label in the ZigBee Network.",
                    "Achieving Load Balancing in Wireless Mesh Networks Through Multiple Gateways.",
                    "Optimizing Routing Protocols for Ad Hoc Network.",
                    "An Efficient Implementation of File Sharing Systems on the Basis of WiMAX and Wi-Fi.",
                    "AnyServer: Digital Network Platform Technology for Next Generation Ubiquitous Communications.",
                    "C4W: An Energy Efficient Public Key Cryptosystem for Large-Scale Wireless Sensor Networks.",
                    "Deterministic key pre-distribution schemes for mobile ad-hoc networks based on set systems with limited intersection sizes.",
                    "Gateway Subset Difference Revocation.",
                    "Light-weight Detection of Spoofing Attacks in Wireless Networks.",
                    "Secure Access Control for Location-Based Applications in WLAN Systems.",
                    "Implementing Agreement Protocols in Sensor Networks.",
                    "SeLoc: Secure Localization for Wireless Sensor and Actor Network.",
                    "Location Tracking Attack in Ad hoc Networks based on Topology Information.",
                    "The Cost of Security: Performance of ZigBee Key Exchange Mechanism in an 802.15.4 Beacon Enabled Cluster.",
                    "Experimental Performance Evaluation of Cryptographic Algorithms on Sensor Nodes.",
                    "Security and Energy Considerations for Routing in Hierarchical Optical Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd MASS 2005",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2005",
                "sub_name": "IEEE 2nd International Conference on Mobile Adhoc and Sensor Systems, MASS 2005, November 7-10, 2005, The City Center Hotel, Washington, USA.",
                "count": 116,
                "papers": [
                    "AASC: adaptive avoid second-collision backoff algorithm for multihop wireless sensor networks.",
                    "Multicasting in ad hoc networks in the context of multiple channels and multiple interfaces.",
                    "Statistical estimation of route expiry times in on-demand ad hoc routing protocols.",
                    "Reducing the energy drain in multihop ad hoc networks.",
                    "Definition and evaluation of a trellis structure for self-organized networks.",
                    "A flooding protocol for MANETs with self-pruning and prioritized retransmissions.",
                    "An experimental study of routing and data aggregation in sensor networks.",
                    "A reliable routing protocol design for wireless sensor networks.",
                    "Dynamic scheduling MAC protocol for large scale sensor networks.",
                    "Towards a new communication paradigm for mobile ad hoc networks.",
                    "Mobility and routing management for heterogeneous multi-hop wireless networks.",
                    "Redundant source routing for real-time services in ad hoc networks.",
                    "Wireless aware SCTP for ad hoc networks.",
                    "Route maintenance using mobility prediction for mobile ad hoc networks.",
                    "A study of safety applications in vehicular networks.",
                    "Cross-layer flooding for sensor networks without location information.",
                    "Pre-scanning and dynamic caching for fast handoff at MAC layer in IEEE 802.11 wireless LANs.",
                    "Comparative evaluation of CBQ and PriQueue in a MANET.",
                    "An RPC design for wireless sensor networks.",
                    "Label routing protocol: a new cross-layer protocol for multi-hop ad hoc wireless networks.",
                    "Fast connection recovery in WLAN-to-cellular vertical handoff.",
                    "Multi-modal MAC design for energy-efficient wireless networks.",
                    "Providing QoS for sensor enabled emergency applications.",
                    "Predictive protocol management with contingency planning for wireless sensor networks.",
                    "Node localization using received signal statistics.",
                    "Energy-efficient continuous and event-driven monitoring.",
                    "Cushion: autonomically adaptive data fusion in wireless sensor networks.",
                    "Cooperation enforcement in ad hoc networks with penalty.",
                    "A natural disasters management system based on location aware distributed sensor networks.",
                    "Robustness of network-wide broadcasts in MANETs.",
                    "On the lifetime analysis of always-on wireless sensor network applications.",
                    "An energy-efficient QoS-aware media access control protocol for wireless sensor networks.",
                    "A decentralized fault diagnosis system for wireless sensor networks.",
                    "Secure localization in sensor networks using transmission range variation.",
                    "Energy efficient data management for wireless sensor networks with data sink failure.",
                    "Energy-constrained task mapping and scheduling in wireless sensor networks.",
                    "Nearly optimal distributed configuration management using probabilistic graphical models.",
                    "Security and trust assurances for smart environments.",
                    "Mobile network management and robust spatial retreats via network dynamics.",
                    "A practical approach to deploy large scale wireless sensor networks.",
                    "Efficient routing protocols for a free space optical sensor network.",
                    "Reliable energy efficient routing in wireless sensor networks.",
                    "Network-aware positioning in sensor networks.",
                    "A predictive QoS control strategy for wireless sensor networks.",
                    "Distributed data aggregation in sensor networks by regression based compression.",
                    "Sensor networks deployment using flip-based sensors.",
                    "Analytical bounds on broadcast with hitch-hiking in wireless ad-hoc networks.",
                    "Data dissemination to mobile sinks in wireless sensor networks: an information theoretic approach.",
                    "Extended energy model for the low rate WPAN.",
                    "Publish-subscribe on sensor networks: a semi-probabilistic approach.",
                    "Improved transport service for remote sensing and control over wireless networks.",
                    "Interactive operations for visualization of ad-hoc sensor system domains.",
                    "SERAN: a semi random protocol solution for clustered wireless sensor networks.",
                    "BAM: branch aggregation multicast for wireless sensor networks.",
                    "Resource allocation using multiple edge-sharing multicast trees.",
                    "Energy-efficient self-adapting online linear forecasting for wireless sensor network applications.",
                    "Cooperative spatial multiplexing in mobile ad hoc networks.",
                    "MAC layer support for group communication in wireless sensor networks.",
                    "Wide-area long-range unidirectional sensor (WALRUS) network.",
                    "Distortion sum-rate performance of successive coding strategy in Gaussian wireless sensor networks.",
                    "Active collaborations for trustworthy data management in ad hoc networks.",
                    "Data-centric attribute allocation and retrieval (DCAAR) scheme for wireless sensor networks.",
                    "Using multiple communication channels for efficient data dissemination in wireless sensor networks.",
                    "On setting up energy-efficient paths with transmitter power control in wireless sensor networks.",
                    "Conserving energy with on-demand topology management.",
                    "A cross-layer approach to service discovery and selection in MANETs.",
                    "IEEE 802.11 DCF based MAC protocols for multiple beam antennas and their limitations.",
                    "Improving power save protocols using carrier sensing for dynamic advertisement windows.",
                    "Sensor node localization using mobile acoustic beacons.",
                    "Location-centric storage for sensor networks.",
                    "An underlay for sensor networks: localized protocols for maintenance and usage.",
                    "Geographical cluster based multihop ad hoc network routing with guaranteed delivery.",
                    "Defending against search-based physical attacks in sensor networks.",
                    "Enforcing security for prevention of DoS attack in wireless sensor networks using economical modeling.",
                    "Authenticated flooding in large-scale sensor networks.",
                    "Efficient pairwise key establishment and management in static wireless sensor networks.",
                    "A scalable and adaptive clock synchronization protocol for IEEE 802.11-based multihop ad hoc networks.",
                    "Interval-based clock synchronization is resilient to mobility.",
                    "Reactive ID assignment for sensor networks.",
                    "Distributed unique global ID assignment for sensor networks.",
                    "Iterative local solutions for connected dominating set in ad hoc wireless networks.",
                    "Power efficient topology control for wireless networks with switched beam directional antennas.",
                    "An energy-efficient unequal clustering mechanism for wireless sensor networks.",
                    "TASC: topology adaptive spatial clustering for sensor networks.",
                    "A stochastic model for optimizing physical carrier sensing and spatial reuse in wireless ad hoc networks.",
                    "Energy-efficient, application-aware medium access for sensor networks.",
                    "Architecture for delay-sensitive communications in mobile optical free-space networks.",
                    "A simple ray-sector signal strength model for indoor 802.11 networks.",
                    "A link-quality and congestion-aware cross layer metric for multi-hop wireless routing.",
                    "Efficient multicasting in multi-hop ad hoc networks using directional antennas.",
                    "An efficient N-to-1 multipath routing protocol in wireless sensor networks.",
                    "PSGR: priority-based stateless geo-routing in wireless sensor networks.",
                    "On-demand loop-free routing in ad hoc networks using source sequence numbers.",
                    "Guesswork: robust routing in an uncertain world.",
                    "Autonomous pickup and delivery for delay tolerant mobile networks.",
                    "Void traversal for guaranteed delivery in geometric routing.",
                    "Efficient distributed algorithms for data fusion and node localization in mobile ad-hoc networks.",
                    "Energy conserving multicast for MANET with swarm intelligence.",
                    "GB: distributed reachability-tunable broadcast algorithms for wireless sensor networks.",
                    "Exposure for collaborative detection using mobile sensor networks.",
                    "Improving connectivity and power efficiency in wireless ad hoc networks through agent nodes.",
                    "On multiple point coverage in wireless sensor networks.",
                    "Attack-resilient time synchronization for wireless sensor networks.",
                    "A self-adaptive intrusion detection method for AODV-based mobile ad hoc networks.",
                    "Reliable and semi-reliable communication with authentication in mobile ad hoc networks.",
                    "Reputed authenticated routing for ad hoc networks protocol (reputed-ARAN).",
                    "New non-interactive key agreement and progression (NIKAP) protocols and their applications to security in ad hoc networks.",
                    "Maintaining functional module integrity in sensor networks.",
                    "Improved mechanism for mobile location privacy.",
                    "Contributory group key agreement protocols, revisited for mobile ad-hoc groups.",
                    "State-based key management scheme for wireless sensor networks.",
                    "Peer identification in wireless and sensor networks using signal properties.",
                    "Location verification using secure distance bounding protocols.",
                    "An efficient key management scheme in hierarchical sensor networks.",
                    "MAC layer security of 802.15.4-compliant networks.",
                    "A cross-layer based intrusion detection approach for wireless ad hoc networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st MASS 2004",
        "info": "Fort Lauderdale, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mass/2004",
                "sub_name": "2004 IEEE International Conference on Mobile Ad-hoc and Sensor Systems, Fort Lauderdale, FL, USA, October 25-27, 2004.",
                "count": 79,
                "papers": [
                    "Update-linearizability: a consistency concept for the chronological ordering of events in MANETs.",
                    "Localized probabilistic and dominating set based algorithm for efficient information dissemination in ad hoc networks.",
                    "Dynamic proxy tree-based data dissemination schemes for wireless sensor networks.",
                    "Query aggregation for providing efficient data services in sensor networks.",
                    "Selective backbone construction for topology control in ad hoc networks.",
                    "Efficient computation of maximal independent sets in unstructured multi-hop radio networks.",
                    "A reliable virtual backbone scheme in mobile ad-hoc networks.",
                    "A performance comparison of protocols for clustering and backbone formation in large scale ad hoc networks.",
                    "Offered load control in IEEE 802.11 multi-hop ad-hoc networks.",
                    "IEEE 802.11 fragmentation-aware energy-efficient ad-hoc routing protocols.",
                    "Performance comparison of cache invalidation strategies for Internet-based mobile ad hoc networks.",
                    "Model-based resource prediction for multi-hop wireless networks.",
                    "RACE: time series compression with rate adaptivity and error bound for sensor networks.",
                    "Power aware coding for spatio-temporally correlated wireless sensor data.",
                    "A path compression technique for on-demand ad-hoc routing protocols.",
                    "Optimizing a class of in-network processing applications in networked sensor systems.",
                    "Enhancing location service scalability with HIGH-GRADE.",
                    "Localization of wireless sensor networks with a mobile beacon.",
                    "Performance study of localization methods for ad-hoc sensor networks.",
                    "A swarm-based fuzzy logic control mobile sensor network for hazardous contaminants localization.",
                    "Packet fragmentation in Wi-Fi ad hoc networks with correlated channel failures.",
                    "TCP-friendly medium access control for ad-hoc wireless networks: alleviating self-contention.",
                    "Link layer measurements in sensor networks.",
                    "Adaptation of multiple access parameters in time hopping UWB cluster based wireless sensor networks.",
                    "Joint synchronization, routing and energy saving in CSMA/CA multi-hop hybrid networks.",
                    "Analysis and implementation of scalable clock synchronization protocols in IEEE 802.11 ad hoc networks.",
                    "Scheduled persistence for medium access control in sensor networks.",
                    "Time indexing in sensor networks.",
                    "Localized topology control for heterogeneous wireless ad-hoc networks.",
                    "On the construction of virtual multicast backbone for wireless ad hoc networks.",
                    "Efficient and robust multicast routing in mobile ad hoc networks.",
                    "Shortest Multipath Routing using Labeled Distances.",
                    "SOLONet: sub-optimal location-aided overlay network for MANETs.",
                    "Stable group model in mobile peer-to-peer media streaming system.",
                    "pREST: a REST-based protocol for pervasive systems.",
                    "An RFID based technique for handling object distribution and recalls in pervasive transaction environments.",
                    "Quality of service analysis and control for wireless sensor networks.",
                    "Improving interactive video in ad-hoc networks using path diversity.",
                    "Throughput guarantees for multi-priority traffic in ad hoc networks.",
                    "Use of congestion-aware routing to spatially separate TCP connections in wireless ad hoc networks.",
                    "Hop count optimal position based packet routing algorithms for ad hoc wireless networks with a realistic physical layer.",
                    "A mix route algorithm for mix-net in wireless mobile ad hoc networks.",
                    "GCRP: geographic virtual circuit routing protocol for ad hoc networks.",
                    "A new framework for loop-free on-demand routing using destination sequence numbers.",
                    "Locality driven key management architecture for mobile ad-hoc networks.",
                    "Benchmarking block ciphers for wireless sensor networks.",
                    "Play alone or together - truthful and efficient routing in wireless ad hoc networks with selfish nodes.",
                    "Reliable routing in mobile ad hoc networks based on mobility prediction.",
                    "A study of the coverage of large-scale sensor networks.",
                    "Semantic internetworking of sensor systems.",
                    "Proxy-based sensor deployment for mobile sensor networks.",
                    "Trade-off between coverage and data reporting latency for energy-conserving data gathering in wireless sensor networks.",
                    "Sindrion: a prototype system for low-power wireless control networks.",
                    "Sensor localization with Ring Overlapping based on Comparison of Received Signal Strength Indicator.",
                    "Efficient multicast tree algorithm for ad hoc networks.",
                    "Scalable routing in hybrid cellular and ad-hoc networks.",
                    "Link probability, network coverage, and related properties of wireless ad hoc networks.",
                    "A self-organizing, location-aware media access control protocol for DS-CDMA sensor networks.",
                    "Communication protocols for a structural health monitoring sensor network.",
                    "Low-cost truthful multicast in selfish and rational wireless ad hoc networks.",
                    "Managed mobility: a novel concept in integrated wireless systems.",
                    "Integrated connectivity framework for Internet and ad hoc networks.",
                    "Enhancing broadcast operations in ad hoc networks with two-hop connected dominating sets.",
                    "A distributed power-allocation and signal-shaping game for multiple-antenna ad-hoc networks impaired by multiple-access interference.",
                    "Customizing GPSR for wireless sensor networks.",
                    "An optimal TDMA-based MAC scheduling for the minimum energy multicast in wireless ad hoc networks.",
                    "Estimating throughput available to a node in wireless ad-hoc network.",
                    "An adaptive mobility-aware MAC protocol for sensor networks (MS-MAC).",
                    "Scribble: an efficient reliable manycast protocol for ad-hoc networks.",
                    "Efficient and practical query scoping in sensor networks.",
                    "Profile-based data diffusion in mobile environments.",
                    "Efficient construction of connected dominating set in wireless ad hoc networks.",
                    "Event dissemination in mobile wireless sensor networks.",
                    "An adaptive and fault-tolerant gateway assignment in sensor networks.",
                    "Efficient data aggregation middleware for wireless sensor networks.",
                    "Protocol-independent packet delivery improvement service for mobile ad hoc networks.",
                    "Optimizing the number of clusters in a wireless sensor network using cross-layer analysis.",
                    "Utility-based routing in wireless ad hoc networks.",
                    "An ad hoc on-demand routing protocol with high packet delivery fraction."
                ]
            }
        ]
    }
]