[
    {
        "year": "2021",
        "name": "22nd MobiHoc 2021",
        "info": "Shanghai, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2021",
                "sub_name": "MobiHoc '21: The Twenty-second International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing, Shanghai, China, 26-29 July, 2021.",
                "count": 28,
                "papers": [
                    "Beyond Scaling: Calculable Error Bounds of the Power-of-Two-Choices Mean-Field Model in Heavy-Traffic.",
                    "Minimizing Age-of-Information in Heterogeneous Multi-Channel Systems: A New Partial-Index Approach.",
                    "Learning-NUM: Network Utility Maximization with Unknown Utility Functions and Queueing Delay.",
                    "MultiAuth: Enable Multi-User Authentication with Single Commodity WiFi Device.",
                    "The Tags Are Alright: Robust Large-Scale RFID Clone Detection Through Federated Data-Augmented Radio Fingerprinting.",
                    "Task Offloading with Uncertain Processing Cycles.",
                    "DeepBeam: Deep Waveform Learning for Coordination-Free Beam Management in mmWave Networks.",
                    "Rotation Sensing Using Passive RFID Tags.",
                    "Real-Time Deep Video Analytics on Mobile Devices.",
                    "Inexact-ADMM Based Federated Meta-Learning for Fast and Continual Edge Learning.",
                    "SkyHAUL: A Self-Organizing Gigabit Network In The Sky.",
                    "Minimizing Age of Information via Scheduling over Heterogeneous Channels.",
                    "Battle between Rate and Error in Minimizing Age of Information.",
                    "An Online Mean Field Approach for Hybrid Edge Server Provision.",
                    "Neuro-DCF: Design of Wireless MAC via Multi-Agent Reinforcement Learning Approach.",
                    "MmWave Codebook Selection in Rapidly-Varying Channels via Multinomial Thompson Sampling.",
                    "Robust Multi-Agent Multi-Armed Bandits.",
                    "uScope: a Tool for Network Managers to Validate Delay-Based SLAs.",
                    "Job Dispatching Policies for Queueing Systems with Unknown Service Rates.",
                    "Joint Update Rate Adaptation in Multiplayer Cloud-Edge Gaming Services: Spatial Geometry and Performance Tradeoffs.",
                    "Weak Signal Detection in 5G+ Systems: A Distributed Deep Learning Framework.",
                    "Crowdfunding with Strategic Pricing and Information Disclosure.",
                    "User Distributions in Shard-based Blockchain Network: Queueing Modeling, Game Analysis, and Protocol Design.",
                    "Man-in-the-Middle Attack Resistant Secret Key Generation via Channel Randomization.",
                    "An Online Learning Approach to Optimizing Time-Varying Costs of AoI.",
                    "DeepLoRa: Fingerprinting LoRa Devices at Scale Through Deep Learning and Data Augmentation.",
                    "Accelerating Distributed Online Meta-Learning via Multi-Agent Collaboration under Limited Communication.",
                    "GT-STORM: Taming Sample, Communication, and Memory Complexities in Decentralized Non-Convex Learning."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st MobiHoc 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2020",
                "sub_name": "Mobihoc '20: The Twenty-first ACM International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing, Virtual Event, USA, October 11-14, 2020.",
                "count": 45,
                "papers": [
                    "Sl-edge: network slicing at the edge.",
                    "Fair multi-resource allocation in mobile edge computing with multiple access points.",
                    "Robust resource provisioning in time-varying edge networks.",
                    "MVStylizer: an efficient edge-assisted video photorealistic style transfer system for mobile phones.",
                    "Fresher content or smoother playback?: a brownian-approximation framework for scheduling real-time wireless video streams.",
                    "Optimizing information freshness using low-power status updates via sleep-wake scheduling.",
                    "Online control of random access with splitting.",
                    "De-anonymizability of social network: through the lens of symmetry.",
                    "Towards compression-resistant privacy-preserving photo sharing on social networks.",
                    "Truthful mobile crowd sensing with interdependent valuations.",
                    "Online dispatching and scheduling of jobs with heterogeneous utilities in edge computing.",
                    "Online scheduling of heterogeneous distributed machine learning jobs.",
                    "Predictive caching at the wireless edge using near-zero caches.",
                    "Approximation algorithms for data-intensive service chain embedding.",
                    "Iterative learning of graph connectivity from partially-observed cascade samples.",
                    "Data inference from encrypted databases: a multi-dimensional order-preserving matching approach.",
                    "Learning to price vehicle service with unknown demand.",
                    "A game-theoretic approach to storage offloading in PoC-based mobile blockchain mining.",
                    "Optimizing ad allocation in mobile advertising.",
                    "Performance analysis of indoor localization based on channel state information ranging model.",
                    "LLOCUS: learning-based localization using crowdsourcing.",
                    "Why queue up?: fast parallel search of RFID tags for multiple users.",
                    "REFRAIN: promoting valid transmission in high-density modern wi-fi networks.",
                    "Emulating round-robin for serving dynamic flows over wireless fading channels.",
                    "Portal: transparent cross-technology opportunistic forwarding for low-power wireless networks.",
                    "TCCI: taming co-channel interference for wireless lans.",
                    "Private and communication-efficient edge learning: a sparse differential gaussian-masking distributed SGD approach.",
                    "PolymoRF: polymorphic wireless receivers through physical-layer deep learning.",
                    "Distributed double auctions for large-scale device-to-device resource trading.",
                    "Internet transport economics: model and analysis.",
                    "Fully-digital beamforming demonstration with Pi-Radio mmWave SDR platform.",
                    "DANGER: a drones aided network for guiding emergency and rescue operations.",
                    "Visualizing the Bitcoin's OP_RETURN operator.",
                    "Scaling composite NFV-network services.",
                    "Rewarding relays for decentralised NAT traversal using smart contracts.",
                    "A blockchain-based framework for energy trading between solar powered base stations and grid.",
                    "Defining trust in IoT environments via distributed remote attestation using blockchain.",
                    "Quantum blockchain networks.",
                    "How to deal with data hungry V2X applications?",
                    "Tensor completion-based 5G positioning with partial channel measurements.",
                    "Acting selfish for the good of all: contextual bandits for resource-efficient transmission of vehicular sensor data.",
                    "Vehicular knowledge networking and application to risk reasoning.",
                    "Distributed resource allocation with multi-agent deep reinforcement learning for 5G-V2V communication.",
                    "Graph-based model for beam management in Mmwave vehicular networks.",
                    "The role of machine learning for trajectory prediction in cooperative driving."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th MobiHoc 2019",
        "info": "Catania, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2019",
                "sub_name": "Proceedings of the Twentieth ACM International Symposium on Mobile Ad Hoc Networking and Computing, Mobihoc 2019, Catania, Italy, July 2-5, 2019.",
                "count": 57,
                "papers": [
                    "A Mean Field Game Analysis of Distributed MAC in Ultra-Dense Multichannel Wireless Networks.",
                    "How Bad is Selfish Caching?",
                    "APP: Augmented Proactive Perception for Driving Hazards with Sparse GPS Trace.",
                    "DeMiLTE: Detecting and Mitigating LTE Interference for Enterprise Wi-Fi in 5 GHz.",
                    "Minimizing Age-of-Information with Throughput Requirements in Multi-Path Network Communication.",
                    "DeepRadioID: Real-Time Channel-Resilient Optimization of Deep Learning-based Radio Fingerprinting Algorithms.",
                    "Jam Sessions: Analysis and Experimental Evaluation of Advanced Jamming Attacks in MIMO Networks.",
                    "Coping Uncertainty in Coexistence via Exploitation of Interference Threshold Violation.",
                    "Quiet CTS: CTS Power Control for Better Spatial Reuse in Wi-Fi.",
                    "Forever Young: Aging Control For Hybrid Networks.",
                    "Optimal Network Control with Adversarial Uncontrollable Nodes.",
                    "DECO: Joint Computation, Caching and Forwarding in Data-Centric Computing Networks.",
                    "Age-optimal Sampling and Transmission Scheduling in Multi-Source Systems.",
                    "Economics of Age of Information Management under Network Externalities.",
                    "A Probabilistic Approach for Demand-Aware Ride-Sharing Optimization.",
                    "DeepFusion: A Deep Learning Framework for the Fusion of Heterogeneous Sensory Data.",
                    "Robot Navigation in Radio Beam Space: Leveraging Robotic Intelligence for Seamless mmWave Network Coverage.",
                    "Tile-based Caching Optimization for 360° Videos.",
                    "DIRECT: Distributed Cross-Domain Resource Orchestration in Cellular Edge Computing.",
                    "Transient Dynamics of Epidemic Spreading and Its Mitigation on Large Networks.",
                    "FingerPass: Finger Gesture-based Continuous User Authentication for Smart Homes Using Commodity WiFi.",
                    "MWSR over an Uplink Gaussian Channel with Box Constraints: A Polymatroidal Approach.",
                    "Minimizing the Age of Information in Wireless Networks with Stochastic Arrivals.",
                    "RAN Resource Usage Prediction for a 5G Slice Broker.",
                    "Competition with Three-Tier Spectrum Access and Spectrum Monitoring.",
                    "QFlow: A Reinforcement Learning Approach to High QoE Video Streaming over Wireless Networks.",
                    "Quantized VCG Mechanisms for Polymatroid Environments.",
                    "Online Scheduling of Traffic Diversion and Cloud Scrubbing with Uncertainty in Current Inputs.",
                    "ERSCC: Enable Efficient and Reliable Screen-Camera Communication.",
                    "Scaling Deep Learning Models for Spectrum Anomaly Detection.",
                    "Timely-Throughput Optimal Coded Computing over Cloud Networks.",
                    "FREE: A Fast and Robust Key Extraction Mechanism via Inaudible Acoustic Signal.",
                    "Predictive Online Server Provisioning for Cost-Efficient IoT Data Streaming Across Collaborative Edges.",
                    "MIMO with Energy Recycling.",
                    "Side-information-aided Noncoherent Beam Alignment Design for Millimeter Wave Systems.",
                    "Barracuda: The Power of ℓ-polling in Proof-of-Stake Blockchains.",
                    "Wideband Full-Duplex Phased Array with Joint Transmit and Receive Beamforming: Optimization and Rate Gains.",
                    "An Infrastructure for Wearable Environments Acquisition and Representation.",
                    "Cost-Efficient Scheme for RF-Powered Sensor Networks by Mixing Mobile Charging and Static Charging.",
                    "A Fast Probing Detection Method using Hybrid Machine Learning Algorithms.",
                    "Reliability Assessment for Ultra-reliable and Low Latency Communications in Cyber-physical Energy Systems.",
                    "Signal Based Device-Free Tracking.",
                    "Peer-to-Peer Energy Trading for Local Area Packetized Power Network.",
                    "Dialogue between Satellite and Cellular Networks: Pricing Game for Data Offloading Assisted by Ultra-dense LEO Constellations.",
                    "Collective Influence Maximization.",
                    "Characterizing Delay and Control Traffic of the Cellular MME with IoT Support.",
                    "Information Source Detection with Limited Time Knowledge.",
                    "Network Utility Maximization under Maximum Delay Constraints and Throughput Requirements.",
                    "Infrastructure and service provider games in crowdsourced networks.",
                    "Cooperative Analytics for the Internet of Things.",
                    "Provisioning and automated scaling of network slices for virtual Content Delivery Networks in 5G infrastructures.",
                    "Implementing CAN bus security by TOUCAN.",
                    "Video Transmission Using Low-Cost Visible Light Communication.",
                    "Propelling Haptic Devices into the Mobile World to Advance K-12 STEM Learning.",
                    "Open source testbed for vehicular communication.",
                    "Composing Services in 5G-TRANSFORMER.",
                    "The Internet of Underwater Things: From Nemo to underwater Whatsapp."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2019topcars",
                "sub_name": "Proceedings of the 1st ACM MobiHoc Workshop on Technologies, mOdels, and Protocols for Cooperative Connected Cars, TOP-Cars@MobiHoc 2019, Catania, Italy, July 2, 2019.",
                "count": 7,
                "papers": [
                    "EPIC: an Epidemic based dissemination algorithm for VANETs.",
                    "Keep It Fresh: Reducing the Age of Information in V2X Networks.",
                    "Characterization and Performance Evaluation of IEEE 802.11p NICs.",
                    "Full duplex-aided Sensing and Scheduling in Cellular-V2X Mode 4.",
                    "A Modular Simulation Framework for Analyzing Platooning Coordination.",
                    "A Framework to Assess Value of Information in Future Vehicular Networks.",
                    "GNSS-only Collaborative Positioning Among Connected Vehicles."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2019persistiot",
                "sub_name": "Proceedings of the ACM MobiHoc Workshop on Pervasive Systems in the IoT Era, PERSIST-IoT@MobiHoc 2019, Catania, Italy, July 2, 2019.",
                "count": 10,
                "papers": [
                    "A social internet of vehicles sharing SIoT relationships.",
                    "Performance and Trade-offs of the new PHY Modes of BLE 5.",
                    "Adaptive Data Update for Cloud-based Internet of Things applications.",
                    "En-OsCo: Energy-aware Osmotic Computing Framework using Hyper-heuristics.",
                    "An Analytic Approach for Resource Allocation of IoT Multicast Traffic.",
                    "Fingerprint Quality Classification for CSI-based Indoor Positioning Systems.",
                    "Sec-IoV: A Multi-Stage Anomaly Detection Scheme for Internet of Vehicles.",
                    "Distributed Deep Neural Network Deployment for Smart Devices from the Edge to the Cloud.",
                    "S-Cache: Toward an Low Latency Service Caching for Edge Clouds.",
                    "IoT for the Users: Thermal Comfort and Cost Saving."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2019ifire",
                "sub_name": "Proceedings of the ACM MobiHoc workshop on innovative aerial communication solutions for FIrst REsponders network in emergency scenarios, iFIRE@MobiHOC 2019, Catania, Italy, July 2, 2019.",
                "count": 4,
                "papers": [
                    "An Ecosystem for Disaster Relief Operations.",
                    "Device-to-Device Discovery and Localization Assisted by UAVs in Pervasive Public Safety Networks.",
                    "Bio-Inspired Routing over FANET in Emergency Situations to support Multimedia Traffic.",
                    "Multiservice UAVs for Emergency Tasks in Post-disaster Scenarios."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "19th MobiHoc 2018",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2018",
                "sub_name": "Proceedings of the Nineteenth ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2018, Los Angeles, CA, USA, June 26-29, 2018.",
                "count": 43,
                "papers": [
                    "(Re)Configuring Bike Station Network via Crowdsourced Information Fusion and Joint Optimization.",
                    "Social-Aware Privacy-Preserving Correlated Data Collection.",
                    "Uplink MU-MIMO in Asynchronous Wireless LANs.",
                    "Learning Algorithms for Scheduling in Wireless Networks with Unknown Channel Statistics.",
                    "Ins and Outs: Optimal Caching and Re-Caching Policies in Mobile Networks.",
                    "Multi-Dimensional Contract Design for Mobile Data Plan with Time Flexibility.",
                    "Optimizing Information Freshness in Wireless Networks under General Interference Constraints.",
                    "Densification Leveraging Mobility: An IoT Architecture Based on Mesh Networking and Vehicles.",
                    "WiVo: Enhancing the Security of Voice Control System via Wireless Signal in IoT Environment.",
                    "On the Theory of Function Placement and Chaining for Network Function Virtualization.",
                    "Dynamic Pricing in the Presence of Participation-Dependent Social Learning.",
                    "Towards Data Poisoning Attacks in Crowd Sensing Systems.",
                    "Discount Allocation for Revenue Maximization in Online Social Networks.",
                    "Loyalty Programs in the Sharing Economy: Optimality and Competition.",
                    "Incentivizing Hosts via Multilateral Cooperation in User-Provided Networks: A Fluid Shapley Value Approach.",
                    "Crowd-Empowered Privacy-Preserving Data Aggregation for Mobile Crowdsensing.",
                    "Incentivizing Truthful Data Quality for Quality-Aware Mobile Data Crowdsourcing.",
                    "Learning Data Dependency with Communication Cost.",
                    "Search Light: Tracking Device Mobility using Indoor Luminaries to Adapt 60 GHz Beams.",
                    "Age-based Scheduling: Improving Data Freshness for Wireless Real-Time Traffic.",
                    "On the Delays in Time-Varying Networks: Does Larger Service-Rate Variance Imply Larger Delays?",
                    "User Mobility Analysis in Disjoint-Clustered Cooperative Wireless Networks.",
                    "Wireless coverage prediction via parametric shortest paths.",
                    "Long-Term Mobile Traffic Forecasting Using Deep Spatio-Temporal Neural Networks.",
                    "WNOS: An Optimization-based Wireless Network Operating System.",
                    "mmChoir: Exploiting Joint Transmissions for Reliable 60GHz mmWave WLANs.",
                    "PULS: Processor-Supported Ultra-Low Latency Scheduling.",
                    "Harnessing HyDRO: Harvesting-aware Data ROuting for Underwater Wireless Sensor Networks.",
                    "Are Friends of My Friends Too Social?: Limitations of Location Privacy in a Socially-Connected World.",
                    "Priority Based Wireless Multi-Network Selection Games.",
                    "A Group Key Management Protocol for Mobile Devices.",
                    "Demand-driven Cache Allocation Based on Context-aware Collaborative Filtering.",
                    "Comparing Routing Protocols over a 3D IoT.",
                    "High Bandwidth and Low Delay over Wireless Multihop Networks.",
                    "Towards Opportunistic Resource Sharing in Mobile Social Networks: an Evolutionary Game Theoretic Approach.",
                    "Spatio-Temporal Aware Collaborative Mobile Sensing with Online Multi-Hop Calibration.",
                    "Utilizing In-Network Buffering for Scheduling and Routing in Data Center Networks.",
                    "Revisiting Transmission Scheduling in RF Energy Harvesting Wireless Communications.",
                    "Optimal Load-Balancing for High-Density Wireless Networks with Flow-Level Dynamics.",
                    "Delay-Constrained Input-Queued Switch.",
                    "AntWall: A System for Mobile Adblocking and Privacy Exposure Prevention.",
                    "A Low-Cost Wireless System Implementation for Interactive and Immersive Teaching.",
                    "PULS: Processor-Supported Ultra-Low Latency Scheduling."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2018smartobjects",
                "sub_name": "Proceedings of the 4th ACM MobiHoc Workshop on Experiences with the Design and Implementation of Smart Objects, SmartObjects@Mobihoc 2018, Los Angeles, CA, USA, June 25, 2018.",
                "count": 9,
                "papers": [
                    "Bluetooth-based context modeling.",
                    "Cognitivecharge: disconnection tolerant adaptive collaborative and predictive vehicular charging.",
                    "Heterogeneous data reduction in WSN: application to smart grids.",
                    "Movement path modelling for node mobility handling.",
                    "Analysis of LoRaWAN v1.1 security: research paper.",
                    "Dead reckoning using time series regression models.",
                    "Improving the efficiency and responsiveness of smart objects using adaptive BLE device discovery.",
                    "mF2C: towards a coordinated management of the IoT-fog-cloud continuum.",
                    "Refining light-based positioning for indoor smart spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2018smartcitiessecurity",
                "sub_name": "Proceedings of the 1st ACM MobiHoc Workshop on Networking and Cybersecurity for Smart Cities, SmartCitiesSecurity@Mobihoc 2018, Los Angeles, CA, USA, June 25, 2018.",
                "count": 3,
                "papers": [
                    "EnergyChain: Enabling Energy Trading for Smart Homes using Blockchains in Smart Grid Ecosystem.",
                    "Wireless Mediation of Multiple Equi-Priority Events in Time-Critical Industrial Applications.",
                    "A Real Time Power Update Scheme for the Smart Grid Using TVWS."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "18th MobiHoc 2017",
        "info": "Chennai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2017",
                "sub_name": "Proceedings of the 18th ACM International Symposium on Mobile Ad Hoc Networking and Computing, Chennai, India, July 10-14, 2017.",
                "count": 40,
                "papers": [
                    "Theseus: Incentivizing Truth Discovery in Mobile Crowd Sensing Systems.",
                    "ConMap: A Novel Framework for Optimizing Multicast Energy in Delay-constrained Mobile Wireless Networks.",
                    "Throughput-Optimal Broadcast in Wireless Networks with Point-to-Multipoint Transmissions.",
                    "Stable Matching for Spectrum Market with Guaranteed Minimum Requirement.",
                    "Smart User Authentication through Actuation of Daily Activities Leveraging WiFi-enabled IoT.",
                    "Widar: Decimeter-Level Passive Tracking via Velocity Monitoring with Commodity Wi-Fi.",
                    "Mobile r-gather: Distributed and Geographic Clustering for Location Anonymity.",
                    "Capacity and delay scaling for broadcast transmission in highly mobile wireless networks.",
                    "CSIsnoop: Attacker Inference of Channel State Information in Multi-User WLANs.",
                    "Decoupling Beam Steering and User Selection for Scaling Multi-User 60 GHz WLANs.",
                    "Efficient MU-MIMO via Switched-beam Antennas.",
                    "Learning-aided Stochastic Network Optimization with Imperfect State Prediction.",
                    "Quantum Game Analysis of Privacy-Leakage for Application Ecosystems.",
                    "D-SLATS: Distributed Simultaneous Localization and Time Synchronization.",
                    "Concurrent Channel Probing and Data Transmission in Full-duplex MIMO Systems.",
                    "Throughput-Optimal Scheduling for Multi-Hop Networked Transportation Systems With Switch-Over Delay.",
                    "Radiation Constrained Scheduling of Wireless Charging Tasks.",
                    "Online Pricing for Mobile Crowdsourcing with Multi-Minded Users.",
                    "MU-MIMO-Aware AP Selection for 802.11ac Networks.",
                    "1000-Cell Global Spectrum Management.",
                    "Emulating Round-Robin in Wireless Networks.",
                    "Adaptive Discount Allocation in Social Networks.",
                    "Maintaining Social Links through Amplify-and-Forward in Wireless Networks.",
                    "Hold'em Caching: Proactive Retention-Aware Caching with Multi-path Routing for Wireless Edge Networks.",
                    "TrUbi: A System for Dynamically Constraining Mobile Devices within Restrictive Usage Scenarios.",
                    "An Online Pricing Mechanism for Mobile Crowdsensing Data Markets.",
                    "Wireless Link Capacity under Shadowing and Fading.",
                    "Core Percolation in Coupled Networks.",
                    "Evolving K-Graph: Modeling Hybrid Interactions in Networks.",
                    "Lightweight Display-to-device Communication using Electromagnetic Radiation and FM Radio.",
                    "Aggregation Rate for Compressible Functions.",
                    "Mobile Phone User's Speed Estimation using WiFi Signal-to-Noise Ratio.",
                    "NICER911: Ad-hoc Communication and Emergency Services Using Networking Smartphones and Wireless Home Routers.",
                    "Information spreading in Online Social Networks: A case study on Twitter network.",
                    "Effect of Recommendations on Serving Content with Unknown Demand.",
                    "Primary Path Effect in Multi-Path TCP: How Serious Is It for Deployment Consideration?",
                    "Adaptive Duty Cycling in IEEE 802.15.4 Cluster Tree Networks Using MAC Parameters.",
                    "Modeling and Analysis of the Effects of Oceanic Wave-Induced Movements of a Boat on the Wireless Link Quality.",
                    "Towards Maximizing Throughput and Coverage of a Novel Heterogeneous Maritime Communication Network.",
                    "Multipath TCP Path Scheduler for Drones: A Segregation of Control and User Data."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th MobiHoc 2016",
        "info": "Paderborn, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2016",
                "sub_name": "Proceedings of the 17th ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2016, Paderborn, Germany, July 4-8, 2016.",
                "count": 60,
                "papers": [
                    "Towards distributed ensemble clustering for networked sensing systems: a novel geometric approach.",
                    "Joint sensor duty cycle scheduling with coverage guarantee.",
                    "Throughput-optimal broadcast in wireless networks with dynamic topology.",
                    "A node-based CSMA algorithm for improved delay performance in wireless networks.",
                    "Throughput characterization of node-based scheduling in multihop wireless networks: a novel application of the Gallai-Edmonds structure theorem.",
                    "Throughput-optimal multi-hop broadcast algorithms.",
                    "Mobility resilience and overhead constrained adaptation in directional 60 GHz WLANs: protocol design and system implementation.",
                    "Hybrid routing in wireless networks with diverse connectivity.",
                    "IQ-Hopping: distributed oblivious channel selection for wireless networks.",
                    "How can I guard my AP?: non-intrusive user identification for mobile devices using WiFi signals.",
                    "Charge me if you can: charging path optimization and scheduling in mobile networks.",
                    "On LTE-WiFi coexistence and inter-operator spectrum sharing in unlicensed bands: altruism, cooperation and fairness.",
                    "GAVEL: strategy-proof ascending bid auction for dynamic licensed shared access.",
                    "Deploying carrier-grade WiFi: offload traffic, not money.",
                    "Fast and reliable unknown tag detection in large-scale RFID systems.",
                    "Joint property estimation for multiple RFID tag sets using snapshots of variable lengths.",
                    "Efficient online coflow routing and scheduling.",
                    "System intelligence: model, bounds and algorithms.",
                    "Distributed coordination maximization over networks: a stochastic approximation approach.",
                    "Anonymous-query based rate control for wireless multicast: approaching optimality with constant feedback.",
                    "WiFinger: leveraging commodity WiFi for fine-grained finger gesture recognition.",
                    "Monitoring vital signs using millimeter wave.",
                    "Full-duplex delay-and-forward relaying.",
                    "Joint selection and transmission scheduling of point-to-point communication requests in multi-channel wireless networks.",
                    "On the capacity regions of single-channel and multi-channel full-duplex links.",
                    "Understanding the impact of limited channel state information on massive MIMO network performances.",
                    "Posted pricing for robust crowdsensing.",
                    "First learn then earn: optimizing mobile crowdsensing campaigns through data-driven user profiling.",
                    "An efficient approximation algorithm for online multi-tier multi-cell user association.",
                    "Asymptotically optimal algorithm for online reconfiguration of edge-clouds.",
                    "High-rate WiFi broadcasting in crowded scenarios via lightweight coordination of multiple access points.",
                    "Supporting real-time wireless traffic through a high-throughput side channel.",
                    "P2-SAS: preserving users' privacy in centralized dynamic spectrum access systems.",
                    "Analog man-in-the-middle attack against link-based packet source identification.",
                    "INCEPTION: incentivizing privacy-preserving data aggregation for mobile crowd sensing systems.",
                    "Coexistence features of LTE-U for spectrum sharing with collocated Wi-Fi: demo.",
                    "Multi-channel access and rendezvous in CRNs: demo.",
                    "Self-adaptive network architecture reconfiguration in CRNs: demo.",
                    "Full-duplex wireless based on a small-form-factor analog self-interference canceller: demo.",
                    "4G LTE-assisted distributed Device-to-Device communication using android smartphones: demo.",
                    "Towards secure spectrum auction: both bids and bidder locations matter: poster.",
                    "Anonymous category-level joint tag estimation: poster.",
                    "LocalCoin: An ad-hoc payment scheme for areas with high connectivity: poster.",
                    "Rate maximization under reactive jamming attacks: poster.",
                    "Reducing computational complexity of coded caching by partitioning users into groups: poster.",
                    "Combinatorics, algorithms and systems for sensor deployment with line-of-sight constraints: poster.",
                    "Solving the crowdsourcing dilemma using the zero-determinant strategy: poster.",
                    "A novel anti-jamming routing strategy for tactical MANETs: poster.",
                    "P2hub private personal data hub for mobile devices: poster.",
                    "Integration of different cryptographic techniques for real-time V2V communication: poster.",
                    "Context aware dynamic log chunking for mobile healthcare applications: poster.",
                    "Analysis of region of interest (RoI) of multimedia content using eye-tracker: poster.",
                    "Towards in-situ sensor network assisted remote sensing of crop parameters: poster.",
                    "Adaptive non-binary classification for network centric handover in heterogeneous networks: poster.",
                    "Real time capable UWB wireless network sniffer: poster.",
                    "PotatoMesh: a solar powered WSN testbed: poster.",
                    "The accuracy of Android energy measurements for offloading computational expensive tasks: poster.",
                    "The privacy leaky bucket: your mobile devices: poster.",
                    "Indoor localization using multi-range beaconing: poster.",
                    "Geo-spatial resource allocation for heterogeneous vehicular communications: poster."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2016hotpost",
                "sub_name": "Proceedings of the 8th ACM International Workshop on Hot Topics in Planet-scale mObile computing and online Social neTworking, HOTPOST@MobiHoc 2016, Paderborn, Germany, July 5, 2016.",
                "count": 10,
                "papers": [
                    "Straight: stochastic geometry and user history based mobility estimation.",
                    "A first view on mobile video popularity as time series.",
                    "Leveraging contact pattern to predict future contact pattern in mobile networks.",
                    "Enhancing opportunistic networking using location based social networks.",
                    "Asynchronous reputation systems in device-to-device ecosystems.",
                    "WI-FAB: attribute-based WLAN access control, without pre-shared keys and backend infrastructures.",
                    "Analyzing social relations for recommending academic conferences.",
                    "Optimal advertisement allocation in online social media feeds.",
                    "Using conflict-free replicated data types for serverless mobile social applications.",
                    "Opinion dynamics on online-offline interacting networks: media influence and antagonistic interaction."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2016mh",
                "sub_name": "Proceedings of the 6th ACM International Workshop on Pervasive Wireless Healthcare, MobileHealth@MobiHoc 2016, Paderborn, Germany, July 5, 2016.",
                "count": 4,
                "papers": [
                    "Enabling street-level pollution and exposure measures: a human-centric approach.",
                    "Reliability in co-located 802.15.4 personal area networks.",
                    "Let healthy links bloom: scalable link checks in low-power wireless networks for smart health.",
                    "PCPRP: power control prediction routing protocol for mobile multimedia E-Health system."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2016pamco",
                "sub_name": "Proceedings of the 2nd ACM Workshop on Privacy-Aware Mobile Computing, Paderborn, Germany, July, 2016.",
                "count": 7,
                "papers": [
                    "Android privacy C(R)ache: reading your external storage and sensors for fun and profit.",
                    "Light-SPD: a platform to prototype secure mobile applications.",
                    "Human recognizer: an ECG based live biometric fingerprint.",
                    "CREDROID: Android malware detection by network traffic analysis.",
                    "Customized privacy preserving for classification based applications.",
                    "A transparent framework based on accessing bridge and mobile app for protecting database privacy with PKI.",
                    "Efficient privacy-preserving schemes for dot-product computation in mobile computing."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2016mscc",
                "sub_name": "Proceedings of the 3rd ACM Workshop on Mobile Sensing, Computing and Communication, MSCC@MobiHoc 2016, Paderborn, Germany, July 5-8, 2016.",
                "count": 7,
                "papers": [
                    "Performance analysis of spatial-temporal spectrum sensing for cognitive vehicular network.",
                    "Architecture and performance of the industrial wired/wireless hybrid networks with multi-token.",
                    "Analyzing GUI running fluency for Android apps.",
                    "Attack gives me power: DoS-defending constant-time privacy-preserving authentication of low-cost devices such as backscattering RFID tags.",
                    "Mobile crowdsensing incentives under participation uncertainty.",
                    "Optimized ciphertext retrieval for cloud computing based on dynamic clustering.",
                    "Data reconstruction with spatial and temporal correlation in wireless sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2016iovvoi",
                "sub_name": "Proceedings of the First International Workshop on Internet of Vehicles and Vehicles of Internet, IoV-VoI '16, Paderborn, Germany, July 4-8, 2016.",
                "count": 7,
                "papers": [
                    "Traffic monitoring and incident detection using cellular and early stage VANET technology deployment.",
                    "Evaluating on-demand pseudonym acquisition policies in vehicular communication systems.",
                    "Distributed EDCA bursting: improving cluster-based communication in IVC.",
                    "High-resolution vehicle telemetry via heterogeneous IVC.",
                    "Regional InfoHubs by vehicles: balancing spatio-temporal coverage and network load.",
                    "VC-bots: a vehicular cloud computing testbed with mobile robots.",
                    "The price of fog: a data-driven study on caching architectures in vehicular networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16th MobiHoc 2015",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2015",
                "sub_name": "Proceedings of the 16th ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2015, Hangzhou, China, June 22-25, 2015.",
                "count": 61,
                "papers": [
                    "Fast Data Retrieval in Cloud Storage Systems.",
                    "Mobile Visual Search.",
                    "The Road Ahead for Wireless Technology: Dreams and Challenges.",
                    "WATCH: WiFi in Active TV Channels.",
                    "FIWEX: Compressive Sensing Based Cost-Efficient Indoor White Space Exploration.",
                    "ALETHEIA: Robust Large-Scale Spectrum Auctions against False-name Bids.",
                    "Turning Waste into Wealth: Enabling Communication in Guardband Whitespace.",
                    "Asynchronous Neighbor Discovery on Duty-cycled Mobile Devices: Integer and Non-Integer Schedules.",
                    "The Value-of-Information in Matching with Queues.",
                    "EarlyBird: Mobile Prefetching of Social Network Feeds via Content Preference Mining and Usage Pattern Analysis.",
                    "Handoff Rate Analysis in Heterogeneous Wireless Networks with Poisson and Poisson Cluster Patterns.",
                    "Loop-Free Backpressure Routing Using Link-Reversal Algorithms.",
                    "Face Routing on a Non-Planar Graph: Theory and Applications to Networks.",
                    "From Rateless to Hopless.",
                    "SmartGuide: Towards Single-image Building Localization with Smartphone.",
                    "Distributed Caching and Small Cell Cooperation for Fast Content Delivery.",
                    "Multi-view Wireless Video Streaming Based on Compressed Sensing: Architecture and Network Optimization.",
                    "When Network Effect Meets Congestion Effect: Leveraging Social Services for Wireless Services.",
                    "Distributed Time-Sensitive Task Selection in Mobile Crowdsensing.",
                    "Quality of Information Aware Incentive Mechanisms for Mobile Crowd Sensing Systems.",
                    "Pay as How Well You Do: A Quality Based Incentive Mechanism for Crowdsensing.",
                    "An Online Approach to Dynamic Channel Access and Transmission Scheduling.",
                    "A High Reliability Asymptotic Approach for Packet Inter-Delivery Time Optimization in Cyber-Physical Systems.",
                    "QoE-Optimal Scheduling for On-Demand Video Streams over Unreliable Wireless Networks.",
                    "On the Capacity Requirement of Largest-Deficit-First for Scheduling Real-Time Traffic in Wireless Networks.",
                    "Secure Communication through Jammers Jointly Optimized in Geography and Time.",
                    "Mitigating Rate Attacks through Crypto-Coded Modulation.",
                    "Temporally or Spatially Dispersed Joint RFID Estimation Using Snapshots of Variable Lengths.",
                    "Performance and Energy Consumption Analysis of a Delay-Tolerant Network for Censorship-Resistant Communication.",
                    "Tracking Vital Signs During Sleep Leveraging Off-the-shelf WiFi.",
                    "UbiBreathe: A Ubiquitous non-Invasive WiFi-based Breathing Estimator.",
                    "Taming Wireless Fluctuations by Predictive Queuing Using a Sparse-Coding Link-State Model.",
                    "TRINITY: A Practical Transmitter Cooperation Framework to Handle Heterogeneous User Profiles in Wireless Networks.",
                    "Device-to-Device Communication Overlaying Two-Hop Multi-Channel Uplink Cellular Networks.",
                    "On the Decomposition of Cell Phone Activity Patterns and their Connection with Urban Ecology.",
                    "Signpost: Scalable MU-MIMO Signaling with Zero CSI Feedback.",
                    "Cross-Cell DoF Distribution: Combating Channel Hardening Effect in Multi-Cell MU-MIMO Networks.",
                    "A Distributed Algorithm to Construct Multicast Trees in WSNs: An Approximate Steiner Tree Approach.",
                    "Virtually Moving Base Stations for Energy Efficiency in Wireless Sensor Networks.",
                    "An Operator Calculus Approach for Multi-constrained Routing in Wireless Sensor Networks.",
                    "Poster: An Adaptive Copy Spraying Scheme for Data Forwarding in Mobile Opportunistic Networks.",
                    "Poster: Compressed Sensing Inspired Approaches for Path Reconstruction in Wireless Sensor Networks.",
                    "Poster: Full-duplex WiFi: Achieving Simultaneous Sensing and Transmission for Future Wireless Networks.",
                    "Poster: Avoiding Rollback Traffic during the Switch of Snapshot Routing in Cyclic Mobile Networks.",
                    "Poster: Design and Implementation of Mobile E-Learning Platform for Medical Training.",
                    "Poster: Roadside Unit Caching Mechanism for Multi-Service Providers.",
                    "Poster: Disseminating Content in Interest-centric Opportunistic Social Networks.",
                    "Poster: A Time-Saving Scheme for Ambulance Transportation with Support of Software-Defined Networking.",
                    "Poster: Toward a Theoretical Privacy Framework for Electronic Locks in Context of Home Security Monitoring System for Clouds of Things.",
                    "Poster: Unified Resource Allocation for Small Cell Networks Using Matching Theory.",
                    "Demo: Proximity-based Information Propagation.",
                    "Demo: LIVES: Learning through Interactive Video and Emotion-aware System.",
                    "Demo: Software-Defined Device to Device Communication in Multiple Cells.",
                    "Demo: RecDroid: An Android Resource Access Permission Recommendation System.",
                    "Demo: WiFi Multihop: Implementing Device-to-Device Local Area Networks by Android Smartphones.",
                    "Demo: Concurrent Spectrum Sensing and Transmission for Cognitive Radio using Self-Interference Cancellation.",
                    "Demo: An Efficient and Reliable Wireless Link for Mobile Video Surveillance Systems.",
                    "Demo: A Low-cost, Highly Customizable Robotic Platform for Testing Mobile Sensor Networks.",
                    "Demo: Real LTE Experimentation in a Controlled Environment.",
                    "Demo: An Augmented Reality Based Social Networking System for Mobile Users Using Smartphones.",
                    "Demo: xRadio: Development of Next Generation Machine-to-Machine (M2M) Radio Adopting Narrow Band OFDM."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015hotpost",
                "sub_name": "Proceedings of the 7th International Workshop on Hot Topics in Planet-scale mObile computing and online Social neTworking, HOTPOST@MobiHoc 2015, Hangzhou, China, June 22, 2015.",
                "count": 9,
                "papers": [
                    "Towards a Three-tiered Social Graph in Decentralized Online Social Networks.",
                    "Privacy Preserving Decentralized Identity Validation for Geo-social Networks over MANET.",
                    "Privacy Preserving Social Tie Discovery Based on Cloaked Human Trajectories.",
                    "Characterizing the Spatio-Temporal Inhomogeneity of Mobile Traffic in Large-scale Cellular Data Networks.",
                    "Exploiting User Context and Network Information for Mobile Application Usage Prediction.",
                    "Video Highlight Shot Extraction with Time-Sync Comment.",
                    "Inter Action Time in Virtual and Physical Spaces: A Comparative Study.",
                    "An Empirical Study of Human Altruistic Behaviors in Opportunistic Networks.",
                    "Evaluating the Influence of Social Selfishness on Cooperative D2D Communications."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015mh",
                "sub_name": "Proceedings of the 2015 Workshop on Pervasive Wireless Healthcare, MobileHealth@MobiHoc 2015, Hangzhou, China, June 22, 2015.",
                "count": 11,
                "papers": [
                    "Mobile Sensing and Beyond in the Information Age: An Experimental Perspective.",
                    "Mobile Sensing and Beyond in the Information Age: An Experimental Perspective.",
                    "mAuditor: Mobile Auditing Framework for mHealth Applications.",
                    "PathS: Enhancing Geographical Maps with Environmental Sensed Data.",
                    "AirSense: A Portable Context-sensing Device for Personal Air Quality Monitoring.",
                    "Smart Energy Harvesting Routing Protocol for WSN based E-Health Systems.",
                    "Smartphone Sensor Fusion based Activity Recognition System for Elderly Healthcare.",
                    "Usability of a Low-Cost Wearable Health Device for Physical Activity and Sleep Duration in Healthy Adults.",
                    "A Genetic-Neuro-Fuzzy Inferential Technique for Diagnosis of Tuberculosis.",
                    "SmartHealth-NDNoT: Named Data Network of Things for Healthcare Services.",
                    "Understanding Women's Needs in Menopause for Development of mHealth."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015mobidata",
                "sub_name": "Proceedings of the 2015 Workshop on Mobile Big Data, Mobidata@MobiHoc 2015, Hangzhou, China, June 21, 2015.",
                "count": 13,
                "papers": [
                    "Controlling the Spreads of Infectious Disease and Scare via Utilizing Location and Social Networking Information.",
                    "Data Preservation in Data-Intensive Sensor Networks With Spatial Correlation.",
                    "A Measurement-based Study on Application Popularity in Android and iOS App Stores.",
                    "SH-CRAN: Hierarchical Framework to Support Mobile Big Data Computing in a Secure Manner.",
                    "Mobile Data Collection Frameworks: A Survey.",
                    "A Mobile Cloud Computing Middleware for Low Latency Offloading of Big Data.",
                    "A Survey of Fog Computing: Concepts, Applications and Issues.",
                    "Distributed Analytics and Edge Intelligence: Pervasive Health Monitoring at the Era of Fog Computing.",
                    "A Mobile Retail POS: Design and Implementation.",
                    "Research on 3D Localization Algorithm of Wireless Sensor Networks in Underground Coal Mine.",
                    "Crime Risk Evaluation in Individual's Local Community.",
                    "Application of multiple orthogonal window spectrum estimation in speaker recognition.",
                    "An Optimal Dynamic Frame Slot-Segment Algorithm."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015mobimwarehn",
                "sub_name": "Proceedings of the ACM International Workshop on Mobility and MiddleWare Management in HetNets, MobiMWareHN@MobiHoc 2015, Hangzhou, China, June 22, 2015.",
                "count": 3,
                "papers": [
                    "Security and Privacy in Mobile Social Networks.",
                    "Data Collection Middleware for Crowdsourcing-based Industrial Sensing Intelligence.",
                    "Design and Implementation of Real-time Sobel Edge Detection on FPGA for Mobile Device Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015mscc",
                "sub_name": "Proceedings of the Second Workshop on Mobile Sensing, Computing and Communication, MSCC@MobiHoc 2015, Hangzhou, China, June 22, 2015.",
                "count": 9,
                "papers": [
                    "Distributed DOA Estimation Based on Manifold Separation Technique in Mobile Wireless Sensor Networks.",
                    "Radiated Power Scaling Factor and Its Effect on The Secrecy Performance of Multi-user Massive MIMO System.",
                    "Quantify Self-Organized Storage Capacity in Supporting Infrastructure-less Transportation Operation.",
                    "Pillow Talks: Bits Over Communications in WLAN.",
                    "Towards a Sensor-Cloud Infrastructure with Sensor Virtualization.",
                    "The Enhancement of GSD Algorithm with Data Preprocessing Technique for WSN.",
                    "Is My Cheese Moved?: An RF based \"X-raying\" Method for Trustworthy Item-identification.",
                    "LIPS: Bring LIght Propagation Selection to Geographic Opportunistic Routing in Strip WSNs.",
                    "FSNC: Flexible and Scalable Network Coding in Wireless Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2015pamco",
                "sub_name": "Proceedings of the 2015 Workshop on Privacy-Aware Mobile Computing, PAMCO@MobiHoc 2015, Hangzhou, China, June 22, 2015.",
                "count": 4,
                "papers": [
                    "Secure Auctions without an Auctioneer via Verifiable Secret Sharing.",
                    "Rise of Mini-Drones: Applications and Issues.",
                    "Privacy Disclosure from Wearable Devices.",
                    "Blind Recognition of Text Input on Mobile Devices via Natural Language Processing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15th MobiHoc 2014",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2014",
                "sub_name": "The Fifteenth ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc'14, Philadelphia, PA, USA, August 11-14, 2014.",
                "count": 61,
                "papers": [
                    "Realizing the transformative impact of computing and data in a networked world.",
                    "Unknown combinatorial auction mechanisms for heterogeneous spectrum redistribution.",
                    "Compressive sensing meets unreliable link: sparsest random scheduling for compressive data gathering in lossy WSNs.",
                    "A systematic study of the delayed column generation method for optimizing wireless networks.",
                    "When backpressure meets predictive scheduling.",
                    "All your location are belong to us: breaking mobile social networks for automated user location tracking.",
                    "Modeling data dissemination in online social networks: a geographical perspective on bounding network traffic load.",
                    "Load balanced short path routing in large-scale wireless networks using area-preserving maps.",
                    "An overlay architecture for throughput optimal multipath routing.",
                    "Just FUN: a joint fountain coding and network coding approach to loss-tolerant information spreading.",
                    "Minimum-sized influential node set selection for social networks under the independent cascade model.",
                    "Not all content is created equal: effect of popularity and availability for content-centric opportunistic networking.",
                    "SmartPhoto: a resource-aware crowdsourcing approach for image sensing with smartphones.",
                    "How to build vehicular networks in the real world.",
                    "Secrecy capacity scaling of large-scale cognitive networks.",
                    "Capacity of wireless networks with multiple types of multicast sessions.",
                    "Capacity maximization in wireless MIMO networks with receiver-side interference suppression.",
                    "Fully distributed algorithms for blind rendezvous in cognitive radio networks.",
                    "A group-theoretic framework for rendezvous in heterogeneous cognitive radio networks.",
                    "An extensible and flexible truthful auction framework for heterogeneous spectrum markets.",
                    "Differentially private spectrum auction with approximate revenue maximization.",
                    "Bounded rationality can increase parking search efficiency.",
                    "Optimal determination of source-destination connectivity in random graphs.",
                    "Supporting mobile users in database-driven opportunistic spectrum access.",
                    "Belief propagation for spatial spectrum access games.",
                    "Truthful prioritization for dynamic bandwidth sharing.",
                    "Ad hoc networks: pushing mobile and wireless communication since 1970.",
                    "ESync: an energy synchronized charging protocol for rechargeable wireless sensor networks.",
                    "Energy efficient multipath TCP for mobile devices.",
                    "An analytical framework to characterize the efficiency and delay in a mobile data offloading system.",
                    "Quality-aware traffic offloading in wireless networks.",
                    "COSMOS: computation offloading as a service for mobile devices.",
                    "Path reconstruction in dynamic wireless sensor networks using compressive sensing.",
                    "Heterogeneous multi-channel neighbor discovery formobile sensing applications: theoretical foundationand protocol design.",
                    "Latency-optimized broadcast in mobile ad hoc networks without node coordination.",
                    "A matrix-completion approach to mobile network localization.",
                    "Surface skeleton extraction and its application for data storage in 3D sensor networks.",
                    "Wise counting: fast and efficient batch authentication for large-scale RFID systems.",
                    "Trace-routing in 3D wireless sensor networks: a deterministic approach with constant overhead.",
                    "Max-min fair rate allocation and routing in energy harvesting networks: algorithmic analysis.",
                    "RxLayer: adaptive retransmission layer for low power wireless.",
                    "Measurement-based transmission schemes for network MIMO.",
                    "Multiple target counting and tracking using binary proximity sensors: bounds, coloring, and filter.",
                    "Demo: road speed profile: from GPS traces to real-time traffic speed.",
                    "Demo: routing overlay for reliable communication in networks with blockage.",
                    "Demo: an energy synchronized charging protocol for rechargeable wireless sensor networks.",
                    "Demo: Dial-a-Ride: a green shortest path algorithm.",
                    "Demo: recommendation system for dynamic spectrum access through spectrum mining and prediction.",
                    "Demo: an augmented reality based file transfer system for mobile users using smart phones.",
                    "Demo: efficient multi-objective optimization of network problems on wireless testbeds.",
                    "Poster: bacteria inspired mitigation of selfish users in ad-hoc social networks.",
                    "Poster: near field communication based access control for wireless medical devices.",
                    "Poster: environment-adaptive clock calibration for wireless sensor networks.",
                    "Poster: a simulation analysis on the hop count of multi-hop path in cognitive radio ad-hoc networks.",
                    "Poster: reliable TCP for popular data in socially-aware ad-hoc networks.",
                    "Poster: the construction of reeb graph and its applications in 3D sensor networks.",
                    "Poster: social mobility based routing in crowdsourced systems.",
                    "Poster: modeling the performance of routing in heterogeneous delay-tolerant networks.",
                    "Poster: CIS: a community-based incentive scheme for socially-aware networking.",
                    "Poster: crowdsourcing to smartphones: social network based human collaboration.",
                    "Poster: enabling mobile content-oriented networking in the mobilityfirst future internet architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2014airborne",
                "sub_name": "Proceedings of the third ACM workshop on Airborne networks and communications, AIRBORNE@MobiHoc 2014, Philadelphia, Pennsylvania, USA, August 11, 2014.",
                "count": 5,
                "papers": [
                    "A proposal for exploring data mule based weak rendezvous for communication between loosely coupled convoys.",
                    "GTA-m: greedy trajectory-aware (m copies) routing for airborne networks.",
                    "Routing in a fleet of micro aerial vehicles: first experimental insights.",
                    "Network-coded connected dominating set relaying for airborne tactical networks.",
                    "A comparison of OLSR and OSPF-MDR for large-scale airborne mobile ad-hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2014mh",
                "sub_name": "Proceedings of the 4th ACM MobiHoc workshop on Pervasive wireless healthcare, MobileHealth@MobiHoc 2014, Philadelphia, Pennsylvania, USA, August 11, 2014.",
                "count": 9,
                "papers": [
                    "On real-time requirements in constrained wireless networks for mobile health.",
                    "Energy constraint-aware routing protocol for data transmission in ad hoc medical care networks.",
                    "Designing user-specific plug-n-play into body area networks.",
                    "Smart phone based blood pressure indicator.",
                    "MotionSynthesis toolset (MoST): a toolset for human motion data synthesis and validation.",
                    "Multi-part file encryption for electronic health records cloud.",
                    "Mobile health: medication abuse and addiction.",
                    "Customizable, scalable and reliable community-based mobile health interventions.",
                    "Toward automated categorization of mobile health and fitness applications."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2014mscc",
                "sub_name": "Proceedings of the first international workshop on Mobile sensing, computing and communication, MSCC@MobiHoc 2014, Philadelphia, Pennsylvania, USA, August 11, 2014.",
                "count": 6,
                "papers": [
                    "On optimal scheduling of multiple mobile chargers in wireless sensor networks.",
                    "Scheduling in vehicular cloud using mixed integer linear programming.",
                    "InterestSpread: an efficient method for content transmission in mobile social networks.",
                    "Evaluating and analyzing the performance of RPL in contiki.",
                    "Confidence-interval based sensing quality evaluation for mobile sensor networks.",
                    "Walk globally, act locally: efficient influential user identification in mobile social networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2014wimobcity",
                "sub_name": "Proceedings of the 2014 ACM international workshop on Wireless and mobile technologies for smart cities, WiMobCity@MobiHoc 2014, Philadelphia, Pennsylvania, USA, August 11, 2014.",
                "count": 13,
                "papers": [
                    "A smart disaster management system for future cities.",
                    "Towards a vehicular cloud - using parked vehicles as a temporary network and storage infrastructure.",
                    "Quantifying the achievable cellular traffic offloading gain with passpoint hotspots.",
                    "New services design for smart cities: a planning roadmap for user-driven innovation.",
                    "Performance comparison of contention- and schedule-based mac protocols in urban parking sensor networks.",
                    "Urban wireless community networks: challenges and solutions for smart city communications.",
                    "On the packet loss correlation in wireless mesh networks: channel models and practical schemes.",
                    "Towards a smart city based on cloud of things.",
                    "User study on the feasibility of incentive systems for smartphone-based DTNs in smart cities.",
                    "VELOR: velocity-based routing protocol.",
                    "Social opportunistic sensing and social centric networking: enabling technology for smart cities.",
                    "A cost-benefit analysis of data processing architectures for the smart grid.",
                    "Intelligent street lighting clustering."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th MobiHoc 2013",
        "info": "Bangalore, India",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2013",
                "sub_name": "The Fourteenth ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc '13, Bangalore, India, July 29 - August 01, 2013.",
                "count": 40,
                "papers": [
                    "LED-to-LED visible light communication networks.",
                    "Continuous scanning with mobile reader in RFID systems: an experimental study.",
                    "Informative counting: fine-grained batch authentication for large-scale RFID systems.",
                    "Balancing lifetime and classification accuracy of wireless sensor networks.",
                    "FAVOR: frequency allocation for versatile occupancy of spectrum in wireless sensor networks.",
                    "Barrier coverage in bistatic radar sensor networks: cassini oval sensing and optimal placement.",
                    "A distributed delaunay triangulation algorithm based on centroidal voronoi tessellation for wireless sensor networks.",
                    "Cut-and-sew: a distributed autonomous localization algorithm for 3D surface wireless sensor networks.",
                    "Heavy-traffic-optimal scheduling with regular service guarantees in wireless networks.",
                    "Distributed greedy approximation to maximum weighted independent set for scheduling with fading channels.",
                    "On the performance of largest-deficit-first for scheduling real-time traffic in wireless networks.",
                    "On traveling path and related problems for a mobile station in a rechargeable sensor network.",
                    "Qute: quality-of-monitoring aware sensing and routing strategy in wireless sensor networks.",
                    "Practical opportunistic routing in high-speed multi-rate wireless mesh networks.",
                    "CSMA over time-varying channels: optimality, uniqueness and limited backoff rate.",
                    "ProBeam: a practical multicell beamforming system for OFDMA small-cell networks.",
                    "Connectivity in obstructed wireless networks: from geometry to percolation.",
                    "On the instantaneous topology of a large-scale urban vehicular network: the cologne case.",
                    "Detecting epidemics using highly noisy data.",
                    "Social trust and social reciprocity based cooperative D2D communications.",
                    "Realtime streaming with guaranteed QoS over wireless D2D networks.",
                    "On bridging the gap between homogeneous and heterogeneous rendezvous schemes for cognitive radios.",
                    "Model-driven energy-aware rate adaptation.",
                    "Quantize-map-forward (QMF) relaying: an experimental study.",
                    "Near-optimal truthful spectrum auction mechanisms with spatial and temporal reuse in wireless networks.",
                    "Characteristic function of connectivity with obstacles.",
                    "Maximizing network throughput with minimal remote data transfer cost in unreliable wireless sensor networks.",
                    "Route-switching games in cognitive radio networks.",
                    "MINT: maximizing information propagation in predictable delay-tolerant network.",
                    "Community based cooperative content caching in social wireless networks.",
                    "Mobile social networking through friend-to-friend opportunistic content dissemination.",
                    "Scheduling of access points for multiple live video streams.",
                    "A simple approximate analysis of floating content for context-aware applications.",
                    "Randomized skip lists-based private authentication for large-scale RFID systems.",
                    "Energy-efficient fault-tolerant data storage & processing in dynamic networks.",
                    "Energy-efficient reliable data dissemination in duty-cycled wireless sensor networks.",
                    "Minimum makespan workload dissemination in DTNs: making full utilization of computational surplus around.",
                    "Adaptive channel bonding in multicarrier wireless networks.",
                    "Connecting, scaling and securing RS code and TD based KPDs in WSNs: deterministic merging.",
                    "SMASHER: a strategy-proof combinatorial auction mechanism for heterogeneous channel redistribution."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2013mh",
                "sub_name": "Proceedings of the 3rd ACM MobiHoc workshop on Pervasive wireless healthcare, MobileHealth@MobiHoc 2013, Bangalore, India, July 29 - August 1, 2013.",
                "count": 8,
                "papers": [
                    "New priority MAC protocol for wireless body area networks.",
                    "ESTHER: a portable sensor toolkit to collect and monitor total hip replacement patient data.",
                    "An improved data security using DNA sequencing.",
                    "Secured wireless medical data transmission using modified elliptic curve cryptography.",
                    "Efficient health data compression on mobile devices.",
                    "A conceptual framework for designing mHealth solutions for developing countries.",
                    "Safer virtual pillbox: assuring medication adherence to elderly patients.",
                    "A robust heart rate detection using smart-phone video."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2013anc",
                "sub_name": "Proceedings of the second ACM MobiHoc workshop on Airborne networks and communications, ANC@MobiHoc 2013, Bangalore, India, July 29, 2013.",
                "count": 5,
                "papers": [
                    "The capacity of aeronautical ad-hoc networks.",
                    "Characterizing 802.11n aerial communication.",
                    "Energy efficient approach with integrated key management scheme for wireless sensor networks: c.2.2 [network protocols].",
                    "Implementation of data privacy between nodes using AES in wireless ad hoc networks.",
                    "Mobile ad hoc networks in the sky: state of the art, opportunities, and challenges."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th MobiHoc 2012",
        "info": "Hilton Head, SC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2012",
                "sub_name": "The Thirteenth ACM International Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc '12, Hilton Head, SC, USA, June 11-14, 2012.",
                "count": 37,
                "papers": [
                    "Urban-scale wireless networks in unlicensed sub-GHz bands.",
                    "Resilient distributed consensus.",
                    "Your friends have more friends than you do: identifying influential mobile users through random walks.",
                    "Encounter based sensor tracking.",
                    "EV-Loc: integrating electronic and visual signals for accurate localization.",
                    "Low-complexity scheduling for wireless networks.",
                    "Stability analyses of longest-queue-first link scheduling in MC-MR wireless networks.",
                    "Enabling real-time interference alignment: promises and challenges.",
                    "Optimization schemes for protective jamming.",
                    "Taming uncertainties in real-time routing for wireless networked sensing and control.",
                    "Minimum-energy connected coverage in wireless sensor networks with omni-directional and directional features.",
                    "Probabilistic missing-tag detection and energy-time tradeoff in large-scale RFID systems.",
                    "Adaptive network coding for scheduling real-time traffic with hard deadlines.",
                    "Distributed network coding-based opportunistic routing for multicast.",
                    "Throughput of rateless codes over broadcast erasure channels.",
                    "Closing the gap in the multicast capacity of hybrid wireless networks.",
                    "Serendipity: enabling remote computing among intermittently connected mobile devices.",
                    "Oblivious low-congestion multicast routing in wireless networks.",
                    "Dissemination in opportunistic social networks: the role of temporal communities.",
                    "Optimal energy-aware epidemic routing in DTNs.",
                    "Transmission delay in large scale ad hoc cognitive radio networks.",
                    "Enforcing dynamic spectrum access with spectrum permits.",
                    "Spatial spectrum access game: nash equilibria and distributed learning.",
                    "Design and implementation of an integrated beamformer and uplink scheduler for OFDMA femtocells.",
                    "A case for adaptive sub-carrier level power allocation in OFDMA networks.",
                    "A distributed resource management framework for interference mitigation in OFDMA femtocell networks.",
                    "Towards intelligent antenna selection in IEEE 802.15.4 wireless sensor networks.",
                    "Localization using bluetooth device names.",
                    "Channel width assignment using relative backlog: extending back-pressure to physical layer.",
                    "Reliable link lifetime-based cluster-head election in wireless ad hoc networks.",
                    "Price-reward for data relaying and handover management in wireless networks.",
                    "JIM-beam: using spatial randomness to build jamming-resilient wireless flooding networks.",
                    "Extracting jamming signals to locate radio interferers and jammers.",
                    "A novel misbehavior evaluation with dempster-shafer theory in wireless sensor networks.",
                    "Your smartphone can watch the road and you: mobile assistant for inattentive drivers.",
                    "A distributed channel selection scheme for multi-channelwireless sensor networks.",
                    "Can smartphone sensors enhance kinect experience?"
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2012mh",
                "sub_name": "Proceedings of the 2nd ACM international workshop on Pervasive Wireless Healthcare, MobileHealth@MobiHoc 2012, Hilton Head, SC, USA, June 11-14, 2012.",
                "count": 10,
                "papers": [
                    "The challenges and opportunities in wireless health.",
                    "iEpi: an end to end solution for collecting, conditioning and utilizing epidemiologically relevant data.",
                    "e-ESAS: improving quality of life for breast cancer patients in developing countries.",
                    "Mobile healthcare infrastructure for home and small clinic.",
                    "Performance evaluation of data intensive mobile healthcare test-bed in a 4G environment.",
                    "Efficient delivery of frequent small data for U-healthcare applications over LTE-advanced networks.",
                    "Inkjet-printed monopole antennas for enhanced-range WBAN and wearable biomonitoring application.",
                    "Low-power fall detection in home-based environments.",
                    "Ultraviolet guardian - real time ultraviolet monitoring: estimating the pedestrians ultraviolet exposure before stepping outdoors.",
                    "Clinical quality guaranteed physiological data compression in mobile health monitoring."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th MobiHoc 2011",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2011",
                "sub_name": "Proceedings of the 12th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2011, Paris, France, May 16-20, 2011.",
                "count": 25,
                "papers": [
                    "Deterministic greedy routing with guaranteed delivery in 3D wireless sensor networks.",
                    "O3: optimized overlay-based opportunistic routing.",
                    "Neighbor discovery in wireless networks with multipacket reception.",
                    "Broadcasting delay-constrained traffic over unreliable wireless links with network coding.",
                    "OmniVoice: a mobile voice solution for small-scale enterprises.",
                    "Enabling coexistence of heterogeneous wireless systems: case for ZigBee and WiFi.",
                    "The hare and the tortoise: taming wireless losses by exploiting wired reliability.",
                    "A market-clearing model for spectrum trade in cognitive radio networks.",
                    "Truthful auction for cooperative communications.",
                    "Non-cooperative spectrum access: the dedicated vs. free spectrum choice.",
                    "Wireless coverage with disparate ranges.",
                    "Barrier coverage in camera sensor networks.",
                    "Local connectivity tests to identify wormholes in wireless networks.",
                    "UNFOLD: uniform fast on-line boundary detection for dynamic 3D wireless sensor networks.",
                    "Self-stabilizing leader election for single-hop wireless networks despite jamming.",
                    "Towards cheat-proof cooperative relay for cognitive radio networks.",
                    "Dispatch-and-search: dynamic multi-ferry control in partitioned mobile networks.",
                    "Putting contacts into context: mobility modeling beyond inter-contact times.",
                    "Towards optimal rate allocation for data aggregation in wireless sensor networks.",
                    "Scheduling algorithms for video multicasting with channel diversity in wireless OFDMA networks.",
                    "Utility optimal scheduling in energy harvesting networks.",
                    "Turning off radios to save power in multi-radio wireless mesh networks.",
                    "EM-MAC: a dynamic multichannel energy-efficient MAC protocol for wireless sensor networks.",
                    "On optimal energy efficient convergecasting in unreliable sensor networks with applications to target tracking.",
                    "Energy-efficient polling protocols in RFID systems."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2011mh",
                "sub_name": "Proceedings of the First ACM MobiHoc Workshop on Pervasive Wireless Healthcare, MobileHealth@MobiHoc 2011, Paris, France, May 16-20, 2011.",
                "count": 12,
                "papers": [
                    "Managing resources for healthcare service calls in a cellular network with relays and machine-type communication nodes.",
                    "Low duty-cycle UWB communications design for body area network.",
                    "Efficient vehicle-to-pedestrian exchange of medical data: an empirical model with preliminary results.",
                    "Multi-sensors' data gathering management system for a wireless health monitoring platform.",
                    "A low-power, distributed, pervasive healthcare system for supporting memory.",
                    "Fingerprinting-based wireless 3D localization for motion capture applications.",
                    "Food intake recognition conception for wearable devices.",
                    "A mobile system for precise wireless pulse transit time (PTT) monitoring.",
                    "Fitness Tour: a mobile application for combating obesity.",
                    "iResTrac: an architecture for maintaining medical resource status with mobile devices.",
                    "Feasibility study of a real-time wandering detection algorithm for dementia patients.",
                    "Model-based architecture analysis for wireless healthcare."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th MobiHoc 2010",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2010",
                "sub_name": "Proceedings of the 11th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2010, Chicago, IL, USA, September 20-24, 2010.",
                "count": 26,
                "papers": [
                    "Identifying the missing tags in a large RFID system.",
                    "The intrusion detection in mobile sensor network.",
                    "Security-capacity trade-off in large wireless networks using keyless secrecy.",
                    "Utility-optimal scheduling in time-varying wireless networks with delay constraints.",
                    "Longest-queue-first scheduling under SINR interference model.",
                    "Distributed rate control and contention resolution in multi-cell IEEE 802.11 wlans with hidden terminals.",
                    "Fine-grained mobility characterization: steady and transient state behaviors.",
                    "Detecting intra-room mobility with signal strength descriptors.",
                    "Mobility: a double-edged sword for HSPA networks: a large-scale test on Hong Kong mobile HSPA networks.",
                    "Globs in the primordial soup: the emergence of connected crowds in mobile wireless networks.",
                    "Fading-resistant low-latency broadcasts in wireless multihop networks: the probabilistic cooperation diversity approach.",
                    "On quality of monitoring for multi-channel wireless infrastructure networks.",
                    "Breaking bidder collusion in large-scale spectrum auctions.",
                    "Whirlpool routing for mobility.",
                    "Flying in the dark: controlling autonomous data ferries with partial observations.",
                    "Cooperation vs. multiplexing: multicast scheduling algorithms for ofdma relay networks.",
                    "Greedy geographic routing in large-scale sensor networks: a minimum network decomposition approach.",
                    "Data preservation under spatial failures in sensor networks.",
                    "Near optimal multi-application allocation in shared sensor networks.",
                    "Connectivity-based and anchor-free localization in large-scale 2d/3d sensor networks.",
                    "Barrier coverage with sensors of limited mobility.",
                    "Multiple receiver strategies for minimizing packet loss in dense sensor networks.",
                    "Rate diverse network coding: breaking the broadcast bottleneck.",
                    "Quantitative analysis of the effect of transmitting power on the capacity of wireless ad hoc networks.",
                    "On optimal feedback allocation in multichannel wireless downlinks.",
                    "Spectrum pricing games with bandwidth uncertainty and spatial reuse in cognitive radio networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10th MobiHoc 2009",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2009",
                "sub_name": "Proceedings of the 10th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2009, New Orleans, LA, USA, May 18-21, 2009.",
                "count": 52,
                "papers": [
                    "Software defined mobile networks.",
                    "Revenue generation for truthful spectrum auction in dynamic spectrum access.",
                    "Spectrum auction framework for access allocation in cognitive radio networks.",
                    "Stackelberg game for utility-based cooperative cognitiveradio networks.",
                    "Efficient resource management in OFDMA Femto cells.",
                    "On performance optimization for multi-carrier MIMO ad hoc networks.",
                    "Delay and effective throughput of wireless scheduling in heavy traffic regimes: vacation model for complexity.",
                    "A refined performance characterization of longest-queue-first policy in wireless networks.",
                    "Scheduling with limited information in wireless systems.",
                    "Multiflows in multihop wireless networks.",
                    "Predict and relay: an efficient routing in disruption-tolerant networks.",
                    "An optimal probabilistic forwarding protocolin delay tolerant networks.",
                    "Aging rules: what does the past tell about the future in mobile ad-hoc networks?",
                    "Fault tolerant target tracking in sensor networks.",
                    "Fine-grained boundary recognition in wireless ad hoc and sensor networks by topological methods.",
                    "Low-connectivity and full-coverage three dimensional wireless sensor networks.",
                    "Energy-efficient capture of stochastic events by global- and local-periodic network coverage.",
                    "Improved bounds on the throughput efficiency of greedy maximal scheduling in wireless networks.",
                    "Admission control and scheduling for QoS guarantees for variable-bit-rate applications on wireless channels.",
                    "Minimum-latency aggregation scheduling in multihop wireless networks.",
                    "Future of multi-hopping: from theory to practice.",
                    "Secure multidimensional range queries in sensor networks.",
                    "Efficient uncoordinated FHSS anti-jamming communication.",
                    "Zero pre-shared secret key establishment in the presence of jammers.",
                    "Optimal monitoring in multi-channel multi-radio wireless mesh networks.",
                    "How to correctly use the protocol interference model for multi-hop wireless networks.",
                    "Characterizing the exit process of a non-saturated IEEE 802.11 wireless network.",
                    "Experimental characterization of sectorized antennas in dense 802.11 wireless mesh networks.",
                    "A novel reliable and energy-saving forwarding technique for wireless sensor networks.",
                    "A practical joint network-channel coding scheme for reliable communication in wireless networks.",
                    "MotionCast: on the capacity and delay tradeoffs.",
                    "Multicasting in delay tolerant networks: a social network perspective.",
                    "3DLS: density-driven data location service for mobile ad-hoc networks.",
                    "Aggressive cognitive radio (ACR): how to make your own white space.",
                    "CSMA interaction detection and capacity estimation in cognitive radio networks.",
                    "Demonstration of cooperative diversity using a custom software-defined radio prototype.",
                    "Demonstration of highly programmable downlink OFDMA (WiMax) transceivers for SDR systems.",
                    "Search-based picture sharing with mobile phones.",
                    "Multi-sector antenna performance in dense wireless networks.",
                    "WARPnet: clean slate research on deployed wireless networks.",
                    "An agile radio framework for unmanaged wireless environments.",
                    "Stealing from an ongoing flow.",
                    "A state-based battery model for nodes' lifetime estimation in wireless sensor networks.",
                    "A novel sensor localization scheme by mobile actors.",
                    "Cooperative spectrum sensing for cognitive radio networks with amplify and forward relaying over correlated log-normal shadowing.",
                    "A DoS-resilient en-route filtering scheme for sensor networks.",
                    "Social network analysis on data diffusion in delay tolerant networks.",
                    "From theory to practice: topology control in wireless sensor networks.",
                    "Exploring 700mhz WiFi-based wireless mesh networking.",
                    "Pub/sub content sharing for mobile networks format.",
                    "Routing in multi-hop wireless mesh networks with bandwidth guarantees.",
                    "Uisce: an alternative approach to end-to-end delivery in manets."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9th MobiHoc 2008",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2008",
                "sub_name": "Proceedings of the 9th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2008, Hong Kong, China, May 26-30, 2008.",
                "count": 56,
                "papers": [
                    "Multihop wireless networks: capacity limits and how to approach them.",
                    "Optimal relay assignment for cooperative communications.",
                    "On exploiting diversity and spatial reuse in relay-enabled wireless networks.",
                    "Routing in outer space: fair traffic load in multi-hop wireless networks.",
                    "Complexity in wireless scheduling: impact and tradeoffs.",
                    "Analyzing DISH for multi-channel MAC protocols in wireless networks.",
                    "DW-MAC: a low latency, energy efficient demand-wakeup MAC protocol for wireless sensor networks.",
                    "Opportunistic and cooperative spatial multiplexing in MIMO ad hoc networks.",
                    "Dynamic packet fragmentation for wireless channels with failures.",
                    "Construction algorithms for k-connected m-dominating sets in wireless sensor networks.",
                    "An O(log n) dominating set protocol for wireless ad-hoc networks under the physical interference model.",
                    "Distributed construction of bounded-degree low-interference spanners of low weight.",
                    "A local greedy scheduling scheme with provable performance guarantee.",
                    "Connectivity in cooperative wireless ad hoc networks.",
                    "Improved asymptotic bounds on critical transmission radius for greedy forward routing in wireless ad hoc networks.",
                    "On the latency for information dissemination in mobile wireless networks.",
                    "Improving sensor network immunity under worm attacks: a software diversity approach.",
                    "Finding popular categories for RFID tags.",
                    "Towards energy efficient VoIP over wireless LANs.",
                    "The capacity and energy efficiency of wireless ad hoc networks with multi-packet reception.",
                    "Multicast capacity for hybrid wireless networks.",
                    "On throughput in linear wireless networks.",
                    "Route recovery in vertex-disjoint multipath routing for many-to-one sensor networks.",
                    "Energy efficient multi-path communication for time-critical applications in underwater sensor networks.",
                    "Rendezvous design algorithms for wireless sensor networks with a mobile base station.",
                    "Bubble rap: social-based forwarding in delay tolerant networks.",
                    "Delegation forwarding.",
                    "The networking shape of vehicular mobility.",
                    "Toward stochastic anatomy of inter-meeting time distribution under general mobility models.",
                    "Hidden information and actions in multi-hop wireless ad hoc networks.",
                    "Dice: a game theoretic framework for wireless multipath network coding.",
                    "A game approach for multi-channel allocation in multi-hop wireless networks.",
                    "Competitions and dynamics of duopoly wireless service providers in dynamic spectrum market.",
                    "Minimum-latency gossiping in multi-hop wireless networks.",
                    "An approximation algorithm for conflict-aware broadcast scheduling in wireless ad hoc networks.",
                    "Delay-bounded routing in vehicular ad-hoc networks.",
                    "Routing in a cyclic mobispace.",
                    "Challenging benchmark for location discovery in ad hoc networks: foundations and applications.",
                    "Using persistent homology to recover spatial information from encounter traces.",
                    "Cooperative transmit-power estimation under wireless fading.",
                    "Fast and quality-guaranteed data streaming in resource-constrained sensor networks.",
                    "Complete optimal deployment patterns for full-coverage and k-connectivity (k<=6) wireless sensor networks.",
                    "Strong barrier coverage of wireless sensor networks.",
                    "Measuring and guaranteeing quality of barrier-coverage in wireless sensor networks.",
                    "Self-monitoring for sensor networks.",
                    "Symmetric replication for efficient flooding in DHTs.",
                    "P2P-based routing and data management using the virtual cord protocol (VCP).",
                    "An approach to finding weak regions for wireless sensor networks with arbitrary sensing areas.",
                    "BEND: MAC-layer proactive mixing protocol for network coding in multi-hop wireless networks.",
                    "A constrained random perturbation vector-based pairwise key establishment scheme for wireless sensor networks.",
                    "Authentication for WiFi - WiBbro-based BWAN interworking.",
                    "Poster abstract: force-based geometric routing.",
                    "Poster abstract: an evaluation study of routing reliability in opportunistic networks.",
                    "A two-level social mobility model for trace generation.",
                    "Poster abstract: scalable and collaborative internet access for opportunistic people networks.",
                    "Mixed altruistic and selfish users in wireless mesh networks: a game theoretic model for multihop bandwidth sharing."
                ]
            },
            {
                "sub_name_abbr": "conf/mobihoc/2008mm",
                "sub_name": "Proceedings of the 1st ACM SIGMOBILE workshop on Mobility Models, MobilityModels 2008, Hong Kong, China, May 26, 2008.",
                "count": 7,
                "papers": [
                    "On clustering phenomenon in mobile partitioned networks.",
                    "Density estimation for out-of-range events on personal mobile devices.",
                    "Infection spread in wireless networks with random and adversarial node mobilities.",
                    "Routing performance analysis of human-driven delay tolerant networks using the truncated levy walk model.",
                    "Working day movement model.",
                    "On the need for bidirectional coupling of road traffic microsimulation and network simulation.",
                    "Generic mobility simulation framework (GMSF)."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th MobiHoc 2007",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2007",
                "sub_name": "Proceedings of the 8th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2007, Montreal, Quebec, Canada, September 9-14, 2007.",
                "count": 27,
                "papers": [
                    "Distributed opportunistic scheduling for ad-hoc communications: an optimal stopping approach.",
                    "On exploiting asymmetric wireless links via one-way estimation.",
                    "A dominating and absorbent set in a wireless ad-hoc network with different transmission ranges.",
                    "Social network analysis for routing in disconnected delay-tolerant MANETs.",
                    "Capacity scaling in delay tolerant networks with heterogeneous mobile nodes.",
                    "Scalable routing in delay tolerant networks.",
                    "Surviving attacks on disruption-tolerant networks without authentication.",
                    "Containing denial-of-service attacks in broadcast authentication in sensor networks.",
                    "A randomized, efficient, and distributed protocol for the detection of node replication attacks in wireless sensor networks.",
                    "A random perturbation-based scheme for pairwise key establishment in sensor networks.",
                    "Complexity in geometric SINR.",
                    "Cross-layer latency minimization in wireless networks with SINR constraints.",
                    "Characterization and analysis of multi-hop wireless MIMO network throughput.",
                    "Allocating dynamic time-spectrum blocks in cognitive radio networks.",
                    "Analysis of multi-hop emergency message propagation in vehicular ad hoc networks.",
                    "Secure incentives for commercial ad dissemination in vehicular networks.",
                    "Maximum-lifetime routing: system optimization & game-theoretic perspectives.",
                    "Balancing traffic load in wireless networks with curveball routing.",
                    "Distributed algorithms for spectrum allocation, power control, routing, and congestion control in wireless networks.",
                    "Approximation algorithms for longest-lived directional multicast communications in WANETs.",
                    "Sensor network minimal energy routing with latency guarantees.",
                    "Distributed energy management algorithm for large-scale wireless sensor networks.",
                    "Outlier detection in sensor networks.",
                    "Capacity of multi-channel wireless networks with random (c, f) assignment.",
                    "Capacity of a wireless ad hoc network with infrastructure.",
                    "The multicast capacity of large multihop wireless networks.",
                    "Bounds for the capacity of wireless multihop networks imposed by topology and demand."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th MobiHoc 2006",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2006",
                "sub_name": "Proceedings of the 7th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2006, Florence, Italy, May 22-25, 2006.",
                "count": 31,
                "papers": [
                    "MISTRAL: : efficient flooding in mobile ad-hoc networks.",
                    "Minimizing recovery state In geographic ad-hoc routing.",
                    "Asymptotic critical transmission radius for greedy forward routing in wireless ad hoc networks.",
                    "Message ferry route design for sparse ad hoc networks with mobile nodes.",
                    "Performance analysis of mobility-assisted routing.",
                    "Model T++: : an empirical joint space-time registration model.",
                    "Analysis of random mobility models with PDE's.",
                    "Modeling steady-state and transient behaviors of user mobility: : formulation, analysis, and application.",
                    "Balancing distance and lifetime in delay constrained ad hoc networks.",
                    "An evaluation of inter-vehicle ad hoc networks based on realistic vehicular traces.",
                    "Jamming and sensing of encrypted wireless ad hoc networks.",
                    "Deploying wireless sensors to achieve both coverage and connectivity.",
                    "Energy conservation via domatic partitions.",
                    "Delay of intrusion detection in wireless sensor networks.",
                    "Mobile backbone networks --: construction and maintenance.",
                    "Interaction of rate and medium access control in wireless networks: : the single cell case.",
                    "DRAND: : distributed randomized TDMA scheduling for wireless ad-hoc networks.",
                    "Adaptive splitting protocols for RFID tag collision arbitration.",
                    "Starvation mitigation through multi-channel coordination in CSMA multi-hop wireless networks.",
                    "MLS: : an efficient location service for mobile ad hoc networks.",
                    "RaWMS -: random walk based lightweight membership service for wireless ad hoc network.",
                    "Robust distributed node localization with error management.",
                    "Distributed localization using noisy distance and angle information.",
                    "Throughput and delay optimization in interference-limited multihop networks.",
                    "Proportionally fair allocation of end-to-end bandwidth in STDMA wireless networks.",
                    "Algorithmic aspects of communication in ad-hoc networks with smart antennas.",
                    "Topology control meets SINR: : the scheduling complexity of arbitrary topologies.",
                    "Wakeup scheduling in wireless sensor networks.",
                    "Fundamental scaling laws for energy-efficient storage and querying in wireless sensor networks.",
                    "Data storage placement in sensor networks.",
                    "SDAP: : a secure hop-by-Hop data aggregation protocol for sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6th MobiHoc 2005",
        "info": "Urbana-Champaign, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2005",
                "sub_name": "Proceedings of the 6th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2005, Urbana-Champaign, IL, USA, May 25-27, 2005.",
                "count": 42,
                "papers": [
                    "Toward the sensor network macroscope.",
                    "Distributed low-cost backbone formation for wireless ad hoc networks.",
                    "On the node-scheduling approach to topology control in ad hoc networks.",
                    "On maximizing the lifetime of distributed information in ad-hoc networks with individual constraints.",
                    "Toward resilient security in wireless sensor networks.",
                    "The feasibility of launching and detecting jamming attacks in wireless networks.",
                    "An efficient scheme for authenticating public keys in sensor networks.",
                    "Interference-aware topology control and QoS routing in multi-channel wireless mesh networks.",
                    "Modelling and performance analysis of the distributed scheduler in IEEE 802.16 mesh mode.",
                    "Stationary distributions of random walk mobility models for wireless ad hoc networks.",
                    "A distributed coordination framework for wireless sensor and actor networks.",
                    "Power balanced coverage-time optimization for clustered wireless sensor networks.",
                    "Inducing spatial clustering in MAC contention for spread spectrum ad hoc networks.",
                    "Characterizing achievable multicast rates in multi-hop wireless networks.",
                    "Distributed dynamic scheduling for end-to-end rate guarantees in wireless ad hoc networks.",
                    "Cross-layer rate control for end-to-end proportional fairness in wireless networks with random access.",
                    "On the end-to-end call acceptance and the possibility of deterministic QoS guarantees in ad hoc wireless networks.",
                    "Localization and routing in sensor networks by local angle information.",
                    "Easily-managed and topology-independent location service for self-organizing networks.",
                    "Sextant: a unified node and event localization framework using non-convex constraints.",
                    "Scalable location services for hierarchically organized mobile ad hoc networks.",
                    "'Openness' and the public airwaves.",
                    "Efficient geographic routing in multihop wireless networks.",
                    "Link-layer salvaging for making routing progress in mobile ad hoc networks.",
                    "A secure ad-hoc routing approach using localized self-healing communities.",
                    "Reliable bursty convergecast in wireless sensor networks.",
                    "TCP over multihop 802.11 networks: issues and performance enhancement.",
                    "TCP with adaptive pacing for multihop wireless networks.",
                    "Mobility improves coverage of sensor networks.",
                    "Deploying sensor networks with guaranteed capacity and fault tolerance.",
                    "Analysis of hop-distance relationship in spatially random sensor networks.",
                    "Low-coordination topologies for redundancy in sensor networks.",
                    "A cross-layer optimization of gnutella for mobile ad hoc networks.",
                    "Towards commercial mobile ad hoc network applications: a radio dispatch system.",
                    "Hybrid sensor networks: a small world.",
                    "Least privilege and privilege deprivation: towards tolerating mobile sink compromises in wireless sensor networks.",
                    "Minimum power configuration in wireless sensor networks.",
                    "Efficient gathering of correlated data in sensor networks.",
                    "Temporal properties of low power wireless links: modeling and implications on multi-hop routing.",
                    "Maximum-lifetime routing algorithms for networks with omnidirectional and directional antennas.",
                    "Timed grid routing (TIGR) bites off energy.",
                    "Minimum energy reliable paths using unreliable wireless links."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "5th MobiHoc 2004",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2004",
                "sub_name": "Proceedings of the 5th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2004, Roppongi Hills, Tokyo, Japan, May 24-26, 2004.",
                "count": 24,
                "papers": [
                    "Asymptotic critical transmission radius and critical neighbor number for k-connectivity in wireless ad hoc networks.",
                    "Does topology control reduce interference?",
                    "Error characteristics of ad hoc positioning systems (aps).",
                    "On greedy geographic routing algorithms in sensing-covered networks.",
                    "Using labeled paths for loop-free on-demand routing in ad hoc networks.",
                    "Market sharing games applied to content distribution in ad-hoc networks.",
                    "Rate allocation in wireless sensor networks with network lifetime requirement.",
                    "A scalable approach for reliable downstream data delivery in wireless sensor networks.",
                    "Internal synchronization of drift-constraint clocks in ad-hoc sensor networks.",
                    "Localized algorithms for energy efficient topology in wireless ad hoc networks.",
                    "Latency of wireless sensor networks with uncoordinated power saving mechanisms.",
                    "On deriving the upper bound of alpha-lifetime for large sensor networks.",
                    "Capacity bounds for three classes of wireless networks: asymmetric, cluster, and hybrid.",
                    "On the behavior of communication links of a node in a multi-hop mobile environment.",
                    "Geometry of information propagation in massively dense ad hoc networks.",
                    "Towards mobility as a network control primitive.",
                    "Locating cache proxies in manets.",
                    "A message ferrying approach for data delivery in sparse mobile ad hoc networks.",
                    "Frequency rolling: a cooperative frequency hopping for mutually interfering wpans.",
                    "A single-channel solution for transmission power control in wireless ad hoc networks.",
                    "Multi-channel mac for ad hoc networks: handling multi-channel hidden terminals using a single transceiver.",
                    "Antenna orientation optimization for minimum-energy multicast tree construction in wireless ad hoc networks with directional antennas.",
                    "A unified MAC layer framework for ad-hoc networks with smart antennas.",
                    "An adaptive strategy for maximizing throughput in MAC layer wireless multicast."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "4th MobiHoc 2003",
        "info": "Annapolis, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2003",
                "sub_name": "Proceedings of the 4th ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2003, Annapolis, Maryland, USA, June 1-3, 2003.",
                "count": 28,
                "papers": [
                    "PAN: providing reliable storage in mobile ad hoc networks with probabilistic quorum systems.",
                    "A charging and rewarding scheme for packet forwarding in multi-hop cellular networks.",
                    "Energy-efficient caching strategies in ad hoc wireless networks.",
                    "Asynchronous wakeup for ad hoc networks.",
                    "Mobility helps security in ad hoc networks.",
                    "Improving fairness among TCP flows crossing wireless ad hoc and wired networks.",
                    "ATP: a reliable transport protocol for ad-hoc networks.",
                    "On the maximum stable throughput problem in random networks with directional antennas.",
                    "A network-aware MAC and routing protocol for effective load balancing in ad hoc wireless networks with directional antenna.",
                    "A MAC protocol for full exploitation of directional antennas in ad-hoc wireless networks.",
                    "On the capacity improvement of ad hoc wireless networks using directional antennas.",
                    "Fault tolerant deployment and topology control in wireless networks.",
                    "Topology management in ad hoc networks.",
                    "The lit K-neigh protocol for symmetric topology control in ad hoc networks.",
                    "CDMA-based MAC protocol for wireless ad hoc networks.",
                    "Lightweight sensing and communication protocols for target enumeration and aggregation.",
                    "ESRT: event-to-sink reliable transport in wireless sensor networks.",
                    "Connected sensor cover: self-organization of sensor networks for efficient query execution.",
                    "Localization from mere connectivity.",
                    "Mobility modelling and trajectory prediction for cellular networks with mobile base stations.",
                    "Minimizing broadcast latency and redundancy in ad hoc networks.",
                    "The shared wireless infostation model: a new ad hoc networking paradigm (or where there is a whale, there is a way).",
                    "PATHS: analysis of PATH duration statistics and their impact on reactive MANET routing protocols.",
                    "Age matters: efficient route discovery in mobile ad hoc networks using encounter ages.",
                    "Worst-Case optimal and average-case efficient geometric ad-hoc routing.",
                    "SHORT: self-healing and optimizing routing techniques for mobile ad hoc networks.",
                    "ANODR: anonymous on demand routing with untraceable routes for mobile ad-hoc networks.",
                    "SHARP: a hybrid adaptive routing protocol for mobile ad hoc networks."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "3rd MobiHoc 2002",
        "info": "Lausanne, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2002",
                "sub_name": "Proceedings of the 3rd ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2002, June 9-11, 2002, Lausanne, Switzerland.",
                "count": 22,
                "papers": [
                    "Path set selection in mobile ad hoc networks.",
                    "Routing performance in the presence of unidirectional links in multihop wireless networks.",
                    "A dynamic core based multicast routing protocol for ad hoc wireless networks.",
                    "On using the ad-hoc network model in cellular packet data networks.",
                    "Performance evaluation of a fair backoff algorithm for IEEE 802.11 DFWMAC.",
                    "Ordered packet scheduling in wireless ad hoc networks: mechanisms and performance analysis.",
                    "Priority scheduling in wireless ad hoc networks.",
                    "On the minimum node degree and connectivity of a wireless multihop network.",
                    "Characterizing the interaction between routing and MAC protocols in ad-hoc networks.",
                    "An integrated environment for testing mobile ad-hoc networks.",
                    "Constructing minimum-energy broadcast trees in wireless ad hoc networks.",
                    "Algorithmic aspects of topology control problems for ad hoc networks.",
                    "Topology management for sensor networks: exploiting latency and density.",
                    "Minimum energy paths for reliable communication in multi-hop wireless networks.",
                    "Message-optimal connected dominating sets in mobile ad hoc networks.",
                    "Approximating minimum size weakly-connected dominating sets for clustering mobile ad hoc networks.",
                    "On the scalability of IEEE 802.11 ad hoc networks.",
                    "Directional virtual carrier sensing for directional antennas in mobile ad hoc networks.",
                    "Comparison of broadcasting techniques for mobile ad hoc networks.",
                    "Weak duplicate address detection in mobile ad hoc networks.",
                    "Improving TCP performance over mobile ad-hoc networks with out-of-order detection and response.",
                    "Performance analysis of the CONFIDANT protocol."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "2nd MobiHoc 2001",
        "info": "Long Beach, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2001",
                "sub_name": "Proceedings of the 2nd ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2001, October 4-5, 2001, Long Beach, CA, USA.",
                "count": 39,
                "papers": [
                    "Implicit source routes for on-demand ad hoc network routing.",
                    "Neighborhood aware source routing.",
                    "Making link-state routing scale for ad hoc networks.",
                    "Adaptive demand-driven multicast routing in multi-hop wireless ad hoc networks.",
                    "Geometric spanner for routing in mobile networks.",
                    "A comparison of TCP performance over three routing protocols for mobile ad hoc networks.",
                    "SEEDEX: a MAC protocol for ad hoc networks.",
                    "Medium access and radio resource management for ad hoc networks based on UTRA TDD.",
                    "Effects of wireless physical layer modeling in mobile ad hoc networks.",
                    "On the performance of ad hoc networks with beamforming antennas.",
                    "Localized algorithms in wireless ad-hoc networks: location discovery and sensor exposure.",
                    "Effects of power conservation, wireless coverage and cooperation on data dissemination among mobile devices.",
                    "Maximum flow-life curve for a wireless ad hoc network.",
                    "Birthday protocols for low energy deployment and flexible neighbor discovery in ad hoc wireless networks.",
                    "The quest for security in mobile ad hoc networks.",
                    "Secure pebblenets.",
                    "Testbed on a desktop: strategies and techniques to support multi-hop MANET routing protocol development.",
                    "Time synchronization in ad hoc networks.",
                    "Performance of a new Bluetooth scatternet formation protocol.",
                    "A pseudo random coordinated scheduling algorithm for Bluetooth scatternets.",
                    "JUMP mode---a dynamic window-based scheduling framework for Bluetooth scatternets.",
                    "A probabilistic analysis for the range assignment problem in ad hoc networks.",
                    "On max-min fairness and scheduling in wireless ad-hoc networks: analytical framework and implementation.",
                    "Scenario-based stability anlysis of the distributed mobility-adaptive clustering (DMAC) algorithm.",
                    "An adaptive MAC and idrectional routing protocol for ad hoc wireless network using ESPAR antenna.",
                    "Ad hoc relay wireless networks over moving vehicles on highways.",
                    "Highly-resilient, energy-efficient multipath routing in wireless sensor networks.",
                    "Comparison between graph-based and interference-based STDMA scheduling.",
                    "Position-aware ad hoc wireless networks for inter-vehicle communications: the Fleetnet project.",
                    "Geographical region summary service for geographical routing.",
                    "Parallel processing over mobile ad hoc networks of handheld machines.",
                    "Throughput of ideality routed wireless ad hoc networks.",
                    "Application of the ASN.1 specification technique to the Bluetooth service discover protocol.",
                    "Selection diversity forwarding in a multihop packet radio network with fading channel and capture.",
                    "Constructing minimum energy mobile wireless networks.",
                    "Location based localized alternate, disjoint, multi-path and component routing schemes for wireless networks.",
                    "Multiuser receiver aware multicast protocols for wireless ad-hoc networks.",
                    "Distributed assignment of encoded MAC addresses in sensor networks.",
                    "Security-aware ad hoc routing for wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "1st MobiHoc 2000",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobihoc/2000",
                "sub_name": "Proceedings of the 1st ACM Interational Symposium on Mobile Ad Hoc Networking and Computing, MobiHoc 2000, Boston, Massachusetts, USA.",
                "count": 25,
                "papers": [
                    "On the impact of alternate path routing for load balancing in mobile ad hoc networks.",
                    "LANMAR: landmark routing for large scale wireless ad hoc networks with group mobility.",
                    "DDR: distributed dynamic routing algorithm for mobile ad hoc networks.",
                    "Predicting node proximity in ad-hoc networks: a least overhead adaptive model for selecting stable routes.",
                    "Neighbor supporting ad hoc multicast routing protocol.",
                    "Role-based multicast in highly mobile but sparsely connected ad hoc networks.",
                    "Content based multicast (CBM) in ad hoc networks.",
                    "An architecture for building self-configurable systems.",
                    "MIPMANET: mobile IP for mobile ad hoc networks.",
                    "Enforcing service availability in mobile ad-hoc WANs.",
                    "Fair medium access in 802.11 based wireless ad-hoc networks.",
                    "Low power rendezvous in embedded wireless networks.",
                    "Assignment methods for spatial reuse TDMA.",
                    "A speech-optimised multiple access scheme for a mobile ad hoc network.",
                    "On the reduction of broadcast redundancy in mobile ad hoc networks.",
                    "Central controller handover procedure for ETSI-BRAN HiperLAN/2 ad hoc networks and clustering with quality of service guarantees.",
                    "DEAPspace: transient ad-hoc networking of pervasive devices.",
                    "Securing ad hoc services, a Jini view: extended abstract.",
                    "Dynamic quality-of-service for mobile ad hoc networks.",
                    "A simulation analysis on reactive route repair techniques for QoS sensitive applications in mobile ad hoc networks.",
                    "Proximity awareness and fast connection establishment in Bluetooth.",
                    "Utility-based decision-making in wireless sensor networks.",
                    "A distributed mechanism for topology discovery in ad hoc wireless networks using mobile agents.",
                    "Performance aspects of Bluetooth scatternet formation.",
                    "Load balancing via relay in next generation wireless systems."
                ]
            }
        ]
    }
]