[
    {
        "year": "2021",
        "name": "27th MobiCom 2021",
        "info": "New Orleans, Louisiana, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2021",
                "sub_name": "ACM MobiCom '21: The 27th Annual International Conference on Mobile Computing and Networking, New Orleans, Louisiana, USA, October 25-29, 2021.",
                "count": 19,
                "papers": [
                    "A community-driven approach to democratize access to satellite ground stations.",
                    "RFClock: timing, phase and frequency synchronization for distributed wireless networks.",
                    "Experience: a five-year retrospective of MobileInsight.",
                    "Physics-inspired heuristics for soft MIMO detection in 5G new radio and beyond.",
                    "DeepRadar: a deep-learning-based environmental sensing capability sensor design for CBRS.",
                    "Millimetro: mmWave retro-reflective tags for accurate, long range localization.",
                    "WiBeacon: expanding BLE location-based services via wifi.",
                    "Verification: can wifi backscatter replace RFID?",
                    "One tag, two codes: identifying optical barcodes with NFC.",
                    "A principled design for passive light communication.",
                    "Shrimp: a robust underwater visible light communication system.",
                    "HeadFi: bringing intelligence to all headphones.",
                    "UltraSE: single-channel speech enhancement using ultrasound.",
                    "Vi-liquid: unknown liquid identification with your smartphone vibration.",
                    "Large-scale vehicle trajectory reconstruction with camera sensing network.",
                    "Elf: accelerate high-resolution mobile deep vision with content-aware parallel offloading.",
                    "AsyMo: scalable and efficient deep-learning inference on asymmetric mobile CPUs.",
                    "PECAM: privacy-enhanced video streaming and analytics via securely-reversible transformation.",
                    "A nationwide census on wifi security threats: prevalence, riskiness, and the economics."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021wintech",
                "sub_name": "WiNTECH'21: Proceedings of the 15th ACM Workshop on Wireless Network Testbeds, Experimental evaluation & CHaracterization, New Orleans, LA, USA, February 4, 2022.",
                "count": 12,
                "papers": [
                    "Programmable and Open-Access Millimeter-Wave Radios in the PAWR COSMOS Testbed.",
                    "ARA: A Wireless Living Lab Vision for Smart and Connected Rural Communities.",
                    "NexRAN: Closed-loop RAN slicing in POWDER -A top-to-bottom open-source open-RAN use case.",
                    "What is A Wireless UAV?: A Design Blueprint for 6G Flying Wireless Nodes.",
                    "Experimental Study of Outdoor UAV Localization and Tracking using Passive RF Sensing.",
                    "Handover Experiments with UAVs: Software Radio Tools and Experimental Research Platform.",
                    "AX-CSI: Enabling CSI Extraction on Commercial 802.11ax Wi-Fi Platforms.",
                    "Multipath TCP in Smartphones Equipped with Millimeter Wave Radios.",
                    "A Comparison Study of Cellular Deployments in Chicago and Miami Using Apps on Smartphones.",
                    "An Experimental Evaluation of MQTT Authentication and Authorization in IoT.",
                    "A Spectrum Consumption Model-based Framework for DSA Experimentation on the COSMOS Testbed.",
                    "OneLNK: One Link to Rule Them All: Web-based Wireless Experimentation for Multi-vendor Remotely Accessible Indoor/Outdoor Testbeds."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021dronecom",
                "sub_name": "DroneCom '21: Proceedings of the 4th ACM MobiCom Workshop on Drone Assisted Wireless Communications for 5G and Beyond, Virtual Event, 29 October 2021.",
                "count": 7,
                "papers": [
                    "Camera-enabled joint robotic-communication paradigm for UAVs mounted with mmWave radios.",
                    "Position optimization and resource allocation for cooperative heterogeneous aerial networks.",
                    "Federated learning-based aerial image segmentation for collision-free movement and landing.",
                    "An intelligent self-learning drone assistance approach towards V2V communication in smart city.",
                    "Cross-domain authentication for 5G-enabled UAVs: a blockchain approach.",
                    "Deep learning based crowd counting model for drone assisted systems.",
                    "QoS-aware dynamic controller implantation over vSDN-enabled UAV networks for real-time service delivery."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021mmnets",
                "sub_name": "mmNets@MobiCom 2021: Proceedings of the 5th ACM Workshop on Millimeter-Wave and Terahertz Networks and Sensing Systems, New Orleans, Louisiana, USA, October 25-29, 2021.",
                "count": 8,
                "papers": [
                    "A case for OFDM in ultra-broadband terahertz communication: an experimental approach.",
                    "Image and index fused sequence-to-sequence algorithm for vision-aided millimeter-wave beam tracking.",
                    "Millimeter-wave beam misalignment effects of small- and large-scale user mobility based on urban measurements.",
                    "Spatio-temporal modulated mm-Wave arrays for physical layer security and resiliency against distributed eavesdropper attacks.",
                    "A preliminary assessment of midhaul links at 140 GHz using ray-tracing.",
                    "Channel modeling for reflective phased array type RISs in mmWave networks.",
                    "Accuracy assessment of user micromobility models for THz cellular systems.",
                    "Full-stack comparison of channel models for networks above 100 GHz in an indoor scenario."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021hev",
                "sub_name": "HotEdgeVideo@MobiCom 2021: Proceedings of the 3rd ACM Workshop on Hot Topics in Video Analytics and Intelligent Edges, New Orleans, Louisiana, USA, 25 October 2021.",
                "count": 7,
                "papers": [
                    "Characterizing real-time dense point cloud capture and streaming on mobile devices.",
                    "Auto-SDA: Automated video-based social distancing analyzer.",
                    "Decentralized modular architecture for live video analytics at the edge.",
                    "Enabling high frame-rate UHD real-time communication with frame-skipping.",
                    "The case for admission control of mobile cameras into the live video analytics pipeline.",
                    "Towards memory-efficient inference in edge video analytics.",
                    "Cost effective processing of detection-driven video analytics at the edge."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/20216gabs",
                "sub_name": "6G-ABS@MobiCom 2021: Proceedings of the 1st Workshop on Artificial Intelligence and Blockchain Technologies for Smart Cities with 6G, New Orleans, Louisiana, USA, October 25 - 29, 2021.",
                "count": 5,
                "papers": [
                    "SCNO: smart city network operator.",
                    "Integrating federated learning with IoMT for managing obesity in smart city.",
                    "A blockchain-based Shamir's threshold cryptography for data protection in industrial internet of things of smart city.",
                    "SOSChain: self optimizing streamchain for last-mile 6G UAV-truck networks.",
                    "Joint power and beamforming optimization of UAV-assisted NOMA networks for B5G-enabled smart cities."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2021",
                "sub_name": "MobiArch@MobiCom 2021: Proceedings of the 16th ACM Workshop on Mobility in the Evolving Internet Architecture, New Orleans, Louisiana, USA, 25 October 2021.",
                "count": 4,
                "papers": [
                    "Learning-based congestion control simulator for mobile internet education.",
                    "Network intelligence in 6G: challenges and opportunities.",
                    "Meeting connected vehicle application requirements: it's not just about bandwidth.",
                    "Internet islands: first class networked communities in isolated regions."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021lpiot",
                "sub_name": "LP-IoT@MobiCom 2021: Proceedings of the 1st ACM Workshop on No Power and Low Power Internet-of-Things, New Orleans, LA, USA, 31 January 2022 - 4 February 2022.",
                "count": 4,
                "papers": [
                    "Experiences in LP-IoT: EnviSense Deployment of Remotely Reprogrammable Environmental Sensors.",
                    "Soil Power?: Can Microbial Fuel Cells Power Non-Trivial Sensors?",
                    "Plant Keeper: Towards Wireless Sensing to Ion Transmission of Plants.",
                    "smol: Sensing Soil Moisture using LoRa."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2021s3",
                "sub_name": "S3@MobiCom 2021: Proceedings of the 12th ACM Wireless of the Students, by the Students, and for the Students (S3) Workshop, New Orleans, Louisiana, USA, 29 October 2021.",
                "count": 4,
                "papers": [
                    "Internet service via UAV: user centric comprehensive attack surface analysis.",
                    "EDGY: on-device paralinguistic privacy protection.",
                    "Passive IoT device fingerprinting using WiFi.",
                    "Demo and dataset for mmWave multi-beam tracking using mMobile 28 GHz testbed."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "26th MobiCom 2020",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2020",
                "sub_name": "MobiCom '20: The 26th Annual International Conference on Mobile Computing and Networking, London, United Kingdom, September 21-25, 2020.",
                "count": 92,
                "papers": [
                    "From relative azimuth to absolute location: pushing the limit of PIR sensor based localization.",
                    "Millimeter-wave full duplex radios.",
                    "Redefining passive in backscattering with commodity devices.",
                    "EagleEye: wearable camera-based person identification in crowded urban spaces.",
                    "X-Array: approximating omnidirectional millimeter-wave coverage using an array of phased arrays.",
                    "Renovating road signs for infrastructure-to-vehicle networking: a visible light backscatter communication and networking approach.",
                    "Voice localization using nearby wall reflections.",
                    "Ghost calls from operational 4G call systems: IMS vulnerability, call DoS attack, and countermeasure.",
                    "Hummingbird: energy efficient GPS receiver for small satellites.",
                    "ScatterMIMO: enabling virtual MIMO with smart surfaces.",
                    "ViVo: visibility-aware mobile volumetric video streaming.",
                    "PDLens: smartphone knows drug effectiveness among Parkinson's via daily-life activity fusion.",
                    "TinyLink 2.0: integrating device, cloud, and client development for IoT applications.",
                    "Challenge: COSMOS: A city-scale programmable testbed for experimentation with advanced wireless.",
                    "M-Cube: a millimeter-wave massive MIMO software radio.",
                    "Experience: advanced network operations in (Un)-connected remote communities.",
                    "Deep learning based wireless localization for indoor navigation.",
                    "Single shot single antenna path discovery in THz networks.",
                    "MET: a magneto-inductive sensing based electric toothbrushing monitoring system.",
                    "Experience: aging or glitching? why does android stop responding and what can we do about it?",
                    "WiChronos: energy-efficient modulation for long-range, large-scale wireless networks.",
                    "Towards flexible wireless charging for medical implants using distributed antenna system.",
                    "Towards 3D human pose construction using wifi.",
                    "TouchPass: towards behavior-irrelevant on-touch user authentication on smartphones leveraging vibrations.",
                    "Internet-of-microchips: direct radio-to-bus communication with SPI backscatter.",
                    "Bleep: motor-enabled audio side-channel for constrained UAVs.",
                    "ThermoWave: a new paradigm of wireless passive temperature monitoring via mmWave sensing.",
                    "NEMO: enabling neural-enhanced video streaming on commodity mobile devices.",
                    "OnRL: improving mobile video telephony via online reinforcement learning.",
                    "Sniffing visible light communication through walls.",
                    "Billion-scale federated learning on mobile clients: a submodel design with tunable privacy.",
                    "SDR receiver using commodity wifi via physical-layer signal reconstruction.",
                    "SociTrack: infrastructure-free interaction tracking through mobile sensor networks.",
                    "Understanding and embracing the complexities of the molecular communication channel in liquids.",
                    "Heimdall: mobile GPU coordination platform for augmented reality applications.",
                    "Nephalai: towards LPWAN C-RAN with physical layer compression.",
                    "SPINN: synergistic progressive inference of neural networks over device and cloud.",
                    "Microscope: mobile service traffic decomposition for network slicing as a service.",
                    "C-14: assured timestamps for drone videos.",
                    "EarSense: earphones as a teeth activity sensor.",
                    "TransLoc: transparent indoor localization with uncertain human participation for instant delivery.",
                    "Tunnel emitter: tunnel diode based low-power carrier emitters for backscatter tags.",
                    "LMAC: efficient carrier-sense multiple access for LoRa.",
                    "iCellSpeed: increasing cellular data speed with device-assisted cell selection.",
                    "mmVib: micrometer-level vibration measurement with mmwave radar.",
                    "Experience: towards automated customer issue resolution in cellular networks.",
                    "Joltik: enabling energy-efficient \"future-proof\" analytics on low-power wide-area networks.",
                    "Re-identification of mobile devices using real-time bidding advertising networks.",
                    "FaceRevelio: a face liveness detection system for smartphones with a single front camera.",
                    "Towards quantum belief propagation for LDPC decoding in wireless networks.",
                    "Demystifying millimeter-wave V2X: towards robust and efficient directional connectivity under high mobility.",
                    "SpiroSonic: monitoring human lung function via acoustic sensing on commodity smartphones.",
                    "Deaf-aid: mobile IoT communication exploiting stealthy speaker-to-gyroscope channel.",
                    "RFGo: a seamless self-checkout system for apparel stores using RFID.",
                    "Understanding power consumption of NB-IoT in the wild: tool and large-scale measurement.",
                    "Ear-AR: indoor acoustic augmented reality on earphones.",
                    "GROOT: a real-time streaming system of high-fidelity volumetric videos.",
                    "CLIO: enabling automatic compilation of deep learning pipelines across IoT and cloud.",
                    "Self-reconfigurable micro-implants for cross-tissue wireless and batteryless connectivity.",
                    "DMM: fast map matching for cellular data.",
                    "Airdropping sensor networks from drones and insects.",
                    "Contactless seismocardiography via deep learning radars.",
                    "BeeCast: a collaborative video streaming system.",
                    "5G edge enhanced mobile augmented reality.",
                    "A hyperlocal mobile web for the next 3 billion users.",
                    "M-cube: an open-source millimeter-wave MIMO software radio for wireless communication and sensing applications.",
                    "A query engine for zero-streaming cameras.",
                    "The implementation of stigmergy in network-assisted multi-agent system.",
                    "WhiteHaul: white space spectrum aggregation system for backhaul.",
                    "Bringing hybrid analog-digital beamforming to commercial MU-MIMO wifi networks.",
                    "Service-oriented intelligent and extensible RAN.",
                    "WiChronos: energy-efficient modulation for long-range, large-scale wireless networks.",
                    "Accelerometer-based smartphone eavesdropping.",
                    "Remote experimentation with open-access full-duplex wireless in the COSMOS testbed.",
                    "Slicing-enabled private 4G/5G network for industrial wireless applications.",
                    "Edge-SLAM: edge-assisted visual simultaneous localization and mapping.",
                    "Using magnetic fingerprints to position cars on multi-layer roads.",
                    "Homecoming: a wireless homing device for UAVs.",
                    "Performance bottlenecks identification in cloudified mobile networks.",
                    "Bringing temperature-awareness to millimeter-wave networks.",
                    "Constructing 3-dimensional 5G coverage map for real-time airborne missions.",
                    "What you wear know how you feel: an emotion inference system with multi-modal wearable devices.",
                    "SmartPatch: a patch prioritization framework for SCADA chain in smart grid.",
                    "TSFCC: high availability service function chain composition approach in mobile network.",
                    "Hybrid communication and storage system with user privacy preservation for public management, analysis and prediction.",
                    "Toward a secure QR code system by fingerprinting screens.",
                    "A seamless virtualized network functions migration mechanism in mobile edge networks.",
                    "A reliable intelligent routing mechanism in 5G core networks.",
                    "CarML: distributed machine learning in vehicular clouds.",
                    "Throughput optimization VNF placement for mapping SFC requests in MEC-NFV enabled networks.",
                    "Design of an IoT-based water flow monitoring system.",
                    "Age of information in wireless networks: from theory to implementation."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020cryblock",
                "sub_name": "CryBlock@MOBICOM 2020: Proceedings of the 3rd Workshop on Cryptocurrencies and Blockchains for Distributed Systems, London, UK, September 25, 2020.",
                "count": 13,
                "papers": [
                    "Decentralized robinson list.",
                    "Proof-of-stake at stake: predatory, destructive attack on PoS cryptocurrencies.",
                    "Are distributed ledger technologies ready for intelligent transportation systems?",
                    "Upper bound probability of double spend attack on SPECTRE.",
                    "HyBloSE: hybrid blockchain for secure-by-design smart environments.",
                    "Actor-based risk analysis for blockchains in smart mobility.",
                    "Cross hyperledger fabric transactions.",
                    "DiLeNA: distributed ledger network analyzer.",
                    "Dynamic power control for rational cryptocurrency mining.",
                    "MOATcoin: exploring challenges and legal implications of smart contracts through a gamelike DApp experiment.",
                    "Atomic cross chain swaps via relays and adapters.",
                    "Implications of dissemination strategies on the security of distributed ledgers.",
                    "Scaling blockchains without giving up decentralization and security: a solution to the blockchain scalability trilemma."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020frugal",
                "sub_name": "Proceedings of the 1st Workshop on Experiences with the Design and Implementation of Frugal Smart Objects, FRUGALTHINGS@MOBICOM 2020, September 21, 2020, London, UK.",
                "count": 7,
                "papers": [
                    "Can IoT Wearable Devices Feed Frugal Innovation?",
                    "FruGar: Exploiting Deep Learning and Crowdsourcing for Frugal Gardening.",
                    "Applying Frugal Innovation to Humidity and Temperature Monitoring.",
                    "Design and Implementation of a Privacy-Aware Smart Mirror System.",
                    "TROPPO LoRa: TROPospheric Personal Observatory using LoRa signals.",
                    "FUDGE: a frugal edge node for advanced IoT solutions in contexts with limited resources.",
                    "Mobile Crowdsensing Based Road Surface Monitoring Using Smartphone Vibration Sensor and Lorawan."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020liot",
                "sub_name": "Proceedings of the Workshop on Light Up the IoT, LIOT@MOBICOM 2020, September 21, 2020, London, UK.",
                "count": 10,
                "papers": [
                    "OFDM based visible light communication with probabilistic shaping.",
                    "Non-linearity of LEDs for VLC IoT applications.",
                    "Multi-LED multi-datastream dome bulb for dense visible light communication networks.",
                    "Evaluating LED-camera communication for drones.",
                    "FLight: toward programmable visible-light-band wireless UAV networking.",
                    "Underwater optical camera communications based on a multispectral camera and spectral variations of the LED emission.",
                    "Why intermittent computing could unlock low-power visible light communication: position paper.",
                    "Passive visible light networks: taxonomy and opportunities.",
                    "Passive visible light positioning systems: an overview.",
                    "Embracing collisions: enabling parallel channel estimation with COTS passive backscatter tags."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020wintech",
                "sub_name": "WiNTECH@MobiCom 2020: Proceedings of the 14th International Workshop on Wireless Network Testbeds, Experimental Evaluation & Characterization, London, UK, September 25, 2020.",
                "count": 21,
                "papers": [
                    "AERPAW Emulation Overview.",
                    "Open-Access Full-Duplex Wireless in the ORBIT and COSMOS Testbeds.",
                    "POWDER: Platform for Open Wireless Data-driven Experimental Research.",
                    "Spectrum Monitoring and Source Separation in POWDER.",
                    "Good Times For Wireless Research.",
                    "Calibrating a 4-channel Fully-Digital 60 GHz SDR.",
                    "Experimental Wireless Testbed for Ultrabroadband Terahertz Networks.",
                    "On the Feasibility of Millimeter-wave Backscatter using Commodity 802.11ad 60 GHz Radios.",
                    "An Experimental Study of CSI Management to Preserve Location Privacy.",
                    "Wi-Fi All-Channel Analyzer.",
                    "The diverse and variegated reactions of different cellular devices to IMSI catching attacks.",
                    "Realistic Emulation of LTE With MoonGen and DPDK.",
                    "An experimental testbed of an Internet of Underwater Things.",
                    "Hardware-Accelerated Real-Time Stream Data Processing on Android with GNU Radio.",
                    "Mobile Network Performance during the COVID-19 Outbreak from a Testbed Perspective.",
                    "An Experimental Vehicular On-Board Unit for the Execution of Anticipated Cooperative Collision Avoidance Services in Cross-Border Scenarios.",
                    "Towards an Experimental Testbed to Study CyberWorm Behaviors in Large Scale Networks.",
                    "Monitoring Networks with Insightful Queries.",
                    "5G EVE a European platform for 5G Application deployment.",
                    "Assessing the need for 5G driven Edge and Fog solution for Digital Twin systems.",
                    "OpenAirInterface 5G NSA system with COTS phone."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020dronecom",
                "sub_name": "DroneCom '20: Proceedings of the 2nd ACM MobiCom Workshop on Drone Assisted Wireless Communications for 5G and Beyond, London, UK, September 25, 2020.",
                "count": 17,
                "papers": [
                    "Energy efficient placement of UAVs in wireless backhaul networks.",
                    "Energy management scheme for wireless powered D2D users with NOMA underlaying full duplex UAV.",
                    "Visualization and performance analysis on 5G network slicing for drones.",
                    "Performance analysis of UAV-enabled backscatter wireless communication network.",
                    "Blockchain-enabled secure communication for drone delivery: a case study in COVID-like scenarios.",
                    "Blockchain-based IoT platform for autonomous drone operations management.",
                    "Private blockchain-envisioned security framework for AI-enabled IoT-based drone-aided healthcare services.",
                    "BioUAV: blockchain-envisioned framework for digital identification to secure access in next-generation UAVs.",
                    "Federated learning meets blockchain at 6G edge: a drone-assisted networking for disaster response.",
                    "An incentive scheme for federated learning in the sky.",
                    "Autonomous detection of malicious events using machine learning models in drone networks.",
                    "A deep learning approach to efficient drone mobility support.",
                    "Cooperative content delivery in UAV-RSU assisted vehicular networks.",
                    "Quality-aware trajectory planning of cellular connected UAVs.",
                    "DIO messages and trickle timer analysis of RPL routing protocol for UAV-assisted data collection in IoT.",
                    "Intelligent vehicle collision avoidance system using 5G-enabled drone swarms.",
                    "An intelligent UAV based data aggregation strategy for IoT after disaster scenarios."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2020mmnets",
                "sub_name": "mmNets@MobiCom 2020: Proceedings of the 4th ACM Workshop on Millimeter-Wave Networks and Sensing Systems, London, United Kingdom, September, 2020.",
                "count": 4,
                "papers": [
                    "Human Activity Classification Using mm-Wave FMCW Radar by Improved Representation Learning.",
                    "An Experimental mmWave Channel Model for UAV-to-UAV Communications.",
                    "mmRAPID: Machine Learning assisted Noncoherent Compressive Millimeter-Wave Beam Alignment.",
                    "mMobile: Building a mmWave Testbed to Evaluate and Address Mobility Effects."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2020",
                "sub_name": "MobiArch@MobiCom 2020: Proceedings of the 15th Workshop on Mobility in the Evolving Internet Architecture, London, United Kingdom, September 21, 2020.",
                "count": 9,
                "papers": [
                    "Fair Cache Sharing Management for Multi-Tenant Based Mobile Edge Networks.",
                    "Frugal Sensing: A Novel approach of Mobile Sensor Network Localization based on Fuzzy-Logic.",
                    "On the benefits of increased vehicles perception to cooperative communications: a performance evaluation study.",
                    "3D Deployment of UAV Swarm for Massive MIMO Communications.",
                    "Massive MIMO in Mobile Networks: Self-Calibration with Channel Estimation Error.",
                    "Decentralized stream processing for spatial range queries in high-density systems.",
                    "NOMA Enhanced 5G Distributed Vehicle to Vehicle Communication for Connected Autonomous Vehicles.",
                    "AJIT: Accountable Just-in-Time Network Resource Allocation with Smart Contracts.",
                    "Admission Control for Quality of Services of Mobile Cellular Network."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "25th MobiCom 2019",
        "info": "Los Cabos, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2019",
                "sub_name": "The 25th Annual International Conference on Mobile Computing and Networking, MobiCom 2019, Los Cabos, Mexico, October 21-25, 2019.",
                "count": 112,
                "papers": [
                    "Detecting if LTE is the Bottleneck with BurstTracker.",
                    "Rebooting Ultrasonic Positioning Systems for Ultrasound-incapable Smart Devices.",
                    "Wideband Full-Duplex Wireless via Frequency-Domain Equalization: Design and Experimentation.",
                    "AMP up your Mobile Web Experience: Characterizing the Impact of Google's Accelerated Mobile Project.",
                    "Living IoT: A Flying Wireless Platform on Live Insects.",
                    "ClientMarshal: Regaining Control from Wireless Clients for Better Experience.",
                    "A Systematic Way to LTE Testing.",
                    "mD-Track: Leveraging Multi-Dimensionality for Passive Indoor Wi-Fi Tracking.",
                    "Experience: Understanding Long-Term Evolving Patterns of Shared Electric Vehicle Networks.",
                    "MP-H2: A Client-only Multipath Solution for HTTP/2.",
                    "VeMo: Enabling Transparent Vehicular Mobility Modeling at Individual Levels with Full Penetration.",
                    "SolarGest: Ubiquitous and Battery-free Gesture Recognition using Solar Cells.",
                    "Fire in Your Hands: Understanding Thermal Behavior of Smartphones.",
                    "Jigsaw: Robust Live 4K Video Streaming.",
                    "Diagnosing Vehicles with Automotive Batteries.",
                    "PDVocal: Towards Privacy-preserving Parkinson's Disease Detection using Non-speech Body Sounds.",
                    "Taprint: Secure Text Input for Commodity Smart Wristbands.",
                    "An Active-Passive Measurement Study of TCP Performance over LTE on High-speed Rails.",
                    "Mobile Gaming on Personal Computers with Direct Android Emulation.",
                    "OFDMA-Enabled Wi-Fi Backscatter.",
                    "Proximity Detection with Single-Antenna IoT Devices.",
                    "Keep Others from Peeking at Your Mobile Device Screen!",
                    "Towards Touch-to-Access Device Authentication Using Induced Body Electric Potentials.",
                    "SignSpeaker: A Real-time, High-Precision SmartWatch-based Sign Language Translator.",
                    "Edge Assisted Real-time Object Detection for Mobile Augmented Reality.",
                    "Blind Distributed MU-MIMO for IoT Networking over VHF Narrowband Spectrum.",
                    "mQRCode: Secure QR Code Using Nonlinearity of Spatial Frequency in Light.",
                    "Canceling Inaudible Voice Commands Against Voice Control Systems.",
                    "Learning to Coordinate Video Codec with Transport Protocol for Mobile Video Telephony.",
                    "vrAIn: A Deep Learning Approach Tailoring Computing and Radio Resources in Virtualized RANs.",
                    "Experience: Design, Development and Evaluation of a Wearable Device for mHealth Applications.",
                    "HealthSense: Software-defined Mobile-based Clinical Trials.",
                    "Touch Well Before Use: Intuitive and Secure Authentication for IoT Devices.",
                    "MuSher: An Agile Multipath-TCP Scheduler for Dual-Band 802.11ad/ac Wireless LANs.",
                    "On-Off Noise Power Communication.",
                    "XModal-ID: Using WiFi for Through-Wall Person Identification from Candidate Video Footage.",
                    "Fast and Efficient Cross Band Channel Prediction Using Machine Learning.",
                    "RNN-Based Room Scale Hand Motion Tracking.",
                    "Towards Low Cost Soil Sensing Using Wi-Fi.",
                    "Software-Defined Cooking using a Microwave Oven.",
                    "On the Feasibility of Wi-Fi Based Material Sensing.",
                    "FLUID: Flexible User Interface Distribution for Ubiquitous Multi-device Interaction.",
                    "Challenge: Unlicensed LPWANs Are Not Yet the Path to Ubiquitous Connectivity.",
                    "Verification: Constructive and Destructive Full Duplex Relays.",
                    "Experiences: Design, Implementation, and Deployment of CoLTE, a Community LTE Solution.",
                    "Occlumency: Privacy-preserving Remote Deep-learning Inference Using SGX.",
                    "Source Compression with Bounded DNN Perception Loss for IoT Edge Computer Vision.",
                    "Optimizing Energy Efficiency of Browsers in Energy-Aware Scheduling-enabled Mobile Devices.",
                    "A Framework for Analyzing Spectrum Characteristics in Large Spatio-temporal Scales.",
                    "TunnelScatter: Low Power Communication for Sensor Tags using Tunnel Diodes.",
                    "Device Administrator Use and Abuse in Android: Detection and Characterization.",
                    "Contactless Infant Monitoring using White Noise.",
                    "eBP: A Wearable System For Frequent and Comfortable Blood Pressure Monitoring From User's Ear.",
                    "MobiSR: Efficient On-Device Super-Resolution through Heterogeneous Mobile Processors.",
                    "Extracting 3D Maps from Crowdsourced GNSS Skyview Data.",
                    "Human-Machine and Human-Robot Interaction for Long-Term User Engagement and Behavior Change.",
                    "4 Systems Perspectives into Human-Centered Machine Learning.",
                    "Demo: Activating Wireless Voice for E-Toll Collection Systems with Zero Start-up Cost.",
                    "Demo: vrAIn Proof-of-Concept - A Deep Learning Approach for Virtualized RAN Resource Control.",
                    "Demo: All-You-Can-Bike - A Street View and Virtual Reality Based Cyber-Physical System for Bikers through IoT Technologies.",
                    "DEMO: EApp: Improving Rural Emergency Preparedness and Response.",
                    "Demo: The RFID Can Hear Your Music Play.",
                    "Demo: TinySDR, A Software-Defined Radio Platform for Internet of Things.",
                    "Software-Defined Cooking (SDC) using a Microwave Oven.",
                    "Demo: Wireless LAN Emulator Using Wireless Network Tap Device for Testing a Vehicular Network System.",
                    "FLUID: Multi-device Mobile Platform for Flexible User Interface Distribution.",
                    "Demo: Extracting 3D Maps from Crowdsourced GNSS Skyview Data.",
                    "Demo: An All-in-One Community LTE Network.",
                    "Demo: A Practical Application of Visible Light Communication: Opportunistic Sharing of Encryption Keys.",
                    "Demo: Tagging IoT Data in a Drone View.",
                    "Demo: Improving Visible Light Backscatter Communication with Delayed Superimposition Modulation.",
                    "DF-Mose: Device-Free Motion Sensing with Wireless Backscattering.",
                    "Demo: Mobile Gaming on Personal Computers with Direct Android Emulation.",
                    "Demo: The Design and Implementation of Intelligent Software Defined Security Framework.",
                    "Demo: A ROS-based Robot with Distributed Sensors for Seamless People Tracking.",
                    "Demo: Toward Continuous User Authentication Using PPG in Commodity Wrist-worn Wearables.",
                    "Poster: Can Mobile Hardware Keep Up with Today's Gigabit Wireless Technologies?",
                    "Poster: Protecting Control Planes in In-Band Software-Defined Wireless Networks.",
                    "Poster: Inaudible High-throughput Communication Through Acoustic Signals.",
                    "Poster: DyMand - An Open-Source Mobile and Wearable System for Assessing Couples' Dyadic Management of Chronic Diseases.",
                    "Keep Others from Peeking at Your Mobile Device Screen!",
                    "Poster: Enabling Wideband Full-Duplex Wireless via Frequency-Domain Equalization.",
                    "Poster: Energy Efficient Mobile Video Transmission over Wireless Networks in IoT Applications.",
                    "Strobe - Towards Low Cost Soil Sensing Using Wi-Fi.",
                    "Poster: Wireless Network Functions in the Era of Low-Power IoT.",
                    "Poster: Enhancing Capacity in Multi-hop Wireless Networks by Joint Node Units.",
                    "Poster: Hawkeye - Predictive Positioning of a Ceiling-Mounted Mobile AP in mmWave WLANs for Maximizing Line-of-sight.",
                    "Poster: SeamFarm - Distributed Data Analytic for Precision Agriculture based on Seamless Computing.",
                    "Poster: While You Were Sleeping - Time-Shifted Prefetching of YouTube Videos to Reduce Peak-time Cellular Data Usage.",
                    "Poster: MobiSR - Efficient On-Device Super-Resolution through Heterogeneous Mobile Processors.",
                    "Poster: Edge-cloud Enhancement - Latency-aware Virtual Cluster Placement for Supporting Cloud Applications in Mobile Edge Networks.",
                    "Poster: Video Chat Scam Detection Leveraging Screen Light Reflection.",
                    "Poster: Secure Visible Light Communication based on Nonlinearity of Spatial Frequency in Light.",
                    "Poster: FlexDP-Flexible Data Plane for ENFV.",
                    "Poster: A Machine Learning based Hybrid Trust Management Heuristic for Vehicular Ad hoc Networks.",
                    "Poster: In-situ Water-Quality Monitoring System through Ultraviolet Sensing Using Off-the-Shelf Cameras.",
                    "Characterizing Uncertainties of Wireless Channels in Connected Vehicles.",
                    "Poster: Polarization-based QAM for Visible Light Backscatter Communication.",
                    "Poster: A Linear Programming Approach for SFC Placement in Mobile Edge Computing.",
                    "Poster: Contactless Infant Monitoring using White Noise.",
                    "Poster: Understanding Long-Term Mobility and Charging Evolving of Shared EV Networks.",
                    "Poster: Causal Inference of Smartphone App Choice.",
                    "Poster: Address Shuffling based Moving Target Defense for In-Vehicle Software-Defined Networks.",
                    "Poster: Cross Labelling and Learning Unknown Activities Among Multimodal Sensing Data.",
                    "Poster: Optimizing Mobile Video Telephony Using Deep Imitation Learning.",
                    "CHANTS'19: 14th Workshop on Challenged Networks.",
                    "HotEdgeVideo'19: Workshop on Hot Topics in Video Analytics and Intelligent Edges.",
                    "Internet-QoE 2019: 4th Internet-QoE Workshop on QoE-based Analysis and Management of Data Communication Networks.",
                    "mmNets'19: The 3rd ACM Workshop on Millimeter-Wave Networks and Sensing Systems.",
                    "S3'19 - Wireless of the Students, by the Students, and for the Students Workshop.",
                    "SMAS'19: 1st ACM Workshop on Emerging Smart Technologies and Infrastructures for Smart Mobility and Sustainability.",
                    "WiNTECH'19: Workshop on Wireless Network Testbeds, Experimental evaluation & CHaracterization."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019s3",
                "sub_name": "Proceedings of the 11th on Wireless of the Students, by the Students, and for the Students Workshop, S3@MobiCom 2019, Los Cabos, Mexico, October 21, 2019.",
                "count": 14,
                "papers": [
                    "Session details: Keynote Talk.",
                    "Sensing the Physical World with RF: Self-Interferometry & Passive-Interferometry.",
                    "Session details: Technical Paper Session.",
                    "Lifetime Optimization of Transmit-Only Sensor Networks with Adaptive Mobile Cluster Heads.",
                    "Evaluation Framework for Real-Time Adaptive 360-Degree Video Streaming over 5G Networks.",
                    "Empirical Analysis of LoRaWAN Adaptive Data Rate for Mobile Internet of Things Applications.",
                    "Session details: Poster Session.",
                    "Demo: EApp: Improving Rural Emergency Preparedness and Response.",
                    "Poster: QoE-Based Analysis of Real-Time Adaptive 360-Degree Video Streaming.",
                    "Poster: Characterizing Performance and Power for mmWave 5G on Commodity Smartphones.",
                    "Poster: Time Encoding for Energy Efficiency and Scalability in Wireless Networks.",
                    "Poster: While You Were Sleeping- Time-Shifted Prefetching of YouTube Videos to Reduce Peak-time Cellular Data Usage.",
                    "Poster: Autonomic Service Placement in Fog Computing.",
                    "Poster: Experimental Evaluation of TCP Congestion Control over 60GHz WLAN."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019mmnets",
                "sub_name": "Proceedings of the 3rd ACM Workshop on Millimeter-wave Networks and Sensing Systems, mmNets@MobiCom 2019, October 25, 2019, Los Cabos, Mexico.",
                "count": 9,
                "papers": [
                    "On the Outage Probability of Millimeter Wave Links with Quasi-deterministic Propagation.",
                    "mmBAC: Location-aided mmWave Backhaul Management for UAV-based Aerial Cells.",
                    "A First Look at 802.11ad Performance on a Smartphone.",
                    "Learning Congestion State For mmWave Channels.",
                    "MillimeTera: Toward A Large-Scale Open-Source mmWave and Terahertz Experimental Testbed.",
                    "Real-time Multi-Gigahertz Sub-Nyquist Spectrum Sensing System for mmWave.",
                    "28 GHz Channel Measurements in the COSMOS Testbed Deployment Area.",
                    "mmSense: Multi-Person Detection and Identification via mmWave Sensing.",
                    "RadHAR: Human Activity Recognition from Point Clouds Generated through a Millimeter-wave Radar."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019smas",
                "sub_name": "Proceedings of the 1st ACM Workshop on Emerging Smart Technologies and Infrastructures for Smart Mobility and Sustainability, SMAS@MobiCom 2019, Los Cabos, Mexico, October 21, 2019.",
                "count": 9,
                "papers": [
                    "Automated Driving Empowered by Connectivity.",
                    "When Gamification Meets Sustainability: A Pervasive Approach to Foster Sustainable Mobility in Madeira.",
                    "A User-Centred Approach to Design In-Vehicle Human Machine Interfaces: A Case Study for Electric Cars.",
                    "Users as Programmers: Developing a Vehicular Interface Notation for Older Users of Smart Vehicles.",
                    "A Framework for Queryable Video Analysis: A Case-Study on Transport Modelling.",
                    "Learn from IoT: Pedestrian Detection and Intention Prediction for Autonomous Driving.",
                    "Resource Management of IoT Devices in Restrictive Environments.",
                    "A Framework for Data and Concept Interoperability in Smart Mobility Systems.",
                    "Road Infrastructure Monitoring System using E-Bikes and Its Extensions for Smart Community."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019wintech",
                "sub_name": "Proceedings of the 13th International Workshop on Wireless Network Testbeds, Experimental Evaluation & Characterization, WiNTECH@@MobiCom 2019, Los Cabos, Mexico, October 25, 2019.",
                "count": 11,
                "papers": [
                    "Enabling OFDMA in Wireless Backscatter.",
                    "Learning from Industrial Ixperimental Research.",
                    "Arena: A 64-antenna SDR-based Ceiling Grid Testbed for Sub-6 GHz Radio Spectrum Research.",
                    "Dead on Arrival: An Empirical Study of The Bluetooth 5.1 Positioning System.",
                    "Free Your CSI: A Channel State Information Extraction Platform For Modern Wi-Fi Chipsets.",
                    "Evaluation of LoRa Performance in a City-wide Testbed: Experimentation Insights and Findings.",
                    "Time-of-flight Wireless Indoor Navigation System for Industrial Environment.",
                    "Demo: Arena: A 64-antenna SDR-based Ceiling Grid Testbed for Sub-6 GHz Radio Spectrum Research.",
                    "Demo: Nano Power Draw in Duty-Cycled Wireless Sensor Networks.",
                    "Demo: LoRa Mesh Network Experimentation in a City-Wide Testbed.",
                    "Poster: Secure Visible Light Communication via Two-Dimensional Spatially Aliased Patterns."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019qoe",
                "sub_name": "Proceedings of the 4th Internet-QoE Workshop on QoE-based Analysis and Management of Data Communication Networks, Internet-QoE@MobiCom 2019, Los Cabos, Mexico, October 21, 2019.",
                "count": 7,
                "papers": [
                    "I See What you See: Real Time Prediction of Video Quality from Encrypted Streaming Traffic.",
                    "Estimating Video Streaming QoE in the 5G Architecture Using Machine Learning.",
                    "Privacy Preserving QoE Modeling using Collaborative Learning.",
                    "Crowd-based Study of Gameplay Impairments and Player Performance in DOTA 2.",
                    "QoE Analysis of Spotify Audio Streaming and App Browsing.",
                    "Traffic Measurement Study on Video Streaming with the Amazon Echo Show.",
                    "QoE of Video Streaming in Multihomed Vehicular Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2019hev",
                "sub_name": "Proceedings of the 2019 Workshop on Hot Topics in Video Analytics and Intelligent Edges, HotEdgeVideo@MobiCom 2019, Los Cabos, Mexico, October 21-25, 2019.",
                "count": 11,
                "papers": [
                    "Session details: Session 1: Cameras are becoming Smarter.",
                    "Networked Cameras Are the New Big Data Clusters.",
                    "Live Video Analytics with FPGA-based Smart Cameras.",
                    "Space-Time Vehicle Tracking at the Edge of the Network.",
                    "Session details: Session 2: ML for Videos.",
                    "Distilled Split Deep Neural Networks for Edge-Assisted Real-Time Systems.",
                    "Cracking open the DNN black-box: Video Analytics with DNNs across the Camera-Cloud Boundary.",
                    "secGAN: A Cycle-Consistent GAN for Securely-Recoverable Video Transformation.",
                    "Session details: Session 3: Playing Nice with the Network.",
                    "Client-side Bandwidth Estimation Technique for Adaptive Streaming of a Browser Based Free-Viewpoint Application.",
                    "Sensor Training Data Reduction for Autonomous Vehicles."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "24th MobiCom 2018",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2018",
                "sub_name": "Proceedings of the 24th Annual International Conference on Mobile Computing and Networking, MobiCom 2018, New Delhi, India, October 29 - November 02, 2018.",
                "count": 138,
                "papers": [
                    "Session details: Keynote Address I.",
                    "Invited Keynote by Mr. Mukesh Ambani.",
                    "Session details: Living on the Edge: Mobile Systems at the Network's Edge.",
                    "Surface MIMO: Using Conductive Surfaces For MIMO Between Small Devices.",
                    "FoggyCache: Cross-Device Approximate Computation Reuse.",
                    "SkyCore: Moving Core to the Edge for Untethered and Reliable UAV-based LTE Networks.",
                    "SWAN: Stitched Wi-Fi ANtennas.",
                    "Session details: Blinded by the Light: AR, VR, and Vision.",
                    "Battery-Free Eye Tracker on Glasses.",
                    "Conductive Inkjet Printed Passive 2D TrackPad for VR Interaction.",
                    "Flare: Practical Viewport-Adaptive 360-Degree Video Streaming for Mobile Devices.",
                    "NestDNN: Resource-Aware Multi-Tenant On-Device Deep Learning for Continuous Mobile Vision.",
                    "DeepCache: Principled Cache for Mobile Deep Vision.",
                    "Session details: Keynote Address II.",
                    "Keeping the Internet Open with an Open-Source Virtual Assistant.",
                    "Session details: Slice, Schedule, Repeat: 5G Cellular Networks.",
                    "Resolving Policy Conflicts in Multi-Carrier Cellular Access.",
                    "ECHO: A Reliable Distributed Cellular Core Network for Hyper-scale Public Clouds.",
                    "Experience: Implications of Roaming in Europe.",
                    "How Should I Slice My Network?: A Multi-Service Empirical Evaluation of Resource Sharing Efficiency.",
                    "GPF: A GPU-based Design to Achieve ~100 μs Scheduling for 5G NR.",
                    "Session details: Keynote Address III.",
                    "The Future of Wireless and What it will Enable.",
                    "Session details: What's the Frequency, Kenneth? Millimeter-Wave Networks.",
                    "Multi-Stream Beam-Training for mmWave MIMO Networks.",
                    "Adaptive Codebook Optimization for Beam Training on Off-the-Shelf IEEE 802.11ad Devices.",
                    "Towards Scalable and Ubiquitous Millimeter-Wave Wireless Networks.",
                    "LiSteer: mmWave Beam Acquisition and Steering by Tracking Indicator LEDs on Wireless APs.",
                    "Session details: Take Me Back to School: Learning and Sensing.",
                    "Towards Environment Independent Device Free Human Activity Recognition.",
                    "CrossSense: Towards Cross-Site and Large-Scale WiFi Sensing.",
                    "Session details: Lock it Down! Security, Countermeasures, and Authentication.",
                    "EchoPrint: Two-factor Authentication using Acoustics and Vision on Smartphones.",
                    "Ghostbuster: Detecting the Presence of Hidden Eavesdroppers.",
                    "Body-Guided Communications: A Low-power, Highly-Confined Primitive to Track and Secure Every Touch.",
                    "CEIVE: Combating Caller ID Spoofing on 4G Mobile Phones Via Callee-Only Inference and Verification.",
                    "Towards Replay-resilient RFID Authentication.",
                    "Proximity-Proof: Secure and Usable Mobile Two-Factor Authentication.",
                    "Session details: Where are U Now? Localization and Motion Tracking.",
                    "Verification: Accuracy Evaluation of WiFi Fine Time Measurements on an Open Platform.",
                    "Closing the Gaps in Inertial Motion Tracking.",
                    "RainbowLight: Towards Low Cost Ambient Light Positioning with Mobile Phones.",
                    "Session details: Keynote Address IV.",
                    "The Science of Social Cyber-Security.",
                    "Session details: Running on Empty: Backscatter and Low-Power Systems.",
                    "Challenge: RFID Hacking for Fun and Profit.",
                    "Parallel Backscatter in the Wild: When Burstiness and Randomness Play with You.",
                    "Experience: Cross-Technology Radio Respiratory Monitoring Performance Study.",
                    "X-Tandem: Towards Multi-hop Backscatter Communication with Commodity WiFi.",
                    "Session details: We are the Engineers: Mobile Systems and Networking.",
                    "Mitigating the Latency-Accuracy Trade-off in Mobile Data Analytics Systems.",
                    "One Billion Apples' Secret Sauce: Recipe for the Apple Wireless Direct Link Ad hoc Protocol.",
                    "Experience: Android Resists Liberation from Its Primary Use Case.",
                    "RAVEN: Improving Interactive Latency for the Connected Car.",
                    "Session details: Keynote Address V.",
                    "The Early International Activities in the Arpanet, Its Mutation into the Internet, and Some Further Regional Extensions.",
                    "Session details: Multi-Modal and Cross-Technology Communications.",
                    "ChromaCode: A Fully Imperceptible Screen-Camera Communication System.",
                    "VSkin: Sensing Touch Gestures on Surfaces of Mobile Devices Using Acoustic Signals.",
                    "Simultaneous Localization and Mapping with Power Network Electromagnetic Field.",
                    "Cross-Frequency Communication: Near-Field Identification of UHF RFIDs with WiFi!",
                    "Achieving Receiver-Side Cross-Technology Communication with Cross-Decoding.",
                    "Session details: Panel Discussion.",
                    "MobiCom'18 Panel: Hammer & Nail vis-a-vis AI / ML Applications to Networked Systems.",
                    "Chip-to-chip RF Communications and Power Delivery via On-chip Antennas.",
                    "Edge Computing with ParaDrop Tutorial.",
                    "5G: An Evolution Towards a Revolution.",
                    "Dynamic Network Analytics: Tutorial Outline.",
                    "Session details: Poster Presentations.",
                    "Poster: Proximity Detection with Single-Antenna IoT Devices.",
                    "Poster: A SDN/NFV-Based IoT Network Slicing Creation System.",
                    "Service Level Virtualization (SLV): A Preliminary Implementation of 3GPP Service Based Architecture (SBA).",
                    "Poster: An SDN Based Content Cache at the WiFi Edge.",
                    "Poster: Redesigning MPTCP for Edge Clouds.",
                    "Poster: Caching Static and Transient Data.",
                    "Poster: Sparse Signal Recovery and Energy Harvesting for Potential 5G Applications.",
                    "Poster: Scalable Network Slicing Architecture for 5G.",
                    "Poster: Bringing mmWave Communications to Raspberry Pi.",
                    "Poster: Uplink and Downlink Resource Allocation for Energy Efficient Cellular Networks with Dual Connectivity.",
                    "HISC NEMO: High Scalability in Nested Network Mobility Using Hierarchical Attachment Approach.",
                    "Poster: Age-of-Information Aware Scheduling for Heterogeneous Sources.",
                    "ACP: Age Control Protocol for Minimizing Age of Information over the Internet.",
                    "iCALM: A Topology Agnostic Socio-inspired Channel Assignment Performance Prediction Metric for Mesh Networks.",
                    "AMuSe: An Agile Multipath TCP Scheduler for Dual-Band 802.11ad/ac Wireless LANs.",
                    "Frame Aggregation in 802.11ac: Need for Modified Block ACK.",
                    "Poster: Joint Data Latency and Packet Loss Optimization for Relay-Node Selection in Time-Varying IoT Networks.",
                    "Poster: A Raspberry Pi Based Data-Centric MAC for Robust Multicast in Vehicular Network.",
                    "Poster: Analyzing Bitrates in Modern Wi-Fi Networks.",
                    "Poster: Wi-Fi User's Video QoE in the Presence of Duty Cycled LTE-U.",
                    "Poster: Facilitating Low Latency and Reliable VR over Heterogeneous Wireless Networks.",
                    "Wireless Caching in Large-Scale Edge Access Points: A Local Distributed Approach.",
                    "Poster: Development of an LAA-LTE Transmitter with Lightweight Wi-Fi Frame Detection.",
                    "Poster: Exploring Visible Light Communication System using RTS/CTS Mechanism for Mobile Environment.",
                    "Poster: A Lightweight Timestamp-based MAC Detection Scheme for XOR Network Coding in Wireless Sensor Networks.",
                    "Poster: Maintaining UAV Stability using Low-Power WANs.",
                    "Poster: Using Barometer on Smartphones to Improve GPS Navigation Altitude Accuracy.",
                    "SaFePlay+: A Wearable Cycling Measurement and Analysis System of Lower Limbs.",
                    "Poster: Networked Acoustics Around Human Ears.",
                    "Poster: Effectiveness of Deep Neural Network Model in Typing-based Emotion Detection on Smartphones.",
                    "Type2Motion: Detecting Mobility Context from Smartphone Typing.",
                    "Poster: Pose-assisted Active Visual Recognition in Mobile Augmented Reality.",
                    "Poster: Low Cost Platform Design for Pollution Measurement in Delhi-NCR using Vehicle-Mounted Sensors.",
                    "Poster: Your Phone Tells Us The Truth: Driver Identification Using Smartphone on One Turn.",
                    "SensingGO: Toward Mobile/Cellular Data Measurement with Social and Rewarding Activities.",
                    "Poster: Utilizing Social Networks Data for Trust Management in a Social Internet of Things Network.",
                    "VeData: Promoting AI Assisted Autonomous Vehicles.",
                    "META: Memory Exploration Tool for Android Devices.",
                    "Magneto: Leveraging Magnetic Field Changes for Inferring Smartphone App Usage.",
                    "Poster: GPU based High Definition Parallel Video Codec Optimization in Mobile Device.",
                    "Your Heart Won't Lie: PPG-based Continuous Authentication on Wrist-worn Wearable Devices.",
                    "Poster: Leveraging Breathing for Continuous User Authentication.",
                    "Poster: Inferring Mobile Payment Passcodes Leveraging Wearable Devices.",
                    "Poster: Detection of Topology Poisoning by Silent Relay Attacker in SDN.",
                    "Poster: A Learning Automata-based DDoS Attack Defense Mechanism in Software Defined Networks.",
                    "Poster: Hybrid Android Malware Detection by Combining Supervised and Unsupervised Learning.",
                    "Poster: Feasibility of Desynchronization Attack in LTE/SAE Networks.",
                    "Poster: A lightweight Mutually Authenticated Key-Agreement scheme for Wireless Body Area Networks in Internet of Things Environment.",
                    "Session details: Demos and Exhibits.",
                    "Demo: RainbowLight: Design and Implementation of a Low Cost Ambient Light Positioning System.",
                    "Demo: Cisco DNA-C as a Platform.",
                    "Demo: Mitigating Multiple Narrowband Interferers in SDR IEEE 802.11g Diversity Receiver.",
                    "RF-iCare: An RFID-based Approach for Infusion Status Monitoring.",
                    "Demo: Tile-Based Viewport-Adaptive Panoramic Video Streaming on Smartphones.",
                    "Linux Goes Apple Picking: Cross-Platform Ad hoc Communication with Apple Wireless Direct Link.",
                    "Elixir: Efficient Data Transfer in WiFi-based IoT Nodes.",
                    "Demo: Near-Field Identification of UHF RFIDs with WiFi!",
                    "Demo: Low Latency Mobile Augmented Reality with Flexible Tracking.",
                    "E-Witness: Preserve and Prove Forensic Soundness of Digital Evidence.",
                    "EasyGO: A Rapid Indoor Navigation and Evacuation System Using Smartphones through Internet of Things Technologies.",
                    "Demo: COIN by SenseGiz.",
                    "Demo: HAMS: Driver and Driving Monitoring using a Smartphone.",
                    "Demo: MegaSense: Megacity-scale Accurate Air Quality Sensing with the Edge.",
                    "Demo: Combating Caller ID Spoofing on 4G Phones Via CEIVE.",
                    "Demo: Android Resists Liberation from Its Primary Use Case.",
                    "Demo: A Software-Defined Radio for Wireless Brain Implants Network.",
                    "Demo: Design and Implementation of LTE Advanced Underlay Device to Device Communication Framework.",
                    "Demo: Optical Wireless Communication \"Li-Fi\".",
                    "Minion: The World's Smallest Energy Auditor."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018s3",
                "sub_name": "Proceedings of the 10th on Wireless of the Students, by the Students, and for the Students Workshop, S3@MobiCom 2018, New Delhi, India, November 2, 2018.",
                "count": 13,
                "papers": [
                    "Session details: Opening Keynote Talk.",
                    "Making Mobile Networks Fly.",
                    "Session details: Paper Session 1.",
                    "Replay-resilient Authentication for IoT.",
                    "Frame Aggregation in 802.11ac: Need for Modified Block ACK.",
                    "Context Aware Data Collection Framework for Critical Infrastructure Monitoring System.",
                    "Session details: Paper Session 2.",
                    "Position Tracking for Virtual Reality Using Commodity WiFi.",
                    "Recognizing Gestures with Ambient Light.",
                    "mmWave Beam Steering via Visible Light Sensing.",
                    "Battery-Free Eye Tracker on Glasses.",
                    "Session details: Closing Keynote Talk.",
                    "Realizing Mixed Reality through Mobile Systems Research."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018wintech",
                "sub_name": "Proceedings of the 12th International Workshop on Wireless Network Testbeds, Experimental Evaluation & Characterization, WiNTECH@MobiCom 2018, New Delhi, India, November 2, 2018.",
                "count": 19,
                "papers": [
                    "Session details: Keynote Address.",
                    "Practical Millimeter Wave Research on Custom Testbeds and Commercial Off-The-Shelf Devices.",
                    "Session details: 5G and Wireless Access.",
                    "A Framework for Integrating MPTCP over LWA: A Testbed Evaluation.",
                    "Design and Validation of a Multi-service 5G Network with QoE-aware Orchestration.",
                    "OpenLEON: An End-to-End Emulator from the Edge Data Center to the Mobile Users.",
                    "Demo: Channel Estimation and Custom Beamforming on the 60 GHz TP-Link Talon AD7200 Router.",
                    "Session details: Testbeds, Measurements and Experimentation.",
                    "A Flexible Software Framework for Real-World Experiments and Temperature-Controlled Testbeds.",
                    "TPy: A Lightweight Framework for Agile Distributed Network Experiments.",
                    "Wireless Network Emulation for Research on Information-Centric Networking.",
                    "nepi-ng: An Efficient Experiment Control Tool in R2lab.",
                    "Demo: Using nepi-ng for Mesh Networks Experiments.",
                    "A Platform for Experiments with Energy Storage Devices for Low-power Wireless Networks.",
                    "Demo: Integration of a Platform for Energy Storage Experiments into a Generic Testbed Framework.",
                    "Session details: Internet of Wireless Things.",
                    "Gesture Recognition with Transparent Solar Cells: A Feasibility Study.",
                    "When LoRaWAN Frames Collide.",
                    "Demo: Wireless Maritime Networking Experiments with Dedalus."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018mmnets",
                "sub_name": "Proceedings of the 2nd ACM Workshop on Millimeter Wave Networks and Sensing Systems, mmNets@MobiCom 2018, New Delhi, India, October 29, 2018.",
                "count": 14,
                "papers": [
                    "Session details: Keynote Address.",
                    "Millimeter Waves, Millisecond Delays.",
                    "Authenticating the Sector Sweep to Protect Against Beam-Stealing Attacks in IEEE 802.11ad Networks.",
                    "Wireless Interface Agent for SDN mmWave Multi-hop Networks: Design and Experimental Evaluation.",
                    "Joint Beam and Channel Tracking for Two-Dimensional Phased Antenna Arrays.",
                    "Session details: Invited Talk.",
                    "A 128-element Dual-Polarized Software-Defined Phased Array Radio for mm-wave 5G Experimentation.",
                    "Network Control Overhead of Mobility Support in Millimeter-Wave Urban Cellular Networks.",
                    "An Analytical Representation of the 3GPP 3D Channel Model Parameters for mmWave Bands.",
                    "Phase-Noise Mitigation at 60 GHz with a Novel Hybrid MIMO Architecture.",
                    "Learning-based Tracking of AoAs and AoDs in mmWave Networks.",
                    "mm-Wave Radar Based Gesture Recognition: Development and Evaluation of a Low-Power, Low-Complexity System.",
                    "Fast and Reliable Initial Cell-search for mmWave Networks.",
                    "Direction of Arrival and Center Frequency Estimation for Impulse Radio Millimeter Wave Communications."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018edgetech",
                "sub_name": "Proceedings of the 2018 on Technologies for the Wireless Edge Workshop, EdgeTech@MobiCom 2018, New Delhi, India, November 2, 2018.",
                "count": 10,
                "papers": [
                    "Session details: Caching Networks.",
                    "Implicit Coordination of Caches in Small Cell Networks under Unknown Popularity Profiles.",
                    "Caching Policies for D2D-Assisted Content Delivery Systems.",
                    "Session details: Mobile Edge Computing.",
                    "A Game-Theoretic Approach to Multi-Objective Resource Sharing and Allocation in Mobile Edge.",
                    "Employing MEC in the Cloud-RAN: An Experimental Analysis.",
                    "Session details: Topics in Edge Computing.",
                    "TopK Ordering on Distributed Systems.",
                    "Care to Share?: An Empirical Analysis of Capacity Enhancement by Sharing at the Edge.",
                    "Platforms for Advanced Wireless Research: Helping Define a New Edge Computing Paradigm."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018ficn",
                "sub_name": "Proceedings of the 1st International Workshop on Future Industrial Communication Networks, FICN@MobiCom 2018, New Delhi, India, November 2, 2018.",
                "count": 12,
                "papers": [
                    "Industrial CPS over Wireless Networks: Performance, Design, Inference, Control.",
                    "Session details: Applications.",
                    "Anomaly Detection Algorithms for Smart Metering using Swarm Intelligence.",
                    "Digitalization of Electromechanical Auxiliary Relays in Substation Automation System.",
                    "Session details: Theory.",
                    "SecureIoT: Hop-Count Based Service-Oriented Efficient Security Solution for IoT.",
                    "Network Coding for Throughput Optimization in Random Access Challenged Networks with Correlated Sources.",
                    "A Game of Incentives: An Efficient Demand Response Mechanism using Fleet of Electric Vehicles.",
                    "Industrial Communication \" A Three Step Rocket.",
                    "Session details: Architecture.",
                    "Intent-based Networks: An Industrial Perspective.",
                    "An Efficient and Secure Directed Diffusion in Industrial Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018cnetsys",
                "sub_name": "Proceedings of the 1st Workshop on Complex Networked Systems for Smart Infrastructure, CNetSys@MobiCom 2018, New Delhi, India, October 29 - November 02, 2018.",
                "count": 3,
                "papers": [
                    "Wireless Characteristics Study for Indoor Multi-Robot Communication System.",
                    "Hm2Sc: Human Movement Model for Post Disaster Scenario in Smart City.",
                    "O-ICN Simulator (OICNSIM): An NS-3 Based Simulator for Overlay Information Centric Networking (O-ICN)."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2018c3vp",
                "sub_name": "Proceedings of the 1st International Workshop on Communication and Computing in Connected Vehicles and Platooning, C3VP@MobiCom 2018, New Delhi, India, October 29 - November 02, 2018.",
                "count": 7,
                "papers": [
                    "Session details: Paper Presentations.",
                    "On Feasibility of VLC Based Car-to-Car Communication Under Solar Irradiance and Fog Conditions.",
                    "Leader Election in Cooperative Adaptive Cruise Control Based Platooning.",
                    "Towards Fog-based Next Generation Internet of Vehicles Architecture.",
                    "Deriving Pattern in Driver's Observability in Road Turns & Traffic Lights: Eye-Tracking based Analysis.",
                    "Lane Change For System-Driven Vehicles Using Dynamic Information.",
                    "Technological Challenges in Autonomous Driving."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "23rd MobiCom 2017",
        "info": "Snowbird, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2017",
                "sub_name": "Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking, MobiCom 2017, Snowbird, UT, USA, October 16 - 20, 2017.",
                "count": 88,
                "papers": [
                    "Making Roads Safer by Making Drivers Better.",
                    "WEBee: Physical-Layer Cross-Technology Communication via Emulation.",
                    "Stateful Inter-Packet Signal Processing for Wireless Networking.",
                    "WiFi-Assisted 60 GHz Wireless Networks.",
                    "Pose Information Assisted 60 GHz Networks: Towards Seamless Coverage and Mobility Support.",
                    "A Control-Plane Perspective on Reducing Data Access Latency in LTE Networks.",
                    "Experience: An Open Platform for Experimentation with Commercial Mobile Broadband Networks.",
                    "Automating Diagnosis of Cellular Radio Access Network Problems.",
                    "Adding the Next Nine: An Investigation of Mobile Broadband Networks Availability.",
                    "The Tick Programmable Low-Latency SDR System.",
                    "BiPass: Enabling End-to-End Full Duplex.",
                    "Orion: RAN Slicing for a Flexible and Cost-Effective Multi-Service Mobile Network Architecture.",
                    "Accelerating Multipath Transport Through Balanced Subflow Completion.",
                    "FSONet: A Wireless Backhaul for Multi-Gigabit Picocells Using Steerable Free Space Optics.",
                    "MagneComm: Magnetometer-based Near-Field Communication.",
                    "PassiveVLC: Enabling Practical Visible Light Backscatter Communication for Battery-free IoT Applications.",
                    "ReflexCode: Coding with Superposed Reflection Light for LED-Camera Communication.",
                    "Navigating the Chasm between Curiosity- and Impact-Driven Research.",
                    "Pulsar: Towards Ubiquitous Visible Light Localization.",
                    "RF-Echo: A Non-Line-of-Sight Indoor Localization System Using a Low-Power Active RF Reflector ASIC Tag.",
                    "Simultaneous Power-Based Localization of Transmitters for Crowdsourced Spectrum Monitoring.",
                    "Minding the Billions: Ultra-wideband Localization for Deployed RFID Tags.",
                    "RIO: A Pervasive RFID-based Touch Gesture Interface.",
                    "FlipTracer: Practical Parallel Decoding for Backscatter Communication.",
                    "TagScan: Simultaneous Target Imaging and Material Identification with Commodity RFID Devices.",
                    "Analog On-Tag Hashing: Towards Selective Reading as Hash Primitives in Gen2 RFID Systems.",
                    "Cardiac Scan: A Non-contact and Continuous Heart-based User Authentication System.",
                    "Automating Visual Privacy Protection Using a Smart LED.",
                    "Continuous Authentication for Voice Assistants.",
                    "NICScatter: Backscatter as a Covert Channel in Mobile Devices.",
                    "Spurring Mobile Systems Research Into The Next Decade.",
                    "UIWear: Easily Adapting User Interfaces for Wearable Devices.",
                    "TinyLink: A Holistic System for Rapid Development of IoT Applications.",
                    "BlueMountain: An Architecture for Customized Data Management on Mobile Systems.",
                    "Furion: Engineering High-Quality Immersive Virtual Reality on Today's Mobile Devices.",
                    "RAVEN: Perception-aware Optimization of Power Consumption for Mobile Games.",
                    "Advertising-based Measurement: A Platform of 7 Billion Mobile Devices.",
                    "NutShell: Scalable Whittled Proxy Execution for Low-Latency Web over Cellular Networks.",
                    "Demo: The Sound of Silence: End-to-End Sign Language Recognition Using SmartWatch.",
                    "Demo: FlexRAN: A Software-Defined RAN Platform.",
                    "Demo: Orion: A Radio Access Network Slicing System.",
                    "Demo: Sensor Fusion Localization and Navigation for Visually Impaired People.",
                    "Demo: A Cell-level Traffic Generator for LoRa Networks.",
                    "Demo: DEMS: DEcoupled Multipath Scheduler for Accelerating Multipath Transport.",
                    "Demo: Atlas Thing Architecture: Enabling Mobile Apps as Things in the IoT.",
                    "Demo: LL-MEC A SDN-based MEC Platform.",
                    "Demo: BlueBee: 10, 000x Faster Cross-Technology Communication from Bluetooth to ZigBee.",
                    "Demo: Position Tracking for Virtual Reality Using Commodity WiFi.",
                    "Demo: Ultra-Low Power Gaze Tracking for Virtual Reality.",
                    "Demo: WEBee: Physical-Layer Cross-Technology Communication via Emulation.",
                    "Demo: Towards Flexible and Scalable Indoor Navigation.",
                    "Demo: FROG: Optimizing Power Consumption of Mobile Games Using Perception-Aware Frame Rate Scaling.",
                    "Demo: ArgosV3: An Efficient Many-Antenna Platform.",
                    "Demo: WiFi-Assisted 60 GHz Wireless Networks.",
                    "Demo: Dynamic Adaptations of WiFi Channel Widths Without TX/RX Coordination.",
                    "Demo: UIWear: Easily Adapting User Interfaces for Wearable Devices.",
                    "Demo: Coding with Superposed Reflection Light for LED-Camera Communication.",
                    "Demo: Stuffing Wi-Fi Beacons for Fun and Profit.",
                    "Demo: Acoustic Sensing Based Indoor Floor Plan Construction Using Smartphones.",
                    "Demo: LiShield: Privacy Protection of Physical Environment Against Photographing.",
                    "Poster: Resource Allocation with Conflict Resolution for Vehicular Sidelink Broadcast Communications.",
                    "Poster: Link Line Crossing Speed Estimation with Narrowband Signal Strength.",
                    "Poster: Broadcast LTE Data Reveals Application Type.",
                    "Poster: Toward a Better Monitoring of Air Pollution using Mobile Wireless Sensor Networks.",
                    "Poster: DeepTFP: Mobile Time Series Data Analytics based Traffic Flow Prediction.",
                    "Poster: A New Scalable, Programmable and Evolvable Mobile Control Plane Platform.",
                    "Poster: Conservative Modulation and Coding for Low-latency Robust Transmission of Scalable ECG over LTE MTC.",
                    "Poster: DRIZY: Collaborative Driver Assistance Over Wireless Networks.",
                    "Poster: Emotion-Aware Smart Tips for Healthy and Happy Sleep.",
                    "Poster: IoTURVA: Securing Device-to-Device Communications for IoT.",
                    "Poster: A Portfolio Theory Approach to Edge Traffic Engineering via Bayesian Networks.",
                    "Poster: Interacting Data-Intensive Services Mining and Placement in Mobile Edge Clouds.",
                    "Poster: Connecting Simulation and Real World: IEEE 802.11p in the Loop.",
                    "Poster: FooDNet: Optimized On Demand Take-out Food Delivery using Spatial Crowdsourcing.",
                    "Poster: RQL: REST Query Language for Converting Firebase to a Mobile Cloud Computing Platform.",
                    "Poster: EasyDefense: Towards Easy and Effective Protection Against Malware for Smartphones.",
                    "Poster: Can MPTCP Improve Performance for Dual-Band 60 GHz/5 GHz Clients?",
                    "Poster: X60: A Programmable Testbed for Wideband 60 GHz WLANs with Phased Arrays.",
                    "Poster: A VLC Solution for Smart Parking.",
                    "Poster: Battery-free Visible Light Sensing.",
                    "Poster: Improving Multipath Resolution with MIMO Smoothing.",
                    "Poster: Combating Multipaths to Enable RFID Sensing in Practical Environments.",
                    "Poster: EasyApp: A Widget-based Cross-platform Mobile Development Environment for End-users.",
                    "Poster: RECO: A Reconfigurable Core Network for Future 5G Communication Systems.",
                    "Poster: Smart RF Table Enables IoT on a Desk.",
                    "Poster: Enabling Secure Location Authentication in Drone.",
                    "Poster: An Efficient Control Framework for Supporting the Future SDN/NFV-enabled Satellite Network.",
                    "Poster: WiFi-based Device-Free Human Activity Recognition via Automatic Representation Learning."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017vlcs",
                "sub_name": "Proceedings of the 4th ACM Workshop on Visible Light Communication Systems, VLCS@MobiCom 2017, Snowbird, UT, USA, October 16, 2017.",
                "count": 14,
                "papers": [
                    "Elements of Visible Light Communication Research.",
                    "Battery-free Visible Light Sensing.",
                    "Roaming in Connecting Light: Practical Visible Light Communication Leveraging LED Sensing.",
                    "SeedLight: Hardening LED-to-Camera Communication with Random Linear Coding.",
                    "Driving Visible Light Communications Towards the Tipping Point for Broad Scale Adoption.",
                    "Position: Augmenting Inertial Tracking with Light.",
                    "Position: Health Effects in LED-based Communication Systems and Possible Mitigations.",
                    "Position: DroneVLC: Visible Light Communication for Aerial Vehicular Networking.",
                    "Demo: An Open-Access Research Testbed for Visible Light Communication.",
                    "Demo: OpenVLC1.2 for Increased Data Rate with Embedded Systems.",
                    "Demo: Battery-free Visible Light Sensing.",
                    "A Performance Comparison of Different Cost Functions for RSS-Based Visible Light Positioning Under the Presence of Reflections.",
                    "A Comparison of Load Balancing Techniques for Hybrid LiFi/RF Networks.",
                    "Hybrid VLC and Radio Communication: Potential, Challenges and Solutions for Coexistence."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017wintech",
                "sub_name": "Proceedings of the 11th Workshop on Wireless Network Testbeds, Experimental evaluation & CHaracterization, WiNTECH@MobiCom, Snowbird, UT, USA, October 20, 2017.",
                "count": 19,
                "papers": [
                    "FLEX-MONROE: A Unified Platform for Experiments under Controlled and Operational LTE Settings.",
                    "Results from Running an Experiment as a Service Platform for Mobile Networks.",
                    "cniCloud: Querying the Cellular Network Information at Scale.",
                    "Repeatability of Vehicular Measurements on Public Roadways.",
                    "From the Lab to the Road: Lessons from Connected Vehicle Testbeds.",
                    "Cellular Access Multi-Tenancy through Small Cell Virtualization and Common RF Front-End Sharing.",
                    "LTE Spectrum Sharing Research Testbed: Integrated Hardware, Software, Network and Data.",
                    "LTESS-track: A Precise and Fast Frequency Offset Estimation for low-cost SDR Platforms.",
                    "Nexmon: Build Your Own Wi-Fi Testbeds With Low-Level MAC and PHY-Access Using Firmware Patches on Off-the-Shelf Mobile Devices.",
                    "Finding by Counting: A Probabilistic Packet Count Model for Indoor Localization in BLE Environments.",
                    "X60: A Programmable Testbed for Wideband 60 GHz WLANs with Phased Arrays.",
                    "EVERUN: Enabling Power Consumption Monitoring in Underwater Networking Platforms.",
                    "Demo: Material Identification with Commodity RFID Devices.",
                    "Demo: Experimentation in Controlled and Operational LTE Settings with FLEX-MONROE.",
                    "Demo: Enabling Asynchronous Awakenings in Wireless Sensor Networks Towards Removing Duty-Cycle Barriers.",
                    "Demo: In-situ Power Consumption Meter for Sensor Networks supporting Extreme Dynamic Range.",
                    "Demo: Spectrum Access System on Cognitive Radio Network Testbed.",
                    "Demo: Nexmon in Action: Advanced Applications Powered by the Nexmon Firmware Patching Framework.",
                    "Poster: Integration of WiFi ToF Positioning System in the Open, Flexible and Adaptive WiSHFUL Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017hotwireless",
                "sub_name": "Proceedings of the 4th ACM Workshop on Hot Topics in Wireless, HotWireless@MOBICOM 2017, Snowbird, UT, USA, October 16, 2017.",
                "count": 10,
                "papers": [
                    "CV-Track: Leveraging Carrier Frequency Offset Variation for BLE Signal Detection.",
                    "Replay-resilient Physical-layer Authentication for Battery-free IoT Devices.",
                    "Enabling WiFi in Open Access Networks.",
                    "One for All, All for One: Toward Efficient Many-to-Many Broadcast in Dynamic Wireless Networks.",
                    "miniRadar: A Low Power IEEE 802.15.4 Transceiver Based Implementation of Bistatic Radar.",
                    "Optically Backhauled Moving Network for Local Trains.",
                    "Back to the Future: Throughput Prediction For Cellular Networks using Radio KPIs.",
                    "uLoRa: Ultra Low-Power, Low-Cost and Open Platform for the LoRa Networks.",
                    "Towards Wide-area Backscatter Networks.",
                    "BLITZ: A Network Architecture for Low Latency and Energy-efficient Event-triggered Wireless Communication."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017carsys",
                "sub_name": "Proceedings of the 2nd ACM International Workshop on Smart, Autonomous, and Connected Vehicular Systems and Services, CarSys@MobiCom 2017, Snowbird, UT, USA, October 20, 2017.",
                "count": 18,
                "papers": [
                    "Learning Affordance for Autonomous Driving.",
                    "Reducing Unnecessary Pedestrian-to-Vehicle Transmissions Using a Contextual Policy.",
                    "New Dimensions of Intersection Control with Connected and Automated Vehicles.",
                    "Vulnerable Road User Protection through Intuitive Visual Cue on Smartphones.",
                    "Privacy Risks in Vehicle Grids and Autonomous Cars.",
                    "Detecting False Position Attack in Vehicular Communications Using Angular Check.",
                    "Vehicular Micro Clouds as Virtual Edge Servers for Efficient Data Collection.",
                    "Characterizing the \"Driver DNA\" Through CAN Bus Data Analysis.",
                    "CarLab: Framework for Vehicular Data Collection and Processing.",
                    "Infrastructure Bandwidth Allocation for Social Welfare Maximization in Future Connected Autonomous Vehicular Networks.",
                    "Parked Cars as Virtual Network Infrastructure: Enabling Stable V2I Access for Long-Lasting Data Flows.",
                    "Managing Massive Firmware-Over-The-Air Updates for Connected Cars in Cellular Networks.",
                    "Poster: An In-Vehicle Software Defined Network Architecture for Connected and Automated Vehicles.",
                    "Poster: Receiver-Driven Semi-Broadcast for Vehicular Applications.",
                    "Poster: Investigating Doppler Effects on Vehicle-to-Vehicle Communication: An Experimental Study.",
                    "Poster: RSSI-Based Pedestrian Localization Using Artificial Neural Networks.",
                    "Demo: Radio Rate Transformer: A Portable VHF/UHF and Gigahertz Radio Combo Providing Broadband Ad-hoc Networking Services to Mobile Vehicles.",
                    "Demo: Freeway Merge Assistance System using DSRC."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017smartobjects",
                "sub_name": "Proceedings of the 3rd Workshop on Experiences with the Design and Implementation of Smart Objects, SmartObjects@MobiCom 2017, Snowbird, UT, USA, October 16, 2017.",
                "count": 10,
                "papers": [
                    "SCARF: A SoCial-Aware Reliable Forwarding Technique for Vehicular Communications.",
                    "Collaborative Cognitive Content Dissemination and Query in Heterogeneous Mobile Opportunistic Networks.",
                    "The Hive: An Edge-based Middleware Solution for Resource Sharing in the Internet of Things.",
                    "Distributed Data Collection Control in Opportunistic Mobile Crowdsensing.",
                    "Poster: Time Analysis of the Feasibility of Vehicular Blocktrees.",
                    "Poster: Smart Object-Oriented Dynamic Energy Management for Base Stations in Smart Cities.",
                    "Smart and Very Distant Objects.",
                    "Virtual Cellular ISPs.",
                    "Managing IoT at the Edge: The Case for BLE Beacons.",
                    "A Proposal for a Publish/Subscribe, Disruption Tolerant Content Island for Fog Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017mmnets",
                "sub_name": "Proceedings of the 1st ACM Workshop on Millimeter-Wave Networks and Sensing Systems, mmNets@MobiCom 2017, Snowbird, UT, USA, October 16 - 20, 2017.",
                "count": 13,
                "papers": [
                    "Vehicle-to-X Communications: The Killer Application of Millimeter Wave.",
                    "Millimeter-Wave Wireless: A Cross-Disciplinary View of Research and Technology Development.",
                    "Experimental Feasibility Study of Motion Sensor-Aided mm-Wave Beam Tracking.",
                    "Mobility Management for TCP in mmWave Networks.",
                    "Neyman-Pearson Codebook Design for Beam Alignment in Millimeter-Wave Networks.",
                    "Enabling Seamless Coverage and Mobility Support for 60 GHz Networks Using Pose Information.",
                    "3GPP 5G NR Millimeter Wave Standards.",
                    "Millimeter Wave Mobile Communications for 5G: Propagation, System Design and Performance.",
                    "Mitigating Lateral Interference: Adaptive Beam Switching for Robust Millimeter-Wave Networks.",
                    "A Lens Array Multi-beam MIMO Testbed for Real-Time mmWave Communication and Sensing.",
                    "Programmable Weight Phased-Array Transmission for Secure Millimeter-Wave Wireless Communication.",
                    "Multi-User 60 GHz WLANs: from Standards to User Selection Policies.",
                    "Enabling High-Quality Untethered Virtual Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2017s3",
                "sub_name": "Proceedings of the 9th ACM Workshop on Wireless of the Students, by the Students, and for the Students, S3@MobiCom 2017, Snowbird, UT, USA, October 20, 2017.",
                "count": 11,
                "papers": [
                    "Safety and Security in the Internet of Things.",
                    "Sub-Microsecond Network Synchronization for Distributed Wireless PHY Protocols.",
                    "Through-body Capacitive Touch Communication.",
                    "Secure Information Transfer Between Nearby Wireless Devices.",
                    "Automating Visual Privacy Protection in the IoT Space.",
                    "Taming of the Wild: IoT in Public Spaces.",
                    "Demo: Low-power Capacitive Sensing Wristband for Hand Gesture Recognition.",
                    "Demo: LiShield: Create a Capture-Resistant Environment Against Photographing.",
                    "Target Material Identification with Commodity RFID Devices.",
                    "Photometry based Blood Oxygen Estimation through Smartphone Cameras.",
                    "Pulsar: Towards Ubiquitous Visible Light Localization."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "22nd MobiCom 2016",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2016",
                "sub_name": "Proceedings of the 22nd Annual International Conference on Mobile Computing and Networking, MobiCom 2016, New York City, NY, USA, October 3-7, 2016.",
                "count": 81,
                "papers": [
                    "Where the curb meets the cloud: urban innovation in the digital age.",
                    "The darkLight rises: visible light communication in the dark.",
                    "Making sense of mechanical vibration period with sub-millisecond accuracy using backscatter signals.",
                    "Messages behind the sound: real-time hidden acoustic signal capture with smartphones.",
                    "Near-ultrasound communication for TV's 2nd screen services.",
                    "Gyro in the air: tracking 3D orientation of batteryless internet-of-things.",
                    "CAT: high-precision acoustic motion tracking.",
                    "Device-free gesture tracking using acoustic signals.",
                    "Emotion recognition using wireless signals.",
                    "QuickC: practical sub-millisecond transport for small cells.",
                    "Practical MU-MIMO user selection on 802.11ac commodity networks.",
                    "LTE in unlicensed spectrum: are we there yet?",
                    "BASIC: backbone-assisted successive interference cancellation.",
                    "OpenMili: a 60 GHz software radio platform with a reconfigurable phased-array antenna.",
                    "A case for faster mobile web in cellular IPv6 networks.",
                    "An in-depth understanding of multipath TCP on mobile devices: measurement and system design.",
                    "Mobileinsight: extracting and analyzing cellular network information on smartphones.",
                    "3D real-time indoor localization via broadband nonlinear backscatter in passive devices with centimeter precision.",
                    "LiTell: robust indoor localization using unmodified light fixtures.",
                    "LiFS: low human-effort, device-free localization with fine-grained subcarrier information.",
                    "Proteus: a network service control platform for service evolution in a mobile software defined infrastructure.",
                    "Experience: accurate simulation of dense scenarios with hundreds of vehicular transmitters.",
                    "Tracking drone orientation with multiple GPS receivers.",
                    "DopEnc: acoustic-based encounter profiling using smartphones.",
                    "RnB: rate and brightness adaptation for rate-distortion-energy tradeoff in HTTP adaptive streaming over mobile devices.",
                    "LEO: scheduling sensor inference algorithms across heterogeneous mobile processors and network resources.",
                    "Lasagna: towards deep hierarchical understanding and searching over mobile sensing data.",
                    "SPREE: a spoofing resistant GPS receiver.",
                    "Appstract: on-the-fly app content semantics with better privacy.",
                    "Investigation of multi-device location spoofing attacks on air traffic control and possible countermeasures.",
                    "MASHaBLE: mobile applications of secret handshakes over bluetooth LE.",
                    "SALVE: server authentication with location verification.",
                    "Towards adversarial detection of mobile malware: poster.",
                    "Martian - message broadcast via LED lights to heterogeneous smartphones: poster.",
                    "A millimeter wave software defined radio platform with phased arrays: poster.",
                    "Measuring and optimizing android smartwatch energy consumption: poster.",
                    "Sensing on ubiquitous surfaces via vibration signals: poster.",
                    "PIN number-based authentication leveraging physical vibration: poster.",
                    "Assessing header impacts in soccer with smartball: poster.",
                    "A mobility prediction system leveraging realtime location data streams: poster.",
                    "HTTP/2 performance in cellular networks: poster.",
                    "Migrating running applications across mobile edge clouds: poster.",
                    "Automatic personal fitness assistance through wearable mobile devices: poster.",
                    "Low-cost wireless phase calibration that works on COTS RFID systems: poster.",
                    "GonioSense: a wearable-based range of motion sensing and measurement system for body joints: poster.",
                    "VALI - an SDN-based management framework for public wireless LANs: poster.",
                    "An infrastructureless and self-deployable indoor navigation approach using semantic signatures: poster.",
                    "ToneSense: communication across technologies through power-channel: poster.",
                    "Do open resources encourage entry into the millimeter wave cellular service market?: poster.",
                    "Enabling on-body transmissions with commodity devices: poster.",
                    "SEEM: simulation experimental environments for mobile applications in MANETs: poster.",
                    "Cell tower extension through drones: poster.",
                    "EasyGuard: enhanced context-aware adaptive access control system for android platform: poster.",
                    "Harnessing spectrum awareness to enhance mobile computing: poster.",
                    "A transfer kernel learning based strategy for adaptive localization in dynamic indoor environments: poster.",
                    "MSN: a mobility-enhanced satellite network architecture: poster.",
                    "Cross-layer MAC/PHY protocol to support IoT traffic in 5G: poster.",
                    "CSI feedback reduction by checking its validity period: poster.",
                    "Robust respiration monitoring using low-cost doppler sensor and wireless network: poster.",
                    "Preserving incumbent users' privacy in exclusion-zone-based spectrum access systems: poster.",
                    "Network analysis of the steam in-home streaming game system: poster.",
                    "Passive sensor tags: demo.",
                    "Towards customer trouble tickets resolution automation in large cellular services: demo.",
                    "LiTell: indoor localization using unmodified light fixtures: demo.",
                    "Tracking orientation of batteryless internet-of-things using RFID tags: demo.",
                    "OpenMili: a 60 GHz software radio with a programmable phased-array antenna: demo.",
                    "Making sense of mechanical vibration with COTS RFID systems: demo.",
                    "Repeatable mobile networking research with phantomNet: demo.",
                    "High-precision acoustic motion tracking: demo.",
                    "Real-time hidden acoustic signal capture with smartphones: demo.",
                    "The darklight rises: visible light communication in the dark: demo.",
                    "Device-free gesture tracking using acoustic signals: demo.",
                    "FMNC - rapid and accurate wifi characterization: demo.",
                    "A framework for collaborative sensing and processing of mobile data streams: demo.",
                    "In-device, runtime cellular network information extraction and analysis: demo.",
                    "Acacia - context-aware edge computing for continuous interactive applications over mobile networks: demo.",
                    "VibKeyboard: virtual keyboard leveraging physical vibration: demo.",
                    "HearHere: smartphone based audio localization using time difference of arrival: demo.",
                    "WiART - visualize and interact with wireless networks using augmented reality: demo.",
                    "GENI wireless testbed: a flexible open ecosystem for wireless communications research: demo.",
                    "JoyTag: a battery-less videogame controller exploiting RFID backscattering: demo."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2016",
                "sub_name": "Proceedings of the Workshop on Mobility in the Evolving Internet Architecture, MobiArch 2016, New York City, NY, USA, October 3-7, 2016.",
                "count": 7,
                "papers": [
                    "Keyword-based mobile application sharing.",
                    "LegoFi the wifi building blocks!: the case for a modular wifi architecture.",
                    "MEC architectural implications for LTE/LTE-A networks.",
                    "Decentralized broadcast-based scheduling for dense multi-hop TSCH networks.",
                    "Smooth DASH adaptation exploiting throughput prediction.",
                    "Experimental evaluation of an SDN-based distributed mobility management solution.",
                    "DECODE: DisruptivE COntent DissEmination with or without infrastructure, it syncs."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016atc",
                "sub_name": "Proceedings of the 6th Workshop on All Things Cellular - Operations, Applications and Challenges, AllThingsCellular@MobiCom 2016, New York City, New York, USA, October 3-7, 2016.",
                "count": 8,
                "papers": [
                    "Optimizing 360 video delivery over cellular networks.",
                    "When should we surf the mobile web using both wifi and cellular?",
                    "MULTEX: multiple PDN connections in LTE and beyond for enhanced routing and services.",
                    "When smartphones become the enemy: unveiling mobile apps anomalies through clustering techniques.",
                    "OWL: a reliable online watcher for LTE control channel measurements.",
                    "Millimeter wave wireless communications: new results for rural connectivity.",
                    "M2M wake-ups over cellular networks: over-the-top SIP.",
                    "LTE-Xtend: scalable support of M2M devices in cellular packet core."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016hotwireless",
                "sub_name": "Proceedings of the 3rd Workshop on Hot Topics in Wireless, HotWireless@MobiCom 2016, New York City, New York, USA, October 3-7, 2016.",
                "count": 18,
                "papers": [
                    "Bringing differential GPS to drones.",
                    "SkyEyes: adaptive video streaming from UAVs.",
                    "Benchmarking resource usage for spectrum sensing on commodity mobile devices.",
                    "No time at all: opportunity cost of Android permissions (invited paper).",
                    "RSS step size: 1 dB is not enough!",
                    "Passive wi-fi and interscatter.",
                    "Augmenting IoT networks with backscatter-enabled passive sensor tags.",
                    "Full-duplex wireless: algorithms and rate improvement bounds for integrated circuit implementations.",
                    "CAP on mobility control for 4G LTE networks.",
                    "Ultra-wideband and indoor localization.",
                    "xD-track: leveraging multi-dimensional information for passive wi-fi tracking.",
                    "Decimeter level passive tracking with wifi.",
                    "Vision-track: vision based indoor tracking in anchor-free regions.",
                    "Toward immersive mobile virtual reality.",
                    "Wireless wearables for virtual and augmented reality.",
                    "WiHaul: max-min fair wireless backhauling over multi-hop millimetre-wave links.",
                    "RadMAC: radar-enabled link obstruction avoidance for agile mm-wave beamsteering.",
                    "Design and experimental demonstration of mirror-aided non-imaging receiver for indoor MIMO-VLC systems."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016wintech",
                "sub_name": "Proceedings of the Tenth ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation, and Characterization, WiNTECH@MobiCom 2016, New York City, New York, USA, October 3-7, 2016.",
                "count": 20,
                "papers": [
                    "Reproducibility in wireless experimentation: need, challenges, and approaches.",
                    "Demystifying low-power wide-area communications for city IoT applications.",
                    "Practical lower layer 60 GHz measurements using commercial off-the-shelf hardware.",
                    "Evaluating 802.11ac features in indoor WLAN: an empirical study of performance and fairness.",
                    "srsLTE: an open-source platform for LTE evolution and experimentation.",
                    "LTE/Wi-Fi co-existence under scrutiny: an empirical study.",
                    "Experimental evaluation of multi-path schedulers for LTE/Wi-Fi devices.",
                    "Topology realization using gain control for wireless testbeds.",
                    "Enabling synchronous directional channel access on SDRs for spectrum sharing applications.",
                    "Automating 3D wireless measurements with drones.",
                    "CRC: collaborative research and teaching testbed for wireless communications and networks.",
                    "Enhancing indoor spatial reuse through adaptive antenna beamsteering: demo.",
                    "Radar-enhanced mm-wave agile beamsteering: demo.",
                    "MONROE, a distributed platform to measure and assess mobile broadband networks: demo.",
                    "The EmPOWER mobile network operating system: demo.",
                    "MAC learning: enabling automatic combination of elementary protocol components: demo.",
                    "D-LiTE-ful: an evaluation platform for DASH QoE for SDN-enabled ISP offloading in LTE: demo.",
                    "UB-ANC emulator: an emulation framework for multi-agent drone networks: demo.",
                    "UB-ANC: a flexible airborne networking and communications testbed: poster.",
                    "Pilot deployment of early warning system for landslides in eastern himalayas: poster."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016vlcs",
                "sub_name": "Proceedings of the 3rd Workshop on Visible Light Communication Systems, VLCS@MobiCom 2016, New York City, NY, USA, October 3-7, 2016.",
                "count": 15,
                "papers": [
                    "Clipping noise cancellation based on compressed sensing for visible light communication.",
                    "1: Occupancy and activity estimation using reflected encoded illumination.",
                    "Using smartphones as continuous receivers in a visible light communication system.",
                    "modBulb: a modular light bulb for visible light communication.",
                    "Unleashing the power of LED-to-camera communications for IoT devices.",
                    "Optimal multi-element VLC bulb design with power and lighting quality constraints.",
                    "modBulb: a modular light bulb for visible light communication.",
                    "Opportunities and pitfalls in securing visible light communication on the physical layer.",
                    "Diversity combining and piezoelectric beam steering for multi-element VLC networks.",
                    "PLiFi: hybrid wifi-VLC networking using power lines.",
                    "High-speed mobile networking through hybrid mmWave-camera communications.",
                    "Visible light based activity sensing using ceiling photosensors.",
                    "Towards a visible light network architecture for continuous communication and localization.",
                    "Unleashing the power of LED-to-camera communications for IoT devices.",
                    "Using smartphones as continuous receivers in a visible light communication system."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016carsys",
                "sub_name": "Proceedings of the First ACM International Workshop on Smart, Autonomous, and Connected Vehicular Systems and Services, CarSys@MobiCom 2016, New York City, NY, USA, October 3-7, 2016.",
                "count": 13,
                "papers": [
                    "IEEE802.11p in fast fading scenarios: from traces to comparative studies of receive algorithms.",
                    "Automotive radar and communications sharing of the 79-GHz band.",
                    "Towards safer texting while driving through stop time prediction.",
                    "Performance and channel load evaluation for contextual pedestrian-to-vehicle transmissions.",
                    "RoadMap: mapping vehicles to IP addresses using motion signatures.",
                    "Traffic shockwave mitigation with human-driven vehicles: is it feasible?",
                    "Connectivity-aware traffic phase scheduling for heterogeneously connected vehicles.",
                    "Achieving global fairness at urban intersections using cooperative DSRC congestion control.",
                    "Connected vehicles under named object architectures.",
                    "Soft-swipe: enabling high-accuracy pairing of vehicles to lanes using COTS technology.",
                    "Inter-vehicle communication assisted localization with resilience to false data injection attacks.",
                    "Comparison of radio frequency and visible light propagation channel for vehicular communications.",
                    "BTGuard: using Bluetooth to sense driver phone use."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016s3",
                "sub_name": "Proceedings of the Eighth Wireless of the Students, by the Students, and for the Students Workshop, S3@MobiCom 2016, New York City, NY, USA, October 7, 2016.",
                "count": 17,
                "papers": [
                    "Towards 7x improvement in battery life of mobile devices.",
                    "Edge computing in the extreme and its applications.",
                    "Real-time 3D robotic arm tracking in indoor environment by RF nonlinear backscattering.",
                    "A novel CSI pre-processing scheme for device-free localization indoors.",
                    "Bo-ear: unsupervised car sound sensing and tracking using microphones on smartphones.",
                    "Do open resources encourage entry into the millimeter wave cellular service market?",
                    "LAMEN: leveraging resources on anonymous mobile edge nodes.",
                    "Are 3rd parties slowing down the mobile web?",
                    "Maximizing the user's benefit in the mobile cloud computing.",
                    "Deep neural network for RFID-based activity recognition.",
                    "WiKiSpiro: non-contact respiration volume monitoring during sleep.",
                    "Fine-grained vital signs estimation using commercial wi-fi devices.",
                    "LIBS: a low-cost in-ear bioelectrical sensing solution for healthcare applications.",
                    "Minimizing energy consumption in transmit-only sensor networks via optimal placement of the cluster heads.",
                    "LocationSafe: granular location privacy for IoT devices.",
                    "A passive multi-channel synchronization solution for IoT.",
                    "Toward detection of unsafe driving with inertial head-mounted sensors."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2016smartobjects",
                "sub_name": "Proceedings of the 2nd Workshop on Experiences in the Design and Implementation of Smart Objects, SmartObjects@MobiCom 2016, New York City, NY, USA, October 3, 2016.",
                "count": 10,
                "papers": [
                    "A smart spa: having fun with physical activities.",
                    "Determining the relative position of vehicles considering bidirectional traffic scenarios in VANETS.",
                    "Cloud storage for mobile users using pre-positioned storage facilities.",
                    "Enhancing compressive sensing encryption in constrained devices using chaotic sequences.",
                    "RECKON: an analytics framework for app developers.",
                    "DataTweet for user-centric and geo-centric IoT communications.",
                    "Low-cost, low-power and long-range image sensor for visual surveillance.",
                    "Abstractions and solutions to support smart-objects in the future internet.",
                    "LuxLeak: capturing computing activity using smart device ambient light sensors.",
                    "Data-oriented abstraction of virtual sensors for energy-aware embedded software systems."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "21st MobiCom 2015",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2015",
                "sub_name": "Proceedings of the 21st Annual International Conference on Mobile Computing and Networking, MobiCom 2015, Paris, France, September 7-11, 2015.",
                "count": 84,
                "papers": [
                    "Agility and Fragility in a Real-time World.",
                    "Wireless Power Hotspot that Charges All of Your Devices.",
                    "Rethinking Energy-Performance Trade-Off in Mobile Web Page Loading.",
                    "Optimizing Smartphone Power Consumption through Dynamic Resolution Scaling.",
                    "Smartphone Background Activities in the Wild: Origin, Energy Drain, and Optimization.",
                    "Precise Power Delay Profiling with Commodity WiFi.",
                    "Understanding and Modeling of WiFi Signal Based Human Activity Recognition.",
                    "WiDraw: Enabling Hands-free Drawing in the Air on Commodity WiFi Devices.",
                    "Keystroke Recognition Using WiFi Signals.",
                    "Reusing 60GHz Radios for Mobile Radar Imaging.",
                    "mTrack: High-Precision Passive Tracking Using Millimeter Wave Radios.",
                    "Acoustic Eavesdropping through Wireless Vibrometry.",
                    "Snooping Keystrokes with mm-level Audio Ranging on a Single Phone.",
                    "MoLe: Motion Leaks through Smartwatch Sensors.",
                    "Demo: Platform for Collecting Data From Urban Sensors Using Vehicular Networking.",
                    "Demo: AntMonitor: A System for Mobile Traffic Monitoring and Real-Time Prevention of Privacy Leaks.",
                    "Demo: Car-Fi: Opportunistic V2I by Exploiting Dual-Access Wi-Fi Networks.",
                    "Demo: FIT IoT-LABA: Large Scale Open Experimental IoT Testbed.",
                    "Demo: OpenVLC1.0 Platform for Research in Visible Light Communication Networks.",
                    "Demo: An Open-source Software Defined Platform for Collaborative and Energy-aware WiFi Offloading.",
                    "Demo: Optimizing Smartphone Power Consumption through Dynamic Resolution Scaling.",
                    "Demo: Modular Multi-radio Wireless Sensor Platform for IoT Trials with Plug&Play Module Connection.",
                    "Demo: Wireless Link Selection on Smartphone: Throughput vs Battery Drain.",
                    "Demo: Closer to Cloud-RAN: RAN as a Service.",
                    "Demo: Witals, AP-centric Health Diagnosis of WiFiNetworks.",
                    "Demo: OneLab: Major Computer Networking Testbeds for IoT and Wireless Experimentation.",
                    "Demo: Molecular MIMO with Drift.",
                    "Demo: Exploring Autoregressive Integrated Models for Time Synchronization in Wireless Sensor Networks.",
                    "Demo: Abstract: Live Adaptations of Low-power MAC Protocols.",
                    "Demo: Implementation of Real-time WiFi Receiver in Ziria, Language for Rapid Prototyping of Wireless PHY.",
                    "Poster: Mobile Data Offloading Testbed.",
                    "Poster: Can Smart Devices Protect Us from Violent Crime?",
                    "Poster: Privacy-Preserving Server-Driven Dynamic Spectrum Access System.",
                    "Poster: On the Low-Cost and Distance-Adaptive Device-free Localization.",
                    "Poster: NLOS-aware Localization Based on Phase Shift Measurements.",
                    "Poster: 3D Printing Your Wireless Coverage.",
                    "Poster: Evaluating Android Applications with Multipath TCP.",
                    "Poster: Network-Based UE Mobility Estimation in Mobile Networks.",
                    "Poster: Extremely Parallel Resource Pre-Fetching for Energy Optimized Mobile Web Browsing.",
                    "Poster: VPN Tunnels for Energy Efficient Multimedia Streaming.",
                    "Poster: A Low Cost People Flow Monitoring System For Sensing The Potential Danger.",
                    "Poster: Unified RemoteU¡ for Mobile Environments.",
                    "Poster: Use your Senses: A Smooth Multipath TCP WiFi/Mobile Handover.",
                    "Poster: Towards Encrypted Query Processing for the Internet of Things.",
                    "Poster: Regression-based Characterization of 802.11ac Indoor Performance.",
                    "Poster: ParkMaster: Leveraging Edge Computing in Visual Analytics.",
                    "Poster: User Location Fingerprinting at Scale.",
                    "Poster: Understanding YouTube QoE in Cellular Networks with YoMoApp: A QoE Monitoring Tool for YouTube Mobile.",
                    "Poster: Continuous and Fine-grained Respiration Volume Monitoring Using Continuous Wave Radar.",
                    "Poster: Distributed Voronoi-based Acoustic Source Localization with Wireless Sensor Networks.",
                    "Poster: TRIM: A Truthful Incentive Mechanism for Dynamic and Heterogeneous Tasks in Mobile Crowdsensing.",
                    "Poster: A Multi-Drone Platform for Empowering Drones' Teamwork.",
                    "Poster: Visible Light Communication in the Dark.",
                    "Poster: Scoping Environment to Assist 60 GHz Link Deployment.",
                    "Poster: Crowdsourced Location Aware Wi-Fi Access Control.",
                    "Poster: An Insomnia Therapy for Clock Synchronization in Wireless Sensor Networks.",
                    "Research Challenges and Opportunities in a Mobility-centric World.",
                    "Recitation: Rehearsing Wireless Packet Reception in Software.",
                    "Hekaton: Efficient and Practical Large-Scale MIMO.",
                    "FreeBee: Cross-technology Communication via Free Side-channel.",
                    "Human Sensing Using Visible Light Communication.",
                    "Extending Mobile Interaction Through Near-Field Visible Light Sensing.",
                    "EcoDrive: A Mobile Sensing and Control System for Fuel Efficient Driving.",
                    "Kaleido: You Can Watch It But Cannot Record It.",
                    "CAreDroid: Adaptation Framework for Android Context-Aware Applications.",
                    "CIDER: Enabling Robustness-Power Tradeoffs on a Computational Eyeglass.",
                    "piStream: Physical Layer Informed Adaptive Video Streaming over LTE.",
                    "The Design and Implementation of a Wireless Video Surveillance System.",
                    "SAMPLES: Self Adaptive Mining of Persistent LExical Snippets for Classifying Mobile Application Traffic.",
                    "Performance Characterization and Call Reliability Diagnosis Support for Voice over LTE.",
                    "ABSENCE: Usage-based Failure Detection in Mobile Networks.",
                    "Experience: Rethinking RRC State Machine Optimization in Light of Recent Advancements.",
                    "European Research towards 5G.",
                    "See Through Walls with COTS RFID System!",
                    "Come and Be Served: Parallel Decoding for COTS RFID Tags.",
                    "Last-Mile Navigation Using Smartphones.",
                    "EchoTag: Accurate Infrastructure-Free Indoor Location Tagging with Smartphones.",
                    "ToneTrack: Leveraging Frequency-Agile Radios for Time-Based Indoor Wireless Localization.",
                    "Big Data, IoT, .... Buzz Words for Academia or Reality for Industry?",
                    "mZig: Enabling Multi-Packet Reception in ZigBee.",
                    "AirExpress: Enabling Seamless In-band Wireless Multi-hop Transmission.",
                    "Control Channel Design for Many-Antenna MU-MIMO.",
                    "QuickSync: Improving Synchronization Efficiency for Mobile Cloud Storage Services.",
                    "FlexiWeb: Network-Aware Compaction for Accelerating Mobile Web Transfers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2015",
                "sub_name": "Proceedings of the 10th International Workshop on Mobility in the Evolving Internet Architecture, MobiArch 2015, Paris, France, September 7, 2015.",
                "count": 12,
                "papers": [
                    "Virtualization Techniques for Redesigning Mobile Backhaul Networks: Challenges and Issues.",
                    "Mobile Data Offloading: An Experimental Evaluation.",
                    "Network Store: Exploring Slicing in Future 5G Networks.",
                    "sNDN: A Social-aware Named Data Framework for Cooperative Content Retrieval via D2D Communications.",
                    "Krowd: A Key-Value Store for Crowded Venues.",
                    "Splitting Control-User Plane on Communication Protocol for Spotty Network.",
                    "Future Communication Clouds.",
                    "Energy-efficient Position Tracking via Trajectory Modeling.",
                    "Prediction of User Mobility Pattern on a Network Traffic Analysis Platform.",
                    "A Base Station Workload-Aware Dynamic Pricing Scheme for Mobile Internet Access.",
                    "Towards an Architecture to Support Complex Multihomed Mobility Scenarios.",
                    "Mobile Multipath Data Transfer over Multirate Wi-Fi Links."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015hotplanet",
                "sub_name": "Proceedings of the 6th International Workshop on Hot Topics in Planet-Scale Measurement, HotPlanet@MobiCom 2015, Paris, France, September 7, 2015.",
                "count": 6,
                "papers": [
                    "Deriving Cellular Network Structure from Inferred Handovers in a Cellular Association Trace.",
                    "An Early Look at Multipath TCP Deployment in the Wild.",
                    "Mobile Data Network Analysis Platform.",
                    "L-Graph: A General Graph Analytic System on Continuous Computation.",
                    "Clustering Large Undirected Graphs on External Memory.",
                    "Modeling Social Interactions in Real Work Environments."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015hotwireless",
                "sub_name": "Proceedings of the 2nd International Workshop on Hot Topics in Wireless, HotWireless@MobiCom 2015, Paris, France, September 11, 2015.",
                "count": 10,
                "papers": [
                    "3D Printing Your Wireless Coverage.",
                    "A Little Sharing Goes a Long Way: The Case for Reciprocal Wifi Sharing.",
                    "ShiftFFT: An Efficient Approach to Mitigate Adjacent Channel Interference in OFDM Systems.",
                    "PolyPoint: Guiding Indoor Quadrotors with Ultra-Wideband Localization.",
                    "Ving: Bootstrapping the Desktop Area Network with a Vibratory Ping.",
                    "Systems For Spectrum Forensics.",
                    "Low-Cost, Flexible and Open Platform for Visible Light Communication Networks.",
                    "Autonomous Alignment of Free-Space-Optical Links Between UAVs.",
                    "THINK: Toward Practical General-Purpose Brain-Computer Communication.",
                    "Enabling Real-Time Collaborative Brain-Mobile Interactive Applications on Volunteer Mobile Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015mcs",
                "sub_name": "Proceedings of the 6th International Workshop on Mobile Cloud Computing and Services, MCS@MobiCom 2015, Paris, France, September 11, 2015.",
                "count": 7,
                "papers": [
                    "Enabling Vehicular Applications using Cloud Services through Adaptive Computation Offloading.",
                    "Cloudlet-based Large-scale 3D Reconstruction Using Real-time Data from Mobile Depth Cameras.",
                    "A Novel Hybrid Mobile Malware Detection System Integrating Anomaly Detection With Misuse Detection.",
                    "Vision: The Case for Symbiosis in the Internet of Things.",
                    "For Your Eyes Only.",
                    "Processing Radio Access Network Functions in the Cloud: Critical Issues and Modeling.",
                    "Vision: Augmenting WiFi Offloading with An Open-source Collaborative Platform."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015s3",
                "sub_name": "Proceedings of the 2015 Workshop on Wireless of the Students, by the Students, & for the Students, S3@MobiCom 2015, Paris, France, September 11, 2015.",
                "count": 24,
                "papers": [
                    "Network-Based UE Mobility Estimation in Mobile Networks.",
                    "Trustworthy Device Pairing for Opportunistic Device-to-Device Communications in Mobile Crowdsourcing Systems.",
                    "Multimodal Indoor Social Interaction Sensing and Real-time Feedback for Behavioural Intervention.",
                    "Poster: A Cell Biology Inspired Model for Controlling Redundant Rebroadcasts in Mobile Ad-hoc Networks.",
                    "Poster: Enabling Hands-free Drawing on WiFi Devices.",
                    "Poster: Krowd: A Key-Value Store for Crowded Venues.",
                    "Poster: Can Smart Devices Protect Us from Violent Crime?",
                    "Poster: On the Quest for Representative Mobile Datasets.",
                    "Poster: Wireless Power Hotspot that Charges All of Your Devices.",
                    "Poster: Realizing All-spectrum Cognitive Networking on a Software-defined Radio Testbed.",
                    "Poster: SoftNull: All-digital Massive MIMO Full-duplex Wireless.",
                    "Demo: Cloud-based Security as a Service for Smart IoT Environments.",
                    "Demo: Dynamic Neutralization of Data Leakages.",
                    "Demo: AntMonitor: Network Traffic Monitoring and Real-Time Prevention of Privacy Leaks in Mobile Devices.",
                    "Demo: On the Monitoring of YouTube QoE in Cellular Networks from End-devices.",
                    "Demo: mSync in Action.",
                    "AntMonitor: Network Traffic Monitoring and Real-Time Prevention of Privacy Leaks in Mobile Devices.",
                    "Guard Mounting: Reorganizations to Mitigate DDoS Attacks over Identity Providers Clustering.",
                    "Exploring Autoregressive Integrated Models for Time Synchronization in Wireless Sensor Networks.",
                    "Towards Ultra-low Power Wearable Health Sensing with Sparse Sampling and Asymmetric Communication.",
                    "Improving Connectivity, Coverage, and Capacity in 60 GHz Indoor WLANs Using Relays.",
                    "Live Adaptations of Low-power MAC Protocols.",
                    "On the Synergy between Nulling and Power Allocation in OFDM Systems.",
                    "A PS Queue Model for Lte Macrocells Taking into Account Mobility of Users."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015smartobjects",
                "sub_name": "Proceedings of the 1st International Workshop on Experiences with the Design and Implementation of Smart Objects, SmartObjects@MobiCom 2015, Paris, France, September 7, 2015.",
                "count": 12,
                "papers": [
                    "A Novel Smart Object-Driven UI Generation Approach for Mobile Devices in the Internet of Things.",
                    "Adaptive Drone Sensing with Always Return-To-Home Guaranteed.",
                    "SoundWrite: Text Input on Surfaces through Mobile Acoustic Sensing.",
                    "Two-Way Communication Protocol using Bluetooth Low Energy Advertisement Frames.",
                    "Poster: Revocation in VANETs Based on k-ary Huffman Trees.",
                    "Poster: Indoor Location System for Vehicles.",
                    "Poster: Activity-Based Access Control for IoT.",
                    "Needle in a Haystack: Limiting the Search Space in Mission-aware Packet Forwarding for Drones.",
                    "Management and Coordination Framework for Aerial-Terrestrial Smart Drone Networks.",
                    "mumble: Framework for Seamless Message Transfer on Smartphones.",
                    "ETTAF: Efficient Target Tracking and Filming with a Flying Ad Hoc Network.",
                    "Accurate Device-Free Localization with Little Human Cost."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015srif",
                "sub_name": "Proceedings of the 2015 Workshop on Software Radio Implementation Forum, SRIF@MobiCom 2015, Paris, France, September 7, 2015.",
                "count": 11,
                "papers": [
                    "Demo: A Software Defined Radio Platform for Rapid Cross-Layer Prototyping.",
                    "Demo: Spectrum-Agile mm-Wave Packet Radio Implementation on USRPs.",
                    "Demo: IIO Blocks for GNU Radio.",
                    "Demo: ROCH: Software-defined Radio Toolbox for Experimental Evaluation of All-spectrum Cognitive Networking.",
                    "Poster: mSync - Frames without Preambles.",
                    "Enhancing GNU Radio with Heterogeneous Computing.",
                    "Poster: Push the Limit of Cross Technology Coexistence.",
                    "Controlled Interference Generation for Wireless Coexistence Research.",
                    "Architecture-Based Software Designs for SDR's.",
                    "Maximizing GPU Exploitation for SDR with GPUDirect.",
                    "Software-Defined Radio for Power Line Communication Research and Development."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2015vlcs",
                "sub_name": "Proceedings of the 2nd International Workshop on Visible Light Communications Systems, VLCS@MobiCom 2015, Paris, France, September 11, 2015.",
                "count": 8,
                "papers": [
                    "The Future of Wireless Light Communication.",
                    "Linux Light Bulbs: Enabling Internet Protocol Connectivity for Light Bulb Networks.",
                    "The Spy Next Door: Eavesdropping on High Throughput Visible Light Communications.",
                    "Joint Illumination-Communication Optimization in Visible Light Communication.",
                    "A Multi-Element VLC Architecture for High Spatial Reuse.",
                    "On Limited Feedback Resource Allocation for Visible Light Communication Networks.",
                    "LiBeamScanner: Accurate Indoor Positioning with Sweeping Light Beam.",
                    "Visible Light Knows Who You Are."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "20th MobiCom 2014",
        "info": "Maui, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2014",
                "sub_name": "The 20th Annual International Conference on Mobile Computing and Networking, MobiCom'14, Maui, HI, USA, September 7-11, 2014.",
                "count": 90,
                "papers": [
                    "From grad school, to startup to acquisition.",
                    "Tackling societal grand challenges using mobile computing.",
                    "Demystifying 60GHz outdoor picocells.",
                    "A vehicle-based measurement framework for enhancing whitespace spectrum databases.",
                    "The case for UHF-band MU-MIMO.",
                    "Enhancing reliability to boost the throughput over screen-camera links.",
                    "The future of mobile computing.",
                    "Full-duplex without strings: enabling full-duplex with half-duplex clients.",
                    "Enabling instantaneous feedback with full-duplex backscatter.",
                    "Strata: layered coding for scalable visual communication.",
                    "It starts with iGaze: visual attention driven networking with smart glasses.",
                    "Wireless barcodes for tagging infrastructure.",
                    "Enabling physical analytics in retail stores using smart glasses.",
                    "Some of my simple results.",
                    "Enfold: downclocking OFDM in WiFi.",
                    "Combating inter-cell interference in 802.11ac-based multi-user MIMO networks.",
                    "Phaser: enabling phased array signal processing on commodity WiFi access points.",
                    "BBN: throughput scaling in dense enterprise WLANs with Bind Beamforming and Nulling.",
                    "Discovering fine-grained RRC state dynamics and performance impacts in cellular networks.",
                    "A practical traffic management system for integrated LTE-WiFi networks.",
                    "Exploring human mobility with multi-source data at extremely large metropolitan scales.",
                    "Modeling web quality-of-experience on cellular networks.",
                    "Where are you from?: confusing location distinction using virtual multipath camouflage.",
                    "Tagoram: real-time tracking of mobile RFID tags to high precision using COTS devices.",
                    "Jigsaw: indoor floor plan reconstruction via mobile crowdsensing.",
                    "Demo: real-time breath monitoring using wireless signals.",
                    "Demo: PhoneLets: offloading the phone off your phone for energy, cost and network load optimization.",
                    "Demo: mobile opportunistic system for experience sharing (MOSES) in indoor exhibitions.",
                    "Demo: tracking user browsing on a demo floor.",
                    "Demo: an open-source development platform for long-range UHF-connected wifi hotspots.",
                    "Demo: real-time MU-MIMO channel analysis with a custom 802.11 implementation.",
                    "Demo: ShadowMaps, the urban phone tracking system.",
                    "Demo: simulating the impact of communication performance on road traffic safety at intersections.",
                    "Demo: co-primary spectrum sharing with inter-operator D2D trial.",
                    "Demo: enabling AGILE spectrum adaptation in commercial 802.11 WLAN deployments.",
                    "Demo: Luxapose: indoor positioning with mobile phones and visible light.",
                    "Demo: a cognitive solution for commercial wireless conferencing system.",
                    "Demo: OpenAirInterface: an open LTE network in a PC.",
                    "Demo: TV white space networking capabilities and potential with an embedded & open-API platform.",
                    "Demo: software defined radio: on a smartphone, as an app!",
                    "Demo: rollinglight - universal camera communications for single led.",
                    "Demo: a robust barcode system for data transmissions over screen-camera links.",
                    "Demo: high-precision RFID tracking using COTS devies.",
                    "Demo: visual attention driven networking with smart glasses.",
                    "Demo: instant phone attitude estimation and its applications.",
                    "Poster: clock synchronization for distributed wireless protocols at the physical layer.",
                    "Poster: geometrical distance distribution for modeling performance metrics in wireless communication networks.",
                    "Poster: overheard ACK with token passing: an optimization to 802.11 MAC protocol.",
                    "Poster: in-lane communication framework using smartphone's inertial sensors.",
                    "Poster: a coarse-fine corner detection approach for two-dimensional barcode decoding.",
                    "Poster: detection of transportation mode based on smartphones for reducing distracted driving.",
                    "Poster: Ziria: language for rapid prototyping of wireless PHY.",
                    "Poster - SAfeDJ community: situation-aware in-car music delivery for safe driving.",
                    "Poster: a framework for instant mobile web browsing with smart prefetching and caching.",
                    "Poster: adaptive flow control for wireless serial bus using wi-fi transmission opportunity.",
                    "Poster: SensingKit: a multi-platform mobile sensing framework for large-scale experiments.",
                    "Poster: locating RFID tags by rotation.",
                    "Poster: HiLight: hiding bits in pixel translucency changes.",
                    "Poster: retrofitting computer vision libraries for concurrent support on mobile devices.",
                    "Poster: AirEye: blind monitor the ISM band using narrowband radio.",
                    "Poster: promoting the spatial reuse of millimeter wave networks via software-defined cross-layer design.",
                    "Poster: Are you driving?: non-intrusive driver detection using built-in smartphone sensors.",
                    "Poster: am i indoor or outdoor?",
                    "Poster: styrofoam: a tightly packed coding scheme for camera-based visible light communication.",
                    "Poster: hearing your breathing: fine-grained sleep monitoring using smartphones.",
                    "Poster: programming software-defined wireless networks.",
                    "Poster: ColPhone: a smartphone is just a piece of the puzzle.",
                    "Poster: come closer: proximity-based authentication for the internet of things.",
                    "Poster: cognitive networking in a self-powered wireless sensor network testbed.",
                    "Poster - SEA-OR: spectrum and energy aware opportunistic routing for self-powered wireless sensor networks.",
                    "Poster: detecting client mobility in WLANs using PHY layer information.",
                    "Poster: SaveAlert: an efficient and scalable sensor-driven danger detection system.",
                    "Poster: doppler effect based device-free moving object localization.",
                    "Applying the lessons learnt for navigating the future: a conversation with the pioneers.",
                    "Luxapose: indoor positioning with mobile phones and visible light.",
                    "Experiencing and handling the diversity in data density and environmental locality in an indoor positioning service.",
                    "Travi-Navi: self-deployable indoor navigation system.",
                    "Accurate indoor localization with zero start-up cost.",
                    "Magnetic MIMO: how to charge your phone in your pocket.",
                    "Itus: an implicit authentication framework for android.",
                    "Caiipa: automated large-scale mobile app testing through contextual fuzzing.",
                    "Rethink energy accounting with cooperative game theory.",
                    "BYOzzzz: focusing on the unsolved challenges in mobility, an industry perspective.",
                    "Robust network compressive sensing.",
                    "EkhoNet: high speed ultra low-power backscatter for next generation sensors.",
                    "A case for enhancing dual radio repeater performance through striping, aggregation, and channel sharing.",
                    "Cutting the cord: a robust wireless facilities network for data centers.",
                    "We can hear you with Wi-Fi!",
                    "Use it free: instantly knowing your phone attitude.",
                    "E-eyes: device-free location-oriented activity identification using fine-grained WiFi signatures."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2014",
                "sub_name": "Proceedings of the 9th ACM Workshop on Mobility in the Evolving Internet Architecture, MobiArch 2014, Maui, HI, USA, September 11, 2014.",
                "count": 11,
                "papers": [
                    "IP-layer soft handoff implementation in ILNP.",
                    "A policy-driven approach to access control in future internet name resolution services.",
                    "SDN-based mobile networking for cellular operators.",
                    "LISP-ROAM: network-based host mobility with LISP.",
                    "ViFi: virtualizing WLAN using commodity hardware.",
                    "COAP: a software-defined approach for home WLAN management through an open API.",
                    "Per-user policy enforcement on mobile apps through network functions virtualization.",
                    "ParaDrop: a multi-tenant platform to dynamically install third party services on wireless gateways.",
                    "Enhancing compact routing in CCN with prefix embedding and topology-aware hashing.",
                    "Interest-aware implicit multicast (iCast): opportunistic mobile data dissemination without per-group management.",
                    "R-iCDN: an approach supporting flexible content routing for ISP-operated CDN."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2014hotwireless",
                "sub_name": "Proceedings of the 1st ACM workshop on Hot topics in wireless, HotWireless 2014, Maui, HI, USA, September 11, 2014.",
                "count": 10,
                "papers": [
                    "In-band wireless cut-through: is it possible?",
                    "Backing out of linear backoff in wireless networks.",
                    "Leveraging interleaved signal edges for concurrent backscatter.",
                    "Harmonia: wideband spreading for accurate indoor rf localization.",
                    "Towards commoditized real-time spectrum monitoring.",
                    "Using your smartphone to detect and map heterogeneous networks and devices in the home.",
                    "Shape matters, not the size: a new approach to extract secrets from channel.",
                    "Synchronicity: pushing the envelope of fine-grained localization with distributed mimo.",
                    "Your AP knows how you move: fine-grained device motion recognition through WiFi.",
                    "Visible light networking and sensing."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2014wintech",
                "sub_name": "Proceedings of the 9th ACM international workshop on Wireless network testbeds, experimental evaluation and characterization, WiNTECH '14, Maui, Hawaii, USA, September 7, 2014.",
                "count": 14,
                "papers": [
                    "BeHop: a testbed for dense WiFi networks.",
                    "A framework for remote automation, configuration, and monitoring of real-world experiments.",
                    "Comparisons of high performance software radios with size, weight, area and power constraints.",
                    "Towards a characterization of white spaces databases errors: an empirical study.",
                    "Online assessment of sensing performance in experimental spectrum sensing platforms.",
                    "Potential pitfalls of the message in message mechanism in modern 802.11 networks.",
                    "Understanding the impact of cross technology interference on IEEE 802.15.4.",
                    "Timings matter: standard compliant ieee 802.11 channel access for a fully software-based SDR architecture.",
                    "System architecture for delay tolerant media distribution for rural south africa.",
                    "Implementation and evaluation of a flexible, load-adaptive link layer protocol.",
                    "Demo: co-primary spectrum sharing with inter-operator D2D trial.",
                    "Demo: a testbed to evaluate frequency-hopping anti-jamming techniques in ieee 802.11.",
                    "Demo: unconventional WiFi-ZigBee communications without gateways.",
                    "Demo: LabVIEW based framework for prototyping dense LTE networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2014s3",
                "sub_name": "Proceedings of the 6th annual workshop on Wireless of the students, by the students, for the students, S3@MobiCom 2014, Maui, Hawaii, USA, September 7, 2014.",
                "count": 9,
                "papers": [
                    "RF-IDraw: virtual touch screen in the air using RF signals.",
                    "Using crowdsourced satellite SNR measurements for 3D mapping and real-time GNSS positioning improvement.",
                    "Overheard ACK with token passing: an optimization to 802.11 MAC protocol.",
                    "D-BigBand: sensing GHZ-wide non-sparse spectrum on commodity radios.",
                    "Understanding RRC state dynamics through client measurements with mobilyzer.",
                    "Assessing the impact of inter-vehicle communication protocols on road traffic safety.",
                    "CMSAS: a concept of middleware architecture to integrate heterogeneous sensor networks and actuators.",
                    "LTE radio analytics made easy and accessible.",
                    "Smart spectrum access algorithms in mobile TV white space networks for utility maximization."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2014spme",
                "sub_name": "Proceedings of the ACM MobiCom Workshop on Security and Privacy in Mobile Environments, SPME@MobiCom 2014, Maui, Hawaii, USA, September 11, 2014.",
                "count": 7,
                "papers": [
                    "Your installed apps reveal your gender and more!",
                    "Brave new world: privacy risks for mobile users.",
                    "RecDroid: a resource access permission control portal and recommendation service for smartphone users.",
                    "Proximity-based wireless access control through considerate jamming.",
                    "Collaborative privacy management: mobile privacy beyond your own devices.",
                    "A fuzzy commitment approach to privacy preserving behavioral targeting.",
                    "Strengthening data privacy during propagation."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2014vlcs",
                "sub_name": "Proceedings of the 1st ACM MobiCom workshop on Visible light communication systems, VLCS@MobiCom 2014, Maui, Hawaii, USA, September 7, 2014.",
                "count": 9,
                "papers": [
                    "The future of VLC: potential and limitations.",
                    "System architecture directions for a software-defined lighting infrastructure.",
                    "Using consumer LED light bulbs for low-cost visible light communication systems.",
                    "OpenVLC: software-defined visible light embedded networks.",
                    "Scalable imaging VLC receivers with token-based pixel selection for spatial multiplexing.",
                    "Styrofoam: a tightly packed coding scheme for camera-based visible light communication.",
                    "Hybrid visible light communication for cameras and low-power embedded devices.",
                    "Do not share!: invisible light beacons for signaling preferences to privacy-respecting cameras.",
                    "HiLight: hiding bits in pixel translucency changes."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "19th MobiCom 2013",
        "info": "Miami, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2013",
                "sub_name": "The 19th Annual International Conference on Mobile Computing and Networking, MobiCom'13, Miami, FL, USA, September 30 - October 04, 2013.",
                "count": 67,
                "papers": [
                    "The evolution of mobility and wireless technologies in the age of the internet of things.",
                    "RF-compass: robot object manipulation using RFIDs.",
                    "LightSync: unsynchronized visual communication over screen-camera links.",
                    "Whole-home gesture recognition using wireless signals.",
                    "Secure unlocking of mobile touch screen devices by simple gestures: you can see it but you can not do it.",
                    "CorLayer: a transparent link correlation layer for energy efficient broadcast.",
                    "Coordinating cellular background transfers using loadsense.",
                    "ParkSense: a smartphone based sensing system for on-street parking.",
                    "How voice calls affect data in operational LTE networks.",
                    "FluidNet: a flexible cloud-based radio access network for small cells.",
                    "Last call for the buffet: economics of cellular networks.",
                    "Network coding for content-based intermittently connected emergency networks.",
                    "Adaptive video streaming for device-to-device mobile platforms.",
                    "A lane-level cooperative collision avoidance system based on vehicular sensor networks.",
                    "Secure M2M cloud testbed.",
                    "PiCode: 2D barcode with embedded picture and ViCode: 3D barcode with embedded video.",
                    "Flexible array of inexpensive radios.",
                    "OverDrive: an overlay-based geocast service for smart traffic applications.",
                    "v(t) CSMA: a link scheduling algorithm in wireless networks with improved delay characteristics.",
                    "Mobile network performance evaluation using the radio frequency network channel emulation simulation tool(RFnest™).",
                    "Decoding IEEE 802.11a/g/p OFDM in software using GNU radio.",
                    "ArgosV2: a flexible many-antenna research platform.",
                    "Online evaluation of sensing characteristics for radio platforms in the CREW federated testbed.",
                    "NTMobile: new end-to-end communication architecture in IPv4 and IPv6 networks.",
                    "BEEINFO: data forwarding based on interest and swarm intelligence for socially-aware networking.",
                    "CRESCENT: a modular cost-efficient open-access testbed for cognitive radio networks routing protocols.",
                    "OpenRoutes: augmenting backhaul network survivability with reduced redundancy- a topology based analysis.",
                    "SilentSense: silent user identification via touch and movement behavioral biometrics.",
                    "Participant recruitment and data collection framework for opportunistic sensing: a comparative analysis.",
                    "SmartLoc: push the limit of the inertial sensor based metropolitan localization using smartphone.",
                    "You're driving and texting: detecting drivers using personal smart phones by leveraging inertial sensors.",
                    "Making the case for computational offloading in mobile device clouds.",
                    "Toward preserving privacy and functionality in geosocial networks.",
                    "Spaceify: a client-edge-server ecosystem for mobile computing in smart spaces.",
                    "Reducing power consumption of IEEE802.11 stations in flexible multicast services.",
                    "Demand-based location dependent data dissemination in VANETs.",
                    "SpyLoc: a light weight localization system for smartphones.",
                    "Concurrent-MAC: increasing concurrent transmissions in multi-AP wireless lans.",
                    "How long are you staying?: predicting residence time from human mobility traces.",
                    "Measuring human queues using WiFi signals.",
                    "T-Mobile QoE lab: making mobile browsing faster and open research problems.",
                    "Comparing wireless network usage: laptop vs smart-phones.",
                    "Radio environment mapping with mobile devices in the TV white space.",
                    "V-scope: an opportunistic wardriving approach to augmenting TV whitespace databases.",
                    "Exploring indoor white spaces in metropolises.",
                    "CSpy: finding the best quality channel without probing.",
                    "Interference alignment by motion.",
                    "Understanding RFID counting protocols.",
                    "Optimal throughput and delay in delay-tolerant networks with ballistic mobility.",
                    "Exploring the potential in practice for opportunistic networks amongst smart mobile devices.",
                    "Fine-grained spectrum adaptation in WiFi networks.",
                    "Observing home wireless experience through WiFi APs.",
                    "Symphony: cooperative packet recovery over the wired backbone in enterprise WLANs.",
                    "Power and thermal challenges in mobile devices.",
                    "Towards a virtual cellular network with variable grade spectrum: challenges and opportunities.",
                    "Indoor localization: ready for primetime?",
                    "Using crowd-sourced viewing statistics to save energy in wireless video streaming.",
                    "A scheduling framework for adaptive video delivery over cellular networks.",
                    "An information-aware QoE-centric mobile video cache.",
                    "Panel: the evolution of wireless video - technology and applications.",
                    "Indexing the real world: sensing, big data and mobility.",
                    "SafeSlinger: easy-to-use and secure public-key exchange.",
                    "Creating secrets out of erasures.",
                    "SecureArray: improving wifi security with fine-grained physical-layer information.",
                    "NEMOx: scalable network MIMO for wireless networks.",
                    "ZIMO: building cross-technology MIMO to harmonize zigbee smog with WiFi flash without intervention.",
                    "Adaptive feedback compression for MIMO networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2013",
                "sub_name": "Proceedings of the Eighth ACM International Workshop on Mobility in the Evolving Internet Architecture, MobiArch 2013, Miami, FL, USA, October 4, 2013.",
                "count": 10,
                "papers": [
                    "Meeting the needs of growing traffic: challenge for cellular wireless networks.",
                    "Cloud-driven architectures for next generation small cell networks.",
                    "Network service abstractions for a mobility-centric future internet architecture.",
                    "MOCA: a lightweight mobile cloud offloading architecture.",
                    "PacketCloud: an open platform for elastic in-network services.",
                    "Characterize energy impact of concurrent network-intensive applications on mobile platforms.",
                    "Preempting state promotions to improve application performance in mobilebroadband networks.",
                    "Bundling frames to save energy while streaming video from LTE mobile device.",
                    "Go this way: navigation for better access quality in mobile networks.",
                    "Towards providing security for mobile games."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2013wintech",
                "sub_name": "Proceedings of the 8th ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation & Characterization, WiNTECH 2013, Miami, Florida, USA, September 30, 2013.",
                "count": 19,
                "papers": [
                    "One size hardly fits all: towards context-specific wireless MAC protocol deployment.",
                    "Enhancing the performance of random access MAC protocols for low-cost SDRs.",
                    "Implementation of a protocol for cooperative packet recovery over hybrid networks.",
                    "From ground to aerial communication: dissecting WLAN 802.11n for the drones.",
                    "MASERATI: mobile adaptive streaming based on environmental and contextual information.",
                    "Using IF-scale delays to emulate the effects of site-specific multipath in a digital wireless channel emulator.",
                    "Bit error distribution and mutation patterns of corrupted packets in low-power wireless networks.",
                    "Evaluating perceptual video quality for mobile clients in 802.11n WLAN.",
                    "Fingerprinting channel dynamics in indoor low-power wireless networks.",
                    "Online energy consumption monitoring of wireless testbed infrastructure through the NITOS EMF framework.",
                    "Characterizing WiFi connection and its impact on mobile users: practical insights.",
                    "Online energy consumption monitoring of wireless testbed infrastructure through the NITOS EMF framework.",
                    "UAV networks in rescue missions.",
                    "Enabling mobile sensing through a DTN framework.",
                    "Enabling cognitive-radio paradigm on commercial off-the-shelf 802.11 hardware.",
                    "WiFi centric power modeling of smartphones.",
                    "Time synchronization and localization for underwater acoustic sensor networks with the SUNSET framework.",
                    "Power-boosting residential wired broadband.",
                    "Using ORBIT for evaluating wireless content-centric network transport."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2013crab",
                "sub_name": "Proceedings of the 1st ACM workshop on Cognitive radio architectures for broadband, CRAB@MobiCom 2013, Miami, Florida, USA, October 4, 2013.",
                "count": 11,
                "papers": [
                    "Cognitive radios and the vehicular cloud.",
                    "On the cascading spectrum contention problem in self-coexistence of cognitive radio networks.",
                    "A resource allocation algorithm for users with multiple applications in 4G-LTE.",
                    "Truthful multi-attribute auction with discriminatory pricing in cognitive radio networks.",
                    "Push the limit of wireless network capacity: a tale of cognitive and coexistence.",
                    "Advanced cognitive radio test-bed with carrier aggregation in TV white space.",
                    "Spread spectrum based cooperative communication transceiver on FPGA platform.",
                    "The cognitive in cognitive radio.",
                    "Energy efficiency impact of cognitive femtocells in heterogeneous wireless networks.",
                    "Multiple description coding for uncompressed video streaming over 60GHz networks.",
                    "Primary weight measure and its support in stochastic routing for dynamic cognitive radio networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2013lcdnet",
                "sub_name": "Proceedings of the 2013 ACM MobiCom workshop on Lowest cost denominator networking for universal access, LCDNet@MobiCom 2013, Miami, Florida, USA, September 30, 2013.",
                "count": 11,
                "papers": [
                    "The challenge of deployment.",
                    "Binder: a system to aggregate multiple internet gateways in community networks.",
                    "How much can we carry?: a capacity analysis of delay tolerant networking in developing countries.",
                    "Raabta: low-cost video conferencing for the developing world.",
                    "CARPOOL: extending free internet access over DTN in urban environment.",
                    "SocialDTN: a DTN implementation for digital and social inclusion.",
                    "Providing security for wireless community networks.",
                    "Nanosatellites for universal network access.",
                    "Filling the gaps of unused capacity through a fountain coded dissemination of information.",
                    "Traffic shaping for enabling less-than-best effort services at the edges of broadband connections.",
                    "On the trade-off between spectrum efficiency with dedicated access and short end-to-end transmission delays with random access in DVB-RCS2."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2013misenet",
                "sub_name": "Proceedings of the 2nd ACM annual international workshop on Mission-oriented wireless sensor networking, MiSeNet@MobiCom 2013, Miami, Florida, USA, October 4, 2013.",
                "count": 9,
                "papers": [
                    "On optimal scheduling of collaborative mobilechargers in wireless sensor networks.",
                    "Modeling and analysis of bi-connected minimum energypath preserving graphs for wireless multi-hop networks.",
                    "Queuing modeling for delay analysis in mission oriented sensor networks under the protocol interference model.",
                    "Catching up with traffic lights for data delivery in vehicular ad hoc networks.",
                    "Total variation regularization for training of indoor location fingerprints.",
                    "A framework for assessing the quality of event detection in sensor networks.",
                    "Human-machine conversations to support mission-oriented information provision.",
                    "SensorChecker: reachability verification in mission-oriented sensor networks.",
                    "Toward aggregating time-discounted information."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "18th MobiCom 2012",
        "info": "Istanbul, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2012",
                "sub_name": "The 18th Annual International Conference on Mobile Computing and Networking, Mobicom'12, Istanbul, Turkey, August 22-26, 2012.",
                "count": 55,
                "papers": [
                    "Nanonetworks: a new frontier in communications.",
                    "Three theories for delays, clocks and security in wireless networks.",
                    "AutoMAC: rateless wireless concurrent medium access.",
                    "No symbol left behind: a link-layer protocol for rateless codes.",
                    "Rate adaptation for 802.11 multiuser mimo networks.",
                    "Achieving high data rates in a distributed MIMO system.",
                    "Argos: practical many-antenna base stations.",
                    "802.11ec: collision avoidance without control messages.",
                    "SimpleMAC: a jamming-resilient MAC-layer protocol for wireless channel coordination.",
                    "Frame retransmissions considered harmful: improving spectrum efficiency using Micro-ACKs.",
                    "RadioJockey: mining program execution to optimize cellular radio usage.",
                    "Can we pay for what we get in 3G data access?",
                    "CloudIQ: a framework for processing base stations in a data center.",
                    "ProfileDroid: multi-layer profiling of android applications.",
                    "Building efficient spectrum-agile devices for dummies.",
                    "Asymmetric caching: improved network deduplication for mobile devices.",
                    "Crowdsourcing to smartphones: incentive mechanism design for mobile phone sensing.",
                    "Searchlight: won't you be my neighbor?",
                    "Distinguishing users with capacitive touch communication.",
                    "MuVi: a multicast video delivery scheme for 4g cellular networks.",
                    "Temporal quality assessment for mobile videos.",
                    "ParCast: soft video delivery in MIMO-OFDM WLANs.",
                    "MARVEL: multiple antenna based relative vehicle localizer.",
                    "MIDU: enabling MIMO full duplex.",
                    "Locating in fingerprint space: wireless indoor localization with little human intervention.",
                    "Centaur: locating devices in an office environment.",
                    "Zee: zero-effort crowdsourcing for indoor localization.",
                    "Push the limit of WiFi based localization for smartphones.",
                    "Empowering developers to estimate app energy consumption.",
                    "FLIGHT: clock calibration using fluorescent lighting.",
                    "Energy-based rate adaptation for 802.11n.",
                    "Faster GPS via the sparse fourier transform.",
                    "Every bit counts: fast and scalable RFID estimation.",
                    "Temporal reachability graphs.",
                    "A simulation tool for automated platooning in mixed highway scenarios.",
                    "CloudMAC: torwards software defined WLANs.",
                    "A unified approach to identifying and healing vulnerabilities in x86 machine code.",
                    "An energy-efficient architecture for multi-hop communication between rovers and satellites in extra-terrestrial surfaces.",
                    "Low-cost interferer detection and classification using TelosB sensor motes.",
                    "Autonomous and distributed recruitment and data collection framework for opportunistic sensing.",
                    "Protocols for highly-dynamic airborne networks.",
                    "LoadingZones: leveraging street parking to enable vehicular internet access.",
                    "Physarum optimization: a new heuristic algorithm to minimal exposure problem.",
                    "Modelling wireless challenges.",
                    "Proximity enhanced mobile D2D video streaming.",
                    "An efficient way to track peers in mobile P2P network.",
                    "A marine experiment of a long distance communication sensor network -MAD-SS-.",
                    "Field tests and indoor emulation of distributed autonomous multi-hop vehicle-to-vehicle communications over TV white space.",
                    "A bundle protocol implementation for android devices.",
                    "An implementation of secure two-party computation for smartphones with application to privacy-preserving interest-cast.",
                    "On-demand content-centric wireless networking.",
                    "Using SOS message propagation to estimate the location of immobilized persons.",
                    "MARVEL: multiple antenna based relative vehicle localizer.",
                    "Clock calibration using fluorescent lighting.",
                    "A wideband compressed spectrum sensing platform for dynamic spectrum access networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2012",
                "sub_name": "Proceedings of the seventh ACM International Workshop on Mobility in the Evolving Internet Architecture, MobiArch 2012, Istanbul, Turkey, August 22, 2012.",
                "count": 8,
                "papers": [
                    "Incentivized cellular offloading via auctions.",
                    "Can offloading save energy for popular apps?",
                    "When mobile networks meet content delivery networks: challenges and opportunities.",
                    "Enhancing mobile data offloading with mobility prediction and prefetching.",
                    "Towards utility-based resource management in heterogeneous wireless networks.",
                    "Supporting wireless access markets with a user-centric QoE-based geo-database.",
                    "Context-based distribution of points of interest.",
                    "Cooperative networks: the mobile tethering game."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2012wintech",
                "sub_name": "Proceedings of the Seventh ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WiNTECH@MOBICOM 2012, Istanbul, Turkey, August 22, 2012.",
                "count": 19,
                "papers": [
                    "White space networking beyond the TV bands.",
                    "Cognitive radio kit framework: experimental platform for dynamic spectrum research.",
                    "Experimentation made easy with the AMazING panel.",
                    "Measurement-driven performance analysis of indoor femtocellular networks.",
                    "A case for evaluating backpressure routing using Ns-3 emulation in a WiFi mesh testbed.",
                    "Towards inherent error-resilient voice encoding schemes in audio sensor networks.",
                    "Improving the accuracy of environment-specific vehicular channel modeling.",
                    "Understanding energy consumption of UHF RFID readers for mobile phone sensing applications.",
                    "SmartEye: an energy-efficient observer platform for internet of things testbeds.",
                    "VIRMANEL: a mobile multihop network virtualization tool.",
                    "Making the best of two worlds: a framework for hybrid experiments.",
                    "A Dvaar to LokVaani: extending cellular coverage inside villages of developing world.",
                    "Demonstrating practical provably secure multi-node communication.",
                    "SPOT demo: multi-entity device-free WLAN localization.",
                    "Demonstrating the AMazING panel.",
                    "A testbed for measuring battery discharge behavior.",
                    "Experimental study of IEEE 802.11n protocol.",
                    "Enabling large scale flexible deployment of cognitive radio routing protocols.",
                    "Evaluating solar panel-driven systems in the laboratory."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "17th MobiCom 2011",
        "info": "Las Vegas, Nevada, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2011",
                "sub_name": "Proceedings of the 17th Annual International Conference on Mobile Computing and Networking, MOBICOM 2011, Las Vegas, Nevada, USA, September 19-23, 2011.",
                "count": 29,
                "papers": [
                    "FLUID: improving throughputs in enterprise wireless lans through flexible channelization.",
                    "SmartVNC: an effective remote computing solution for smartphones.",
                    "FERMI: a femtocell resource management system forinterference mitigation in OFDMA networks.",
                    "WiFi-Nano: reclaiming WiFi efficiency through 800 ns slots.",
                    "XPRESS: a cross-layer backpressure architecture for wireless multi-hop networks.",
                    "CRMA: collision-resistant multiple access.",
                    "SociableSense: exploring the trade-offs of adaptive sampling and computation offloading for social sensing.",
                    "Overlapping communities in dynamic networks: their detection and mobile applications.",
                    "Detecting driver phone use leveraging car speakers.",
                    "I am the antenna: accurate outdoor AP location using smartphones.",
                    "Traffic-driven power saving in operational 3G cellular networks.",
                    "MOTA: engineering an operator agnostic mobile service.",
                    "Anonymization of location data does not work: a large-scale measurement study.",
                    "Enhance & explore: an adaptive algorithm to maximize the utility of wireless networks.",
                    "Scoop: decentralized and opportunistic multicasting of information streams.",
                    "R3: robust replication routing in wireless networks with diverse connectivity characteristics.",
                    "Flooding-resilient broadcast authentication for VANETs.",
                    "E-MiLi: energy-minimizing idle listening in wireless networks.",
                    "REfactor-ing content overhearing to improve wireless performance.",
                    "Distributed spectrum management and relay selection in interference-limited cooperative wireless networks.",
                    "No time to countdown: migrating backoff to the frequency domain.",
                    "Harnessing frequency diversity in wi-fi networks.",
                    "Beamforming on mobile devices: a first study.",
                    "FlexCast: graceful wireless video streaming.",
                    "A cross-layer design for scalable mobile video.",
                    "Practical, real-time, full duplex wireless.",
                    "Understanding stateful vs stateless communication strategies for ad hoc networks.",
                    "Optimal gateway selection in multi-domain wireless networks: a potential game perspective.",
                    "Fundamental relationship between NodeDensity and delay in wireless ad hoc networks with unreliable links."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2011wintech",
                "sub_name": "Proceedings of the 6th ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WiNTECH@MobiCom 2011, Las Vegas, Nevada, USA, September 19, 2011.",
                "count": 22,
                "papers": [
                    "Future wireless experimentation: a testbed perspective.",
                    "Enhancing ASSERT: making an accurate testbed friendly.",
                    "Challenges of using wireless network testbeds: a case study on ORBIT.",
                    "TinyWiFi: making network protocol evaluation portable across multiple phy-link layers.",
                    "A method of proactive MANET routing protocol evaluation applied to the OLSR protocol.",
                    "LENS: resource specification for wireless sensor network experimentation infrastructures.",
                    "Kalman filter-based tracking of a device-free passive entity in wireless environments.",
                    "Novel metrics and experimentation insights for dynamic frequency selection in wireless LANs.",
                    "When are directional antennas useful in indoor environments.",
                    "Experimental assessment of tradeoffs among spectrumsensing platforms.",
                    "Design issues and performance evaluation of a SDR-based reconfigurable framework for adaptive OFDM transmission.",
                    "Design and energy consumption analysis of a custom built wireless sensor node for environmental monitoring.",
                    "Establishing mobile ad-hoc networks in 802.11 infrastructure mode.",
                    "Acquisition and identification of OFDM signals using cyclostationary signatures.",
                    "AROMA: automatic generation of radio maps for localization systems.",
                    "RealSim: real-time mapping of real world sensor deployments into simulation scenarios.",
                    "An experimental framework for data gathering and analysis in wireless sensor networks.",
                    "MAC-Engine: a new architecture for executing MAC algorithms on commodity wifi hardware.",
                    "Throughput optimization in MIMO mesh networks.",
                    "Facilitating experimental networking research with the FINS framework.",
                    "A TinyOS based tool for gathering real-world wireless traces.",
                    "Towards realistic WSN evaluation: extended abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2011s3",
                "sub_name": "Proceedings of the 3rd ACM workshop on Wireless of the students, by the students, for the students, S3@MOBICOM 2011, Las Vegas, NV, USA, September 19 - 23, 2011.",
                "count": 9,
                "papers": [
                    "A case for the coexistence of heterogeneous wireless networks.",
                    "A simple queueing network model of mobility in a campus wireless network.",
                    "A markov chain model for coarse timescale channel variation in an 802.16e wireless network.",
                    "A measurement-based algorithm to maximize the utility of wireless networks.",
                    "How effective is mobile browser cache?",
                    "Smart phone based systems for social psychological research: challenges and design guidelines.",
                    "Anticipatory wireless bitrate control for blocks.",
                    "Enabling opportunistic resources sharing on mobile operating systems: benefits and challenges.",
                    "Towards jamming-resistant and competitive medium access in the SINR model."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2011coronet",
                "sub_name": "Proceedings of the 3rd ACM workshop on Cognitive radio networks, CoRoNet@MOBICOM 2011, Las Vegas, Nevada, USA, September 19, 2011.",
                "count": 5,
                "papers": [
                    "Imperfect full duplex spectrum sensing in cognitive radio networks.",
                    "Deployment of a cellular network in the TVWS: a case study in a challenging environment.",
                    "Aware channel assignment algorithm for cognitive networks.",
                    "Versatile sensing for mobile devices: cost, performance and hardware prototypes.",
                    "Cross-layer optimal spectrum sensing duration and scheduling in cognitive networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "16th MobiCom 2010",
        "info": "Chicago, Illinois, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2010",
                "sub_name": "Proceedings of the 16th Annual International Conference on Mobile Computing and Networking, MOBICOM 2010, Chicago, Illinois, USA, September 20-24, 2010.",
                "count": 33,
                "papers": [
                    "Achieving single channel, full duplex wireless communication.",
                    "Side channel: bits over interference.",
                    "CSMA/CN: carrier sense multiple access with collision notification.",
                    "The spaces between us: setting and maintaining boundaries in wireless spectrum access.",
                    "ZiFi: wireless LAN discovery via ZigBee interference signatures.",
                    "CTRL: a self-organizing femtocell management architecture for co-channel deployment.",
                    "Intentional networking: opportunistic exploitation of mobile network diversity.",
                    "Bartendr: a practical approach to energy-aware cellular data scheduling.",
                    "Challenge: towards distributed RFID sensing with software-defined radio.",
                    "Challenge: mobile optical networks through visual MIMO.",
                    "Hermes: data transmission over unknown voice channels.",
                    "SMS-based web search for low-end mobile devices.",
                    "PixNet: interference-free wireless links using LCD-camera pairs.",
                    "Did you see Bob?: human localization using mobile phones.",
                    "Exploiting temporal stability and low-rank structure for localization in mobile networks.",
                    "Indoor localization without the pain.",
                    "Privacy vulnerability of published anonymous mobility traces.",
                    "Design and experimental evaluation of multi-user beamforming in wireless LANs.",
                    "Pushing the envelope of indoor wireless spatial reuse using directional access points and clients.",
                    "Directional antenna diversity for mobile devices: characterizations and solutions.",
                    "NVS: a virtualization substrate for WiMAX networks.",
                    "Stix: a goal-oriented distributed management system for large-scale broadband wireless access networks.",
                    "MIMO rate adaptation in 802.11n wireless networks.",
                    "Fair WLAN backhaul aggregation.",
                    "Retransmission != repeat: simple retransmission permutation can resolve overlapping channel collisions.",
                    "Sybot: an adaptive and mobile spectrum survey system for wifi networks.",
                    "Inferring and mitigating a link's hindering transmissions in managed 802.11 wireless networks.",
                    "The kappa factor: inferring protocol performance using inter-link reception correlation.",
                    "Toward understanding characteristics of dedicated short range communications (DSRC) from a perspective of vehicular network engineers.",
                    "Profiling users in a 3g network using hourglass co-clustering.",
                    "Physical-layer identification of UHF RFID tags.",
                    "Back-pressure routing and rate control for ICNs.",
                    "Differential forms for target tracking and aggregate queries in distributed networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2010wintech",
                "sub_name": "Proceedings of the Fifth ACM International Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WiNTECH@MOBICOM 2010, Chicago, Illinois, USA, September 20, 2010.",
                "count": 10,
                "papers": [
                    "QOMB wireless network emulation testbed: evaluation and case study.",
                    "CandlES: communication and lighting emulation software.",
                    "Mesh testbed for multi-channel MAC development: design and experimentation.",
                    "MeshUp: reliably evolving a living lab.",
                    "Understanding the joint application of wireless optimizations.",
                    "Experimental characterization of 802.11n link quality at high rates.",
                    "A case for evaluating sensor network protocols concurrently.",
                    "Flexible key exchange negotiation for wireless sensor networks.",
                    "Sensei-uu: a relocatable sensor network testbed.",
                    "HYDRA: virtualized distributed testbed for DTN simulations."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2010s3",
                "sub_name": "Proceedings of the 2010 ACM workshop on Wireless of the students, by the students, for the students, S3@MOBICOM 2010, Chicago, IL, USA, September 20-24, 2010.",
                "count": 15,
                "papers": [
                    "Optimal forwarding strategies for the relay channel under average delay constraints.",
                    "From centralized to distributed sensor localization.",
                    "SoftCast: clean-slate scalable wireless video.",
                    "Capacity of byzantine agreement: summary of recent results.",
                    "Analyzing the performance of greedy maximal scheduling via local pooling and graph theory.",
                    "Is oversensitive spectrum sensing the door opener for initial cognitive radio deployments?",
                    "Diversity in smartphone energy consumption.",
                    "Critical analysis of encounter traces.",
                    "A correlation attack against user mobility privacy in a large-scale WLAN network.",
                    "PUMA: policy-based unified management architecture for wireless networking.",
                    "Delivering capacity for the mobile internet by stitching together networks.",
                    "Bologna: block-based 802.11 transmission recovery.",
                    "TFA: a large scale urban mesh network for social and network research.",
                    "WARPlab: a flexible framework for rapid physical layer design.",
                    "QuRiNet: a wireless testbed for network and ecological research."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2010coronet",
                "sub_name": "Proceedings of the 2010 ACM Workshop on Cognitive Radio Networks, CoRoNet@MOBICOM 2010, Chicago, Illinois, USA, September 20, 2010.",
                "count": 6,
                "papers": [
                    "Practical implementation of blind synchronization in NC-OFDM based cognitive radio networks.",
                    "Cognitive spatial degrees of freedom estimation via compressive sensing.",
                    "A decentralized MAC for opportunistic spectrum access in cognitive wireless networks.",
                    "Energy-efficient communication in next generation rural-area wireless networks.",
                    "Spectrum occupancy validation and modeling using real-time measurements.",
                    "Network coding relayed dynamic spectrum access."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "15th MobiCom 2009",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2009",
                "sub_name": "Proceedings of the 15th Annual International Conference on Mobile Computing and Networking, MOBICOM 2009, Beijing, China, September 20-25, 2009.",
                "count": 30,
                "papers": [
                    "Dynamic spectrum access in DTV whitespaces: design rules, architecture and algorithms.",
                    "Mining spectrum usage data: a large-scale spectrum measurement study.",
                    "A quorum-based framework for establishing control channels in dynamic spectrum access networks.",
                    "Throughput-efficient sequential channel sensing and probing in cognitive radio networks under sensing errors.",
                    "SAM: enabling practical spatial multiple access in wireless LAN.",
                    "Order matters: transmission reordering in wireless networks.",
                    "Design, implementation and evaluation of an efficient opportunistic retransmission protocol.",
                    "Esense: communication through energy sensing.",
                    "Capacity of large-scale CSMA wireless networks.",
                    "Scheduling partition for order optimal capacity in large-scale wireless networks.",
                    "Mobility increases the connectivity of K-hop clustered wireless networks.",
                    "Opportunistic flooding in low-duty-cycle wireless sensor networks with unreliable links.",
                    "Compressive data gathering for large-scale wireless sensor networks.",
                    "Data fusion improves the coverage of wireless sensor networks.",
                    "Lifetime and coverage guarantees through distributed coordinate-free sensor activation.",
                    "Neighbor discovery in wireless networks and the coupon collector's problem.",
                    "Frequency-aware rate adaptation and MAC protocols.",
                    "Optimal beam scheduling for multicasting in wireless networks.",
                    "A scalable micro wireless interconnect structure for CMPs.",
                    "Glia: a practical solution for effective high datarate wifi-arrays.",
                    "Link layer behavior of body area networks at 2.4 GHz.",
                    "Challenge: ultra-low-power energy-harvesting active networked tags (EnHANTs).",
                    "SurroundSense: mobile phone localization via ambience fingerprinting.",
                    "Fine-grained I/O access control of the mobile devices based on the Xen architecture.",
                    "A fundamental scalability criterion for data aggregation in VANETs.",
                    "CENTAUR: realizing the full potential of centralized wlans through a hybrid data path.",
                    "OpenLIDS: a lightweight intrusion detection system for wireless mesh networks.",
                    "On the effectiveness of secret key extraction from wireless signal strength in real environments.",
                    "Localization with snap-inducing shaped residuals (SISR): coping with errors in measurement.",
                    "Hiding stars with fireworks: location privacy through camouflage."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2009coronet",
                "sub_name": "Proceedings of the 2009 ACM Workshop on Cognitive Radio Networks, CoRoNet 2009, Beijing, China, September 21, 2009.",
                "count": 15,
                "papers": [
                    "Building a spectrum map for future cognitive radio technology.",
                    "On the efficiency of distributed spectrum sensing in ad-hoc cognitive radio networks.",
                    "Impact of mobility on spectrum sensing in cognitive radio networks.",
                    "Understanding cross-band interference in unsynchronized spectrum access.",
                    "Interference management via rate splitting and HARQ over time-varying fading channels.",
                    "On the performance of cognitive access with periodic spectrum sensing.",
                    "Connectivity of cognitive radio networks: proximity vs. opportunity.",
                    "Revenue maximization and distributed power allocation in cognitive radio networks.",
                    "Online market driven spectrum scheduling and auction.",
                    "A multipath routing and spectrum access (MRSA) framework for cognitive radio systems in multi-radio mesh networks.",
                    "Wireless spectrum prediction model based on time series analysis method.",
                    "Correlation-based spectrum sensing in cognitive radio.",
                    "RACON: a routing protocol for mobile cognitive radio networks.",
                    "Achievable throughput of multiple access spectrum systems based on cognitive relay.",
                    "Test bed design for detect and avoid of ultra wideband devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2009wintech",
                "sub_name": "Proceedings of the 4th ACM International Workshop on Experimental Evaluation and Characterization, WINTECH '09, Beijing, China, September 21, 2009.",
                "count": 21,
                "papers": [
                    "RapidMesh: declarative toolkit for rapid experimentation of wireless mesh networks.",
                    "Qos-aware channel scheduling for multi-radio/multi-channel wireless mesh networks.",
                    "Assessing mobility support in mesh networks.",
                    "TLQAP: a topology and link quality assessment protocol for efficient node allocation on wireless testbeds.",
                    "A measurement study of zigbee-based indoor localization systems under RF interference.",
                    "A model for comparing rate adaptation algorithms.",
                    "Mobility emulator for DTN and MANET applications.",
                    "The Stanford OpenRoads deployment.",
                    "Footprint: cellular assisted Wi-Fi AP discovery on mobile phones for energy saving.",
                    "Monitoring the high-voltage transmission lines based on two-tier wireless networks.",
                    "OLSR and Net-X as a framework for channel assignment experiments: extended abstract.",
                    "A backoff copying scheme for contention resolution in wireless sensor networks.",
                    "A new slicing scheme for efficient use of wireless testbeds.",
                    "Demonstration of distributed TDMA MAC protocol implementation with OLSR on linux enriched WARP.",
                    "Interference mitigation in WiFi networks using multi-sector antennas.",
                    "A demonstration of the RapidMesh development toolkit.",
                    "Reconfigurable framework for adaptive OFDM transmission.",
                    "A multi-radio wireless P2P network testbed.",
                    "Friendly clustering: the winning strategy of the maniac challenge 2009.",
                    "Distributed localization, tracking, and automatic personal identification: a solution based on a wireless biometric badge.",
                    "Visualizing simulation and testbed of wireless sensor networks with NetTopo."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "14th MobiCom 2008",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2008",
                "sub_name": "Proceedings of the 14th Annual International Conference on Mobile Computing and Networking, MOBICOM 2008, San Francisco, California, USA, September 14-19, 2008.",
                "count": 32,
                "papers": [
                    "Multi-hop mobile wireless network design: implicit cross-layer loss models and performance sensitivities.",
                    "eBay in the Sky: strategy-proof wireless spectrum auctions.",
                    "In-band spectrum sensing in cognitive radio networks: energy detection or feature detection?",
                    "Advancing wireless link signatures for location distinction.",
                    "Challenges: wide-area wirelesss NETworks (WANETs).",
                    "BreadCrumbs: forecasting mobile connectivity.",
                    "Media sharing based on colocation prediction in urban transport.",
                    "Enhancing interactive web applications in hybrid networks.",
                    "Relays, base stations, and meshes: enhancing mobile networks with infrastructure.",
                    "GAnGS: gather, authenticate 'n group securely.",
                    "On fast and accurate detection of unauthorized wireless access points using clock skews.",
                    "Wireless device identification with radiometric signatures.",
                    "Radio-telepathy: extracting a secret key from an unauthenticated wireless channel.",
                    "Capacity of large scale wireless networks under Gaussian channel model.",
                    "ACES: adaptive clock estimation and synchronization using Kalman filtering.",
                    "WiMAX relay networks: opportunistic scheduling to exploit multiuser diversity and frequency selectivity.",
                    "On the critical phase transition time of wireless multi-hop networks with random failures.",
                    "Assessment of urban-scale wireless networks with a small number of measurements.",
                    "Cabernet: vehicular content delivery using WiFi.",
                    "Experiences in a 3G network: interplay between the wireless channel and applications.",
                    "An empirical study of UHF RFID performance.",
                    "Can CSMA/CA networks be made fair?",
                    "Horizon: balancing tcp over multiple paths in wireless mesh network.",
                    "An adaptive, high performance mac for long-distance multihop wireless networks.",
                    "Challenges: automated design of networking protocols.",
                    "Ditto: a system for opportunistic caching in multi-hop wireless networks.",
                    "Understanding congestion control in multi-hop wireless mesh networks.",
                    "Incentive-compatible opportunistic routing for wireless networks.",
                    "Modulation rate adaptation in urban and vehicular environments: cross-layer implementation and experimental evaluation.",
                    "On link-layer reliability and stability for wireless communication.",
                    "Taking the sting out of carrier sense: interference cancellation for wireless LANs.",
                    "ZipTx: exploiting the gap between bit errors and packet loss."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2008winsdr",
                "sub_name": "Proceedings of the 2008 ACM Workshop on Wireless Networks and Systems for Developing Regions, San Francisco, California, USA, September 19, 2007.",
                "count": 9,
                "papers": [
                    "Networking in the land of northern lights: two years of experiences from DTN system deployments.",
                    "Tegola tiered mesh network testbed in rural Scotland.",
                    "Building rural wireless networks: lessons learnt and future directions.",
                    "Potential for collaborative caching and prefetching in largely-disconnected villages.",
                    "Design principles for opportunistic communication in constrained computing environments.",
                    "A framework for multi-region delay tolerant networking.",
                    "Issues in next generation wireless networks and services for developing regions.",
                    "A radio multiplexing architecture for high throughput point to multipoint wireless networks.",
                    "Optimizing high latency links in the developing world."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2008melt",
                "sub_name": "Proceedings of the ACM International Workshop on Mobile Entity Localization and Tracking in GPS-less Environments, MELT 2008, San Francisco, California, USA, September 19, 2008.",
                "count": 23,
                "papers": [
                    "Predicting future locations using prediction-by-partial-match.",
                    "Active GSM cell-id tracking: \"Where Did You Disappear?\".",
                    "AAMPL: accelerometer augmented mobile phone localization.",
                    "A proposal for gps-less location detection using a reference direction information sharing method with co-operation of mobile terminals.",
                    "Indoor tracking of laboratory mice via an rfid-tracking framework.",
                    "Ultrasound-aided pedestrian dead reckoning for indoor navigation.",
                    "Locating zigbee® nodes using the ti®s cc2431 location engine: a testbed platform and new solutions for positioning estimation of wsns in dynamic indoor environments.",
                    "Proximity classification for mobile devices using wi-fi environment similarity.",
                    "Indoor localization based on response rate of bluetooth inquiries.",
                    "Redpin - adaptive, zero-configuration indoor localization through user collaboration.",
                    "On clustering RSS fingerprints for improving scalability of performance prediction of indoor positioning systems.",
                    "Precise location tracking system based on time difference of arrival over LR-WPAN.",
                    "Pre-processing of fingerprints to improve the positioning accuracy of 802.11-based positioning systems.",
                    "A novel backtracking particle filter for pattern matching indoor localization.",
                    "A geometrical perspective on localization.",
                    "Localization using signal strength: to range or not to range?",
                    "Mobile sensor localization and navigation using RF doppler shifts.",
                    "Reduction of location estimation error using neural networks.",
                    "Real-time tracking for sensor networks via sdp and gradient method.",
                    "A note on the trackability of dynamic sensor networks.",
                    "Cooperative localization using angle of arrival measurements in non-line-of-sight environments.",
                    "Localization of mobile users using trajectory matching.",
                    "Sensor network localization, euclidean distance matrix completions, and graph realization."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2008wuwnet",
                "sub_name": "Proceedings of the Third Workshop on Underwater Networks, WUWNET 2008, San Francisco, California, USA, September 15, 2007.",
                "count": 16,
                "papers": [
                    "Underwater communications and AUVs: from the arctic to the equator and other places before, after and in between.",
                    "Analysis of a simple multihop underwater acoustic network.",
                    "Fountain codes and their application to broadcasting in underwater networks: performance modeling and relevant tradeoffs.",
                    "Reliability in underwater inter-vehicle communications.",
                    "Coordination of autonomous underwater vehicles for acoustic image acquisition.",
                    "MU-Sync: a time synchronization protocol for underwater mobile networks.",
                    "Phero-Trail: a bio-inspired location service for mobile underwater sensor networks.",
                    "Motion-aware self-localization for underwater networks.",
                    "UW-FLASHR: achieving high channel utilization in a time-based acoustic mac protocol.",
                    "Towards automated design of MAC protocols for underwater wireless networks.",
                    "Focused beam routing protocol for underwater acoustic networks.",
                    "Survey of hardware platforms for an energy efficient implementation of matching pursuits algorithm for shallow water networks.",
                    "Structured channel estimation methods for cooperative underwater communication.",
                    "Improving efficiency of a flooding-based routing protocol for underwater networks.",
                    "A reservation mac protocol for ad-hoc underwater acoustic sensor networks.",
                    "An ultrasonic communication system for biotelemetry in extremely shallow waters."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2008wintech",
                "sub_name": "Proceedings of the Third ACM Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WINTECH 2008, San Francisco, California, USA, September 19, 2008.",
                "count": 23,
                "papers": [
                    "Can theory meet practice?: the case of multi-channel wireless networks.",
                    "A city-wide vehicular infrastructure for wide-area wireless experimentation.",
                    "An empirical study of bandwidth predictability in mobile computing.",
                    "Municipal wireless data network in Longmont, CO.",
                    "Validation of a miniaturized wireless network testbed.",
                    "Peeling the 802.11 onion: separating congestion from physical per.",
                    "Active capture of wireless traces: overcome the lack in protocol analysis.",
                    "Insights from a freeway car-to-car real-world experiment.",
                    "MMAN - a monitor for mobile ad hoc networks: design, implementation, and experimental evaluation.",
                    "Characterizing mobile ad hoc networks -: the maniac challenge experiment.",
                    "Using commodity hardware platform to develop and evaluate CSMA protocols.",
                    "On topology creation for an indoor wireless grid.",
                    "On estimating joint interference for concurrent packet transmissions in low power wireless networks.",
                    "Understanding and modeling pedestrian mobility of train-station scenarios.",
                    "Building wireless mesh networks in forests: antenna direction, transmit power, and vegetation effects on network performance.",
                    "Interactions between cooperation strategies in mobile ad hoc networks.",
                    "PaPMo: packet accurate protocol monitoring system.",
                    "WiPal and WScout, two hands-on tools for wireless packet traces manipulation and visualization.",
                    "FlexMAC: a wireless protocol development and evaluation platform based on commodity hardware.",
                    "A demonstration of frequency hopping ad hoc and sensor network synchronization method on warp boards.",
                    "Multi-user MIMO testbed.",
                    "Interference aware channel allocation in a multichannel, multi-interface wireless network.",
                    "Machine learning for physical layer link adaptation in multiple-antenna wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "13th MobiCom 2007",
        "info": "Montréal, Québec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2007",
                "sub_name": "Proceedings of the 13th Annual International Conference on Mobile Computing and Networking, MOBICOM 2007, Montréal, Québec, Canada, September 9-14, 2007.",
                "count": 41,
                "papers": [
                    "The geometry of mobility.",
                    "Scheduling algorithms for multi-carrier wireless data systems.",
                    "Superimposed code based channel assignment in multi-radio multi-channel wireless mesh networks.",
                    "Optimal channel probing and transmission scheduling for opportunistic spectrum access.",
                    "Trade-offs between mobility and density for coverage in wireless sensor networks.",
                    "Rendered path: range-free localization in anisotropic sensor networks with holes.",
                    "Designing localized algorithms for barrier coverage.",
                    "Reliable density estimates for coverage and connectivity in thin strips of finite length.",
                    "DARWIN: distributed and adaptive reputation mechanism for wireless ad-hoc networks.",
                    "802.11 user fingerprinting.",
                    "Robust location distinction using temporal link signatures.",
                    "Mining call and mobility data to improve paging efficiency in cellular networks.",
                    "Adaptive network coding and scheduling for maximizing throughput in wireless networks.",
                    "Beyond the bits: cooperative packet recovery using physical layer information.",
                    "Crossing over the bounded domain: from exponential to power-law inter-meeting time in manet.",
                    "A general model of wireless interference.",
                    "Power law and exponential decay of inter contact times between mobile devices.",
                    "Study of a bus-based disruption-tolerant network: mobility modeling and impact on routing.",
                    "Challenges: towards truly scalable ad hoc networks.",
                    "Challenge: peers on wheels - a road to new traffic information systems.",
                    "Challenges: device-free passive localization for wireless environments.",
                    "Adaptive contact probing mechanisms for delay tolerant applications.",
                    "A measurement-based approach to modeling link capacity in 802.11-based wireless networks.",
                    "MDG: measurement-driven guidelines for 802.11 wlan design.",
                    "Multicast capacity for large scale wireless ad hoc networks.",
                    "On designing collusion-resistant routing schemes for non-cooperative wireless ad hoc networks.",
                    "Weak state routing for large scale dynamic networks.",
                    "Revisiting minimum cost reliable routing in wireless mesh networks.",
                    "Practical network coding in wireless networks.",
                    "SecNav: secure broadcast localization and time synchronization in wireless networks.",
                    "Real-time implications of multiple transmission rates in wireless networks.",
                    "Towards context-aware wireless spectrum agility.",
                    "Altruistic cooperation for energy-efficient multi-channel MAC protocols.",
                    "Self-healing multi-radio wireless mesh networks.",
                    "Superposition coding for wireless mesh networks.",
                    "Authentication on the edge: distributed authentication for a global open wi-fi network.",
                    "Mining behavioral groups in large wireless LANs.",
                    "Interference mitigation in enterprise wlans through speculative scheduling.",
                    "Cross-layer jamming detection and mitigation in wireless broadcast networks.",
                    "Understanding the effect of access point density on wireless LAN performance.",
                    "Low-overhead channel-aware rate adaptation."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2007wuwnet",
                "sub_name": "Proceedings of the Second Workshop on Underwater Networks, WUWNET 2007, Montréal, Québec, Canada, September 14, 2007.",
                "count": 17,
                "papers": [
                    "Effects of the channel on acoustic modem performance in the ocean.",
                    "US navy seaweb development.",
                    "MIMO time reversal communications.",
                    "Efficient communication over highly spread underwater acoustic channels.",
                    "Frequency reuse underwater: capacity of an acoustic cellular network.",
                    "Network coding schemes for underwater networks: the benefits of implicit acknowledgement.",
                    "A hybrid medium access control protocol for underwater wireless networks.",
                    "Understanding spatio-temporal uncertainty in medium access with ALOHA protocols.",
                    "Energy-efficient reliable broadcast in underwater acoustic networks.",
                    "A delay-reliability analysis for multihop underwater acoustic communication.",
                    "An underwater network testbed: design, implementation and measurement.",
                    "Energy-efficient localization in networks of underwater drifters.",
                    "Folding: a method for semantic encoding of error-tolerant data.",
                    "AquaNodes: an underwater sensor network.",
                    "A DSP implementation of OFDM acoustic modem.",
                    "Rate-range for an FH-FSK acoustic modem.",
                    "Localization with Dive'N'Rise (DNR) beacons for underwater acoustic sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2007sanet",
                "sub_name": "Proceedings of the First ACM Workshop on Sensor and Actor Networks, SANET 2007, Montréal, Québec, Canada, September 10, 2007.",
                "count": 13,
                "papers": [
                    "Simulations in wireless sensor and ad hoc networks.",
                    "Analytical evaluation of virtual infrastructures for data dissemination in wireless sensor networks with mobile sink.",
                    "PROSAN: probabilistic opportunistic routing in SANETs.",
                    "Navigating actors in mobile sensor actor networks.",
                    "Distributed acoustic conversation shielding: an application of a smart transducer network.",
                    "Managing heterogeneous sensors and actuators in ubiquitous computing environments.",
                    "Asynchronous training in SANET.",
                    "A mobility prediction model for a role management dynamic algorithm for wireless sensor networks.",
                    "Controlling sensors and actuators collectively using the COCOS-framework.",
                    "Slime mold inspired coordinations for wireless sensor and actor networks.",
                    "Routing sensitive priority scheduling.",
                    "Detecting Sybil attacks in image senor network using cognitive intelligence.",
                    "Towards maximum longevity of energy limited SANETs."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2007wintech",
                "sub_name": "Proceedings of the Second ACM Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WINTECH 2007, Montréal, Québec, Canada, September 10, 2007.",
                "count": 18,
                "papers": [
                    "GNU radio as an experimental platform: current capabilities and future directions.",
                    "Wireless sensors on rotating structures: performance evaluation and radio link characterization.",
                    "Physical concerns for cross-layer prototyping and wireless network experimentation.",
                    "An experimental study on the capture effect in 802.11a networks.",
                    "JiST/MobNet: combined simulation, emulation, and real-world testbed for ad hoc networks.",
                    "WHYNET: a framework for in-situ evaluation of heterogeneous mobile wireless systems.",
                    "Wireless unfairness: alleviate MAC congestion first!",
                    "On TCP throughput and window size in a multihop wireless network testbed.",
                    "An experimental study of network performance impact of increased latency in software defined radios.",
                    "Loc{lib, trace, eva, ana}: research tools for 802.11-based positioning systems.",
                    "Wireless virtualization on commodity 802.11 hardware.",
                    "A wired-wireless testbed architecture for network layer experimentation based on ORBIT and VINI.",
                    "A wireless mesh network testbed in rural mountain areas.",
                    "Heraklion MESH: an experimental metropolitan multi-radio mesh network.",
                    "An effective algorithm of the relative movement between vehicles and pedestrians in VPEC.",
                    "Vertical handover management scheme using multiple TCP connections for heterogeneous networks.",
                    "Application prototyping for wireless proximity networks.",
                    "A MIMO demonstration of Hydra."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "12th MobiCom 2006",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2006",
                "sub_name": "Proceedings of the 12th Annual International Conference on Mobile Computing and Networking, MOBICOM 2006, Los Angeles, CA, USA, September 23-29, 2006.",
                "count": 36,
                "papers": [
                    "Mobile broadband evolution: from controversy to convergence.",
                    "Computationally efficient scheduling with the physical interference model for throughput improvement in wireless mesh networks.",
                    "A coordinate-based approach for exploiting temporal-spatial diversity in wireless mesh networks.",
                    "Enabling distributed throughput maximization in wireless mesh networks: a partitioning approach.",
                    "On accurate measurement of link quality in multi-hop wireless mesh networks.",
                    "A measurement study of vehicular internet access using in situ Wi-Fi networks.",
                    "Packet-level diversity - from theory to practice: an 802.11-based experimental investigation.",
                    "Long-distance 802.11b links: performance measurements and experience.",
                    "Analysis and implications of student contact patterns derived from campus schedules.",
                    "Stochastic event capture using mobile sensors subject to a quality metric.",
                    "Localization in sparse networks using sweeps.",
                    "Boundary recognition in sensor networks by topological methods.",
                    "Practical synchronization techniques for multi-channel MAC.",
                    "Robust rate adaptation for 802.11 wireless networks.",
                    "IQU: practical queue-based user association management for WLANs.",
                    "Distributed channel management in uncoordinated wireless environments.",
                    "Mitigating attacks on open functionality in SMS-capable cellular networks.",
                    "A 3: application-aware acceleration for wireless data networks.",
                    "Metastability of CDMA cellular systems.",
                    "TCP-aware resource allocation in CDMA networks.",
                    "On the complexity of scheduling in wireless networks.",
                    "Broadcast capacity in multihop wireless networks.",
                    "Performance analysis of access selection and transmit diversity in multi-access networks.",
                    "Efficient interference-aware TDMA link scheduling for static wireless networks.",
                    "Localized algorithm for aggregate fairness in wireless sensor networks.",
                    "Double rulings for information brokerage in sensor networks.",
                    "Routing algorithms for delay-insensitive and delay-sensitive applications in underwater sensor networks.",
                    "On optimal communication cost for gathering correlated data through wireless sensor networks.",
                    "Fast and reliable estimation schemes in RFID systems.",
                    "Low-cost communication for rural internet kiosks using mechanical backhaul.",
                    "Coverage and connectivity in three-dimensional networks.",
                    "Hot topic: physical-layer network coding.",
                    "Improving spatial reuse through tuning transmit power, carrier sense threshold, and data rate in multihop wireless networks.",
                    "Component based channel assignment in single radio, multi-channel ad hoc networks.",
                    "On delivery guarantees of face and combined greedy-face routing in ad hoc and sensor networks.",
                    "OURS: optimal unicast routing systems in non-cooperative wireless networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2006wuwnet",
                "sub_name": "Proceedings of the First Workshop on Underwater Networks, WUWNET 2006, Los Angeles, CA, USA, September 25, 2007.",
                "count": 19,
                "papers": [
                    "Acoustic propagation considerations for underwater acoustic communications network development.",
                    "Modulation and demodulation techniques for underwater acoustic communications.",
                    "State-of-the-art in protocol research for underwater acoustic sensor networks.",
                    "A survey of practical issues in underwater networks.",
                    "Wide area ocean networks: architecture and system design considerations.",
                    "Localization in underwater sensor networks: survey and challenges.",
                    "On the relationship between capacity and distance in an underwater acoustic communication channel.",
                    "Deployment analysis in underwater acoustic wireless sensor networks.",
                    "An optimization framework for joint sensor deployment, link scheduling and routing in underwater sensor networks.",
                    "Electromagnetic communications within swarms of autonomous underwater vehicles.",
                    "Design of a low-cost acoustic modem for moored oceanographic applications.",
                    "Low-power acoustic modem for dense underwater sensor networks.",
                    "Status packet deprecation and store-forward routing in AUSNet.",
                    "Sensor networks of freely drifting autonomous underwater explorers.",
                    "Cooperative multihop communication for underwater acoustic networks.",
                    "Reconfigurable acoustic modem for underwater sensor networks.",
                    "When underwater acoustic nodes should sleep with one eye open: idle-time power management in underwater sensor networks.",
                    "On applying network coding to underwater sensor networks.",
                    "A MAC protocol for ad-hoc underwater acoustic sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2006wintech",
                "sub_name": "Proceedings of the First ACM Workshop on Wireless Network Testbeds, Experimental Evaluation and Characterization, WINTECH 2006, Los Angeles, California, USA, September 29, 2006.",
                "count": 31,
                "papers": [
                    "Twenty-first century networking: beyond bits and packets.",
                    "A software architecture for physical layer wireless network emulation.",
                    "An integrated approach to the development of wireless network protocols.",
                    "Adaptive wireless-network testbed for cognitive radio technology.",
                    "Experimental evaluation and characterization of the magnets wireless backbone.",
                    "COMPASS: A probabilistic indoor positioning system based on 802.11 and digital compasses.",
                    "Optimal CWmin selection for achieving proportional fairness in multi-rate 802.11e WLANs: test-bed implementation and evaluation.",
                    "Collision avoidance in a dense RFID network.",
                    "Characterizing multi-way interference in wireless mesh networks.",
                    "Implications of link range and (In)stability on sensor network architecture.",
                    "Multipath profile discrimination in TOA-based WLAN ranging with link layer frames.",
                    "An empirical analysis of heterogeneity in IEEE 802.11 MAC protocol implementations and its implications.",
                    "Architecture of the hybrid MCG-mesh testbed.",
                    "Hybrid wireless mesh network deployment: a communication testbed for disaster scenarios.",
                    "A large-scale testbed for wireless mobile ad hoc networks.",
                    "The design, deployment, and analysis of signetLab: a sensor network testbed and interactive management tool.",
                    "Using packet probes for available bandwidth estimation: a wireless testbed experience.",
                    "Performance evaluation of a WiMAX testbed under VoIP traffic.",
                    "WDS-based layer 2 routing for wireless mesh networks.",
                    "Reader collision avoidance mechanism in ubiquitous sensor and RFID networks.",
                    "A measurement-based model for estimating transmission capacity in a wireless mesh network.",
                    "Advanced TCP evaluation testbed on mixed wired internet and satellite environments.",
                    "The meshDVNet wireless mesh network test-bed.",
                    "QuRiNet: quail ridge natural reserve wireless mesh network.",
                    "WHYNET: a hybrid testbed for large-scale, heterogeneous and adaptive wireless networks.",
                    "COTS-based DSRC testbed for rapid algorithm development, implementation, and test.",
                    "A real time MIMO OFDM testbed for cognitive radio & networking research.",
                    "Millipede: a rollerblade positioning system.",
                    "Software radio implementation of short-range wireless standards for sensor networking.",
                    "Video streaming over overlaid bluetooth piconets (OBP).",
                    "Directional radio propagation measurements for near-ground peer-to-peer networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2006mobishare",
                "sub_name": "Proceedings of the 1st international workshop on Decentralized resource sharing in mobile computing and networking, MobiShare@MobiCom 2006, Los Angeles, California, USA, July 25, 2006.",
                "count": 16,
                "papers": [
                    "Code torrent: content distribution using network coding in VANET.",
                    "XScribe: a stateless, cross-layer approach to P2P multicast in multi-hop ad hoc networks.",
                    "GUESS: gossiping updates for efficient spectrum sensing.",
                    "Energy consumption and conservation in mobile peer-to-peer systems.",
                    "Energy aware self-organizing density management in wireless sensor networks.",
                    "Mobile service overlays: reconfigurable middleware for MANETs.",
                    "Zero servers with zero broadcasts.",
                    "A churn and mobility resistant approach for DHTs.",
                    "Performance evaluation of chord in mobile ad hoc networks.",
                    "SCTP profiling framework for multi-homed environment.",
                    "Location independent compact routing for wireless networks.",
                    "Incentives for electronic coupon systems.",
                    "Bluetooth content distribution stations on public transit.",
                    "Alluvion and cascade: fast data dissemination schemes in multihop wireless networks.",
                    "Ekta+: opportunistic multiplexing in a wireless DHT.",
                    "Towards efficient range queries in mobile ad hoc networks using DHTs."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "11th MobiCom 2005",
        "info": "Cologne, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2005",
                "sub_name": "Proceedings of the 11th Annual International Conference on Mobile Computing and Networking, MOBICOM 2005, Cologne, Germany, August 28 - September 2, 2005.",
                "count": 23,
                "papers": [
                    "A unified energy-efficient topology for unicast and broadcast.",
                    "Improving loss resilience with multi-radio diversity in wireless networks.",
                    "Architecture and evaluation of an unplanned 802.11b mesh network.",
                    "Capacity of multi-channel wireless networks: impact of number of channels and interfaces.",
                    "Joint channel assignment and routing for throughput optimization in multi-radio wireless mesh networks.",
                    "Characterizing the capacity region in multi-radio multi-channel wireless mesh networks.",
                    "MAP: medial axis based geometric routing in sensor networks.",
                    "Effects of routing computations in content-based routing networks with mobile data sources.",
                    "On designing incentive-compatible routing and forwarding protocols in wireless ad-hoc networks: an integrated approach using game theoretical and cryptographic techniques.",
                    "Challenges: a radically new architecture for next generation mobile ad hoc networks.",
                    "Challenges: communication through silence in wireless sensor networks.",
                    "Challenge: CeTV and Ca-Fi - cellular and Wi-Fi over CATV.",
                    "Design and evaluation of a new MAC protocol for long-distance 802.11 mesh networks.",
                    "Model T: an empirical model for user registration patterns in a campus wireless LAN.",
                    "Self-management in chaotic wireless deployments.",
                    "Modeling media access in embedded two-flow topologies of multi-hop wireless networks.",
                    "An analytical model for the dimensioning of a GPRS/EDGE network with a capacity constraint on a group of cells.",
                    "MoB: a mobile bazaar for wide-area wireless services.",
                    "PeopleNet: engineering a wireless virtual social network.",
                    "Experimental platform for mobile information systems.",
                    "Using mobile relays to prolong the lifetime of wireless sensor networks.",
                    "Barrier coverage with wireless sensors.",
                    "Cross-layer optimization for routing data traffic in UWB-based sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2005din",
                "sub_name": "Proceedings of the 1st ACM workshop on Dynamic interconnection of networks, DIN@MobiCom 2005, Cologne, Germany, September 2, 2005.",
                "count": 12,
                "papers": [
                    "What can we unlearn from BGP?",
                    "Ambient networks: a framework for mobile network cooperation.",
                    "Dynamic autoconfiguration in 4G networks: problem statement and preliminary solution.",
                    "Towards self-organising personal networks.",
                    "Self organizing ambient control space: an ambient network architecture for dynamic network interconnection.",
                    "Visions for dynamic network scenarios in ubiquitous environments: applications and research issues.",
                    "Applying a cryptographic namespace to applications.",
                    "Scalability analysis of the TurfNet naming and routing architecture.",
                    "Names, addresses and identities in ambient networks.",
                    "A framework for network media optimization in multihomed QoS networks.",
                    "Towards modular mobility management in ambient networks.",
                    "Janus: an architecture for flexible access to sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "10th MobiCom 2004",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2004",
                "sub_name": "Proceedings of the 10th Annual International Conference on Mobile Computing and Networking, MOBICOM 2004, 2004, Philadelphia, PA, USA, September 26 - October 1, 2004.",
                "count": 26,
                "papers": [
                    "MobiDesk: mobile virtual desktop computing.",
                    "Using code collection to support large applications on mobile devices.",
                    "Architecture and techniques for diagnosing faults in IEEE 802.11 infrastructure networks.",
                    "Localization for mobile sensor networks.",
                    "VOR base stations for indoor 802.11 positioning.",
                    "Practical robust localization over large-scale 802.11 wireless networks.",
                    "Revisiting the TTL-based controlled flooding search: optimality and randomization.",
                    "Network deformation: traffic-aware algorithms for dynamically reducing end-to-end delay in multi-hop wireless networks.",
                    "Routing in multi-radio, multi-hop wireless mesh networks.",
                    "Power conservation and quality of surveillance in target tracking sensor networks.",
                    "On k-coverage in a mostly sleeping sensor network.",
                    "Performance optimizations for wireless wide-area networks: comparative study and experimental evaluation.",
                    "Characterizing flows in large wireless data networks.",
                    "The changing usage of a mature campus-wide wireless network.",
                    "Denial of service resilience in ad hoc networks.",
                    "SSCH: slotted seeded channel hopping for capacity improvement in IEEE 802.11 ad-hoc wireless networks.",
                    "Improving TCP performance over mobile ad hoc networks by exploiting cross-layer information awareness.",
                    "Truthful multicast routing in selfish wireless networks.",
                    "Initializing newly deployed ad hoc and sensor networks.",
                    "FLSS: a fault-tolerant topology control algorithm for wireless networks.",
                    "End-to-end performance and fairness in multihop wireless backhaul networks.",
                    "Coordinated load balancing, handoff/cell-site selection, and scheduling in multi-cell packet data systems.",
                    "Fairness and load balancing in wireless LANs using association control.",
                    "A scalable model for channel access protocols in multihop ad hoc networks.",
                    "Exploiting medium access diversity in rate adaptive wireless LANs.",
                    "On using battery state for medium access control in ad hoc wireless networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2004wac",
                "sub_name": "Proceedings of the Second International Workshop on Mobility Management & Wireless Access Protocols, 2004, Philadelphia, PA, USA, October 1, 2004.",
                "count": 22,
                "papers": [
                    "Coping with uncertainty in wireless mobile networks: an information theoretic framework.",
                    "Error characteristics and calibration-free techniques for wireless LAN-based location estimation.",
                    "Hybrid rate control for IEEE 802.11.",
                    "Reducing MAC layer handoff latency in IEEE 802.11 wireless LANs.",
                    "A performance comparison of dynamic channel and ressource allocation protocols for mobile cellular networks.",
                    "Quality of service routing (QoSR) interactions with the BRAIN candidate micro-mobility protocol (BCMP).",
                    "Choosing beacon periods to improve response times for wireless HTTP clients.",
                    "Looking at protocol efficiency from a new angle: stability - delay analysis.",
                    "A mobility-based adaptive MAC for supporting real-time applications in multihop ad-hoc networks.",
                    "Wireless MPLS: a new layer 2.5 micro-mobility scheme.",
                    "A protocol for micromobility management in next generation IPv6 networks.",
                    "Towards service and user discovery on wireless networks.",
                    "Mobility management of transport protocol supporting multiple connections.",
                    "Context awareness for group interaction support.",
                    "Securing the download of radio configuration files for software defined radio devices.",
                    "Efficient and reliable high level communication in randomly deployed wireless sensor networks.",
                    "A structured group mobility model for the simulation of mobile ad hoc networks.",
                    "The design of PaMaNet the Paderborn mobile ad-hoc network.",
                    "Mobility management meets privacy: the failure of existing proposals and a new, future-proof approach.",
                    "SPIDER-NET: a sensor platform for an intelligent ad-hoc wireless relaying network.",
                    "Link layer sssisted mobility support using SIP for real-time multimedia communications.",
                    "A comparative study of mobility anchor point selection schemes in hierarchical mobile IPv6 networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "9th MobiCom 2003",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2003",
                "sub_name": "Proceedings of the Ninth Annual International Conference on Mobile Computing and Networking, MOBICOM 2003, 2003, San Diego, CA, USA, September 14-19, 2003.",
                "count": 27,
                "papers": [
                    "A receiver-centric transport protocol for mobile hosts with heterogeneous wireless interfaces.",
                    "Enhancing TCP fairness in ad hoc wireless networks using neighborhood RED.",
                    "A comparison of mechanisms for improving mobile IP handoff latency for end-to-end TCP.",
                    "Characterizing achievable rates in multi-hop wireless networks: the joint routing and scheduling problem.",
                    "Throughput capacity of random ad hoc networks with infrastructure support.",
                    "Impact of interference on multi-hop wireless network performance.",
                    "Range-free localization schemes for large scale sensor networks.",
                    "Geographic routing without location information.",
                    "Efficient location area planning for personal communication systems.",
                    "Minimum energy disjoint path routing in wireless ad-hoc networks.",
                    "A high-throughput path metric for multi-hop wireless routing.",
                    "Reactive routing overhead in networks with unreliable nodes.",
                    "MiSer: an optimal low-energy transmission strategy for IEEE 802.11a/h.",
                    "Self-tuning wireless network power management.",
                    "Improving protocol capacity with model-based frame scheduling in IEEE 802.11-operated WLANs.",
                    "Sound mobility models.",
                    "Towards realistic mobility models for mobile ad hoc networks.",
                    "DIRAC: a software-based wireless router system.",
                    "Ad hoc-VCG: a truthful and cost-efficient routing protocol for mobile ad hoc networks with selfish agents.",
                    "Trajectory based forwarding and its applications.",
                    "Manycast: exploring the space between anycast and multicast in ad hoc networks.",
                    "Topology control for wireless sensor networks.",
                    "Power optimization in fault-tolerant topology control algorithms for wireless multi-hop networks.",
                    "Distributed algorithms for guiding navigation across a sensor network.",
                    "ARC: an integrated admission and rate control framework for CDMA data networks based on non-cooperative games.",
                    "Wireless downlink data channels: user performance and cell dimensioning.",
                    "UCAN: a unified cellular and ad-hoc network architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/wsna/2003",
                "sub_name": "Proceedings of the Second ACM International Conference on Wireless Sensor Networks and Applications, WSNA 2003, San Diego, CA, USA, September 19, 2003.",
                "count": 18,
                "papers": [
                    "Asymptotically optimal time synchronization in dense sensor networks.",
                    "Lightweight time synchronization for sensor networks.",
                    "Using proximity and quantized RSS for sensor localization in wireless networks.",
                    "Proximity interactions between wireless sensors and their application.",
                    "Experimental evaluation of synchronization and topology control for in-building sensor network applications.",
                    "MANTIS: system support for multimodAl NeTworks of in-situ sensors.",
                    "Efficient code distribution in wireless sensor networks.",
                    "Computation hierarchy for in-network processing.",
                    "Cleaning and querying noisy sensors.",
                    "Information-directed routing in ad hoc sensor networks.",
                    "Role-based hierarchical self organization for wireless ad hoc sensor networks.",
                    "Analysis on the redundancy of wireless sensor networks.",
                    "The coverage problem in a wireless sensor network.",
                    "Parametric probabilistic sensor network routing.",
                    "Throughput and energy efficiency in topology-controlled multi-hop wireless sensor networks.",
                    "Fast authenticated key establishment protocols for self-organizing sensor networks.",
                    "Analyzing and modeling encryption overhead for sensor network nodes.",
                    "Information assurance in sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "8th MobiCom 2002",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2002",
                "sub_name": "Proceedings of the Eighth Annual International Conference on Mobile Computing and Networking, MOBICOM 2002, Atlanta, Georgia, USA, September 23-28, 2002.",
                "count": 26,
                "papers": [
                    "Zero-interaction authentication.",
                    "Ariadne: a secure on-demand routing protocol for ad hoc networks.",
                    "Opportunistic media sccess for multirate ad hoc networks.",
                    "A power control MAC protocol for ad hoc networks.",
                    "Transmission scheduling in ad hoc networks with directional antennas.",
                    "Using directional antennas for medium access control in ad hoc networks.",
                    "TCP/IP performance over 3G wireless links with rate and delay variation.",
                    "A transport layer approach for achieving aggregate bandwidths on multi-homed mobile hosts.",
                    "Reliable network connections.",
                    "Analysis of a campus-wide wireless network.",
                    "Minimizing energy for wireless web access with bounded slowdown.",
                    "Link layer assisted mobile IP fast handoff method over wireless LAN networks.",
                    "On the interdependence of routing and data compression in multi-hop sensor networks.",
                    "A two-tier data dissemination model for large-scale wireless sensor networks.",
                    "Wake on wireless: : an event driven energy saving strategy for battery operated devices.",
                    "Minimum-energy broadcast in all-wireless networks: : NP-completeness and distribution issues.",
                    "Investigating upper bounds on network lifetime extension for cell-based energy conservation techniques in stationary ad hoc networks.",
                    "Resource control for elastic traffic in CDMA networks.",
                    "Capacity of multi-service cellular networks with transmission-rate control: : a queueing analysis.",
                    "Efficient integration of multi-hop wireless and wired networks with QoS constraints.",
                    "Robotics-based location sensing using wireless ethernet.",
                    "On balancing between transcoding overhead and spatial consumption in content adaptation.",
                    "Rajicon: remote PC GUI operations via constricted mobile interfaces.",
                    "Challenges: environmental design for pervasive computing systems.",
                    "Challenge: : integrating mobile wireless devices into the computational grid.",
                    "Challenge: : recombinant computing and the speakeasy approach."
                ]
            },
            {
                "sub_name_abbr": "conf/mobicom/2002wsna",
                "sub_name": "Proceedings of the First ACM International Workshop on Wireless Sensor Networks and Applications, WSNA 2002, Atlanta, Georgia, USA, September 28, 2002.",
                "count": 15,
                "papers": [
                    "PSFQ: a reliable transport protocol for wireless sensor networks.",
                    "Constrained random walks on random graphs: routing algorithms for large scale wireless sensor networks.",
                    "Rumor routing algorthim for sensor networks.",
                    "A coverage-preserving node scheduling scheme for large wireless sensor networks.",
                    "Sensor deployment strategy for target detection.",
                    "Infrastructure tradeoffs for sensor networks.",
                    "Calibration as parameter estimation in sensor networks.",
                    "Smart-tag based data dissemination.",
                    "GHT: a geographic hash table for data-centric storage.",
                    "Wireless sensor networks for habitat monitoring.",
                    "Lifetime analysis of a sensor network with hybrid automata modelling.",
                    "A directionality based location discovery scheme for wireless sensor networks.",
                    "The bits and flops of the n-hop multilateration primitive for node localization problems.",
                    "Efficient tracing of failed nodes in sensor networks.",
                    "A dual-space approach to tracking and sensor management in wireless sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "7th MobiCom 2001",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2001",
                "sub_name": "MOBICOM 2001, Proceedings of the seventh annual international conference on Mobile computing and networking, Rome, Italy, July 16-21, 2001.",
                "count": 30,
                "papers": [
                    "The cricket compass for context-aware mobile applications.",
                    "Exploiting location information for infostation-based hoarding.",
                    "Locating application data across service discovery domains.",
                    "Preemptive routing in Ad Hoc networks.",
                    "Merit: A unified framework for routing protocol assessment in mobile Ad Hoc networks.",
                    "Capacity of Ad Hoc wireless networks.",
                    "Geography-informed energy conservation for Ad Hoc routing.",
                    "Span: An energy-efficient coordination algorithm for topology maintenance in Ad Hoc wireless networks.",
                    "Online power-aware routing in wireless Ad-hoc networks.",
                    "Making computers disappear: appliance data services.",
                    "m-links: An infrastructure for very small internet devices.",
                    "Smart kindergarten: sensor-based wireless networks for smart developmental problem-solving enviroments.",
                    "Exposure in wireless Ad-Hoc sensor networks.",
                    "Research challenges in wireless networks of biomedical sensors.",
                    "Dynamic fine-grained localization in Ad-Hoc networks of sensors.",
                    "Intercepting mobile communications: the insecurity of 802.11.",
                    "SPINS: security protocols for sensor netowrks.",
                    "Distributed multi-hop scheduling and medium access with delay and throughput constraints.",
                    "A new approach to channel access scheduling for Ad Hoc networks.",
                    "A transmission control scheme for media access in sensor networks.",
                    "A rate-adaptive MAC protocol for multi-Hop wireless networks.",
                    "Dynamic voltage scaling on a low-power microprocessor.",
                    "Automatic performance setting for dynamic voltage scaling.",
                    "Physical layer driven protocol and algorithm design for energy-efficient wireless sensor networks.",
                    "TCP westwood: Bandwidth estimation for enhanced transport over wireless links.",
                    "Mobile network estimation.",
                    "Design and analysis of a new approach multiple burst admission control for cdma2000.",
                    "Mobile connectivity protocols and throughput measurements in the Ricochet Microcellular data network (MCDN) system.",
                    "IP paging service for mobile hosts.",
                    "A cost-efficient signaling protocol for mobility application part(MAP) in IMT-2000 systems."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "6th MobiCom 2000",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/2000",
                "sub_name": "MOBICOM 2000, Proceedings of the sixth annual international conference on Mobile computing and networking, Boston, MA, USA, August 6-11, 2000.",
                "count": 28,
                "papers": [
                    "Analysis of a local-area wireless network.",
                    "Dynamic power management for portable systems.",
                    "Experiences of developing and deploying a context-aware tourist guide: the GUIDE project.",
                    "The Cricket location-support system.",
                    "Sending messages to mobile users in disconnected ad-hoc wireless networks.",
                    "Directed diffusion: a scalable and robust communication paradigm for sensor networks.",
                    "Analysis of analytical mobility models with resect to the applicability for handover modeling and to the estimation of signaling cost.",
                    "A new model for packet scheduling in multihop wireless networks.",
                    "Achieving MAC layer fairness in wireless packet networks.",
                    "Intersystem location update and paging schemes for multitier wireless networks.",
                    "Tracking mobile users with uncertain parameters.",
                    "A scalable location service for geographic ad hoc routing.",
                    "A unified header compression framework for low-bandwidth links.",
                    "Reduced cell switching in a mobile computing environment.",
                    "An end-to-end approach to host mobility.",
                    "Distributed fair scheduling in a wireless LAN.",
                    "Downlink scheduling in CDMA data networks.",
                    "Adaptive allocation of CDMA resources for network-level QoS assurances.",
                    "A scalable low-latency cache invalidation strategy for mobile environments.",
                    "Using semantic caching to manage location dependent data in mobile computing.",
                    "Pushing dependent data in clients-providers-servers systems.",
                    "Caching strategies in on-demand routing protocols for wireless ad hoc networks.",
                    "GPSR: greedy perimeter stateless routing for wireless networks.",
                    "Mitigating routing misbehavior in mobile ad hoc networks.",
                    "Challenges: an application model for pervasive computing.",
                    "Intrusion detection in wireless ad-hoc networks.",
                    "W-mail: an electronic mail system for wearable computing environments.",
                    "Research challenges in environmental observation and forecasting systems."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "5th MobiCom 1999",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/1999",
                "sub_name": "MOBICOM '99, The Fifth Annual ACM/IEEE International Conference on Mobile Computing and Networking, Seattle, Washington, USA, August 15-19, 1999.",
                "count": 28,
                "papers": [
                    "LeZi-Update: An Information-Theoretic Approach to Track Mobile Users in PCS Networks.",
                    "Analysis of a Metropolitan-Area Wireless Network.",
                    "An Architecture for a Secure Service Discovery Service.",
                    "Supporting CORBA Applications in a Mobile Environment.",
                    "Using Code Mobility to Create Ubiquitous and Active Augmented Reality in Mobile Computing.",
                    "The Anatomy of a Context-Aware Application.",
                    "BlueSky: A Cordless Networking Solution for Palmtop Computers.",
                    "Octopus: Embracing the Energy Efficiency of Handheld Multimedia Computers.",
                    "Pulsed Battery Discharge in Communication Devices.",
                    "Power Control for Link Quality Protection in Cellular DS-CDMA Networks with Integrated (packet and circuit) Services.",
                    "Optimality of Greedy Power Control and Variable Spreading Gain in Multi-Class CDMA Mobile Networks.",
                    "Optimizing the End-to-End Performance of Reliable Flows Over Wireless Links.",
                    "Reversing the Collision-Avoidance Handshake in Wireless Networks.",
                    "A Unified Architecture for the Design and Evaluation of Wireless Fair Queueing Algorithms.",
                    "Performance Evaluation of PRADOS: A Scheduling Algorithm for Traffic Integration in a Wireless ATM Network.",
                    "The Broadcast Storm Problem in a Mobile ad hoc Network.",
                    "Performance Evaluation of a Wireless Hierarchical Data Dissemination System.",
                    "Adaptive Protocols for Information Dissemination in Wireless Sensor Networks.",
                    "Query Localization Techniques for On-Demand Routing Protocols in ad hoc Networks.",
                    "Scenario-Based Performance Analysis of Routing Protocols for Mobile ad-hoc Networks.",
                    "Multicast Operation of the Ad-Hoc On-Demand Distance Vector Routing Protocol.",
                    "Analysis of TCP Performance over Mobile Ad Hoc Networks.",
                    "WTCP: A Reliable Transport Protocol for Wireless Wide-Area Networks.",
                    "Next Century Challenges: RadioActive Networks.",
                    "Next Century Challenges: Nexus - An Open Global Infrastructure for Spatial-Aware Applications.",
                    "Next Century Challenges: Data-Centric Networking for Invisible Computing.",
                    "Next Century Challenges: Scalable Coordination in Sensor Networks.",
                    "Next Century Challenges: Mobile Networking for \"Smart Dust\"."
                ]
            },
            {
                "sub_name_abbr": "conf/mobide/99",
                "sub_name": "Proceedings of the ACM International Workshop on Data Engineering for Wireless and Mobile Access, August 20, 1999, Seattle, WA, USA.",
                "count": 14,
                "papers": [
                    "Supporting Transactional Cache Consistency in Mobile Database Systems.",
                    "Impact of mobility on transaction management.",
                    "Recovery Guarantees in Mobile Systems.",
                    "Dynamic Multicast Information Dissemination in Hybrid Satellite-Wireless Networks.",
                    "Intelligent Paging Strategies for Personal Communication Services Network.",
                    "DataSpace - Querying and Monitoring Deeply Networked Collections in Physical Space.",
                    "Scheduling Data Broadcast to \"impatient\" Users.",
                    "MOCA: A Service Framework for Mobile Computing Devices.",
                    "Accelerating Telnet Performance in Wireless Networks.",
                    "MAGNET: An Architecture for Dynamic Resource Allocation.",
                    "Pervasive Computing: What is it Good for?",
                    "Using Clustering for Effective Management of a Semantic Cache in Mobile Computing.",
                    "Data Partitioning for Disconnected Client Server Databases.",
                    "Data Warehousing Alternatives for Mobile Environments."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "4th MobiCom 1998",
        "info": "Dallas, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/1998",
                "sub_name": "MOBICOM '98, The Fourth Annual ACM/IEEE International Conference on Mobile Computing and Networking, Dallas, Texas, USA, October 25-30, 1998.",
                "count": 27,
                "papers": [
                    "Adapting Packet Fair Queueing Algorithms to Wireless Networks.",
                    "A Wireless Fair Service Algorithm for Packet Cellular Networks.",
                    "Balanced Media Access Methods for Wireless Networks.",
                    "Joint Broadcast Scheduling and User's Cache Management for Efficient Information Delivery.",
                    "Scheduling On-Demand Broadcasts: New Metrics and Algorithms.",
                    "Modeling and Evaluation of Prefetching Policies for Context-Aware Information Services.",
                    "Location-Aided Routing (LAR) in Mobile Ad Hoc Networks.",
                    "A Distance Routing Effect Algorithm for Mobility (DREAM).",
                    "A Performance Comparison of Multi-Hop Wireless Ad Hoc Network Routing Protocols.",
                    "What is a File Synchronizer?",
                    "Mobile Awareness in a Wide Area Wireless Network of Info-Stations.",
                    "StratOSphere: Mobile Processing of Distributed Objects in Java.",
                    "Towards a Design Methodology for Adaptive Applications.",
                    "Flexible Network Support for Mobility.",
                    "Power Management Techniques for Mobile Communication.",
                    "Rate Adaptation Schemes in Networks with Mobile Hosts.",
                    "Power-Aware Routing in Mobile Ad Hoc Networks.",
                    "On Programmable Universal Mobile Channels in a Cellular Internet.",
                    "Multi-Sensor Location Tracking.",
                    "An Efficient Mobility Management Strategy for Personal Communication Systems.",
                    "Optimal Location Management Algorithms for Mobile Networks.",
                    "Effective Bandwidth in Wireless ATM Networks.",
                    "Performance Evaluations of Path Optimization Schemes for Inter-Switch Handoffs in Wireless ATM Networks.",
                    "Integration of Circuit and Packet Switched Transport in a 3RD Generation Mobile Network.",
                    "Comparison of Connection Admission-Control Schemes in the Presence of Hand-Offs in Cellular Networks.",
                    "TCP Source Activity and Its Impact on Call Admission Control in CDMA Voice/Data Network.",
                    "Undeniable Billing in Mobile Communication."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "3rd MobiCom 1997",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/1997",
                "sub_name": "MOBICOM '97, Proceedings of the Third Annual ACM/IEEE International Conference on Mobile Computing and Networking, Budapest, Hungary, September 26-30, 1997.",
                "count": 26,
                "papers": [
                    "Composable ad-hoc Mobile Services for Universal Interaction.",
                    "Dynamic Network Reconfiguration Support for Mobile Computers.",
                    "Location-Aware Mobile Applications Based on Directory Services.",
                    "Reliable Broadcast in Mobile Multihop Packet Networks.",
                    "Route Optimization in Mobile ATM Networks.",
                    "Wireless Andrew: Experience Building a High Speed, Campus-Wide Wireless Data Network.",
                    "GeoCast - Geographic Addressing and Routing.",
                    "The Effects of Asymmetry on TCP Performance.",
                    "Log-Time Algorithms for Scheduling Single and Multiple Channel Data Broadcast.",
                    "Multimedia Communication in Cellular PACS Network.",
                    "Delivering Diverse Delay/Dropping QoS Requirements in a TDMA Environment.",
                    "Uplink CDMA Systems with Diverse QoS Guarantees for Heterogeneous Traffic.",
                    "An Adaptive Hybrid ARQ Scheme with Concatenated FEC Codes for Wireless ATM.",
                    "Low Power Error Control for Wireless Links.",
                    "Mobile Multicast (MoM) Protocol: Multicast Support for Mobile Hosts.",
                    "A New Multicasting-Based Architecture for Internet Host Mobility.",
                    "A Public-Key Based Secure Mobile IP.",
                    "A New Location Update Strategy for Cellular Networks and Its Implementation Using a Genetic Algorithm.",
                    "A Dynamic Paging Scheme for Wireless Communication Systems.",
                    "A Connection Handover Protocol for LEO Satellite ATM Networks.",
                    "A Protection Scheme for Mobile Agents on Java.",
                    "Ticket Based Service Access for the Mobile User.",
                    "Dealing with Server Corruption in Weakly Consistent, Replicated Data Systems.",
                    "Support for Mobile Pen-Based Applications.",
                    "A General Purpose Proxy Filtering Mechanism Applied to the Mobile Environment.",
                    "Web Browsing in a Wireless Environment: Disconnected and Asynchronous Operation in ARTour Web Express."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "2nd MobiCom 1996",
        "info": "Rye, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/1996",
                "sub_name": "MOBICOM '96, Proceedings of the Second Annual International Conference on Mobile Computing and Networking, Rye, New York, USA, November 10-12, 1996.",
                "count": 18,
                "papers": [
                    "Low-Loss TCP/IP Header Compression for Wireless Networks.",
                    "TCP Extensions for Space Communications.",
                    "Mobility Support in IPv6.",
                    "Efficient and Flexible Location Management Techniques for Wireless Communication Systems.",
                    "On Resource Discovery in Distributed Systems with Mobile Hosts.",
                    "Fast and Scalable Handoffs for Wireless Internetworks.",
                    "Spectrum Sharing Under the Asynchronous UPCS Etiquette: The Performance of Collocated Systems under Heavy Load.",
                    "A Dynamic Load Balancing Strategy for Channel Assignment Using Selective Borrowing in Cellular Mobile Environment.",
                    "Lossless Handover for Wireless ATM.",
                    "Rapid Prototyping of Mobile Context-Aware Applications: The Cyberguide Case Study.",
                    "WebExpress: A System for Optimizing Web Browsing in a Wireless Environment.",
                    "Building Reliable Mobile-Aware Applications Using the Rover Toolkit.",
                    "A Dynamic Disk Spin-Down Technique for Mobile Computing.",
                    "Reducing Processor Power Consumption by Improving Processor Time Management in a Single-user Operating System.",
                    "Security on the Move: Indirect Authentication using Kerberos.",
                    "Wireless ATM MAC Performance Evaluation, Case Study: HIPERLAN vs. modified MDR.",
                    "A Scalable Wireless Virtual LAN.",
                    "Floor Acquisition Multiple Access with Collision Resolution."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "1st MobiCom 1995",
        "info": "Berkeley, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobicom/1995",
                "sub_name": "MOBICOM '95, Proceedings of the First Annual International Conference on Mobile Computing and Networking, Berkeley, CA, USA, November 13-15, 1995.",
                "count": 20,
                "papers": [
                    "Improving TCI/IP Performance over Wireless Networks.",
                    "Comparing Algorithm for Dynamic Speed-Setting of a Low-Power CPU.",
                    "Untraceability in Mobile Networks.",
                    "SpectrumWare: A Software-Oriented Approach to Wireless Signal Processing.",
                    "The Design & Implementation of a Hybrid Handover Protocol for Multi-Media Wireless LANs.",
                    "Adaptive Network Support for Mobile Multimedia.",
                    "FAMA-PJ: A Channel Access Protocol for Wireless LANs.",
                    "A Routing Protocol for Packet Radio Networks.",
                    "M-RPC: A Remote Procedure Call Service for Mobile Clients.",
                    "A Mobile Virtual-Distributed System Architecture for Supporting Wireless Mobile Computing and Communications.",
                    "Intelligent File Hoarding for Mobile Computers.",
                    "Mobility Management in Integrated Wireless-ATM Networks.",
                    "The Shadow Cluster Concept for Resource Allocation and Call Admission in ATM-Based Wireless Networks.",
                    "Rednet: A Wireless ATM Local Area Network Using Infrared Links.",
                    "User Profile Replication for Faster Location Lookup in Mobile Environments.",
                    "An Adaptive Location Management Strategy for Mobile IP.",
                    "Local Anchor Scheme for Reducing Location Tracking Costs in PCNs.",
                    "Mobile Wireless Network System Simulation.",
                    "An Optimization Method for the Channel Assignment in Mixed Environments.",
                    "Performance Comparison of Mobile Support Strategies."
                ]
            }
        ]
    }
]