[
    {
        "year": "2021",
        "name": "19th MobiSys 2021",
        "info": "Virtual Event, Wisconsin, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2021",
                "sub_name": "MobiSys '21: The 19th Annual International Conference on Mobile Systems, Applications, and Services, Virtual Event, Wisconsin, USA, 24 June - 2 July, 2021.",
                "count": 50,
                "papers": [
                    "FollowUpAR: enabling follow-up effects in mobile AR applications.",
                    "LensCap: split-process framework for fine-grained visual privacy control for augmented reality apps.",
                    "Xihe: a 3D vision-based lighting estimation framework for mobile augmented reality.",
                    "zTT: learning-based DVFS with zero thermal throttling for mobile devices.",
                    "ClusterFL: a similarity-aware federated learning system for human activity recognition.",
                    "Low-latency speculative inference on distributed multi-modal data streams.",
                    "nn-Meter: towards accurate latency prediction of deep-learning model inference on diverse edge devices.",
                    "PPFL: privacy-preserving federated learning with trusted execution environments.",
                    "MegaMind: a platform for security & privacy extensions for voice assistants.",
                    "Rushmore: securely displaying static and animated images using TrustZone.",
                    "Encrypted cloud photo storage using Google photos.",
                    "SafetyNOT: on the usage of the SafetyNet attestation API in Android.",
                    "Thermotag: item-level temperature sensing with a passive RFID tag.",
                    "OESense: employing occlusion effect for in-ear human sensing.",
                    "Healthy diapering with passive RFIDs for diaper wetness sensing and urine pH identification.",
                    "Counting a stationary crowd using off-the-shelf wifi.",
                    "MotionCompass: pinpointing wireless camera via motion-activated traffic.",
                    "TyrLoc: a low-cost multi-technology MIMO localization system with a single RF chain.",
                    "Accurate ubiquitous localization with off-the-shelf IEEE 802.11ac devices.",
                    "Owlet: enabling spatial information in ubiquitous acoustic devices.",
                    "mmMesh: towards 3D real-time dynamic human mesh construction using millimeter-wave.",
                    "SOS: isolated health monitoring system to save our satellites.",
                    "Discovering emergency call pitfalls for cellular networks with formal methods.",
                    "Is your smoke detector working properly?: robust fault tolerance approaches for smoke detectors.",
                    "How much battery does dark mode save?: an accurate OLED display power profiler for modern smartphones.",
                    "Tap: an app framework for dynamically composable mobile systems.",
                    "Marauder: synergized caching and prefetching for low-risk mobile app acceleration.",
                    "Throughput-fairness tradeoffs in mobility platforms.",
                    "RayTrack: enabling interference-free outdoor mobile VLC with dynamic field-of-view.",
                    "SpaceBeam: LiDAR-driven one-shot mmWave beam management.",
                    "Commodity-level BLE backscatter.",
                    "SCOPE: an open and softwarized prototyping platform for NextG systems.",
                    "A real-time experimentation platform for sub-6 GHz and millimeter-wave MIMO systems.",
                    "FastZIP: faster and more secure zero-interaction pairing.",
                    "ITrackU: tracking a pen-like instrument via UWB-IMU fusion.",
                    "Hivemind: social control-and-use of IoT towards democratization of public spaces.",
                    "Pain-o-vision, effortless pain management.",
                    "A smart agent guided contactless data collection system amid a pandemic.",
                    "ThingSpire OS: a WebAssembly-based IoT operating system for cloud-edge integration.",
                    "Apple in my eyes (AIME): liveness detection for mobile security using corneal specular reflections.",
                    "LATTE: online MU-MIMO grouping for video streaming over commodity wifi.",
                    "AR game traffic characterization: a case of Pokémon Go in a flash crowd event.",
                    "Measuring forest carbon with mobile phones.",
                    "Facilitating in-situ shared use of IoT actuators in public spaces.",
                    "Lost and Found!: associating target persons in camera surveillance footage with smartphone identifiers.",
                    "Acoustic ruler using wireless earbud.",
                    "Microstructure-guided spatial sensing for low-power IoT.",
                    "A do-it-yourself computer vision based robotic ball throw trainer.",
                    "Open source RAN slicing on POWDER: a top-to-bottom O-RAN use case.",
                    "Mobile and wireless research on the POWDER platform."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2021digibiom",
                "sub_name": "DigiBiom@MobiSys '21: Proceedings of the 2021 Workshop on Future of Digital Biomarkers, Virtual Event, Wisconsin, USA, 25 June, 2021.",
                "count": 13,
                "papers": [
                    "Advancing the science of digital biomarkers.",
                    "Social media derived biomarkers of mental health: opportunities, pitfalls, and the next frontier.",
                    "Prediction of self-reported depression scores using person-generated health data from a virtual 1-year mental health observational study.",
                    "Tenets towards smartphone-based medical tricorders.",
                    "Joint prediction of cocaine craving and euphoria using structured prediction energy networks.",
                    "Design of a neurocognitive digital health system (NDHS) for neurodegenerative diseases.",
                    "Music in behavioral health: from digital biomarker to therapeutics.",
                    "It takes a village: development of digital measures for computer scientists.",
                    "Digital biomarkers from sweat analysis for therapeutic drug monitoring in soft tissue infections.",
                    "Psycho-physiological impedance matching through holistic closed-loop cyber-physical systems.",
                    "Digital epidemiology and the COVID-19 pandemic.",
                    "Digital biomarkers in health technology startups.",
                    "The role of science policy in developing digital biomarkers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2021dronet",
                "sub_name": "DroNet@MobiSys '21: Proceedings of the 7th Workshop on Micro Aerial Vehicle Networks, Systems, and Applications, Virtual Event, Wisconsin, USA, 24 June, 2021.",
                "count": 6,
                "papers": [
                    "Toward a Marketplace for Aerial Computing.",
                    "POD: A Smartphone That Flies.",
                    "A Comparative Study of Virtual Infrastructure Management Solutions for UAV Networks.",
                    "Persistent Airborne Surveillance using Semi-Autonomous Drone swarms.",
                    "Towards Adaptive, Self-Configuring Networked Unmanned Aerial Vehicles.",
                    "An Experimental Analysis on Drone-Mounted Access Points for Improved Latency-Reliability."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2021iol",
                "sub_name": "IoL@MobiSys '21: Proceedings of the Workshop on Internet of Lights, Virtual Event, Wisconsin, USA, 25 June, 2021.",
                "count": 6,
                "papers": [
                    "LED-to-LED based VLC systems: developments and open problems.",
                    "Adaptive WDMA: improving the data rate of a densely deployed LiFi network.",
                    "Link adaptive protocol for V2LC.",
                    "Position: drone camera communication meets robotic soil sensing.",
                    "Gbps underwater optical wireless communication in turbulence and random sea surface.",
                    "Multi-cell deployment for experimental research in visible light communication-based internet of things."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2021emdl",
                "sub_name": "EMDL@MobiSys 2021: Proceedings of the 5th International Workshop on Embedded and Mobile Deep Learning, Virtual Event, Wisconsin, USA, June 25, 2021.",
                "count": 7,
                "papers": [
                    "Adaptive Inference through Early-Exit Networks: Design, Challenges and Directions.",
                    "Are Mobile DNN Accelerators Accelerating DNNs?",
                    "Battery-Free Camera Occupancy Detection System.",
                    "Benchmarking Video Object Detection Systems on Embedded Devices under Resource Contention.",
                    "ParallelFusion: Towards Maximum Utilization of Mobile GPU for DNN Inference.",
                    "Towards Ubiquitous Learning: A First Measurement of On-Device Training Performance.",
                    "Enabling Binary Neural Network Training on the Edge."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2021bodysys",
                "sub_name": "BodySys@MobiSys 2021: Proceedings of the Workshop on Body-Centric Computing Systems, Virtual Event, Wisconson USA, 24 June, 2021.",
                "count": 6,
                "papers": [
                    "Performance Monitoring for Exercise Movements using Mobile Cameras.",
                    "Effective Assessment of Cognitive Load in Real-World Scenarios using Wrist-worn Sensor Data.",
                    "Heart Rate Monitoring Using Capacitive Touchscreen Sensing.",
                    "MoveFeel: Expressive Dance Movement Determination Through Video Analysis.",
                    "I know it's still you: A study of using the PPG sensor to support zero re-authentications.",
                    "Wearable sensor driven Cardiac model to derive hemodynamic insights during exercise."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "18th MobiSys 2020",
        "info": "Toronto, Ontario, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2020",
                "sub_name": "MobiSys '20: The 18th Annual International Conference on Mobile Systems, Applications, and Services, Toronto, Ontario, Canada, June 15-19, 2020.",
                "count": 44,
                "papers": [
                    "mm-FLEX: an open platform for millimeter-wave mobile full-bandwidth experimentation.",
                    "See through smoke: robust indoor mapping with low-cost mmWave radar.",
                    "Osprey: a mmWave approach to tire wear sensing.",
                    "DigiScatter: efficiently prototyping large-scale OFDMA backscatter networks.",
                    "Gateway over the air: towards pervasive internet connectivity for commodity IoT.",
                    "Towards scalable backscatter sensor mesh with decodable relay and distributed excitation.",
                    "Two to tango: hybrid light and backscatter networks for next billion devices.",
                    "General-purpose deep tracking platform across protocols for the internet of things.",
                    "SmokeBomb: effective mitigation against cache side-channel attacks on the ARM architecture.",
                    "SonicPrint: a generally adoptable and secure fingerprint biometrics in smart devices.",
                    "SelMon: reinforcing mobile device security with self-protected trust anchor.",
                    "MagHacker: eavesdropping on stylus pen writing via magnetic sensing from commodity mobile devices.",
                    "DarkneTZ: towards model privacy at the edge using trusted execution environments.",
                    "Fast and scalable in-memory deep multitask learning via neural weight virtualization.",
                    "Approximate query service on autonomous IoT cameras.",
                    "Causes and fixes of unexpected phone shutoffs.",
                    "Tabellion: secure legal contracts on mobile devices.",
                    "Combating packet collisions using non-stationary signal scaling in LPWANs.",
                    "A cloud-optimized link layer for low-power wide-area networks.",
                    "SecWIR: securing smart home IoT communications via wi-fi routers with embedded intelligence.",
                    "Soil moisture sensing with commodity RFID systems.",
                    "BlueDoor: breaking the secure information flow via BLE vulnerability.",
                    "BeeCluster: drone orchestration via predictive optimization.",
                    "Wi-Go: accurate and scalable vehicle positioning using WiFi fine timing measurement.",
                    "Edge-SLAM: edge-assisted visual simultaneous localization and mapping.",
                    "WhiteHaul: an efficient spectrum aggregation system for low-cost and high capacity backhaul over white spaces.",
                    "SkySense: terrestrial and aerial spectrum use analysed using lightweight sensing technology with weather balloons.",
                    "MPBond: efficient network-level collaboration among personal mobile devices.",
                    "PERCEIVE: deep learning-based cellular uplink prediction using real-time scheduling patterns.",
                    "Vulcan: lessons on reliability of wearables through state-aware fuzzing.",
                    "WAKE: a behind-the-ear wearable system for microsleep detection.",
                    "Painometry: wearable and objective quantification system for acute postoperative pain.",
                    "RehabPhone: a software-defined tool using 3D printing and smartphones for personalized home-based rehabilitation.",
                    "EMO: real-time emotion recognition from single-eye images for resource-constrained eyewear devices.",
                    "Mobile Volumetric Video Streaming Enhanced by Super Resolution.",
                    "AirPlanes: a DIY modeling system using mobile VSLAM for indoor space.",
                    "A benchmark for event-race analysis in android apps.",
                    "NoFaceContact: stop touching your face with NFC.",
                    "Does ambient RF energy suffice to power battery-free IoT?",
                    "Deduplicating future data transfer using data exchanged in the past to decrease mobile bandwidth usage.",
                    "Key sensor discovery for quality audit of air sensor networks.",
                    "MPBond: efficient network-level collaboration among personal mobile devices.",
                    "Osprey demo: a mmwave approach to tire wear sensing.",
                    "Vulcan: a state-aware fuzzing tool for wear OS ecosystem."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2020healthdl",
                "sub_name": "HealthDL@MobiSys 2020, Proceedings of the 2020 Deep Learning for Wellbeing Applications Leveraging Mobile Devices and Edge Computing, June 19, 2020, Toronto, ON, Canada.",
                "count": 8,
                "papers": [
                    "Sensitivity, Specificity, Generalizability, and Reusability Aspirations for Machine Learning (ML) Models in mHealth.",
                    "Tackling the Challenges of Machine Learning for Mobile Health Systems.",
                    "Supporting Home Quarantine with Smart Speakers.",
                    "Olivia Health Analytic Platform.",
                    "M&M: Deep learning aided multi-facet mental health support tool for College Students.",
                    "Mobile Health Diagnostics through Audio Signals.",
                    "Towards Ultra-Efficient DNN Inference Acceleration on Edge Devices for Wellbeing Applications.",
                    "A Deep Learning Framework for Prediction of Readmission Risk After Cancer Surgery from Mobile Data Streams."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2020dronet",
                "sub_name": "DroNet@MobiSys 2020: Proceedings of the 6th ACM Workshop on Micro Aerial Vehicle Networks, Systems, and Applications, Toronto, Ontario, Canada, June 15, 2020.",
                "count": 10,
                "papers": [
                    "DRUBER: a trustable decentralized drone-based delivery system.",
                    "Robust mission planning of UAV networks for environmental sensing.",
                    "Implementable self-organized flocking algorithm for UAVs based on the emergence of virtual roads.",
                    "Connected Ad-Hoc swarm of drones.",
                    "PENGUIN: aquatic plastic pollution sensing using AUVs.",
                    "Performance of a networked human-drone team: command response and interaction effects.",
                    "First experiments with a 5G-Connected drone.",
                    "DroneNet-Sim: a learning-based trace simulation framework for control networking in drone video analytics.",
                    "Measuring fixed wing UAS networks at long range.",
                    "Distributed reinforcement learning for flexible UAV swarm control with transfer learning capabilities."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2020wearsys",
                "sub_name": "WearSys@MobiSys 2020: Proceedings of the 6th ACM Workshop on Wearable Systems and Applications, Toronto, Ontario, Canada, June 19, 2020.",
                "count": 7,
                "papers": [
                    "PHY-IDS: a physical-layer spoofing attack detection system for wearable devices.",
                    "Proximity-based active learning for eating moment recognition in wearable systems.",
                    "Assessment of cognitive load from bio-potentials measured using wearable endosomatic device.",
                    "Challenges in measuring partner dancing skills via wearable accelerometers.",
                    "Human-in-the-loop RL with an EEG wearable headset: on effective use of brainwaves to accelerate learning.",
                    "Gauntlet: a novel precise finger and hand movements capturing wearable.",
                    "Hand hygiene compliance checking system with explainable feedback."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2020openwireless",
                "sub_name": "OpenWireless@MobiSys 2020: Proceedings of the 1st International Workshop on Open Software Defined Wireless Networks, Toronto, ON, Canada, June 19, 2020.",
                "count": 3,
                "papers": [
                    "Auction-based Network Slicing Architecture and Experimentation on SD-RANs.",
                    "Design and Implementation of Scalable Massive-MIMO Networks.",
                    "Software Radios for Unmanned Aerial Systems."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "17th MobiSys 2019",
        "info": "Seoul, Republic of Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2019",
                "sub_name": "Proceedings of the 17th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys 2019, Seoul, Republic of Korea, June 17-21, 2019.",
                "count": 142,
                "papers": [
                    "Capttery: Scalable Battery-like Room-level Wireless Power.",
                    "WaveEar: Exploring a mmWave-based Noise-resistant Speech Sensing for Voice-User Interface.",
                    "DeQA: On-Device Question Answering.",
                    "BuScope: Fusing Individual & Aggregated Mobility Behavior for.",
                    "BreathListener: Fine-grained Breathing Monitoring in Driving Environments Utilizing Acoustic Signals.",
                    "FlyZone: A Testbed for Experimenting with Aerial Drone Applications.",
                    "InternalBlue - Bluetooth Binary Patching and Experimentation Framework.",
                    "Animal-Borne Anti-Poaching System.",
                    "SpecEye: Towards Pervasive and Privacy-Preserving Screen Exposure Detection in Daily Life.",
                    "When IoT met Augmented Reality: Visualizing the Source of the Wireless Signal in AR View.",
                    "Freedom: Fast Recovery Enhanced VR Delivery Over Mobile Networks.",
                    "GLEAM: An Illumination Estimation Framework for Real-time Photorealistic Augmented Reality on Mobile Devices.",
                    "LpGL: Low-power Graphics Library for Mobile AR Headsets.",
                    "Understanding and Detecting Overlay-based Android Malware at Market Scales.",
                    "Permissions Plugins as Android Apps.",
                    "Elix: Path-Selective Taint Analysis for Extracting Mobile App Links.",
                    "Apps Can Quickly Destroy Your Mobile's Flash: Why They Don't, and How to Keep It That Way.",
                    "\"Jekyll and Hyde\" is Risky: Shared-Everything Threat Mitigation in Dual-Instance Apps.",
                    "Banner: An Image Sensor Reconfiguration Framework for Seamless Resolution-based Tradeoffs.",
                    "CardioCam: Leveraging Camera on Mobile Devices to Verify Users While Their Heart is Pumping.",
                    "pH Watch - Leveraging Pulse Oximeters in Existing Wearables for Reusable, Real-time Monitoring of pH in Sweat.",
                    "Liquid Testing with Your Smartphone.",
                    "Real-time Arm Skeleton Tracking and Gesture Inference Tolerant to Missing Wearable Sensors.",
                    "Aura: Inside-out Electromagnetic Controller Tracking.",
                    "Zero-Effort Cross-Domain Gesture Recognition with Wi-Fi.",
                    "MagTrack: Enabling Safe Driving Monitoring with Wearable Magnetics.",
                    "CloseTalker: Secure, Short-Range Ad Hoc Wireless Communication.",
                    "enClosure: Group Communication via Encounter Closures.",
                    "Are RFID Sensing Systems Ready for the Real World?",
                    "Detecting Misplaced RFID Tags on Static Shelved Items.",
                    "SparSDR: Sparsity-proportional Backhaul and Compute for SDRs.",
                    "This is Your President Speaking: Spoofing Alerts in 4G LTE Networks.",
                    "CASTLE over the Air: Distributed Scheduling for Cellular Data Transmissions.",
                    "WatchTower: Fast, Secure Mobile Page Loads Using Remote Dependency Resolution.",
                    "Toward Reliable Localization by Unequal AoA Tracking.",
                    "An In-depth Study of Commercial MVNO: Measurement and Optimization.",
                    "Graphics-aware Power Governing for Mobile Devices.",
                    "Understanding Fileless Attacks on Linux-based IoT Devices with HoneyCloud.",
                    "Heterogeneous Multi-Mobile Computing.",
                    "Rover Who Make Indoor Radio Map.",
                    "Dissecting 802.11ac Performance - Why You Should Turn Off MU-MIMO.",
                    "Modeling Exploration/Exploitation Decisions through Mobile Sensing for Understanding Mechanisms of Addiction.",
                    "Bringing Context into Emoji Recommendations.",
                    "Virtual-to-Real Transfer via Dynamics Models.",
                    "When Wearable Sensing Meets Arm Tracking.",
                    "When Friends Move: A Deep Learning-based Approach for Friendship Prediction in Mobility Network.",
                    "System Architecture for Progressive Augmented Reality.",
                    "Multi-Agent Deep Reinforcement Learning for Connected Vehicles.",
                    "Sensor Localization System for AR-assisted Disaster Relief Applications.",
                    "Measurement of Smart Speaker Wake-up Response Time with Camera.",
                    "AutoCUP: A Platform for Automatically Creating Aerial Panoramic Map with Multi-UAVs.",
                    "PROMAR: Practical Reference Object-based Multi-user Augmented Reality.",
                    "Automation of Memory Leak Detection and Correction on Android JNI.",
                    "Apps Can Quickly Destroy Your Mobile's Flash - Why They Don't, and How to Keep It That Way.",
                    "Towards Backscatter-enabled Networked Utensils.",
                    "Audio-based Drone Ranging and Localization using Deep Learning.",
                    "enClosure: Group Communication via Encounter Closures.",
                    "Surface++: A Scalable and Self-sustainable Wireless Sound Sensing Surface.",
                    "Using the Analytical Network Process for Controller Placement in Software Defined Networks.",
                    "AuthGPS: Lightweight GPS Authentication against GPS and LTE Spoofing.",
                    "Visualization of City model with VWorld.",
                    "Data Rate and Transmission Power Adaptation for Bluetooth Low Energy.",
                    "Prototyping Functional Android App Features with ProDroid.",
                    "Towards Condition-Independent Deep Mobile Sensing.",
                    "Sensorless Indoor Localization Utilizing Collaborative Data Acquisition through Gamification.",
                    "Basic Study of BLE Indoor Localization using LSTM-based Neural Network.",
                    "The Light Will Be with You. Always - A Novel Continuous Mobile Authentication with the Light Sensor.",
                    "Relationship Between LF/HF Value in Heart Rate and Used Mobile Applications.",
                    "Data Collection from Outdoor IoT 802.15.4 Sensor Networks using Unmanned Aerial Systems.",
                    "Detection of Misplaced Stationary RFID Tags.",
                    "Deep ECG Wave Estimation Model with Seismograph Sensor.",
                    "Towards Supporting IoT Device Storage and Network Security Using DTLS.",
                    "Expediting IoT Application Testing.",
                    "Development of a Low-cost Gas Sensor Unit for Wide Area Air Pollution Monitoring System.",
                    "EasyTrack - Orchestrating Large-scale Mobile User Experimental Studies.",
                    "Animal-Borne Acoustic Gunshot Detector.",
                    "Detecting Arrivals and Departure of Subway Train Using Linear Accelerometer.",
                    "Saliency based 360° Video Contents Encoding for Streaming Service.",
                    "Distributed Network Resource Sharing AP in Inter-WLAN Environments.",
                    "Intrusion Detection on IoT Services using Event Sampling and Correlation.",
                    "Outlier Detection for Ship Trajectory Prediction.",
                    "Multi-Access Edge Computing based Simulation Offloading for 5G Mobile Application.",
                    "Sensor Network for Transmitting Tsunami Information using MAD-SS Technology in Tosa Bay.",
                    "SAKURA a Model Based Root Cause Analysis Framework for vIMS.",
                    "A Lightweight Network Slicing Orchestration Architecture.",
                    "RC Function Virtualization - You Can Remote Control Drone Squadrons.",
                    "Natural Language Voice based Authentication Mechanism for Smartphones.",
                    "SEEjang: Smart, Easy, and Economical Offline Shopping Assist App Development through a Design Thinking Proces.",
                    "Predicting Air Quality using Moving Sensors.",
                    "Teach Once and Use Everywhere - Building AI Assistant Eco-Skills via User Instruction and Demonstration.",
                    "Accelerating Applications in the Fast-moving Devices with Proactive Provisioning.",
                    "Partitioning Garbage Collection Between the Secure and Normal Worlds for Trusted Applications.",
                    "CINT - An Energy-efficient Mixed-signal In-Memory CNN Accelerator Based on NOR Flash Memory.",
                    "MR and IoT Convergence Platform with AI Support for Disaster Recognition.",
                    "High Precision Relative Positioning on a Mobile.",
                    "Right Intervention at Right Time to Right Person for Healthy Behavior Adaptation.",
                    "Gas Sensing with COTS RFID Devices.",
                    "Smartphone Based Wellness Application for Healthy Lifestyle Promotion.",
                    "Towards Privacy-preserving Mobile Applications with Federated Learning: The Case of Matrix Factorization.",
                    "CNN Based Human Detection for Unmanned Aerial Vehicle.",
                    "Towards Precise Localization of E-Scooters Using Sidewalk Ramps.",
                    "Medical Concept Extraction using Smartphone and Natural Language Processing Techniques.",
                    "SoundUAV: Fingerprinting Acoustic Emanations for Delivery Drone Authentication.",
                    "RSSI based Power Control Algorithm for C-V2X Mode 4.",
                    "Accelerating Colorizer of Shaded Image for Autonomous Driving in Resource-Constrained SoC.",
                    "Towards the Experience of Daytime Driving at Night.",
                    "80% of Block Propagation Rate is Enough - Towards Secure and Efficient PoW-based Blockchain Consensus.",
                    "Gait Dependency of Smartphone Walking Speed Estimation using Deep Learning.",
                    "Machine Learning without Real-world Data.",
                    "Grid-based Gaussian Modeling for Cellular Positioning.",
                    "Capturing Subjective Time as Context and It's Applications.",
                    "Accurate Eating Detection on a Daily Wearable Necklace.",
                    "Latency Adaptive Streaming of 8K 360 Degree Video to Mobile VR Headsets.",
                    "Light-Weight Programming Language for Blockchain.",
                    "meChat: In-device Conversational Photo Sharing Service.",
                    "Situation-Aware Conversational Agent with Kinetic Earables.",
                    "GLEAM - An Illumination Estimation Framework for Real-time Photorealistic Augmented Reality on Mobile Devices.",
                    "Telekinetic Thumb Summons Out-of-reach Touch Interface Beneath Your Thumbtip.",
                    "This is Your President Speaking: Spoofing Alerts in 4G LTE Networks.",
                    "A Robust and Customizable Tracking Algorithm for Accurate Heart Rate Estimation.",
                    "Passive Detection of Perceived Stress Using Location-driven Sensing Technologies at Scale.",
                    "Sender-Controlled Mobile Instant Message Notifications Using Activity Information.",
                    "Motivating Long-term Dietary Habit Modification through Mobile MR Gamification.",
                    "CASTLE over the Air - Distributed Scheduling for Cellular Data Transmissions.",
                    "An Immersive Visualization of Micro-climatic Data using USC AiR.",
                    "Towards Peripheral Awareness of Remote Family Member's Context Using Self-mobile Robotic Avatars.",
                    "PotholeEye - How Can We Effectively Maintain the Pavement Distress?",
                    "Automatic Assessment Framework for Range of Motion Test using Wearable Device and Smartphone.",
                    "Backscatter-enabled Polymorphic Light Sensors.",
                    "Earable - An Ear-Worn Biosignal Sensing Platform for Cognitive State Monitoring and Human-Computer Interaction.",
                    "pH Watch - Leveraging Pulse Oximeters in Existing Wearables for Reusable, Real-time Monitoring of pH in Sweat.",
                    "The Indoor Environment Monitoring System for Intelligent Buildings Using Wifi Mesh Based Internet of Things.",
                    "Edge Acceleration of Deep Neural Networks.",
                    "RemoteGL - Towards Low-latency Interactive Cloud Graphics Experience for Mobile Devices.",
                    "Video Analytics - Killer App for Edge Computing.",
                    "Robot-Assisted Acupuncture.",
                    "Crypto Wallet Working on Low-cost 4G LTE Mobile Phone.",
                    "Micropayments for Trusted Vehicular Services using MOTIVE.",
                    "Real-Time Object Identification with a Smartphone Knock.",
                    "Banner - An Image Sensor Reconfiguration Framework for Seamless Resolution-based Tradeoffs.",
                    "Heterogeneous Multi-Mobile Computing.",
                    "Indoor Dialog Agent in Mixed Reality."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2019mcss",
                "sub_name": "Proceedings of the 5th ACM Workshop on Mobile Systems for Computational Social Science, MCSS@MobiSys 2019, Seoul, Republic of Korea, June 21, 2019.",
                "count": 6,
                "papers": [
                    "On Hyper-local Conversational Agents in Urban Settings.",
                    "Evaluating Machine Learning Algorithms for Prediction of the Adverse Valence Index Based on the Photographic Affect Meter.",
                    "A Semantic and Social Structure of Platform Business.",
                    "How Notification Queues Contain Hidden Natural Experiments.",
                    "Mom, I see You Angry at Me! Designing a Mobile Service for Parent-child Conflicts by In-situ Emotional Empathy.",
                    "Exploratory Analysis of Individuals' Mobility Patterns and Experienced Conflicts in Workgroups."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2019wearsys",
                "sub_name": "The 5th ACM Workshop on Wearable Systems and Applications, WearSys@MobiSys 2019, Seoul, Republic of Korea, June 17-21, 2019.",
                "count": 15,
                "papers": [
                    "Keynote - Eye Itself as a Camera: Sensors, Integrity, and Trust.",
                    "Why Wear a Battery? The Future of Wearables May be Batteryless.",
                    "A Mobility Evaluation of Tilt Panning and Offset Sensing Smart Watch Input.",
                    "Understanding the Predictability of Smartwatch Usage.",
                    "Wrist-worn Wearable Sensors to Understand Insides of the Human Body: Data Quality and Quantity.",
                    "Protecting Visual Information in Augmented Reality from Malicious Application Developers.",
                    "WhereWear: Calibration-free Wearable Device Identification through Ambient Sensing.",
                    "Position: Smart KT Tape - A Bendable Wearable System for Muscle Fatigue Sensing.",
                    "Position: Wearable Polymorphic Light Sensors.",
                    "Position: On the Use of Low-cost Sensors for Non-intrustive Newborn Sepsis Monitoring.",
                    "Towards Machine Learning with Zero Real-World Data.",
                    "Cerebro:  A Wearable Solution to Detect and Track User Preferences using Brainwaves.",
                    "Walk to Show Your Identity: Gait-based Seamless User Authentication Framework Using Deep Neural Network.",
                    "Design Fiction for Real-World Connected Wearables.",
                    "Making Sensors Tangible with Long-exposure Photography."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "16th MobiSys 2018",
        "info": "Munich, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2018",
                "sub_name": "Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys 2018, Munich, Germany, June 10-15, 2018.",
                "count": 79,
                "papers": [
                    "SeCloak: ARM Trustzone-based Mobile Peripheral Control.",
                    "TruZ-Droid: Integrating TrustZone with Mobile Operating System.",
                    "VButton: Practical Attestation of User-driven Operations in Mobile Apps.",
                    "Augmented Reality-based Mimicry Attacks on Behaviour-Based Smartphone Authentication.",
                    "My Being to Your Place, Your Being to My Place: Co-present Robotic Avatars Create Illusion of Living Together.",
                    "Cutting the Cord: Designing a High-quality Untethered VR System with Low Latency Remote Rendering.",
                    "AVR: Augmented Vehicular Reality.",
                    "Kite: Building Conversational Bots from Mobile Apps.",
                    "RuntimeDroid: Restarting-Free Runtime Change Handling for Android Apps.",
                    "Empath-D: VR-based Empathetic App Design for Accessibility.",
                    "Sonoloc: Scalable positioning of commodity mobile devices.",
                    "BikeGPS: Accurate Localization of Shared Bikes in Street Canyons via Low-Level GPS Cooperation.",
                    "Gnome: A Practical Approach to NLOS Mitigation for GPS Positioning in Smartphones.",
                    "Explicit Channel Coordination via Cross-technology Communication.",
                    "Spatial Stream Backscatter Using Commodity WiFi.",
                    "Chiron: Concurrent High Throughput Communication for IoT Devices.",
                    "CoReCast: Collision Resilient Broadcasting in Vehicular Networks.",
                    "SandTrap: Tracking Information Flows On Demand with Parallel Permissions.",
                    "Detecting Wireless Spy Cameras Via Stimulating and Probing.",
                    "Shadow Wi-Fi: Teaching Smartphones to Transmit Raw Signals and to Extract Channel State Information to Implement Practical Covert Channels over Wi-Fi.",
                    "TYTH-Typing On Your Teeth: Tongue-Teeth Localization for Human-Computer Interface.",
                    "Depth Aware Finger Tapping on Virtual Displays.",
                    "Brain Password: A Secure and Truly Cancelable Brain Biometrics for Smart Headwear.",
                    "MicroMobile: Leveraging Mobile Advertising for Large-Scale Experimentation.",
                    "TAR: Enabling Fine-Grained Targeted Advertising in Retail Stores.",
                    "CrowdEstimator: Approximating Crowd Sizes with Multi-modal Data for Internet-of-Things Services.",
                    "Widar2.0: Passive Human Tracking with a Single Wi-Fi Link.",
                    "Augmenting Indoor Inertial Tracking with Polarized Light.",
                    "Multipath Triangulation: Decimeter-level WiFi Localization and Orientation with a Single Unaided Receiver.",
                    "On-Demand Deep Model Compression for Mobile Devices: A Usage-Driven Model Selection Framework.",
                    "Multi-User Gesture Recognition Using WiFi.",
                    "BARNET: Towards Activity Recognition Using Passive Backscattering Tag-to-Tag Network.",
                    "WiSh: Towards a Wireless Shape-aware World using Passive RFIDs.",
                    "LiquID: A Wireless Liquid IDentifier.",
                    "Cross-Platform Support for Rapid Development of Mobile Acoustic Sensing Applications.",
                    "AIM: Acoustic Imaging on a Mobile.",
                    "Rubiks: Practical 360-Degree Streaming for Smartphones.",
                    "Avoiding an IoT 'Tragedy of the Commons'.",
                    "I3: An IoT Marketplace for Smart Communities.",
                    "Lifelong Learning on Harvested Energy.",
                    "Data Analytics Service Composition and Deployment on IoT Devices.",
                    "Decentralised Edge-Computing and IoT through Distributed Trust.",
                    "Leveraging Secure Multiparty Computation in the Internet of Things.",
                    "TrustGyges: A Hidden Volume Solution with Cloud Safe Storage and TEE.",
                    "Using Crowdsourcing Data for Adaptive Video Streaming in Cellular Network.",
                    "A PUF Seed Generator for RIOT: Introducing Crypto-Fundamentals to the Wild.",
                    "When Autonomous Drones Meet Driverless Cars.",
                    "A Multipath Transport Multihoming Mobile Relay Architecture for High-speed Rails Networking.",
                    "Named-data Emergency Network Services.",
                    "Audio-Kinetic Model for Automatic Dietary Monitoring with Earable Devices.",
                    "Spatial Audio for Human-Object Interactions in Small AR Workspaces.",
                    "Pathstore, A Data Storage Layer For The Edge.",
                    "On-Wearable AI to Model Human Interruptibility.",
                    "An Accurate Smartphone Ranging System.",
                    "Exploring an Inclusive User Interface through Respiration.",
                    "Speech in Smartwatch based Audio.",
                    "Design and Implementation of Driving Information Collection System for Driver Behavior Analysis.",
                    "LightCert: Designing Smaller Certificates for the Internet of Things Devices.",
                    "RaDiCS: Distributed Computing Service over Raspberry Pis with Unikernels.",
                    "Reactive Mesh Simplification for Augmented Reality Head Mounted Displays.",
                    "Using Pre-trained Full-Precision Models to Speed Up Training Binary Networks For Mobile Devices.",
                    "Deterministic binary filters for keyword spotting applications.",
                    "Inference of Big-Five Personality Using Large-scale Networked Mobile and Appliance Data.",
                    "Touchless Wireless Authentication via LocalVLC.",
                    "CAR: The Cleanest Air Routing Algorithm for Path Navigation with Minimal PM2.5 Exposure on the Move.",
                    "A Novel Finger-Assisted Touch-free Text Input System Without Training.",
                    "Empath-D: VR-based Empathetic App Design for Accessibility.",
                    "VolksFlow: Crowd Mobility Analytics with Multi-modal Data for Internet-of-Things Services.",
                    "Wireless Video Streaming for Ultra-low-power Cameras.",
                    "Empowering Cyber-Physical Systems with FADEX.",
                    "Cross-Technology Interference Nulling for Improved LTE-U/WiFi Coexistence.",
                    "System-E: Enhancing Privacy on Mobile Systems through Content-Based Classification and Storage.",
                    "Distributed Real-Time Generative 3D Hand Tracking using Edge GPGPU Acceleration.",
                    "eSense: Earable Platform for Human Sensing.",
                    "Seamless Producer Mobility for the Industrial Information-Centric Internet.",
                    "Software-defined Visible Light Backscatter Network.",
                    "Plug & Play Network Application Chaining for Multi-Service Programmability in 5G RAN.",
                    "HomeMeld: Co-present Robotic Avatar System for Illusion of Living Together.",
                    "Video: Enabling Public Cameras to Talk to the Public."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018phd",
                "sub_name": "Proceedings of the 2018 MobiSys 2018 Ph.D. Forum, Munich, Germany, June 10, 2018.",
                "count": 6,
                "papers": [
                    "Securing Embedded Networks through Secure Collective Attestation.",
                    "Passive Human Sensing with COTS Wi-Fi.",
                    "Toward Privacy Enhanced Solutions For Granular Control Over Health Data Collected by Wearable Devices.",
                    "OS-level Software & Hardware Attacks and Defenses.",
                    "Air Quality Friendly Route Recommendation System.",
                    "Internet of Environmental Things: A Human Centered Approach."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018dronet",
                "sub_name": "Proceedings of the 4th ACM Workshop on Micro Aerial Vehicle Networks, Systems, and Applications, DroNet@MobiSys 2018, Munich, Germany, June 10-15, 2018.",
                "count": 17,
                "papers": [
                    "ASTRO: Autonomous, Sensing, and Tetherless netwoRked drOnes.",
                    "Do Unmanned Aerial Vehicles Cause Harmful Interference to Ground Wireless Network Deployments?",
                    "Axis- plus Content-based Control for Camera Drones: Design and Evaluation of User Interface Concepts.",
                    "Aerial Drones with Direction Sensitive DeepEars.",
                    "Structural Health Monitoring of Multi-Rotor Micro Aerial Vehicles.",
                    "Surveying Areas in Developing Regions Through Context Aware Drone Mobility.",
                    "EffFeu project: Efficient Operation of Unmanned Aerial Vehicles for Industrial Fire Fighters.",
                    "A NFV system to support configurable and automated multi-UAV service deployments.",
                    "Topology Control of Unmanned Aerial Vehicle (UAV) Mesh Networks: A Multi-Objective Evolutionary Algorithm Approach.",
                    "In-Band LOS Discovery Between Drones Using Highly Directional Transceivers.",
                    "UAV-Direct: Facilitating D2D Communications for Dynamic and Infrastructure-less Networking.",
                    "Benchmarking of Routing Algorithms in 3D MANETs.",
                    "GazeDrone: Mobile Eye-Based Interaction in Public Space Without Augmenting the User.",
                    "Self-Localization of Micro AUVs Using a Low-Power, Low-Cost Acoustic Modem: Poster.",
                    "Drones, Smartphones and Sensors to Face Natural Disasters.",
                    "Graph-theoretic approach for UAV-aided network connectivity.",
                    "Drone Noise Reduction through Audio Waveguiding."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018ioparts",
                "sub_name": "Proceedings of the 1st International Workshop on Internet of People, Assistive Robots and ThingS, IoPARTS@MobiSys 2018, Munich, Germany, June 10, 2018.",
                "count": 12,
                "papers": [
                    "CommonSense: Collaborative learning of scene semantics by robots and humans.",
                    "Transparent Fault Tolerance for Real-Time Automation Systems.",
                    "An Actor Based Architecture For Multi-Robot System With Application To Warehouse.",
                    "Geometric Mapping for Sustained Indoor Autonomy.",
                    "Wireless Mesh Routing For Indoor Robotic Communications.",
                    "SkyHelp: UAV Assisted Emergency Communication in Deep Open Pit Mines.",
                    "Planning Mobile Charging Vehicles Based on User Charging Behavior.",
                    "Towards Accurate and Real-time Information Extrapolation on Charging Pile Network.",
                    "Localizing a Depth Measuring Sensor In Flood Scenario.",
                    "Analysing Multi-Point Multi-Frequency Machine Vibrations using Optical Sampling.",
                    "The Analysis of Features Importance in Electrical Infrared Images Faults Diagnosis.",
                    "Geomagnetic Field based Human Search and Following for Autonomous Robots."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018cryblock",
                "sub_name": "Proceedings of the 1st Workshop on Cryptocurrencies and Blockchains for Distributed Systems, CRYBLOCK@MobiSys 2018, Munich, Germany, June 15, 2018.",
                "count": 20,
                "papers": [
                    "ChainSoft: Collaborative Software Development using Smart Contracts.",
                    "Hierarchical interactions between Ethereum smart contracts across Testnets.",
                    "Towards Blockchain-enabled Wireless Mesh Networks.",
                    "Open Peer-to-Peer Systems over Blockchain and IPFS: an Agent Oriented Framework.",
                    "Resilient, crowd-sourced LPWAN infrastructure using blockchain.",
                    "Block-Supply Chain: A New Anti-Counterfeiting Supply Chain Using NFC and Blockchain.",
                    "Non-Blocking Two Phase Commit Using Blockchain.",
                    "Number of confirmation blocks for Bitcoin and GHOST consensus protocols on networks with delayed message delivery: Extended abstract.",
                    "Blockchain Enlightenment and Smart City Cryptopolis.",
                    "Conquering Generals: an NP-Hard Proof of Useful Work.",
                    "Securing Physical Assets on the Blockchain: Linking a novel Object Identification Concept with Distributed Ledgers.",
                    "Blockchain-based Identity Management with Mobile Device.",
                    "Mitigating loT Device based DDoS Attacks using Blockchain.",
                    "From Bitcoin to Bitcoin Cash: a network analysis.",
                    "MARS: Monetized Ad-hoc Routing System (A Position Paper).",
                    "ChargeltUp: On Blockchain-based technologies for Autonomous Vehicles.",
                    "A Blockchain-based Flight Data Recorder for Cloud Accountability.",
                    "Feather forking as a positive force: incentivising green energy production in a blockchain-based smart grid.",
                    "Design Thinking using the Blockchain: Enable Traceability of Intellectual Property in Problem-Solving Processes for Open Innovation.",
                    "Federated Byzantine Agreement to Ensure Trustworthiness of Digital Manufacturing Platforms."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018edgesys",
                "sub_name": "Proceedings of the 1st International Workshop on Edge Systems, Analytics and Networking, EdgeSys@MobiSys 2018, Munich, Germany, June 10, 2018.",
                "count": 10,
                "papers": [
                    "EdgeEye: An Edge Service Framework for Real-time Intelligent Video Analytics.",
                    "The Web as a Distributed Computing Platform.",
                    "Enabling GPU-assisted Antivirus Protection on Android Devices through Edge Offloading.",
                    "A Multi-Cloudlet Infrastructure for Future Smart Cities: An Empirical Study.",
                    "Profit-aware Resource Management for Edge Computing Systems.",
                    "Duvel: Enabling Context-driven, Multi-profile Apps on Android through Storage Sandboxing.",
                    "Enabling Edge Devices that Learn from Each Other: Cross Modal Training for Activity Recognition.",
                    "Semi-Edge: From Edge Caching to Hierarchical Caching in Network Fog.",
                    "Voice enabling mobile applications with UIVoice.",
                    "Sizing Buffers of IoT Edge Routers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018wearsys",
                "sub_name": "Proceedings of the 4th ACM Workshop on Wearable Systems and Applications, WearSys@MobiSys 2018, Munich, Germany, June 10, 2018.",
                "count": 11,
                "papers": [
                    "Disposable, stretchable on-skin sensors for posture monitoring.",
                    "Exploring audio and kinetic sensing on earable devices.",
                    "FSO-VR: steerable free space optics link for virtual reality headsets.",
                    "Understanding activity segmentation for multi-sport competitions.",
                    "Keystroke inference using ambient light sensor on wrist-wearables: a feasibility study.",
                    "Mindful interruptions: a lightweight system for managing interruptibility on wearables.",
                    "TILES audio recorder: an unobtrusive wearable solution to track audio activity.",
                    "Table of interest: activity recognition and behaviour analysis using a battery less wearable sensor.",
                    "The potential of wearable technology for monitoring social interactions based on interpersonal synchrony.",
                    "Visual features for ego-centric activity recognition: a survey.",
                    "Challenges with real-world smartwatch based audio monitoring."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2018emdl",
                "sub_name": "Proceedings of the 2nd International Workshop on Embedded and Mobile Deep Learning, EMDL@MobiSys 2018, Munich, Germany, June 15, 2018.",
                "count": 8,
                "papers": [
                    "Efficiently Combining SVD, Pruning, Clustering and Retraining for Enhanced Neural Network Compression.",
                    "D-Pruner: Filter-Based Pruning Method for Deep Convolutional Neural Network.",
                    "On-the-fly deterministic binary filters for memory efficient keyword spotting applications on embedded devices.",
                    "Mobile Based Continuous Authentication Using Deep Features.",
                    "Mayo: A Framework for Auto-generating Hardware Friendly Deep Neural Networks.",
                    "HARNet: Towards On-Device Incremental Learning using Deep Ensembles on Constrained Devices.",
                    "Neural Network Syntax Analyzer for Embedded Standardized Deep Learning.",
                    "QualityDeepSense: Quality-Aware Deep Learning Framework for Internet of Things Applications with Sensor-Temporal Attention."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "15th MobiSys 2017",
        "info": "Niagara Falls, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2017",
                "sub_name": "Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys'17, Niagara Falls, NY, USA, June 19-23, 2017.",
                "count": 84,
                "papers": [
                    "Augmenting the Human Experience.",
                    "BackDoor: Making Microphones Hear Inaudible Sounds.",
                    "Strata: Fine-Grained Acoustic-based Device-Free Tracking.",
                    "SoundSifter: Mitigating Overhearing of Continuous Listening Devices.",
                    "BatMapper: Acoustic Sensing Based Indoor Floor Plan Construction Using Smartphones.",
                    "MobileDeepPill: A Small-Footprint Mobile Deep Learning System for Recognizing Unconstrained Pill Images.",
                    "DeepEye: Resource Efficient Local Execution of Multiple Deep Vision Models using Wearable Commodity Hardware.",
                    "DeepMon: Mobile GPU-based Deep Learning Framework for Continuous Vision Applications.",
                    "Enabling High-Precision Visible Light Localization in Today's Buildings.",
                    "POLI: Long-Range Visible Light Communications Using Polarized Light Intensity Modulation.",
                    "Card-stunt as a Service: Empowering a Massively Packed Crowd for Instant Collective Expressiveness.",
                    "CELLI: Indoor Positioning Using Polarized Sweeping Light Beams.",
                    "Poster: Multicamera Synchronization for Smartphones using Optimally Modulated Illuminations.",
                    "Poster: Sdguard: An Android Application Implementing Privacy Protection and Ransomware Detection.",
                    "Poster: MobiTemplate: A Template-based Rapid Cross-Platform Mobile Application Development Environment.",
                    "Poster: Mobile Power Management Using FreeRTOS-based Uninterruptable Generator Supply.",
                    "Poster: Charge My Phone As I Instruct.",
                    "Poster: Docker-Based Self-Organizing IoT Services Architecture for Smarthome.",
                    "Poster: Improve Push Notification on Smartwatches.",
                    "Poster: Mobile Photo Data Management as a Platform Service.",
                    "Poster: Towards Quick Angular Check to Rebuff Forged Position Attacks in Vehicular Communication.",
                    "Poster: Visual Cue-Based VRU Protection on Smartphones.",
                    "Poster: A Lightweight Live Migration Platform with Container-based Virtualization for System Resilience.",
                    "Poster: Application-Layer Optimization of Performance vs Energy in Mobile Network I/O.",
                    "Poster: Vocal Resonance as a Passive Biometric.",
                    "Poster: Occupancy State Detection using WiFi Signals.",
                    "Poster: Smartwatch Knows How Much You Drink.",
                    "Poster: EPS: Edge-hosted Personal Services for Mobile Users.",
                    "Poster: HeartFit: An Intuitive Smartphone Application for Well-being of Hypertensive Patients.",
                    "Poster: Flood Monitoring using Computer Vision.",
                    "Poster: Impact of Ground Truth Errors on Wi-Fi Localization Accuracy.",
                    "Poster: Observe. Patternize. Mimic.: Leveraging Patterns in Mobile-User Behavior for Enterprise Applications.",
                    "Poster: RTDroid: A Real-Time Solution with Android.",
                    "Poster: Securing Device Inputs for Smartphones Using Hypervisor Based Approach.",
                    "Poster: Memory Protection in Ultra-Low-Power Multi-Application Wearables.",
                    "Poster: Android Malware Detection using Multi-Flows and API Patterns.",
                    "Poster: Camera Images Offloading in Low-resource Wireless Networks.",
                    "Poster: Redundancy Aided Vehicular Networking.",
                    "Poster: Twirl: : On the Benefits of Adapting Orientation of a WiFi Access-Point.",
                    "Poster: Online Map Matching for Passive Indoor Positioning Systems.",
                    "Poster: Auracle: A Wearable Device for Detecting and Monitoring Eating Behavior.",
                    "Poster: Characters vs. Words: Observations on Command Design for Brain-Computer Interfaces.",
                    "Poster: Field Testing Vehicular Networks using OpenC2X.",
                    "Poster: ARM Errata and their Software Workarounds.",
                    "Poster: Extensive Evaluation of Emotional Contagion on Smiling Selfies over Social Network.",
                    "Demo: Mobile Contextual Advertising Platform based on Tiny Text Intelligence.",
                    "Demo: BlueMountain: An Architecture to Customize Data Management on Mobile Systems.",
                    "Demo: Fusing Mobile Sensors for Paper Keyboard On-the-Go.",
                    "Demo: sigSocial: A Novel Social Media Aggregation Service using a Tiny Text Intelligence.",
                    "Demo: Fully Automated UI Testing System for Large-scale Android Apps Using Multiple Devices.",
                    "Demo: DeepMon: Building Mobile GPU Deep Learning Models for Continuous Vision Applications.",
                    "Demo: Card-stunt as a Service: Empowering a Massively Packed Crowd for Instant Collective Expressiveness.",
                    "Demo: AWSense: A Framework for Collecting Sensing Data from the Apple Watch.",
                    "Demo: Riding the Non-linearities to Record Ultrasound with Smartphones.",
                    "Demo: Detecting Group Formations using iBeacon Technology.",
                    "Demo: Enabling Dynamic Gesture Mapping with UI Events.",
                    "Demo: iBlink: Smart Glasses for Facial Paralysis Patients.",
                    "Demo: Reptor: Enabling API Virtualization on Android for Platform Openness.",
                    "Demo: CELLI: Indoor Positioning using Polarized Sweeping Light Beams.",
                    "Demo: Live Video Stream Triggers.",
                    "ALOHA to the Web.",
                    "SchrodinText: Strong Protection of Sensitive Textual Content of Mobile Applications.",
                    "Matthan: Drone Presence Detection by Identifying Physical Signatures in the Drone's RF Communication.",
                    "System Service Call-oriented Symbolic Execution of Android Framework with Applications to Vulnerability Discovery and Exploit Generation.",
                    "Enabling Gesture-based Interactions with Objects.",
                    "Position and Orientation Agnostic Gesture Recognition Using WiFi.",
                    "Object Recognition and Navigation using a Single Networking Device.",
                    "BreathPrint: Breathing Acoustics-based User Authentication.",
                    "Glimpse: A Programmable Early-Discard Camera Architecture for Continuous Mobile Vision.",
                    "Accelerating Mobile Audio Sensing Algorithms through On-Chip GPU Offloading.",
                    "Enabling Cross-ISA Offloading for COTS Binaries.",
                    "Mobile Plus: Multi-device Mobile Platform for Cross-device Functionality Sharing.",
                    "Indoor Follow Me Drone.",
                    "iBlink: Smart Glasses for Facial Paralysis Patients.",
                    "BigRoad: Scaling Road Data Acquisition for Dependable Self-Driving.",
                    "Characterizing Smartwatch Usage in the Wild.",
                    "Reptor: Enabling API Virtualization on Android for Platform Openness.",
                    "iCharge: User-Interactive Charging of Mobile Devices.",
                    "Accelerating Mobile Web Loading Using Cellular Link Information.",
                    "Open Data Kit 2.0: A Services-Based Application Framework for Disconnected Data Management.",
                    "Heimdall: A Privacy-Respecting Implicit Preference Collection Framework.",
                    "Trust but Verify: Auditing the Secure Internet of Things.",
                    "Techu: Open and Privacy-Preserving Crowdsourced GPS for the Masses.",
                    "TrustShadow: Secure Execution of Unmodified Applications with ARM TrustZone."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017dronet",
                "sub_name": "Proceedings of the 3rd Workshop on Micro Aerial Vehicle Networks, Systems, and Applications, DroNet@MobiSys 2017, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 9,
                "papers": [
                    "PROTC: PROTeCting Drone's Peripherals through ARM TrustZone.",
                    "Mission Support for Drones: a Policy Based Approach.",
                    "A Novel Hybrid Path Planning Algorithm for Localization in Wireless Networks.",
                    "ASIMUT project: Aid to SItuation Management based on MUltimodal, MUltiUAVs, MUltilevel acquisition Techniques.",
                    "Drone Networks for Virtual Human Teleportation.",
                    "Identifying Mosquito Breeding Sites via Drone Images.",
                    "Network Traffic Analysis of a Small Quadcopter.",
                    "Increasing the Cellular Network Capacity Using Self-Organized Aerial Base Stations.",
                    "FANET Application Scenarios and Mobility Models."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017phdf",
                "sub_name": "Proceedings of the 2017 Workshop on MobiSys 2017 Ph.D. Forum, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 10,
                "papers": [
                    "Wearable Sensing Approaches for Stress Recognition in Everyday Life.",
                    "Enabling Large-Scale Road Data Acquisition with an Easy-to-Install and Sustainable Setup.",
                    "Mobile Sensing Through Deep Learning.",
                    "A Context-driven Energy Assessment for Energy-aware Development of Mobile Sensing Applications.",
                    "Starting your Research Career after a PhD.",
                    "Toward Battery-free Smart Cameras.",
                    "Flexible Data Management on Mobile Systems.",
                    "Extended Abstract: Building Mobile Application Frameworks for Disconnected Data Management.",
                    "Spectrum Sharing of Wi-Fi and DSRC In The 5.9 GHz Band.",
                    "Android Security via Static Program Analysis."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017wearsys",
                "sub_name": "Proceedings of the 2017 Workshop on Wearable Systems and Applications, WearSys 2017, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 11,
                "papers": [
                    "mSelf: Using Mobile Sensors to Self-monitor and Improve Health, Wellness, and Performance.",
                    "Challenges and Opportunities in Wearable Systems.",
                    "AuthoRing: Wearable User-presence Authentication.",
                    "Capacitive Sensing 3D-printed Wristband for Enriched Hand Gesture Recognition.",
                    "Toward a Wearable Sensor for Eating Detection.",
                    "A Photoplethysmograph Based Practical Heart Rate Estimation Algorithm for Wearable Platforms.",
                    "Detecting Compensatory Trunk Movements in Stroke Survivors using a Wearable System.",
                    "Poster: Understanding Long-Term Adoption of Wearable Activity Trackers Among Older Adults.",
                    "Distributed Adaptive Model Predictive Control of a Cluster of Autonomous and Context-Sensitive Body Cameras.",
                    "Toward Accurate and Efficient Feature Selection for Speaker Recognition on Wearables.",
                    "Rethink Phone-Wearable Collaboration From the Networking Perspective."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017digitalbiomarker",
                "sub_name": "Proceedings of the 1st Workshop on Digital Biomarkers, DigitalBioMarker@MobiSys, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 8,
                "papers": [
                    "A Quantum of Solace: Digital Traces and Mental Health.",
                    "Designing Effective Movement Digital Biomarkers for Unobtrusive Emotional State Mobile Monitoring.",
                    "Discovery of Behavioral Markers of Social Anxiety from Smartphone Sensor Data.",
                    "Motion Biomarkers for Early Detection of Dementia-Related Agitation.",
                    "Exploring Symmetric and Asymmetric Bimanual Eating Detection with Inertial Sensors on the Wrist.",
                    "MyoBuddy: Detecting Barbell Weight Using Electromyogram Sensors.",
                    "Observation Time vs. Performance in Digital Phenotyping.",
                    "Panel: Designing Studies for Feasibility Testing, Refinement and Validation of Digital Biomarkers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017emdl",
                "sub_name": "Proceedings of the 1st International Workshop on Embedded and Mobile Deep Learning (Deep Learning for Mobile Systems and Applications), EMDL@MobiSys 2017, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 5,
                "papers": [
                    "MobiRNN: Efficient Recurrent Neural Network Execution on Mobile GPU.",
                    "RSTensorFlow: GPU Enabled TensorFlow for Deep Learning on Commodity Android Devices.",
                    "Pruning Filters and Classes: Towards On-Device Customization of Convolutional Neural Networks.",
                    "Practical Processing of Mobile Sensor Data for Continual Deep Learning Predictions.",
                    "Design and Implementation of the Vehicular Camera System using Deep Neural Network Compression."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2017wpa",
                "sub_name": "Proceedings of the 4th International on Workshop on Physical Analytics, WPA@MobiSys 2017, Niagara Falls, NY, USA, June 23, 2017.",
                "count": 7,
                "papers": [
                    "Towards Unobtrusive Mental Well-Being Monitoring for Independent-Living Elderly.",
                    "Experiences in Building a Real-World Eating Recogniser.",
                    "Peripheral WiFi Vision: Exploiting Multipath Reflections for More Sensitive Human Sensing.",
                    "Konark: A RFID based System for Enhancing In-store Shopping Experience.",
                    "CamMirror: Single-Camera-based Distance Estimation for Physical Analytics Applications.",
                    "Can Mobile Workforce Revolutionize Country-Scale Crowdsourcing?",
                    "ENACT: Encounter-based Architecture for Contact Tracing."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "14th MobiSys 2016",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2016",
                "sub_name": "Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys 2016, Singapore, June 26-30, 2016.",
                "count": 31,
                "papers": [
                    "LiveLabs: Building In-Situ Mobile Sensing & Behavioural Experimentation TestBeds.",
                    "Platypus: Indoor Localization and Identification through Sensing of Electric Potential Changes in Human Bodies.",
                    "The Design and Implementation of a Mobile RFID Tag Sorting Robot.",
                    "Idea: A System for Efficient Failure Management in Smart IoT Environments.",
                    "Listening through a Vibration Motor.",
                    "Practical Human Sensing in the Light.",
                    "I am a Smartwatch and I can Track my User's Arm.",
                    "BodyScan: Enabling Radio-based Sensing on Wearable Devices for Contactless Activity and Vital Sign Monitoring.",
                    "Beetle: Flexible Communication for Bluetooth Low Energy.",
                    "MCDNN: An Approximation-Based Execution Framework for Deep Stream Processing Under Resource Constraints.",
                    "TaskFolder: Dynamic and Fine-Grained Workload Consolidation for Mobile Devices.",
                    "Understanding the Characteristics of Android Wear OS.",
                    "Mobility Modeling and Prediction in Bike-Sharing Systems.",
                    "Defending against Sybil Devices in Crowdsourced Mapping Services.",
                    "TransitLabel: A Crowd-Sensing System for Automatic Labeling of Transit Stations Semantics.",
                    "Reactive Control of Autonomous Drones.",
                    "DefDroid: Towards a More Defensive Mobile OS Against Disruptive App Behavior.",
                    "I-Pic: A Platform for Privacy-Compliant Image Capture.",
                    "What You Mark is What Apps See.",
                    "Viola: Trustworthy Sensor Notifications for Enhanced Privacy on Mobile Systems.",
                    "Expansion of Human-Phone Interface By Sensing Structure-Borne Sound Propagation.",
                    "FlashBack: Immersive Virtual Reality on Mobile Devices via Rendering Memoization.",
                    "uLink: Enabling User-Defined Deep Linking to App Content.",
                    "FOCUS: Robust Visual Codes for Everyone.",
                    "Practical Bluetooth Traffic Sniffing: Systems and Privacy Implications.",
                    "Characterizing and Improving WiFi Latency in Large-Scale Operational Networks.",
                    "ReCon: Revealing and Controlling PII Leaks in Mobile Network Traffic.",
                    "CASE: Comprehensive Application Security Enforcement on COTS Mobile Devices.",
                    "Targeted Mimicry Attacks on Touch Input Based Implicit Authentication Schemes.",
                    "Privacy Capsules: Preventing Information Leaks by Mobile Apps.",
                    "Regulating ARM TrustZone Devices in Restricted Spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016c",
                "sub_name": "Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services Companion, Singapore, Singapore, June 25-30, 2016.",
                "count": 147,
                "papers": [
                    "Demo: Cloud-Based Vehicular Data Analytics Platform.",
                    "Demo: Real-Time C2C Matching Based on Social Media Messages.",
                    "Poster: MonoSense: An Energy Efficient Transportation Mode Detection System.",
                    "Poster: HeuristicIoT: A Framework for Augmenting Heuristic Search Algorithms by Internet-of-Things Data.",
                    "Poster: Privacy Protection for Real World Participatory Sensing System.",
                    "Poster: Rural Broadband Access via TVWs.",
                    "Poster: Measuring Developers' Sentiments in the Android Open Source Project.",
                    "Poster: Calorie-Aware Food Recommendation System.",
                    "Poster: Web Service based Communication for Devices with Limited Resources.",
                    "Poster: A Comparison Study of Wi-Fi Direct and Dedicated Short Range Communication for Intelligent Transport Services.",
                    "POSTER: 2.4 GHz Indoor Path Loss Prediction Model for Multifloored Building.",
                    "Poster: Optimized Ensemble Based Data Classification for Marine Mobile Communication.",
                    "Poster: Improving Road Safety Through Smart-Sensing.",
                    "Poster: Exploring Opportunistic Networks in the Context of Post-Disaster Management Services.",
                    "Poster: Exploring Security as a Service for IoT Enabled Remote Application Framework.",
                    "Poster: RailCop: Detecting Missing Rail on Railway Using Wireless Sensor Networks.",
                    "Poster: HALL: High-accuracy and Low-cost RFID Localization in Large-scale environment.",
                    "Poster: Improving Communication and Communicability with Smarter Use of Text-based Messages on Mobile and Wearable devices.",
                    "Poster: Two-Steps Independent Solution for Rule-based CEP.",
                    "Poster: Developing an Intrusion Detection System for Cloud Computing.",
                    "Poster: Motivation Maintaining of the SNS Users by the Notification of the Regional Contribution Information.",
                    "Poster: PBRE: Population Based Reliable Node Finding in Participatory Sensing.",
                    "Poster: Towards Radio-based Sensing on Wearables.",
                    "Poster: Context Aware Route Determination Model for Mobile Indoor Navigation Systems for Vision Impaired People.",
                    "Poster: A Step Towards Smart Traffic Sign Board by Smart Devices.",
                    "POSTER: A Low Cost Cloud Based System to Handle Flash Flood.",
                    "Poster: Air Quality Monitoring using Low-cost SensingDevices.",
                    "Poster: Virtual Sensor: The Purpose and Applications.",
                    "Poster: Core Temperature Estimation During Exercise Using Wearable Sensors.",
                    "Poster: Android Whole-System Control Flow Analysis for Accurate Application Behavior Modeling.",
                    "Poster: Understanding Social Relationship Using Passive WiFi Scanning.",
                    "Poster: A Lightweight Robust Routing in Strip Wireless Sensor Network with Edge Detect Based Region Divided.",
                    "Poster: Simplified In-door WiFi-Beacon Navigation System Without Exact Location.",
                    "Poster: CarSafe - Feasibility Study of a Life Saving System in a Car.",
                    "Poster: Mobile based Image processing for quick paper marking and audio quiz to engage large class size in developing countries.",
                    "Poster: Smart Adaptive User Interface of Mobile Applications for Semi-Literate People.",
                    "POSTER: Mechanisms for Detecting and Mitigating Performance Drop in Large Scale WiFi Networks.",
                    "Poster: A Magnetic Fingerprint-based Automobile Position Tracking using Smartphones.",
                    "Poster: Searching for Efficient V2X Communication in Intelligent Transportation Systems.",
                    "Poster: Spatio-Temporal Information Correction Mechanism for Wild Animal Wearable Sensors.",
                    "Poster: Overcoming Throughput Degradation in Multi-Radio Cognitive Radio Networks.",
                    "Poster: Infrastructure Independent Indoor Localization for Post-Disaster Rescue Mission.",
                    "Poster: Index Structure for Spatial Keyword Query with Myanmar Language on the Mobile Devices.",
                    "Poster: Low-complexity Outdoor Localization for Long-range, Low-power Radios.",
                    "Poster: Packet Aggregation Scheme for 6Lo Networks in IoT Environments.",
                    "Poster: A Novel Computation Offloading Technique for Reducing Energy Consumption of Smart Watch.",
                    "Poster: Sentiment Analysis of BGM Toward Automatic BGM Selection Based on Emotion.",
                    "Poster: A Real-time Cattle Recognition System using Wireless Multimedia Networks.",
                    "Poster: Worm Propagation Model for Cyber Warfare Modeling and Simulation in Tactical Networks.",
                    "Poster: MobiEar-Building an Environment-independent Acoustic Sensing Platform for the Deaf using Deep Learning.",
                    "Poster: Towards a Multitask Worker Recruitment Framework for Mobile Crowdsensing.",
                    "POSTER: Testing the Efficacy of an SMS-based Tutoring System.",
                    "Poster: ETRACK: Energy Efficient Tracking a Mobile Object Using Under Water Sensors.",
                    "Poster: PDF: Push-based Data Forwarding in Vehicular NDN.",
                    "Poster: Demultiplexing Activities of Daily Living and Reducing Overhead of Storage in IoT enabled Smarthomes.",
                    "Poster: Road Behavior and Stoppage Pattern Analysis from Public Bus Trajectories: A Perspective of Developing Region.",
                    "Poster: Design and Evaluation of Participatory Mobile Sensing Platform for Diverse Sensing and Gamification Scenarios.",
                    "Poster: Crowdsourcing for User Experience(UX) Evaluation.",
                    "Poster: Protibaadi: An Extended Solution to Deal with Sexual Harassment.",
                    "Poster: Optimal Hotspot Selection for Internet Sharing Using Tethering.",
                    "Poster: The Future to Personalize Medicine Is in Your Smart-device.",
                    "POSTER: Enhancement of Cluster-Based Routing Protocol in Wireless Sensor Network.",
                    "Poster: Creation of a Co-Located Mobile-phone Users Group Using Voice.",
                    "Poster: Decentralized Disaster Recovery Networks Using Beacon Stuffing.",
                    "Poster: Power Attack in Body Area Networks: Dream or Reality?",
                    "Poster: Towards Creating User's Impression Map with Wearable Sensors.",
                    "Poster: Network Model of Scalable Remote Healthcare Systems.",
                    "Poster: Energy-efficient Web Browsing in Smartphones.",
                    "POSTER: Accurate Schedule Alarming Based on User Profiling.",
                    "Poster: Optimal Path Finding for Emergency Cases on Android.",
                    "Poster: Software Architecture for Efficiently Designing Cloud Applications using Node.js.",
                    "Poster: Taming Asymmetric Delays for Network Time Protocol Using Electric Grid Frequency.",
                    "Poster: Smart-Phones as Active Sensing Platform for Road Safety Solutions.",
                    "Poster: Advanced Feature Based Deep Learning for Intelligent Human Activity Recognition: An Approach using Scene Context and Composition of Sub Events.",
                    "Poster: Research on Participatory Sensing and Human Behavior Change with Information Presentation Using Monsters.",
                    "Poster: Discovery of Disappeared Node in Large Number of BLE Devices Environment.",
                    "Poster: Breaching Pattern Screen Lock Security.",
                    "Poster: Air Quality Friendly Route Recommendation System.",
                    "Poster: SmartTrafMoniSys: Smartphone based Traffic Monitoring and Management System.",
                    "Poster: Understanding the Routine Activities of Students in Campus using Smartphone Sensors.",
                    "Poster: Reconstruction Accuracy of Data Perturbation in Mobile Environmental Sensing.",
                    "Poster: Discovering User Relationships Through Smartphone Wi-Fi Probes.",
                    "Poster: Energy Efficient Navigation Systems.",
                    "Poster: Interactive Platform for Urban Bird Studies Using Participatory Sensing.",
                    "Poster: Virtual Eye- A Smarter Mode of Interaction to Virtual Tours.",
                    "Poster: Enhancing Fuel Economy of Fleet Vehicles Through Real-Time Driver Monitoring and Feedback.",
                    "Poster: A Bicycle-borne Sensor Network for Monitoring Urban Air Quality.",
                    "Poster: A Device-free Evaluation System for Gymnastics using Passive RFID Tags.",
                    "Poster: KinFrame: Framework for Large Scale Surveillance of Vulnerable People using Depth Camera.",
                    "Poster: Sonicnect: Accurate Hands-Free Gesture Input System with Smart Acoustic Sensing.",
                    "Poster: A Large Number of Soil Temperature and Moisture Sensor and Network System.",
                    "Demo: I-Pic: A Platform for Privacy-Compliant Image Capture.",
                    "Demo: FlashBack: Immersive Virtual Reality on Mobile Devices via Rendering Memoization.",
                    "Demo: A SDR-Based Indoor Localization System for Mobile Devices.",
                    "Demo: Profiling Power Utilization Behaviours of Smartwatch Applications.",
                    "Demo: Exploiting IMU Sensors for IoT Enabled Health Monitoring.",
                    "Demo: LASS: A Location-Aware Sensing System for Participatory PM2.5 Monitoring.",
                    "Demo: Mobile Wireless Charging and Sensing by Drones.",
                    "Demo: Magnetic Positioning Sphere - A Single-Source 3D Positioning System using Rotating Magnetic Fields.",
                    "Demo: Drumming Application Using Commodity Wearable Devices.",
                    "Demo: Building Comprehensible Access Control for the Internet of Things using Beetle.",
                    "Demo: Real-world Deployment of Seat Occupancy Detectors.",
                    "Demo: Sensing Gamers' Emotions Using Physiological Sensors.",
                    "Demo: TA$Ker: Campus-Scale Mobile Crowd-Tasking Platform.",
                    "Demo: Fusing WiFi and Video Sensing for Accurate Group Detection in Indoor Spaces.",
                    "Demo: API Virtualization for Platform Openness in Android.",
                    "Demo: MilliCat: Real-Time Autonomous Image Suggestion for Mobile Messaging.",
                    "Demo: Accelerated Deep Learning Inference for Embedded and Wearable Devices using DeepX.",
                    "Demo: CollaboRoid for Mobile Collaborative Applications.",
                    "Demo: GPU-based Image Recognition and Object Detection on Commodity Mobile Devices.",
                    "Demo: Mobile Plus: Mobile Platform for Transparent Sharing of Functionalities Across Devices.",
                    "Demo: Wanda, Securely Introducing Mobile Devices.",
                    "Demo: Towards Immersive and Interactive Gym Exercises.",
                    "Demo: Smartwatch based Shopping Gesture Recognition.",
                    "Demo: What You Mark is What Apps See.",
                    "Demo: ReCon: Revealing and Controlling PII Leaks in Mobile Network Traffic.",
                    "Demo: Smartwatch based Food Diary & Eating Analytics.",
                    "Demo: Sound Localization using Smartphone.",
                    "Demo: Interactive Visual Privacy Control with Gestures.",
                    "Demo: Free Data Communication Using Wireless Charging.",
                    "Demo: FocusVR: Effective & Usable VR Display Power Management.",
                    "Demo: Multi-device Gestural Interfaces.",
                    "Demo: Augmenting Force-Sensing Interface to Mobile Devices with Sound.",
                    "Demo: MiHub: Wearable Management for IoT.",
                    "Demo: Mobile Platform for Interactive Applications on Everyday Surfaces using a Single Commodity Smartphone.",
                    "Demo: Wearable Application to Manage Problem Behavior in Children with Neurodevelopmental Disorders.",
                    "Demo: Data Analysis and Visualization in Bike-Sharing Systems.",
                    "Poster: A Software-Defined Multi-Camera Network.",
                    "Poster: Mobile Virtual Reality for Head-mounted Displays With Interactive Streaming Video and Likelihood-based Foveation.",
                    "Poster: Approximate Memoization for Perception-based Mobile Applications.",
                    "Poster: NiSleep: Gamification-Friendly Quantitative Evaluation Methodology of Sleep Quality.",
                    "POSTER: Generic Drone Control Platform for Autonomous Capture of Cinema Scenes Submission.",
                    "Poster: SDN for Future Train to Ground Communication Services.",
                    "Poster: QoE-centric Mobile Operating System Design.",
                    "Poster: Cyber-Function Virtualization for Mobile Cyber-Physical Systems.",
                    "Poster: TapSnoop - Inferring Tapstrokes from Listening to Tap Sound on Mobile Devices.",
                    "Poster: VShare: An Android Short-Range D2D Video Sharing System.",
                    "Poster: WearCOPD - Monitoring COPD Patients Remotely using Smartwatches.",
                    "Poster: Understanding Mobile User Interactions with the IoT.",
                    "Poster: A Localization and Wireless Charging System for Wireless Rechargeable Sensor Networks Using Mobile Vehicles.",
                    "Poster: Sentiment User Profile System based on Polarity Comparison.",
                    "Poster: Context-driven Mood Mining.",
                    "Poster: Deep Learning Enabled M2M Gateway for Network Optimization.",
                    "Poster: 3DBuilder - A Versatile Scheme to Reconstruct 3D Models on Smartphones.",
                    "Poster: Defending against Sybil Devices in Crowdsourced Mapping Services.",
                    "Poster: Composing Adaptive Software Systems in Decentralized Infrastructures.",
                    "Poster: A Real-Time and Low-Cost Escalator Riding Monitoring System for Preventing The Accidental Dangers."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016dronet",
                "sub_name": "Proceedings of the 2nd Workshop on Micro Aerial Vehicle Networks, Systems, and Applications for Civilian Use, DroNet@MobiSys 2016, Singapore, June 26, 2016.",
                "count": 12,
                "papers": [
                    "Autonomous Mobile Drone Mesh Networks.",
                    "Drones in the Smart City and IoT: Protocols, Resilience, Benefits, and Risks.",
                    "Towards Single-Failure-Tolerant Multicopters.",
                    "Model-based Real-time Testing of Drone Autopilots.",
                    "Investigating Cost-effective RF-based Detection of Drones.",
                    "Enhancing TV White-Spaces Database with Unmanned Aerial Scanning Vehicles (UASVs).",
                    "A Security Framework for a Drone Delivery Service.",
                    "Generic Drone Control Platform for Autonomous Capture of Cinema Scenes.",
                    "Cloudrone: Micro Clouds in the Sky.",
                    "Virtual Space Boxes and Drone-as-Reference-Station Localisation for Drone Services: an Approach Based on Signal Strengths.",
                    "UAV Multilevel Swarms for Situation Management.",
                    "PI in the Sky."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016wearsys",
                "sub_name": "Proceedings of the 2016 Workshop on Wearable Systems and Applications, WearSys@MobiSys 2016, Singapore, June 30, 2016.",
                "count": 5,
                "papers": [
                    "MiHub: Wearable Management for IoT.",
                    "CryptoCoP: Lightweight, Energy-efficient Encryption and Privacy for Wearable Devices.",
                    "Wireless Smartphone Keyboard for Visually Challenged Users.",
                    "In-ear Biosignal Recording System: A Wearable For Automatic Whole-night Sleep Staging.",
                    "DeepSense: A GPU-based Deep Convolutional Neural Network Framework on Commodity Mobile Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016mobigames",
                "sub_name": "Proceedings of the 3rd Workshop on Mobile Gaming, Singapore, MobiGames@MobiSys 2016, June 30, 2016.",
                "count": 5,
                "papers": [
                    "Jasper: Sensing Gamers' Emotions Using Physiological Sensors.",
                    "When Intuitive Multi-touch Tablet Is Not Enough: Mobile Gaming for Extreme Usability.",
                    "Data-Driven Approaches for Functional Virtual World Modeling.",
                    "A Discussion on Time Optimization for Games in Mobile Computing.",
                    "Low Bit-rate Mobile Cloud Gaming."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016iotofhealth",
                "sub_name": "Proceedings of the First Workshop on IoT-enabled Healthcare and Wellness Technologies and Systems, IoTofHealth@MobiSys 2016, Singapore, June 30, 2016.",
                "count": 10,
                "papers": [
                    "Keynote Talk: Harnessing Health IOT for Smart Healthcare.",
                    "iCarMa: Inexpensive Cardiac Arrhythmia Management - An IoT Healthcare Analytics Solution.",
                    "Food Weight Estimation using Smartphone and Cutlery.",
                    "Small Nudges, Big Impact: Innovative Approaches to Health Promotion in Singapore.",
                    "IoT-Enabled Health Promotion.",
                    "Heterogeneous Services in Layered Framework of IoT Enabled Assisted Living.",
                    "Exploiting IMU Sensors for IOT Enabled Health Monitoring.",
                    "From Books to Bots: Using Medical Literature to Create a Chat Bot.",
                    "SleepSensei: An Automated Sleep Quality Monitor and Sleep Duration Estimator.",
                    "Data-driven Healthcare using Affordable Sensing: Screening, Diagnosis and Therapy."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2016mobidata",
                "sub_name": "Proceedings of the First Workshop on Mobile Data, MobiData@MobiSys 2016, Singapore, June 30, 2016.",
                "count": 5,
                "papers": [
                    "The Wireless Shark: Identifying WiFi Devices Based on Probe Fingerprints.",
                    "The Need to Account for Geographical Diversities in Mobile Data Research.",
                    "Mining Spatial-Temporal geoMobile Data via Feature Distributional Similarity Graph.",
                    "Indoor Location Error-Detection via Crowdsourced Multi-Dimensional Mobile Data.",
                    "Oscillation Resolution for Massive Cell Phone Traffic Data."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "13th MobiSys 2015",
        "info": "Florence, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2016wpa",
                "sub_name": "Proceedings of the 3rd International on Workshop on Physical Analytics, WPA@MobiSys 2015, Singapore, June 26, 2016.",
                "count": 8,
                "papers": [
                    "Device-Free Radio-based Low Overhead Identification of Subject Classes.",
                    "WIBECAM: Device Free Human Activity Recognition Through WiFi Beacon-Enabled Camera.",
                    "Analyzing Shopper's Behavior through WiFi Signals.",
                    "Driving Behavior Analysis for Smartphone-based Insurance Telematics.",
                    "Walking in Sync: Two is Company, Three's a Crowd.",
                    "Matching Physical Sites with Web Sites for Semantic Localization.",
                    "Quantified Workplace: Opportunities and Challenges.",
                    "An Autonomous Reputation Framework for Physical Locations based on WiFi Signals."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015",
                "sub_name": "Proceedings of the 13th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys 2015, Florence, Italy, May 19-22, 2015.",
                "count": 61,
                "papers": [
                    "Invisible Sensing of Vehicle Steering with Smartphones.",
                    "Turning a Mobile Device into a Mouse in the Air.",
                    "Tracking Keystrokes Using Wireless Signals.",
                    "Contactless Sleep Apnea Detection on Smartphones.",
                    "MAdScope: Characterizing Mobile In-App Targeted Ads.",
                    "AdAttester: Secure Online Mobile Advertisement Attestation Using TrustZone.",
                    "Efficient Privilege De-Escalation for Ad Libraries in Mobile Apps.",
                    "GameOn: p2p Gaming On Public Transport.",
                    "Kahawai: High-Quality Mobile Gaming Using GPU Offload.",
                    "Accelerating Mobile Applications through Flip-Flop Replication.",
                    "Outatime: Using Speculation to Enable Low-Latency Continuous Interaction for Mobile Cloud Gaming.",
                    "RollingLight: Enabling Line-of-Sight Light-to-Camera Communications.",
                    "InFrame++: Achieve Simultaneous Screen-Human Viewing and Hidden Screen-Camera Communication.",
                    "Real-Time Screen-Camera Communication Behind Any Scene.",
                    "Starfish: Efficient Concurrency Support for Computer Vision Applications.",
                    "TypingRing: A Wearable Ring Platform for Text Input.",
                    "U-Wear: Software-Defined Ultrasonic Networking for Wearable Devices.",
                    "LookUp: Enabling Pedestrian Safety Services via Shoe Sensing.",
                    "ZOE: A Cloud-less Dialog-enabled Continuous Sensing Wearable Exploiting Heterogeneous Computation.",
                    "Reducing Smartphone Application Delay through Read/Write Isolation.",
                    "AccelWord: Energy Efficient Hotword Detection through Accelerometer.",
                    "Wearables Can Afford: Light-weight Indoor Positioning with Visible Light.",
                    "OverLay: Practical Mobile Augmented Reality.",
                    "Visually Fingerprinting Humans without Face Recognition.",
                    "Analyzing the Use of Quick Response Codes in the Wild.",
                    "Beyond the Radio: Illuminating the Higher Layers of Mobile Networks.",
                    "Mobilyzer: An Open Platform for Controllable Mobile Network Measurements.",
                    "Energy Efficient WiFi Display.",
                    "Practicalizing Delay-Tolerant Mobile Apps with Cedos.",
                    "Video: LookUp!: Enabling Pedestrian Safety Services via Shoe Sensing.",
                    "Video: Lightweight Visible Light Communication for Indoor Positioning.",
                    "Demo: Mobile Crowdsensing of Road Surface Roughness.",
                    "Demo: D2D Rescue of Overloaded Cellular Channels.",
                    "Demo: Irides: Attaining Quality, Responsiveness and Mobility for Virtual Reality Head-mounted Displays.",
                    "Demo: Using Wearables to Learn from Human Dynamics.",
                    "Demo: Breathing-Based Text Input for Mobile Phones.",
                    "Demo: Continuous Emotional Status in Mobile-Mediated Communications.",
                    "Demo: Mobile Software Emotions Logging: Towards an Automatic Usability Evaluation.",
                    "Demo: TouchCom - Creating Real Excalibur Experience with Body Touch Communication.",
                    "Demo: Real-Time Screen-Camera Communication Behind Any Scene.",
                    "Demo: Energy Harvesting Using Everyday Objects.",
                    "Demo: : NOMAD: An Edge Cloud Platform for Hyper-Responsive Mobile Apps.",
                    "Demo: Bringing the Internet of Toys to Life.",
                    "Demo: Achieving Simultaneous Screen-Human Viewing and Hidden Screen-Camera Communication.",
                    "Demo: Lightweight Visible Light Communication forIndoor Positioning.",
                    "Demo: Mobilyzer: Mobile Network Measurement Made Easy.",
                    "Demo: Turning a Mobile Device into a Mouse in the Air.",
                    "Demo: Finger and Hand Gesture Recognition using Smartwatch.",
                    "Poster: bPart - A Small and Versatile Bluetooth Low Energy Sensor Platform for Mobile Sensing.",
                    "Poster: Detecting if a Smartphone is Indoors or Outdoors with Ultrasounds.",
                    "Poster: Swarming Drones Can Connect You to the Network.",
                    "Poster: Constructing a Unique Profile for Mobile User Identification in Location Recommendation Systems.",
                    "Poster: Detection of Cyberbullying in a Mobile Social Network: Systems Issues.",
                    "Poster: A Hybrid Indoor Audio Localization System.",
                    "Poster: TVisor - A Practical and Lightweight Mobile Red-Green Dual-OS Architecture.",
                    "Poster: A Continuous and Noninvasive User Authentication System for Google Glass.",
                    "Poster: A Context Simulation Harness for Realistic Mobile App Testing.",
                    "Poster: Localized Content for Village Schools.",
                    "Poster: Context-Triggered Mobile Network Measurement.",
                    "Poster: Emergency Management Using SHERLOCK.",
                    "Poster: Location Verification and Recovery for Mobile In-Vehicle Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015iot-sys",
                "sub_name": "Proceedings of the 2015 Workshop on IoT challenges in Mobile and Industrial Systems, IoT-Sys@MobiSys 2015, Florence, Italy, May 18, 2015.",
                "count": 10,
                "papers": [
                    "The Physical Web.",
                    "Building an On-ramp for the Internet of Things.",
                    "BearLoc: A Composable Distributed Framework for Indoor Localization Systems.",
                    "Automatic Sensor Data Stream Segmentation for Real-time Activity Prediction in Smart Spaces.",
                    "ESMRF: Enhanced Stateless Multicast RPL Forwarding For IPv6-based Low-Power and Lossy Networks.",
                    "Bird Flocking Congestion Control for CoAP/RPL/6LoWPAN Networks.",
                    "Old Wine in New Skins?: Revisiting the Software Architecture for IP Network Stacks on Constrained IoT Devices.",
                    "Key Management Protocol with Implicit Certificates for IoT systems.",
                    "A Distributed Test System Architecture for Open-source IoT Software.",
                    "On the Feasibility of Attribute-Based Encryption on Smartphone Devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015wearsys",
                "sub_name": "Proceedings of the 2015 workshop on Wearable Systems and Applications, WearSys 2015, Florence, Italy, May 18, 2015.",
                "count": 14,
                "papers": [
                    "An Energy Neutral Wearable Camera with EPD Display.",
                    "Colorizer: Smart Glasses Aid for the Colorblind.",
                    "Feasibility Analysis for Estimation of Blood Pressure and Heart Rate using A Smart Eye Wear.",
                    "Wearable Inertial Sensor for Jump Performance Analysis.",
                    "Wearable Sensing Framework for Human Activity Monitoring.",
                    "Toward Detection of Unsafe Driving with Wearables.",
                    "Early Implementation Experience with Wearable Cognitive Assistance Applications.",
                    "Prototyping Wearables for Supporting Cognitive Mapping by the Blind: Lessons from Co-Creation Workshops.",
                    "Real-Time Calibration of a Human Thermal Model with Solar Radiation Using Wearable Sensors.",
                    "Smartphone Usage Restriction During Crossing Roads and Railways.",
                    "A Review of Smart Clothing in Military.",
                    "Design and Implementation of a Wearable Environmental Monitoring System.",
                    "User-Centered Design for Wearable Neuro-rehabilitation System.",
                    "Communicating with the Outside World through Surreptitious Wearable Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015wpa",
                "sub_name": "Proceedings of the 2nd workshop on Workshop on Physical Analytics, WPA@MobiSys 2015, Florence, Italy, May 22, 2015.",
                "count": 8,
                "papers": [
                    "Device-Free Radio-based Low Overhead Identification of Subject Classes.",
                    "WIBECAM: Device Free Human Activity Recognition Through WiFi Beacon-Enabled Camera.",
                    "Analyzing Shopper's Behavior through WiFi Signals.",
                    "Driving Behavior Analysis for Smartphone-based Insurance Telematics.",
                    "Walking in Sync: Two is Company, Three's a Crowd.",
                    "Matching Physical Sites with Web Sites for Semantic Localization.",
                    "Quantified Workplace: Opportunities and Challenges.",
                    "An Autonomous Reputation Framework for Physical Locations based on WiFi Signals."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015phdf",
                "sub_name": "Proceedings of the 2015 on MobiSys PhD Forum, Florence, Italy, May 18, 2015.",
                "count": 12,
                "papers": [
                    "Extended Abstract: Efficient Dynamic Mobile Sensing Strategies for Context-Aware Applications.",
                    "Sensor-Cloud: Enabling Remote Health-Care services.",
                    "Big Stream Cloud Architecture for the Internet of Things.",
                    "Flexible And Effective Energy Management In Smartphones.",
                    "Energy Efficient and Fair Management of Sensing Applications on Heterogeneous Resource Mobile Devices.",
                    "Gradient Profiling for Pedestrian Services.",
                    "Smart Gateway for Low-Power Lossy Networks.",
                    "Opportunistic traffic Offloading Mechanisms for Mobile/4G Networks.",
                    "Urban Mobility and Networking.",
                    "Efficient Multi-hop Broadcast Data Dissemination for IoT and Smart Cities Applications.",
                    "Simplifying Cooperation with End Users.",
                    "Offloading Delay Tolerant Data through Opportunistic Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015diyn",
                "sub_name": "Proceedings of the 2015 Workshop on Do-it-yourself Networking: an Interdisciplinary Approach, DIYNetworking@MobiSys 2015, Florence, Italy, May 18, 2015.",
                "count": 6,
                "papers": [
                    "Live Video Streaming for Community Networks, Experimenting with PeerStreamer on the Ninux Community.",
                    "DTN-enabled Infostation and Cinema-in-a-Backpack.",
                    "Learning IoT without the \"I\"- Educational Internet of Things in a Developing Context.",
                    "SCANDEX: Service Centric Networking for Challenged Decentralised Networks.",
                    "Kadupul: Livin' on the Edge with Virtual Currencies and Time-Locked Puzzles.",
                    "Do-it-yourself Networks: A Multi-layer Network Approach to the Analysis of Mobile User Egocentric and Sociocentric Behaviors."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015futuremobileui",
                "sub_name": "Proceedings of the 2015 Workshop on Future Mobile User Interfaces, FutureMobileUI@MobiSys 2015, Florence, Italy, May 18, 2015.",
                "count": 4,
                "papers": [
                    "Mobile User Interfaces based on User Attention.",
                    "Design, Development and Evaluation Challenges for Future Mobile User Interfaces in Safety-Critical Contexts.",
                    "Integrated Interaction with Large and Small Devices.",
                    "Smart Jewelry: The Future of Mobile User Interfaces."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015dronet",
                "sub_name": "Proceedings of the First Workshop on Micro Aerial Vehicle Networks, Systems, and Applications for Civilian Use, DroNet@MobiSys 2015, Florence, Italy, May 18, 2015.",
                "count": 13,
                "papers": [
                    "Aerial Platform based Wireless Communications: Will the Myth now become Reality?",
                    "Krypto: Assisting Search and Rescue Operations using Wi-Fi Signal with UAV.",
                    "Next-Hop Decision-Making in Mobility-Controlled Message Ferrying Networks.",
                    "Analysis of Harmful Interference to and from Aerial IEEE 802.11 Systems.",
                    "A Quadcopter Controller to Maintain Radio Link Quality.",
                    "Captain Buzz: An All-Smartphone Autonomous Delta-Wing Drone.",
                    "An Autonomous Multi-UAV System for Search and Rescue.",
                    "Face Recognition on Drones: Issues and Limitations.",
                    "Virtual Tourism with Drones: Experiments and Lag Compensation.",
                    "Experimental Validation of Efficient Static Trajectories for the Localization of Wireless Nodes in a Mixed Indoor-Outdoor Scenario Using an Unmanned Aerial Vehicle.",
                    "Drone Indoor Self-Localization.",
                    "Study and Experimentation of Control Policies to Dynamically Maintain Micro-UAV Flight Stability.",
                    "Epidgeons: Combining Drones and DTNs Technologies to Provide Connectivity in Remote Areas."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2015mobigames",
                "sub_name": "Proceedings of the 2nd Workshop on Mobile Gaming, MobiGames@MobiSys 2015, Florence, Italy, May 19, 2015.",
                "count": 7,
                "papers": [
                    "Communication Energy Overhead of Mobiles Games.",
                    "Towards Accurate GPU Power Modeling for Smartphones.",
                    "Does Playing Online Mobile Games Overcharge You for the Fun?",
                    "To Cloud or Not to Cloud: Measuring the Performance of Mobile Gaming.",
                    "MCG Test-bed: an Experimental Test-bed for Mobile Cloud Gaming.",
                    "Matchmaking Game Players On Public Transport.",
                    "Mobile Agents for Mobile Games."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "12th MobiSys 2014",
        "info": "Bretton Woods, NH, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2014",
                "sub_name": "The 12th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys'14, Bretton Woods, NH, USA, June 16-19, 2014.",
                "count": 69,
                "papers": [
                    "Balancing design and technology to tackle global grand challenges.",
                    "BodyBeat: a mobile system for sensing non-speech body sounds.",
                    "Ubiquitous keyboard for small mobile devices: harnessing multipath fading for fine-grained keystroke localization.",
                    "Autodirective audio capturing through a synchronized smartphone array.",
                    "Tracking human queues using single-point signal monitoring.",
                    "A wearable system that knows who wears it.",
                    "Towards wearable cognitive assistance.",
                    "iShadow: design of a wearable, real-time mobile gaze tracker.",
                    "nShield: a noninvasive NFC security system for mobiledevices.",
                    "Sensor-assisted facial recognition: an enhanced biometric authentication system for smartphones.",
                    "MAdFraud: investigating ad fraud in android applications.",
                    "EnCore: private, context-based communication for mobile social apps.",
                    "RisQ: recognizing smoking gestures with inertial sensors on a wristband.",
                    "An energy harvesting wearable ring platform for gestureinput on surfaces.",
                    "User-generated free-form gestures for authentication: security and memorability.",
                    "Automatic and scalable fault detection for mobile applications.",
                    "PUMA: programmable UI-automation for large-scale dynamic analysis of mobile apps.",
                    "Characterizing resource usage for mobile web browsing.",
                    "Procrastinator: pacing mobile apps' usage of the network.",
                    "CoAST: collaborative application-aware scheduling of last-mile cellular traffic.",
                    "Rio: a system solution for sharing i/o between mobile systems.",
                    "Real-time android with RTDroid.",
                    "Enhancing vehicular internet connectivity using whitespaces, heterogeneity, and a scouting radio.",
                    "COIN-GPS: indoor localization from direct GPS receiving.",
                    "SAIL: single access point-based indoor localization.",
                    "I am a smartphone and i can tell my user's walking direction.",
                    "Demo: Rio: a system solution for sharing I/O between mobile systems.",
                    "Demo: open data kit 2.0 tool suite.",
                    "Demo: Kahawai: high-quality mobile gaming using GPU offload.",
                    "Demo: real-time object tagging and retrieval.",
                    "Demo: DeLorean: using speculation to enable low-latency continuous interaction for mobile cloud gaming.",
                    "Demo: AuthPaper - protecting paper-based documents/credentials using authenticated 2D barcodes.",
                    "Demo: A remote sensor placement device for scalable and precise deployment of sensor networks.",
                    "Demo: Hand-to-hand communication using smartphones.",
                    "Demo: Zero interaction private messaging with ZIPR.",
                    "Demo: Mapping global mobile performance trends with mobilyzer and mobiPerf.",
                    "Demo: I am a smartphone and i can tell my user's walking direction.",
                    "Demo: Ubiquitous interaction with smart objects.",
                    "Demo: Protecting visual secrets with privateeye.",
                    "Demo: Crowd-cache - popular content for free.",
                    "Demo: Yalut - user-centric social networking overlay.",
                    "Demo: SaveAlert: design for a sensor-driven CrowdWatch danger detection system.",
                    "Demo: Recognizing humans without face recognition.",
                    "Demo: A paper keyboard for mobile devices.",
                    "Demo: FaceBlock: privacy-aware pictures for google glass.",
                    "Poster: A robust vehicular accident detection system using inexpensive portable devices.",
                    "Poster: SoftOffload: a programmable approach toward collaborative mobile traffic offloading.",
                    "Poster: Semi-automatic monitoring vital parameters of mobile users.",
                    "Poster: Motivating an inter-networking architecture for WSN/IoT.",
                    "Poster: A virtual sensing framework for mobile phones.",
                    "Poster: M-Seven: monitoring smoking event by considering time sequence information via iPhone M7 API.",
                    "Poster: Retro: an automated, application-layer record and replay for android.",
                    "Poster: Enabling computational jewelry for mHealth applications.",
                    "Poster: Scalable evaluation for wireless mobile systems.",
                    "Poster: Towards reducing smartphone application delay through read/write isolation.",
                    "Poster: Ontology-based heartbeat classification for mobile electrocardiogram monitoring.",
                    "Poster: Balancing disclosure and utility of personal information.",
                    "Poster: DriveBlue: can bluetooth enhance your driving experience?",
                    "Poster: A power-aware mobile app for field scientists.",
                    "Poster: Crowdsourcing for video traffic surveillance.",
                    "Poster: Improving efficiency of metropolitan-scale transit systems with multi-mode data feeds.",
                    "Video: Rio: a system solution for sharing i/o between mobile systems.",
                    "Video: WiFi-honk: smartphone-based beacon stuffed WiFi Car2X-communication system for vulnerable road user safety.",
                    "Video: Remote sensor placement.",
                    "Video: study of storage impact on smartphone application delay.",
                    "Video: Procrastinator: pacing mobile apps' usage of the network.",
                    "Video: User-generated free-form gestures for authentication: security and memorability.",
                    "Video: Open data kit tables.",
                    "Video: Unsupervised indoor localization (UnLoc): beyond the prototype."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2014mars",
                "sub_name": "Proceedings of the 2014 Workshop on Mobile Augmented Reality and Robotic Technology-Based Systems, MARS 2014, Bretton Woods, New Hampshire, USA, June 16, 2014.",
                "count": 14,
                "papers": [
                    "Toward a data-driven generative behavior model for human-robot interaction.",
                    "RoSCAR: robot stock car autonomous racing.",
                    "Robotics enabled in-home environment screening for fall risks.",
                    "Panel: future trends and research issues in mobile augmented reality.",
                    "Demo: lehigh explorer augmented campus tour (LACT).",
                    "Demo: mobile augmented reality in medical education: an application for dermatology.",
                    "Demo: toward a data-driven generative behavior model for human-robot interaction.",
                    "Cloud-based mobile augmented reality, pitfalls and strategies in a realtime deployment.",
                    "On the limits of positioning-based pedestrian risk awareness.",
                    "CloudRidAR: a cloud-based architecture for mobile augmented reality.",
                    "Appurtenant: enhancing completeness and efficiency of bidirectional patient-physician communication using automatic speech recognition.",
                    "Enabling an augmented reality ecosystem: a content-oriented survey.",
                    "A gesture-based interface for the exploration and classification of protein binding cavities.",
                    "Panel: future research trends in robotics technologies."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2014mcs",
                "sub_name": "Proceedings of the Fifth International Workshop on Mobile Cloud Computing & Services, MCS 2014, Bretton Woods, New Hampshire, USA, June 16, 2014.",
                "count": 6,
                "papers": [
                    "Vision: the case for cellular small cells for cloudlets.",
                    "meSDN: mobile extension of SDN.",
                    "Reducing the cloud cost of mobile reverse-geocoding.",
                    "Vision: cloud and crowd assistance for GPS urban canyons.",
                    "Vision: smart home control with head-mounted sensors for vision and brain activity.",
                    "Vision: towards an extensible app ecosystem for home automation through cloud-offload."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2014wpa",
                "sub_name": "Proceedings of the 2014 Workshop on Physical Analytics, WPA 2014, Bretton Woods, New Hampshire, USA, June 16, 2014.",
                "count": 11,
                "papers": [
                    "Physical analytics to model health behaviors.",
                    "On11: an activity recommendation application to mitigate sedentary lifestyle.",
                    "My smartphone knows i am hungry.",
                    "Using smartphones to sense, assess, and improve well-being.",
                    "Life-logging, thing-logging and the internet of things.",
                    "Socio-physical analytics: challenges & opportunities.",
                    "The case for human-centric personal analytics.",
                    "GlimpseData: towards continuous vision-based personal analytics.",
                    "Wi-Fi analytics for business intelligence.",
                    "Analysing the privacy policies of Wi-Fi trackers.",
                    "Tracking people and monitoring their vital signs using body radio reflections."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2014phdf",
                "sub_name": "Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys 2014, Bretton Woods, New Hampshire, USA, June 16, 2014, PhD Forum.",
                "count": 8,
                "papers": [
                    "Coexistence of LTE and WiFi heterogeneous networks via inter network coordination.",
                    "Smartphone application delay optimizations.",
                    "Energy-awareness in large-scale internet of things networks.",
                    "The internet of tags: energy-harvesting adaptive algorithms.",
                    "Extended abstract: efficient image processing for continuous mobile vision.",
                    "Towards efficient data collection in WSNs.",
                    "Improving trust in personal sensing.",
                    "Agentless cloud-wide monitoring of virtual disk state."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "11th MobiSys 2013",
        "info": "Taipei, Taiwan",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2013",
                "sub_name": "The 11th Annual International Conference on Mobile Systems, Applications, and Services, MobiSys'13, Taipei, Taiwan, June 25-28, 2013.",
                "count": 80,
                "papers": [
                    "AMC: verifying user interface properties for vehicular applications.",
                    "CarSafe app: alerting drowsy and distracted drivers using dual cameras on smartphones.",
                    "CrowdAtlas: self-updating maps for cloud and personal use.",
                    "Sensing vehicle dynamics for determining driver phone use.",
                    "Optimizing background email sync on smartphones.",
                    "Energy characterization and optimization of image sensing toward continuous mobile vision.",
                    "Leveraging graphical models to improve accuracy and reduce privacy risks of mobile sensing.",
                    "ProtectMyPrivacy: detecting and mitigating privacy leaks on iOS devices using crowdsourcing.",
                    "SmartAds: bringing contextual ads to mobile apps.",
                    "CAMEO: a middleware for mobile advertisement delivery.",
                    "Scalable crowd-sourcing of video from mobile devices.",
                    "Just-in-time provisioning for cyber foraging.",
                    "SIF: a selective instrumentation framework for mobile applications.",
                    "RetroSkeleton: retrofitting android apps.",
                    "SmartSynth: synthesizing smartphone automation scripts from natural language.",
                    "FM-based indoor localization via automatic fingerprint DB construction and matching.",
                    "High-accuracy differential tracking of low-cost GPS receivers.",
                    "Guoguo: enabling fine-grained indoor localization via smartphone.",
                    "Avoiding multipath to revive inbuilding WiFi localization.",
                    "Spartacus: spatially-aware interaction for mobile devices through energy-efficient audio sensing.",
                    "ViRi: view it right.",
                    "ScreenPass: secure password entry on touchscreen devices.",
                    "Accounting for roaming users on mobile data access: issues and root causes.",
                    "Comparison of caching strategies in modern cellular backhaul networks.",
                    "LEAD: leveraging protocol signatures for improving wireless link performance.",
                    "PROTEUS: network performance forecast for real-time, interactive mobile applications.",
                    "NuActiv: recognizing unseen new activities using semantic attribute-based learning.",
                    "SocioPhone: everyday face-to-face interaction monitoring platform using multi-phone sensor fusion.",
                    "MoodScope: building a mood sensor from smartphone usage patterns.",
                    "Auditeur: a mobile-cloud service platform for acoustic event detection on smartphones.",
                    "Kwiizya: local cellular network services in remote areas.",
                    "AdRob: examining the landscape and impact of android application plagiarism.",
                    "EnGarde: protecting the mobile phone from malicious NFC interactions.",
                    "AdRob: examining the landscape and impact of android application plagiarism.",
                    "CarSafe app: alerting drowsy and distracted drivers using dual cameras on smartphones.",
                    "Keyword programming for TouchDevelop.",
                    "MoodScope: building a mood sensor from smartphone usage patterns.",
                    "Energy proportional image sensors for continuous mobile vision.",
                    "CrowdAtlas: self-updating maps for cloud and personal use.",
                    "Video streaming using whitespace spectrum for vehicular applications.",
                    "Sensing device co-location through patterns of silence.",
                    "RegTrack: a differential relative gps tracking solution.",
                    "Pointer wizard: a remote interaction user interface.",
                    "Kwiizya: local cellular network services in remote areas.",
                    "Multi-screen social TV over cloud-centric media platform.",
                    "Rewriting an Android app using RetroSkeleton.",
                    "Participatory sensing and crowd management in public spaces.",
                    "An anonymous matching system based on mobile numbers.",
                    "Floodcasting, a data dissemination service supporting real-time actuation and control.",
                    "Low-cost personal air-quality monitor.",
                    "Power management using game state detection on android smartphones.",
                    "Location-based authentication system using space dependent information.",
                    "Compass fusion: high precision indoor people localization and identification.",
                    "SocioPhone: everyday face-to-face interaction monitoring platform using multi-phone sensor fusion.",
                    "A mobile live TV system for Taiwan high-speed rail.",
                    "Indoor geolocation on multi-sensor smartphones.",
                    "Yes, right there!: a self-portrait application with sensor-assisted guiding for smartphones.",
                    "BiFocus: using radio-optical beacons for an augmented reality search application.",
                    "Visible light communications for scooter safety.",
                    "O'BTW: an opportunistic, similarity-based mobile recommendation system.",
                    "Embedded NFC protection and forensics for mobile phones with EnGarde.",
                    "PAUL: proactive automated mobile user-centric content deLivery.",
                    "Smartphone sensing for large data set collection of potholes.",
                    "Authenticating and tracing biological anonym of VANET based on KMC decentralization and two-factor.",
                    "Carrying my environment with me in iot-enhanced smart buildings.",
                    "Mobile user clustering in large time-scale data transfer scheduling.",
                    "Fusing prefetch and delay-tolerant transfer for mobile videos.",
                    "WhereAmI: image-based positioning in dense urban areas.",
                    "A black-box based android GUI testing system.",
                    "An approximation algorithm of orienteering problems for mobile computing.",
                    "Artistic eye: recognizing key viewing points of popular sites.",
                    "Instrumenting Thailand's coastline: mobile devices for environmental and disaster monitoring.",
                    "CEGF: corner extraction by GPS filtering for power-efficient location uploading.",
                    "Mobile code offloading: should it be a local decision or global inference?",
                    "Framework for automated power estimation of android applications.",
                    "Solving network isolation problem in duty-cycled wireless sensor networks.",
                    "An integrated system for indoor and outdoor location-based services (MapBiquitous): mobisys'13 poster abstract.",
                    "How to harmonize wi-fi and bluetooth in a mobile device?",
                    "Odometer in the pocket.",
                    "HyCloud: a hybrid approach toward offloading cellular content through opportunistic communication."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2013cellnet",
                "sub_name": "Proceeding of the 2013 Workshop on Cellular Networks: Operations, Challenges, and Future Design, CellNet '13, Taipei, Taiwan, June 25, 2013.",
                "count": 5,
                "papers": [
                    "Late-binding: how to lose fewer packets during handoff.",
                    "Adapp: an adaptive network selection framework for smartphone applications.",
                    "Practical performance of MU-MIMO precoding in many-antenna base stations.",
                    "Sprinkler: distributed content storage for just-in-time streaming.",
                    "EnVi: energy efficient video player for mobiles."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2013vanet",
                "sub_name": "Proceeding of the tenth ACM international workshop on Vehicular inter-networking, systems, and applications, VANET 2013, Taipei, Taiwan, June 25, 2013.",
                "count": 13,
                "papers": [
                    "PAL - privacy augmented LTE: a privacy-preserving scheme for vehicular LTE communication.",
                    "Reliability analysis of vehicle-to-vehicle applications based on real world measurements.",
                    "ParkingMeter: balancing energy savings and service availability.",
                    "Distributed-fountain network code (DFNC) for content delivery in vehicular networks.",
                    "EMBARC: error model based adaptive rate control for vehicle-to-vehicle communications.",
                    "Joint power/rate congestion control optimizing packet reception in vehicle safety communications.",
                    "Analytical modeling of link duration for vehicular ad hoc networks in urban environment.",
                    "Sustainable highways with shadow tolls based on VANET advertising.",
                    "MRMV: design and evaluation of a multi-radio multi-vehicle system for metro-WiFi access.",
                    "A cluster based beaconing process for VANET.",
                    "Modeling vehicle-to-vehicle line of sight channels and its impact on application-layer performance.",
                    "Adaptive vehicular routing protocol based on ant colony optimization.",
                    "Co-existing periodic beaconing and hazard warnings in IEEE 802.11p-based platooning applications."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "10th MobiSys 2012",
        "info": "Ambleside, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2012",
                "sub_name": "The 10th International Conference on Mobile Systems, Applications, and Services, MobiSys'12, Ambleside, United Kingdom - June 25 - 29, 2012.",
                "count": 73,
                "papers": [
                    "SwordFight: enabling a new class of phone-to-phone action games on commodity phones.",
                    "ExerLink: enabling pervasive social exergames with heterogeneous exercise devices.",
                    "ACE: exploiting correlation for energy-efficient and continuous context sensing.",
                    "CoMon: cooperative ambience monitoring platform with continuity and benefit awareness.",
                    "MicroCast: cooperative video streaming on smartphones.",
                    "Flit: a bulk transmission protocol for RFID-scale sensors.",
                    "COBRA: color barcode streaming for smartphone systems.",
                    "BLINK: a high throughput link layer for backscatter communication.",
                    "Fast app launching for mobile devices using predictive user context.",
                    "Web caching on smartphones: ideal vs. reality.",
                    "Mobius: unified messaging and data serving for mobile apps.",
                    "Informed mobile prefetching.",
                    "FM-based indoor localization.",
                    "You are facing the Mona Lisa: spot localization using PHY layer information.",
                    "No need to war-drive: unsupervised indoor localization.",
                    "Satellites in our pockets: an object positioning system using smartphones.",
                    "A close examination of performance and power characteristics of 4G LTE networks.",
                    "Human mobility modeling at metropolitan scales.",
                    "Isolating and analyzing fraud activities in a large cellular network via voice call graph analysis.",
                    "What is keeping my phone awake?: characterizing and detecting no-sleep energy bugs in smartphone apps.",
                    "RiskRanker: scalable and accurate zero-day android malware detection.",
                    "Opaak: using mobile phones to limit anonymous identities online.",
                    "Plug-n-trust: practical trusted sensing for mhealth.",
                    "Tapprints: your finger taps have fingerprints.",
                    "Medusa: a programming framework for crowd-sensing applications.",
                    "Open data kit sensors: a sensor integration framework for android at the application-level.",
                    "Software abstractions for trusted sensors.",
                    "How long to wait?: predicting bus arrival time with mobile phone based participatory sensing.",
                    "Beyond deployments and testbeds: experiences with public usage on vehicular WiFi hotspots.",
                    "WIISARD: a measurement study of network properties and protocol reliability during an emergency response.",
                    "DozyAP: power-efficient Wi-Fi tethering.",
                    "CiAO/IP: a highly configurable aspect-oriented IP stack.",
                    "Demo: ExerLink - enabling pervasive social exergames with heterogeneous exercise devices.",
                    "Demo: a barcode streaming system for smartphones.",
                    "Demo: SenseTogether - cooperative ambience monitoring platform with continuity and benefit awareness.",
                    "Demo: satellites in our pockets: an object positioning system using smartphones.",
                    "Demo: MVChat: flasher detection for mobile video chat.",
                    "Demo: how long to wait?: predicting bus arrival time with mobile phone based participatory sensing.",
                    "Demo: SmartLake: lightweight sensing and optimizing cleanup of algae blooms on Taihu Lake.",
                    "Demo: Microcast: cooperative video streaming on smartphones.",
                    "Demo: a programming cloud of smartphones.",
                    "Demo: the airplace indoor positioning platform.",
                    "Demo: a mobility aware cooperative scheme for MAC reconfiguration in cognitive wireless networks.",
                    "Demo: enabling mobile time-dependent pricing.",
                    "Demo: code in the air - simplifying tasking on smartphones.",
                    "Demo: Cellchek: demonstrating a cost-effective cell phone-based patient monitoring and advising system.",
                    "Demo: mobile interaction with ads on public display networks.",
                    "Demo: Medusa: a programming framework for crowd-sensing applications.",
                    "Demo: user identification and authentication with capacitive touch communication.",
                    "Demo: Bluetooth TouchPoint.",
                    "Demo: context driven advertisement optimizer.",
                    "Demo: introducing NextSharemobile, an interactive second screen application.",
                    "Demo: using mobile devices to personalize pervasive displays.",
                    "Demo: VisualComm - new robust channel of file transfer in mobile communications.",
                    "Demo: an experience sampling toolkit for the transport domain.",
                    "Demo: phone-to-phone mobile motion gaming on commodity phones.",
                    "Demo: unsupervised indoor localization.",
                    "Demo: NFC-based sensor data caching.",
                    "Poster: multi-track map matching.",
                    "Poster: towards mobile GPU-accelerated context processing for continuous sensing applications on smartphones.",
                    "Poster: evaluating energy consumption of sensing algorithms - solely via models?",
                    "Poster: saving power for mobile phones with partial Wi-Fi scans.",
                    "Poster: supporting collaborative sensing applications.",
                    "Poster: the development of a semantic feature analysis based mobile application for individuals with aphasia.",
                    "Poster: using local and global knowledge in wireless sensor networks.",
                    "Poster: an energy profiler for android applications used in the real world.",
                    "Poster: a smart scheduling mechanism for energy saving in android system.",
                    "Poster: cloud-enabled content search and sharing system for mobile phones (MobiShare).",
                    "Poster: towards position-based routing for mobile environments.",
                    "Poster: a framework to sense planet-scale vehicular mobility using online traffic webcameras.",
                    "Poster: a hybrid approach for indoor mobile phone localization.",
                    "Poster: a construction of a long distance communication sensor network node using Arduino and Mad-SS shield.",
                    "Poster: SixthSense - shaping travel activities through flexible interpretations of time."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2012hotplanet",
                "sub_name": "Proceedings of the 4th ACM international workshop on Hot topics in planet-scale measurement, HotPlanet@MobiSys 2012, Ambleside, United Kingdom, June 25-29, 2012.",
                "count": 8,
                "papers": [
                    "Through a graph, darkly.",
                    "A framework for realistic vehicular network modeling using planet-scale public webcams.",
                    "Towards planet-scale localization on smartphones with a partial radiomap.",
                    "Collecting big datasets of human activity one checkin at a time.",
                    "A global measurement study of context-based propagation and user mobility.",
                    "Big wireless measurement campaigns: are they really worth the price?",
                    "Uncovering properties in participatory sensor networks.",
                    "Insights on metropolitan-scale vehicular mobility from a networking perspective."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "9th MobiSys 2011",
        "info": "Bethesda, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2011",
                "sub_name": "Proceedings of the 9th International Conference on Mobile Systems, Applications, and Services (MobiSys 2011), Bethesda, MD, USA, June 28 - July 01, 2011.",
                "count": 59,
                "papers": [
                    "TagSense: a smartphone-based approach to automatic image tagging.",
                    "Using mobile phones to write in air.",
                    "FindingMiMo: tracing a missing mobile phone using daily observations.",
                    "Odessa: enabling interactive perception applications on mobile devices.",
                    "Adaptive display power management for mobile games.",
                    "Switchboard: a matchmaking system for multiplayer mobile games.",
                    "Chameleon: a color-adaptive web browser for mobile OLED displays.",
                    "Real-time trip information service for a large taxi fleet.",
                    "AppJoy: personalized mobile application discovery.",
                    "SignalGuru: leveraging mobile phones for collaborative traffic signal schedule advisory.",
                    "Indoor location sensing using geo-magnetism.",
                    "Indoor localization without infrastructure using the acoustic background spectrum.",
                    "Exploiting FM radio data system for adaptive clock calibration in sensor networks.",
                    "AccuLoc: practical localization of performance measurements in 3G networks.",
                    "Caché: caching location-enhanced content to improve user privacy.",
                    "ProxiMate: proximity-based secure pairing using ambient wireless signals.",
                    "Security versus energy tradeoffs in host-based mobile malware detection.",
                    "Analyzing inter-application communication in Android.",
                    "Avoiding the rush hours: WiFi energy management via traffic isolation.",
                    "Opportunistic alignment of advertisement delivery with cellular basestation overloads.",
                    "Revisiting partial packet recovery in 802.11 wireless LANs.",
                    "Energy-efficient positioning for smartphones using Cell-ID sequence matching.",
                    "Energy-efficient trajectory tracking for mobile devices.",
                    "Profiling resource usage for mobile applications: a cross-layer approach.",
                    "Self-constructive high-rate system energy modeling for battery-powered mobile systems.",
                    "Demo: distance tracking using WLAN time of flight.",
                    "Demo: SNEAP: a social network-enabled EAP method no more open hotspots.",
                    "Demo: SignalGuru: leveraging mobile phones for collaborative traffic signal schedule advisory.",
                    "Demo: quality-adaptive video streaming with dynamic bandwidth aggregation on roaming, multi-homed clients.",
                    "Demo: avoiding the rush hours, wifi energy management via traffic isolation.",
                    "Demo: e-gesture - a collaborative architecture for energy-efficient gesture recognition with hand-worn sensor and mobile devices.",
                    "Demo: a system for aligning advertisement delivery with cellular basestation overloads.",
                    "Demo: CoMon - resource-aware cooperative context monitoring system for smartphone-centric sensor-rich pans.",
                    "Demo: El-pincel - a painter cloud service for greener web pages.",
                    "Demo: a sensor network time synchronization protocol based on fm radio data system.",
                    "Demo: mobile application resource optimizer (ARO).",
                    "Demo: leveraging clustering for energy-efficient neighbor discovery.",
                    "Demo: sesame: self-constructive system energy modeling for battery-powered mobile systems.",
                    "Demo: chameleon: a color-adaptive web browser for mobile OLED displays.",
                    "Demo: opportunistic mobile social networking.",
                    "Demo: bankrupting the jammer.",
                    "Demo: an out-of-band alternative to face recognition.",
                    "Demo: visual MIMO based LED - camera communication applied to automobile safety.",
                    "Demo: indoor localization without infrastructure using the acoustic background spectrum.",
                    "Demo: prototyping UWB-enabled enhants.",
                    "Demo: Illinois vehicular project, live data sampling and energy-efficient node discovery.",
                    "Demo: spanning an underlay over a host WPAN cluster.",
                    "Demo: adaptive display power management for mobile games.",
                    "Poster: gait-based smartphone user identification.",
                    "Poster: you driving? talk to you later.",
                    "Poster: energy consumption impact of UHF RFID reader integration with mobile phones.",
                    "Poster: a green solution for intelligent metropolitan heating system with uSDcard.",
                    "Poster: a context-aware framework for mobile applications.",
                    "Poster: practical trusted computing for mhealth sensing.",
                    "Poster: evaluation of the industrial suitability of a software platform for future smartphones.",
                    "Poster: HealthOS: a platform for integrating and developing pervasive healthcare applications.",
                    "Poster: collective mobile sensing for wireless network performance monitoring.",
                    "Precise indoor localization using PHY information.",
                    "Poster: What's on your mind?: a mind-based driving alert system."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2011hotplanet",
                "sub_name": "Proceedings of the 3rd ACM International Workshop on Hot Topics in Planet-scale Measurement, HotPlanet@MobiSys 2011, Bethesda, MD, USA, June 28 - July 1, 2011.",
                "count": 7,
                "papers": [
                    "Open data kit: creating an open source community for mobile data collection.",
                    "The first mobility data contest hosted at the ACM HotPlanet'11 workshop.",
                    "High-resolution large-scale air pollution monitoring: approaches and challenges.",
                    "Albatross sampling: robust and effective hybrid vertex sampling for social graphs.",
                    "Automated land use identification using cell-phone records.",
                    "Reality vs emulation: running real mobility traces on a mobile wireless testbed.",
                    "Computing performance indicators in detecting shipping collision."
                ]
            },
            {
                "sub_name_abbr": "conf/mobiarch/2011",
                "sub_name": "Proceedings of the sixth international workshop on MobiArch, MobiArch '11, Bethesda, Maryland, USA, June 28, 2011.",
                "count": 7,
                "papers": [
                    "Saving mobile device energy with multipath TCP.",
                    "Opportunistic mobility with multipath TCP.",
                    "Using predictable mobility patterns to support scalable and secure MANETs of handheld devices.",
                    "GSTAR: generalized storage-aware routing for mobilityfirst in the future mobile internet.",
                    "SystemSens: a tool for monitoring usage in smartphone research deployments.",
                    "TailTheft: leveraging the wasted time for saving energy in cellular communications.",
                    "ErdOS: achieving energy savings in mobile OS."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "8th MobiSys 2010",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2010",
                "sub_name": "Proceedings of the 8th International Conference on Mobile Systems, Applications, and Services (MobiSys 2010), San Francisco, California, USA, June 15-18, 2010.",
                "count": 27,
                "papers": [
                    "Mobile emotional intelligence.",
                    "Participatory sensing: applications and architecture.",
                    "Darwin phones: the evolution of sensing and inference on mobile phones.",
                    "Automatic and robust breadcrumb system deployment for indoor firefighter applications.",
                    "IDEA: integrated distributed energy awareness for wireless sensor networks.",
                    "MAUI: making smartphones last longer with code offload.",
                    "PRISM: platform for remote sensing using smartphones.",
                    "CrowdSearch: exploiting crowds for accurate real-time image search on mobile phones.",
                    "NAPman: network-assisted power management for wifi devices.",
                    "Catnap: exploiting high bandwidth wireless interfaces to save energy for mobile devices.",
                    "ParkNet: drive-by sensing of road-side parking statistics.",
                    "Horn-ok-please.",
                    "GreenGPS: a participatory sensing fuel-efficient maps application.",
                    "Anatomizing application performance differences on smartphones.",
                    "Diversity in smartphone usage.",
                    "On the limits of effective hybrid micro-energy harvesting on mobile CRFID sensors.",
                    "Augmenting mobile 3G using WiFi.",
                    "Characterizing the transport behaviour of the short message service.",
                    "Performance study of active tracking in a cellular network using a modular signaling platform.",
                    "Energy-delay tradeoffs in smartphone applications.",
                    "Growing an organic indoor location system.",
                    "Energy-accuracy trade-off for continuous mobile device location.",
                    "Energy-efficient rate-adaptive GPS-based positioning for smartphones.",
                    "Improving energy efficiency of location sensing on smartphones.",
                    "Ensemble: cooperative proximity-based authentication.",
                    "Docx2Go: collaborative editing of fidelity reduced documents on mobile devices.",
                    "MoVi: mobile phone based video highlights via collaborative sensing."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2010hotplanet",
                "sub_name": "Proceedings of the 2nd ACM International Workshop on Hot Topics in Planet-scale Measurement, HotPlanet@MobiSys 2010, San Francisco, CA, USA, June 15-18, 2010.",
                "count": 5,
                "papers": [
                    "Planet-scale human mobility measurement.",
                    "Toward a common model and a markup language for personal gazetteers.",
                    "Extremely large-scale sensing applications for planetary WSNs.",
                    "Cuckoo: towards decentralized, socio-aware online microblogging services and data measurements.",
                    "The challenges in large-scale smartphone user studies."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "7th MobiSys 2009",
        "info": "Kraków, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2009",
                "sub_name": "Proceedings of the 7th International Conference on Mobile Systems, Applications, and Services (MobiSys 2009), Kraków, Poland, June 22-25, 2009.",
                "count": 26,
                "papers": [
                    "SPATE: small-group PKI-less authenticated trust establishment.",
                    "xShare: supporting impromptu sharing of mobile phones.",
                    "Attacks on public WLAN-based positioning systems.",
                    "BlueMonarch: a system for evaluating bluetooth applications in the wild.",
                    "PEIR, the personal environmental impact report, as a platform for participatory sensing systems research.",
                    "Longitudinal study of a building-scale RFID ecosystem.",
                    "Fidelity-aware replication for mobile devices.",
                    "MaJaB: improving resource management for web-based applications on mobile devices.",
                    "Leveraging smart phones to reduce mobility footprints.",
                    "Wifi-reports: improving wireless network selection with collaboration.",
                    "Point&Connect: intention-based device pairing for mobile phone users.",
                    "Using bluetooth device names to support interaction in smart environments.",
                    "SoundSense: scalable sound sensing for people-centric applications on mobile phones.",
                    "A framework of energy efficient mobile sensing for automatic user state recognition.",
                    "A methodology for extracting temporal properties from sensor network data streams.",
                    "StarTrack: a framework for enabling track-based applications.",
                    "EnTracked: energy-efficient robust position tracking for mobile devices.",
                    "R2D2: regulating beam shape and rate as directionality meets diversity.",
                    "Blue-Fi: enhancing Wi-Fi performance using bluetooth signals.",
                    "Predictive methods for improved vehicular WiFi access.",
                    "iScope: personalized multi-modality image search for mobile devices.",
                    "mFerio: the design and evaluation of a peer-to-peer mobile payment system.",
                    "Air-dropped sensor network for real-time high-fidelity volcano monitoring.",
                    "Leakage-aware energy synchronization for wireless sensor networks.",
                    "SolarStore: enhancing data reliability in solar-powered storage-centric sensor networks.",
                    "Sensor selection for energy-efficient ambulatory medical monitoring."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2009hotplanet",
                "sub_name": "Proceedings of the 1st ACM International Workshop on Hot Topics of Planet-Scale Mobility Measurements, HotPlanet@MobiSys 2009, Wroclaw, Poland, June 22-25, 2009.",
                "count": 6,
                "papers": [
                    "Sampling urban mobility through on-line repositories of GPS tracks.",
                    "DOME: a diverse outdoor mobile testbed.",
                    "Towards new methods for mobility data gathering: content, sources, incentives.",
                    "SniffMob: inferring human contact patterns using wireless devices.",
                    "Sentient bikes for collecting mobility traces in opportunistic networks.",
                    "Scaling measurement experiments to planet-scale: ethical, regulatory and cultural considerations."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "6th MobiSys 2008",
        "info": "Breckenridge, CO, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2008",
                "sub_name": "Proceedings of the 6th International Conference on Mobile Systems, Applications, and Services (MobiSys 2008), Breckenridge, CO, USA, June 17-20, 2008.",
                "count": 23,
                "papers": [
                    "Life, the universe, and the future of mobile computing.",
                    "Brimon: a sensor network system for railway bridge monitoring.",
                    "Virtual trip lines for distributed privacy-preserving traffic monitoring.",
                    "The pothole patrol: using a mobile sensor network for road surface monitoring.",
                    "Improving wireless privacy with an identifier-free link layer protocol.",
                    "Supporting vehicular mobility in urban multi-hop wireless networks.",
                    "Composcan: adaptive scanning for efficient concurrent communications and positioning with 802.11.",
                    "Flashproxy: transparently enabling rich web content via remote execution.",
                    "Enhancing web browsing security on public terminals using mobile composition.",
                    "Design, analysis, and implementation of a large-scale real-time location-based information sharing system.",
                    "Efficient channel-aware rate adaptation in dynamic environments.",
                    "Symphony: synchronous two-phase rate and power control in 802.11 wlans.",
                    "Micro power management of active 802.11 interfaces.",
                    "Peopletones: a system for the detection and notification of buddy proximity on mobile phones.",
                    "Micro-Blog: sharing and querying content through mobile phones and social participation.",
                    "Sherlock: automatically locating objects for humans.",
                    "Trustworthy and personalized computing on public kiosks.",
                    "Anonysense: privacy-aware people-centric sensing.",
                    "Behavioral detection of malware on mobile handsets.",
                    "Detecting energy-greedy anomalies and mobile malware variants.",
                    "Sixthsense: rfid-based enterprise intelligence.",
                    "SeeMon: scalable and energy-efficient context monitoring framework for sensor-rich mobile environments.",
                    "Cascadia: a system for specifying, detecting, and managing rfid events."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2008v",
                "sub_name": "Proceedings of the First Workshop on Virtualization in Mobile Computing, Breckenridge, CO, USA, June 17, 2008.",
                "count": 9,
                "papers": [
                    "MobiVMM: a virtual machine monitor for mobile phones.",
                    "Acceleration of the L4/Fiasco microkernel using scratchpad memory.",
                    "Shared device driver model for virtualized mobile handsets.",
                    "Chameleon: a capability adaptation system for interface virtualization.",
                    "Lightweight module isolation for sensor nodes.",
                    "Virtualized in-cloud security services for mobile devices.",
                    "Transient customization of mobile computing infrastructure.",
                    "VStore: efficiently storing virtualized state across mobile devices.",
                    "Community sensor grids: virtualization for sharing across domains."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "5th MobiSys 2007",
        "info": "San Juan, Puerto Rico",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2007",
                "sub_name": "Proceedings of the 5th International Conference on Mobile Systems, Applications, and Services (MobiSys 2007), San Juan, Puerto Rico, June 11-13, 2007.",
                "count": 24,
                "papers": [
                    "P2P, DSM, and other products of the complexity factory.",
                    "Cell phones as a research platform.",
                    "Context browsing with mobiles - when less is more.",
                    "PageTailor: reusable end-user customization for the mobile web.",
                    "MobiUS: enable together-viewing video experience across two mobile devices.",
                    "NodeMD: diagnosing node-level faults in remote wireless sensor systems.",
                    "MyExperience: a system for in situ tracing and capturing of user feedback on mobile phones.",
                    "Improving mobile database access over wide-area networks without degrading consistency.",
                    "Real-time deployment of multihop relays for range extension.",
                    "Dali: a communication-centric data abstraction layer for energy-constrained devices in mobile sensor networks.",
                    "Shooter localization and weapon classification with soldier-wearable networked sensors.",
                    "Experiences of designing and deploying intelligent sensor nodes to monitor hand-arm vibrations in the field.",
                    "Radio interferometric tracking of mobile wireless nodes.",
                    "Triage: balancing energy and quality of service in a microserver.",
                    "Context-for-wireless: context-sensitive energy-efficient wireless data transfer.",
                    "Wireless wakeups revisited: energy management for voip over wi-fi smartphones.",
                    "MobiSteer: using steerable beam directional antenna for vehicular network access.",
                    "Vehicular opportunistic communication under the microscope.",
                    "Surface street traffic estimation.",
                    "SmokeScreen: flexible privacy controls for presence-sharing.",
                    "Preserving location privacy in wireless lans.",
                    "SmartSiren: virus detection and alert for smartphones.",
                    "Simplifying cyber foraging for mobile devices.",
                    "COMBINE: leveraging the power of wireless peers through collaborative downloading."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2007h",
                "sub_name": "Proceedings of the 1st ACM SIGMOBILE International Workshop on Systems and Networking Support for Healthcare and Assisted Living Environments, HealthNet 2007, San Juan, Puerto Rico, June 11, 2007.",
                "count": 20,
                "papers": [
                    "Rendezvous-based access control for medical records in the pre-hospital environment.",
                    "Addressing security in medical sensor networks.",
                    "Context-aware access to public shared devices.",
                    "Investigating network architectures for body sensor networks.",
                    "Heartbeat driven medium access control for body sensor networks.",
                    "Toward highly-available WSNs for assisted living.",
                    "Energy-efficient multi-hop medical sensor networking.",
                    "Participatory user centered design techniques for a large scale ad-hoc health information system.",
                    "Investigating and supporting health management practices of individuals with diabetes.",
                    "MACCS: : an industrial study of hands-free wireless communications for mobile healthcare workers.",
                    "A feature combination approach for the detection of early morning bathroom activities with wireless sensors.",
                    "A resource optimized physical movement monitoring scheme for environmental and on-body sensor networks.",
                    "Accelerometer-based human abnormal movement detection in wireless sensor networks.",
                    "An integrated wireless sensing and mobile processing architecture for assisted living and healthcare applications.",
                    "Automatic administration of the get up and go test.",
                    "Health-OS: : a position paper.",
                    "Meditrina: : addressing the system-level challenges to ambient assisted living.",
                    "Universal real-time navigational assistance (URNA): an urban bluetooth beacon for the blind.",
                    "Algorithm to automatically detect abnormally long periods of inactivity in a home.",
                    "A time-and-value centric provenance model and architecture for medical event streams."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2007mobiopp",
                "sub_name": "Proceedings of the 1st international MobiSys workshop on Mobile opportunistic networking, MobiOpp@MobiSys 2007, San Juan, Puerto Rico, June 11, 2007.",
                "count": 14,
                "papers": [
                    "Contention-aware analysis of routing schemes for mobile opportunistic networks.",
                    "A comparison of opportunistic and deterministic forwarding in mobile multihop wireless networks.",
                    "Evaluating contacts for routing in highly partitioned mobile networks.",
                    "Reactive sink mobility in wireless sensor networks.",
                    "Energy-efficient opportunistic topology control in wireless sensor networks.",
                    "Opportunistic spatio-temporal dissemination system for vehicular networks.",
                    "Evaluating vehicle network strategies for downtown Portland: opportunistic infrastructure and the importance of realistic mobility models.",
                    "Applicability of identity-based cryptography for disruption-tolerant networking.",
                    "Incentive-based cooperative and secure inter-personal networking.",
                    "Prioritized epidemic routing for opportunistic networks.",
                    "Performance modeling of network coding in epidemic routing.",
                    "Hybrid routing in clustered DTNs with message ferrying.",
                    "TACO-DTN: a time-aware content-based dissemination system for delay tolerant networks.",
                    "Reliable and efficient message delivery in delay tolerant networks using rateless codes."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "4th MobiSys 2006",
        "info": "Uppsala, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2006",
                "sub_name": "Proceedings of the 4th International Conference on Mobile Systems, Applications, and Services (MobiSys 2006), Uppsala, Sweden, June 19-22, 2006.",
                "count": 19,
                "papers": [
                    "Enhancing the security of corporate Wi-Fi ntworks using DAIR.",
                    "LIGER: implementing efficient hybrid security mechanisms for heterogeneous sensor networks.",
                    "FireWxNet: a multi-tiered portable wireless system for monitoring weather conditions in wildland fire environments.",
                    "Context-aware interactive content adaptation.",
                    "Efficient and transparent dynamic content updates for mobile clients.",
                    "Feasibility study of mesh networks for all-wireless offices.",
                    "Fast handoff for seamless wireless mesh networks.",
                    "Measurement driven deployment of a two-tier urban mesh access network.",
                    "SATIRE: a software architecture for smart AtTIRE.",
                    "MiNT-m: an autonomous mobile wireless experimentation platform.",
                    "Pegboard: a framework for developing mobile applications.",
                    "ARIADNE: a dynamic indoor signal map construction and localization system.",
                    "PinPoint.",
                    "Building realistic mobility models from coarse-grained traces.",
                    "MOJO: a distributed physical layer anomaly detection system for 802.11 WLANs.",
                    "WiFiProfiler: cooperative diagnosis in wireless LANs.",
                    "CoolSpots: reducing the power consumption of wireless mobile devices with multiple radio interfaces.",
                    "Improved access point selection.",
                    "Using smart triggers for improved user performance in 802.11 wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "3rd MobiSys 2005",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2005",
                "sub_name": "Proceedings of the 3rd International Conference on Mobile Systems, Applications, and Services, MobiSys 2005, Seattle, Washington, USA, June 6-8, 2005.",
                "count": 20,
                "papers": [
                    "A systems architecture for ubiquitous video.",
                    "LiveMail: personalized avatars for mobile entertainment.",
                    "MediaAlert: a broadcast video monitoring and alerting system for mobile users.",
                    "Cracking the Bluetooth PIN.",
                    "Shake them up!: a movement-based pairing protocol for CPU-constrained devices.",
                    "Reincarnating PCs with portable SoulPads.",
                    "Slingshot: deploying stateful services in wireless hotspots.",
                    "DeltaCast: efficient file reconciliation in wireless broadcast systems.",
                    "Improving TCP performance over wireless networks with collaborative multi-homed mobile hosts.",
                    "Horde: separating network striping policy from mechanism.",
                    "An overlay MAC layer for 802.11 networks.",
                    "Design and implementation of a single system image operating system for ad hoc networks.",
                    "A dynamic operating system for sensor nodes.",
                    "A relative positioning system for co-located mobile devices.",
                    "WALRUS: wireless acoustic location with room-level resolution using ultrasound.",
                    "The Horus WLAN location determination system.",
                    "Deploying and evaluating a location-aware system.",
                    "Accuracy characterization for metropolitan-scale Wi-Fi localization.",
                    "Energy efficiency of handheld computer interfaces: limits, characterization and practice.",
                    "Turducken: hierarchical power management for mobile devices."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2005eesr",
                "sub_name": "Workshop on End-to-End, Sense-and-Respond Systems, Applications, and Services, EESR '05, Seattle, WA, USA, June 5, 2005.",
                "count": 8,
                "papers": [
                    "A Sensor-based, Web Service-enabled, Emergency Medical Response System.",
                    "A Rule-based System for Sense-and-Respond Telematics Services.",
                    "Meteorological Command and Control: An End-to-end Architecture for a Hazardous Weather Detection Sensor Network.",
                    "Reducing Business Surprises through Proactive, Real-Time Sensing and Alert Management.",
                    "A File System Abstraction for Sense and Respond Systems.",
                    "Transversal Issues in Real-Time Sense-and-Respond Systems.",
                    "M-ECho: A Middleware for Morphable Data-Streaming in Pervasive Systems.",
                    "The Abstract Task Graph: A Methodology for Architecture-Independent Programming of Networked Sensor Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/mobisys/2005witmemo",
                "sub_name": "International Workshop on Wireless Traffic Measurements and Modeling, WiTMeMo'05, Seattle, WA, USA, June 5, 2005.",
                "count": 7,
                "papers": [
                    "A Measurement Study of Path Capacity in 802.11b-based Wireless Networks.",
                    "Mobility Assessment for MANETs Requiring Persistent Links.",
                    "An Experimental Study of Multimedia Traffic Performance in Mesh Networks.",
                    "Analysis of a Wi-Fi Hotspot Network.",
                    "MobiNet: A Scalable Emulation Infrastructure for Ad hoc and Wireless Networks.",
                    "An Accurate Technique for Measuring the Wireless Side of Wireless Networks.",
                    "Modeling Users' Mobility among WiFi Access Points."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "2nd MobiSys 2004",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2004",
                "sub_name": "Proceedings of the Second International Conference on Mobile Systems, Applications, and Services, MobiSys 2004, Hyatt Harborside, Boston, Massachusetts, USA, June 6-9, 2004.",
                "count": 24,
                "papers": [
                    "Human Needs and Mobile Technologies: Small, fast, and fun.",
                    "NWSLite: A Light-Weight Prediction Utility for Mobile Devices.",
                    "uSleep: A Technique for Reducing Energy Consumption in Handheld Devices.",
                    "Ghosts in the Machine: Interfaces for Better Power Management (Awarded Best Paper!).",
                    "Metadata Creation System for Mobile Images.",
                    "Bluetooth and WAP Push Based Location-Aware Mobile Advertising System.",
                    "Impromptu: Managing Networked Audio Applications for Mobile Users.",
                    "Improving the Latency of 802.11 hand-offs using Neighbor Graphs.",
                    "DOMINO: A System to Detect Greedy Behavior in IEEE 802.11 Hotspots.",
                    "Talking Phones: a cultural reading of mobile technologies.",
                    "Hood: A Neighborhood Abstraction for Sensor Networks.",
                    "Intelligent Fluid Infrastructure for Embedded Networking.",
                    "Impact of Radio Irregularity on Wireless Sensor Networks.",
                    "Middleware Support for Reconciling Client Updates and Data Transcoding.",
                    "Exponential Index: A Parameterized Distributed Indexing Scheme for Data on Air.",
                    "Mimic: Raw Activity Shipping for File Synchronization in Mobile File Systems.",
                    "An Architecture for Privacy-Sensitive Ubiquitous Computing.",
                    "Tracking Moving Devices with the Cricket Location System.",
                    "Divert: Fine-grained Path Selection for Wireless LANs.",
                    "MAR: A Commuter Router Infrastructure for the Mobile Internet.",
                    "A Mechanism for Host Mobility Management supporting Application Awareness.",
                    "Electronic Shepherd - a Low-Cost, Low-Bandwidth, Wireless Network System.",
                    "Implementing Software on Resource-Constrained Mobile Sensors: Experiences with Impala and ZebraNet.",
                    "Energy-Efficient Surveillance System Using Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "1st MobiSys 2003",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mobisys/2003",
                "sub_name": "Proceedings of the First International Conference on Mobile Systems, Applications, and Services, MobiSys 2003, San Francisco, CA, USA, May 5-8, 2003.",
                "count": 23,
                "papers": [
                    "Single Reflection Spatial Voting: A Novel Method for Discovering Reflective Surfaces Using Indoor Positioning Systems.",
                    "The Lighthouse Location System for Smart Dust.",
                    "Anonymous Usage of Location-Based Services Through Spatial and Temporal Cloaking.",
                    "Reservations for Conflict Avoidance in a Mobile Database System.",
                    "Protecting Applications with Transient Authentication.",
                    "iFlow: Middleware-assisted Rendezvous-based Information Access for Mobile Ad Hoc Applications.",
                    "Full TCP/IP for 8-Bit Architectures.",
                    "System Services for Ad-Hoc Routing: Architecture, Implementation and Experiences.",
                    "Predictive Resource Management for Wearable Computing.",
                    "Host Mobility Using an Internet Indirection Infrastructure.",
                    "Contact Networking: A Localized Mobility System.",
                    "Service-Oriented Network Sockets.",
                    "Energy-Conserving Data Placement and Asynchronous Multicast in Wireless Sensor Networks.",
                    "Design and Implementation of a Framework for Efficient and Programmable Sensor Networks.",
                    "An Entity Maintenance and Connection Service for Sensor Networks.",
                    "Operating System Modifications for Task-Based Speed and Voltage Scheduling.",
                    "Energy Aware Lossless Data Compression.",
                    "Energy-Adaptive Display System Designs for Future Mobile Environments.",
                    "iMASH: Interactive Mobile Application Session Handoff.",
                    "Tactics-Based Remote Execution for Mobile Computing.",
                    "Collaboration and Multimedia Authoring on Mobile Devices.",
                    "Characterizing Mobility and Network Usage in a Corporate Wireless Local-Area Network.",
                    "GPRSWeb: Optimizing the Web for GPRS Links."
                ]
            }
        ]
    }
]