[
    {
        "year": "2020",
        "name": "16th MSN 2020",
        "info": "Tokyo, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2020",
                "sub_name": "16th International Conference on Mobility, Sensing and Networking, MSN 2020, Tokyo, Japan, December 17-19, 2020.",
                "count": 117,
                "papers": [
                    "A Centralized Controller for Reliable and Available Wireless Schedules in Industrial Networks.",
                    "A FAIR Extension for the MQTT Protocol.",
                    "A Game Theoretical Pricing Scheme for Vehicles in Vehicular Edge Computing.",
                    "A Global Brain fuelled by Local intelligence: Optimizing Mobile Services and Networks with AI.",
                    "A Near-optimal Protocol for the Subset Selection Problem in RFID Systems.",
                    "A Priority Task Scheduling Algorithm based on Residual Energy in EH-WSNs.",
                    "A QoE-based 360° Video Adaptive Bitrate Delivery and Caching Scheme for C-RAN.",
                    "Adaptive Machine learning: A Framework for Active Malware Detection.",
                    "AirQ: A Privacy-Preserving Truth Discovery Framework for Vehicular Air Quality Monitoring.",
                    "An Efficient Data Aggregation Scheme with Local Differential Privacy in Smart Grid.",
                    "An Online Pricing Strategy of EV Charging and Data Caching in Highway Service Stations.",
                    "Analysing Ballistocardiography for Pervasive Healthcare.",
                    "BDTF: A Blockchain-Based Data Trading Framework with Trusted Execution Environment.",
                    "BIA: A Blockchain-based Identity Authorization Mechanism.",
                    "Compressed Multivariate Kernel Density Estimation for WiFi Fingerprint-based Localization.",
                    "CoOMO: Cost-efficient Computation Outsourcing with Multi-site Offloading for Mobile-Edge Services.",
                    "COPSS-lite: A Lightweight ICN based Pub/Sub System for IoT Environments.",
                    "Data Collection Strategy Based on Drone Technology in Wireless Sensor Networks.",
                    "Deep Reinforcement Learning for Optimal Resource Allocation in Blockchain-based IoV Secure Systems.",
                    "Detection of malicious nodes in drone ad-hoc network based on supervised learning and clustering algorithms.",
                    "Dynamic Resource Allocation for Hierarchical Federated Learning.",
                    "Dynamic Spectrum Allocation Enabled Multi-user Latency Minimization in Mobile Edge Computing.",
                    "Efficient Algorithm for Multi-Constrained Opportunistic Wireless Scheduling.",
                    "Efficient Distributed Training in Heterogeneous Mobile Networks with Active Sampling.",
                    "Efficient Service Entity Chain Placement in Mobile Edge Computing.",
                    "Energy-efficient Trajectory Planning and Speed Scheduling for UAV-assisted Data Collection.",
                    "Energy-saving Strategy for Edge Computing by Collaborative Processing Tasks on Base Stations.",
                    "Enhancing IoT Anomaly Detection Performance for Federated Learning.",
                    "Evaluation environment using edge computing for artificial intelligence-based irrigation system.",
                    "FD-Band: A Ubiquitous Fall Detection System Using Low-Cost COTS Smart Band.",
                    "Federated Deep Payload Classification for Industrial Internet with Cloud-Edge Architecture.",
                    "Fine-grained Device and Data Access Control of Community Medical Internet of Things.",
                    "Joint Service Caching and Computation Offloading to Maximize System Profits in Mobile Edge-Cloud Computing.",
                    "Jointly Video Bitrate Adaptation and Multicast Resource Allocation in Mobile Edge Networks.",
                    "Lifetime Improvements of Smart Sensors Maintenance Protocol in Prospect of IoT-based Rampal Power Plant.",
                    "Load balancing and resource management in distributed B5G networks.",
                    "Magic Wand: Towards Plug-and-Play Gesture Recognition on Smartwatch.",
                    "Markov Probability Fingerprints: A Method for Identifying Encrypted Video Traffic.",
                    "MEC-Assisted FoV-Aware and QoE-Driven Adaptive 360° Video Streaming for Virtual Reality.",
                    "MobiFit: Contactless Fitness Assistant for Freehand Exercises Using Just One Cellular Signal Receiver.",
                    "Multivariate and Multi-frequency LSTM based Fine-grained Productivity Forecasting for Industrial IoT.",
                    "Online Distributed Job Dispatching with Outdated and Partially-Observable Information.",
                    "Optimal Defense Strategy against Evasion Attacks.",
                    "Optimizing functional split of baseband processing on TWDM-PON based fronthaul network.",
                    "Privacy-Protecting Reputation Management Scheme in IoV-based Mobile Crowdsensing.",
                    "QoS Optimization of DNN Serving Systems Based on Per-Request Latency Characteristics.",
                    "Real-Time Survivor Detection in UAV Thermal Imagery Based on Deep Learning.",
                    "Real-time Task Offloading for Data and Computation Intensive Services in Vehicular Fog Computing Environments.",
                    "Reinforcement Learning based Joint Channel/Subframe Selection Scheme for Fair LTE-WiFi Coexistence.",
                    "Research on D2D Data Transmission Protocol in NDN.",
                    "RF-WTI: Wood Types Identification based on Commodity RFID Devices.",
                    "SASAK: Shrinking the Attack Surface for Android Kernel with Stricter \"seccomp\" Restrictions.",
                    "Scheduling mix-flow in SD-DCN based on Deep Reinforcement Learning with Private Link.",
                    "SDN Based Computation Offloading for Industrial Internet of Things.",
                    "Simultaneous Multi-face Zoom Tracking for 3-D People-Flow Analysis with Face Identification.",
                    "SSR: Joint Optimization of Recommendation and Adaptive Bitrate Streaming for Short-form Video Feed.",
                    "Terminal-Edge-Cloud Collaboration: An Enabling Technology for Robust Multimedia Streaming.",
                    "Throughput Maximization for UAV-Enabled Data Collection.",
                    "Tile-based Multi-source Adaptive Streaming for 360-degree Ultra-High-Definition Videos.",
                    "TL-IDPS: Two Level Intrusion Detection and Prevention System using Probabilistic Optimal Feature Set Estimation.",
                    "Towards mmWave Localization with Controllable Reflectors in NLoS Scenarios.",
                    "Training Machine Learning Models Through Preserved Decentralization.",
                    "Urban Mobility Prediction based on LSTM and Discrete Position Relationship Model.",
                    "Weighted Local Outlier Factor for Detecting Anomaly on In-Vehicle Network.",
                    "Wireless Information and Energy Provision with Practical Modulation in Energy Self-Sustainable Wireless Networks.",
                    "A Geometry-based Non-stationary Wideband MIMO Channel Model and Correlation Analysis for Vehicular Communication Systems.",
                    "Analyzing Eye-movements of Drivers with Different Experiences When Making a Turn.",
                    "Autonomous Security Analysis and Penetration Testing.",
                    "Early Botnet Detection for the Internet and the Internet of Things by Autonomous Machine Learning.",
                    "Identifying unfamiliar callers' professions from privacy-preserving mobile phone data.",
                    "Length Matters: Fast Internet Encrypted Traffic Service Classification based on Multi-PDU Lengths.",
                    "[Invited] LoRaCTP: a LoRa based Content Transfer Protocol for sustainable edge computing.",
                    "Machine Learning Enabled Secure Collection of Phasor Data in Smart Power Grid Networks.",
                    "Mobility-Aware Offloading and Resource Allocation in MEC-Enabled IoT Networks.",
                    "Multi-dimensional Impact Detection and Diagnosis in Cellular Networks.",
                    "[Invited] NDN Based Participatory Crowdsensing Framework with Area-focused Interest Forwarding.",
                    "NoPTPeer: Protecting Android Devices from Stealthy Spoofing and Stealing in WLANs without Privilege.",
                    "Real-time Emotion Recognition for Sales.",
                    "Resilient Caching in Information-Centric Networking.",
                    "Subject-adaptive Skeleton Tracking with RFID.",
                    "Trapdoor Assignment of PEKS-based NDN Strategy in Two-Tier Networks.",
                    "User Interest Communities Influence Maximization in a Competitive Environment.",
                    "A Study on MQTT Node Selection.",
                    "Impact of Mode Selection on the Performance of D2D-Unlicensed Communications.",
                    "UAV-empowered Protocol for Information Sharing in VDTN.",
                    "Demo Abstract: Vision-aided 3D Human Pose Estimation with RFID.",
                    "Verifiable Blockchain-Based Searchable Encryption with forward and backward privacy.",
                    "A Traffic Engineering Technology Based on Segment Routing in SDN.",
                    "An Ensemble Learning Approach for Extracting Concept Prerequisite Relations from Wikipedia.",
                    "Boosting Cooperative Game with Complete Information in Multi-UAV Mesh Router Networks.",
                    "Community Preference-Based Information-Centric Networking Cache.",
                    "Design and Analysis of Decentralized Interactive Cyber Defense Approach based on Multi-agent Coordination.",
                    "Improving the Response Time of SDN Controllers Based on Vertical Handover.",
                    "A Collision-free MAC protocol based on quorum system for underwater acoustic sensor networks.",
                    "A Privacy-preserving and Collusion-resisting Top-k Query Processing in WSNs.",
                    "AcousticThermo: Temperature Monitoring Using Acoustic Pulse Signal.",
                    "Gesture Recognition System Based on Neural Networks by Using COTS RFID Tag Array.",
                    "Real-time and Accurate RFID Tag Localization based on Multiple Feature Fusion.",
                    "Coding based Distributed Data Shuffling for Low Communication Cost in Data Center Networks.",
                    "Improving Analysis of Automatic Distribution Changes for Power Grid.",
                    "Privacy-Preserving Techniques for Protecting Large-Scale Data of Cyber-Physical Systems.",
                    "Research on load forecasting model on power sensor net.",
                    "Research on visualization planning method of distribution network based on graphical model integration.",
                    "Researches on Intelligent Traffic Signal Control Based on Deep Reinforcement Learning.",
                    "WSAD: An Unsupervised Web Session Anomaly Detection Method.",
                    "A Method to Construct Vulnerability Knowledge Graph based on Heterogeneous Data.",
                    "ECDT: Exploiting Correlation Diversity for Knowledge Transfer in Partial Domain Adaptation.",
                    "Study on Location and Sizing Programming of Regional Substation.",
                    "A Game-Theoretical Approach for Task Offloading in Edge Computing.",
                    "A Low Cost Edge Computing and LoRaWAN Real Time Video Analytics for Road Traffic Monitoring.",
                    "A Novel Service Composition Approach for Offloading in Mobile Edge Computing.",
                    "Accurate IoT Device Identification from Merely Packet Length.",
                    "An Optimal Wireless Transmission Strategy based on Coherent Beamforming and Successive Interference Cancellation for Edge Computing.",
                    "Dependency-Aware Dynamic Task Scheduling in Mobile-Edge Computing.",
                    "Game Theory based Joint Task Offloading and Resource Allocation Algorithm for Mobile Edge Computing.",
                    "Load Balancing Mechanisms of Unmanned Surface Vehicle Cluster Based on Marine Vehicular Fog Computing.",
                    "Virtual Machine Security Migration Strategy Based on the Edge Computing Environment."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "15th MSN 2019",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2019",
                "sub_name": "15th International Conference on Mobile Ad-Hoc and Sensor Networks, MSN 2019, Shenzhen, China, December 11-13, 2019.",
                "count": 75,
                "papers": [
                    "Multi-carrier Measurement Study of Mobile Network Latency: The Tale of Hong Kong and Helsinki.",
                    "Knowledge-Aware Graph Collaborative Filtering for Recommender Systems.",
                    "LSTM-Aided Reinforcement Learning for Energy Management in Microgrid with Energy Storage and EV Charging.",
                    "A Deep Reinforcement Learning Approach to Multi-Component Job Scheduling in Edge Computing.",
                    "Accurate Magnetic Object Localization Using Artificial Neural Network.",
                    "A Generalized Obfuscation Method to Protect Software of Mobile Apps.",
                    "RF-Recorder: A Contactless Music Play Recording System Using COTS RFID.",
                    "Pedestrian Flow Prediction with Business Events.",
                    "An Elliptic Curve Based Name Privacy Protection Mechanism for Sensory Data Centric Named Data Networking.",
                    "An Autonomous UAV Navigation System for Unknown Flight Environment.",
                    "Wiga: A WiFi-Based Contactless Activity Sequence Recognition System Based on Deep Learning.",
                    "Energy-Efficient Cooperative Scalable Video Distribution and Sharing in Mobile Social Networks.",
                    "TODQA: Efficient Task-Oriented Data Quality Assessment.",
                    "Prediction-Based Task Allocation in Mobile Crowdsensing.",
                    "Energy-Efficient Data Collection Scheme Based on Mobile Edge Computing in WSNs.",
                    "AMRnet: A Real-Time Automatic Modulation Recognition Network for Wireless Communication System.",
                    "Available Bandwidth Estimation for Directional CSMA/CA Ad Hoc Networks.",
                    "FLoc: Fingerprint-Based Indoor Localization System under a Federated Learning Updating Framework.",
                    "Physical Layer Security in Untrusted Decode-and-Forward Relay Networks Allowing Intra-Link Errors.",
                    "SocialCar: A Task Allocation Framework for Social Media Driven Vehicular Network Sensing Systems.",
                    "Non-Cooperative Aerial Base Station Placement via Stochastic Optimization.",
                    "Towards Cascading Problem for Dynamic Rate Allocations in ISP Networks with SDN.",
                    "Cooperative Calibration Scheme for Mobile Wireless Sensor Network.",
                    "Addressing the Conflict of Negative Feedback and Sampling for Online Ad Recommendation in Mobile Social Networks.",
                    "Optimal Download of Dynamically Generated Data by Using ISL Offloading in LEO Networks.",
                    "Data Aggregation Scheduling in Duty-Cycled Multihop Wireless Networks Subject to Physical Interference.",
                    "Minimum-Latency Data Gathering Scheduling in Multi-Channel Wireless Sensor Networks Using Only Secure Links.",
                    "Mobility Pattern-Aware Task Recommendation for Taxi Crowdsourcing Delivery.",
                    "Characterizing Smartphone Users' Mobility Patterns in a Large 4G Cellular Network.",
                    "Optimal Satellite Data Downloading to Multiple ESs by ISL Offloading in LEO Satellite Networks.",
                    "RF Aerially Charging Scheduling for UAV Fleet : A Q-Learning Approach.",
                    "Provenance Compression Using Packet-Path-Index Differences in Wireless Sensor Networks.",
                    "Exploratory Community Detection: Finding Communities in Unknown Networks.",
                    "Summarizing the Slices: Sample-Based Core-Periphery Classification on Complex Networks.",
                    "Anomalous Seismic Events Detection by Build-In Sensors on Smart Phones.",
                    "BookChain: Library-Free Book Sharing Based on Blockchain Technology.",
                    "Spectral Graph Theory Based Topology Analysis for Reconfigurable Data Center Networks.",
                    "Joint Task Offloading and Data Caching in Mobile Edge Computing.",
                    "Subject Independent Human Activity Recognition with Foot IMU Data.",
                    "A Lightweight Hash Function Based on Cellular Automata for Mobile Network.",
                    "Multi-objective Link-Separation Multipath Selection Using k Max-Min for Software-Defined MANETs.",
                    "Themis: A Novel Detection Approach for Detecting Mixed Algorithmically Generated Domains.",
                    "POI Recommendation Based on First-Order Collaborative Filtering Tree.",
                    "Trust-Aware Group Recommendation with Attention Mechanism in Social Network.",
                    "A Mininet-Based Emulated Testbed for the I/Ocloud.",
                    "Robot Drivers: Learning to Drive by Trial & Error.",
                    "DeepRTP: A Deep Spatio-Temporal Residual Network for Regional Traffic Prediction.",
                    "ACAC: An Airtime-Aware Centralized Association Control System in 802.11ac WLANs.",
                    "Online Joint Scheduling of Delay-Sensitive and Computation-Oriented Tasks in Edge Computing.",
                    "WiEnhance: Towards Data Augmentation in Human Activity Recognition Using WiFi Signal.",
                    "The Image Annotation Method by Convolutional Features from Intermediate Layer of Deep Learning Based on Internet of Things.",
                    "VDetector: Detecting Vulnerability Based on Inter-Component Data Flows in Android Applications.",
                    "High Performance Power-Efficient Gate-Based CAM for Reconfigurable Computing.",
                    "Reduce UAV Coverage Energy Consumption through Actor-Critic Algorithm.",
                    "Mining and Comparing User Reviews across Similar Mobile Apps.",
                    "An Optimization Deployment Scheme for Static Charging Piles Based on Dynamic of Shared E-Bikes.",
                    "Anomaly Detection for Screw Tightening Timing Data with LSTM Recurrent Neural Network.",
                    "The Classification of Surface Electromyographic for Ankle Eversion and Inversion Based on Cerebellar Model Neural Networks.",
                    "Extensible Lower Bound Function for Dynamic Time Warping.",
                    "A Distributed Image Compression Scheme for Energy Harvesting Wireless Multimedia Sensor Networks.",
                    "Histopathologic Cancer Detection Based on Deep Multiple Instance Learning.",
                    "A Cooperative Indoor Localization Enhancement Framework on Edge Computing Platforms for Safety-Critical Applications.",
                    "Enabling Safety-Critical and Computation-Intensive IoV Applications via Vehicular Fog Computing.",
                    "iWEP: An Intelligent WLAN Early Warning Platform Using Edge Computing.",
                    "Encoding Space to Count Multi-Targets with Multiplexed Binary Infrared Sensors.",
                    "Forest Mapping from Hyperspectral Image Using Deep Belief Network.",
                    "An Approach to Time Series Classification Using Binary Distribution Tree.",
                    "Facial Expression Recognition Based on Edge Computing.",
                    "Intelligent Log Analysis System for Massive and Multi-Source Security Logs: MMSLAS Design and Implementation Plan.",
                    "A Deception Defense and Active Defense Based Three-Dimensional Defense Architecture: DA-3DD Design and Implementation Plan.",
                    "Research on Abstractive Automatic Summarization Technology Based on Deep Learning.",
                    "Dandelion: An Online Testbed for LoRa Development.",
                    "Tree-Structured Correlation Filters for Robust Visual Tracking.",
                    "Gait Activity Authentication Using LSTM Neural Networks with Smartphone Sensors.",
                    "Noise-Identified Kalman Filter for Short-Term Traffic Flow Forecasting."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "14th MSN 2018",
        "info": "Shenyang, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2018",
                "sub_name": "14th International Conference on Mobile Ad-Hoc and Sensor Networks, MSN 2018, Shenyang, China, December 6-8, 2018.",
                "count": 36,
                "papers": [
                    "Clustering-based Communication Backbone for Large Scale UAV Networks.",
                    "HERMES: Pedestrian Real-Time Offline Positioning and Moving Trajectory Tracking System Based on MEMS Sensors.",
                    "A Blockchain-Based Scheme for Secure Data Provenance in Wireless Sensor Networks.",
                    "Multi-Dimension Context-Based Service Recommendation Algorithm in VANET.",
                    "A Joint Optimization on Cross-Layer for mmWave Wireless Network.",
                    "SL-MAC: A Joint TDMA MAC Protocol for LEO Satellites Supported Internet of Things.",
                    "Energy-Aware Service Composition of Configurable IoT Smart Things.",
                    "Configuration of the C-V2X Mode 4 Sidelink PC5 Interface for Vehicular Communication.",
                    "A Deployment Model of Charging Pile Based on Random Forest for Shared Electric Vehicle in Smart Cities.",
                    "Content-Centric Community-Aware Mobile Social Network Routing Scheme.",
                    "Influence Maximization with Trust Relationship in Social Networks.",
                    "Task Assignment for Simple Tasks with Small Budget in Mobile Crowdsourcing.",
                    "Quality-Based User Recruitment in Mobile CrowdSensing.",
                    "GTC Forest: An Ensemble Method for Network Structured Data Classification.",
                    "Ensemble Deep Learning Method for Short-Term Load Forecasting.",
                    "Combinatorial Double Auction-Based Service Allocation Using an Extended NSGA-III in Clouds.",
                    "Improving Influence Maximization from Samples: An Empirical Analysis.",
                    "Complex Behavior Recognition Based on Convolutional Neural Network: A Survey.",
                    "Smartphone-Assisted Over-Air Reprogramming Based on Visible Light Communication.",
                    "PosAla: A Smartphone-Based Posture Alarm System Design for Smartphone Users.",
                    "RPSBPT: A Route Planning Scheme with Best Profit for Taxi.",
                    "A Group Construction Algorithm Based on Density and Closeness Clustering in Mobile Communication Networks.",
                    "Deep Identity Confusion for Automatic Sleep Staging Based on Single-Channel EEG.",
                    "Brain-Inspired Communications in Dense Wireless Networks.",
                    "Controller Placement in Software-Defined Satellite Networks.",
                    "Reputation and Incentive Mechanism for SDN Applications.",
                    "A Secure Routing Mechanism for Industrial Wireless Networks Based on SDN.",
                    "Distributed and Application-Aware Task Scheduling in Edge-Clouds.",
                    "Launching Low-Rate DoS Attacks with Cache-Enabled WiFi Offloading.",
                    "Real-Time Trajectory Data Publishing Method with Differential Privacy.",
                    "Research on Co-Location Privacy-Preserving System.",
                    "How Do Metro Station Crowd Flows Influence the Taxi Demand Based on Deep Spatial-Temporal Network?",
                    "GeoLoc: A Geomagnetic Indoor Localization Algorithm with Iterative Uncertainty Elimination.",
                    "Path Planning for Sensor Data Collection by Using UAVs.",
                    "Prediction of Customer Churn Incline in Mobile Communication.",
                    "Optimal Content Caching Policy Considering Mode Selection and User Preference under Overlay D2D Communications."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "13th MSN 2017",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2017",
                "sub_name": "Mobile Ad-hoc and Sensor Networks - 13th International Conference, MSN 2017, Beijing, China, December 17-20, 2017, Revised Selected Papers.",
                "count": 39,
                "papers": [
                    "An Efficient and Secure Range Query Scheme for Encrypted Data in Smart Grid.",
                    "Receive Buffer Pre-division Based Flow Control for MPTCP.",
                    "On Complementary Effect of Blended Behavioral Analysis for Identity Theft Detection in Mobile Social Networks.",
                    "A Hierarchical Framework for Evaluation of Cloud Service Qualities.",
                    "Facility Location Selection Using Community-Based Single Swap: A Case Study.",
                    "Message Transmission Scheme Based on the Detection of Interest Community in Mobile Social Networks.",
                    "An Improved Lossless Data Hiding Scheme in JPEG Bitstream by VLC Mapping.",
                    "Co-saliency Detection Based on Siamese Network.",
                    "An Efficient Privacy-Preserving Fingerprint-Based Localization Scheme Employing Oblivious Transfer.",
                    "An Efficient Sparse Coding-Based Data-Mining Scheme in Smart Grid.",
                    "Achieving Communication Effectiveness of Web Authentication Protocol with Key Update.",
                    "Placement Fraud Detection on Smart Phones: A Joint Crowdsourcing and Data Analyzing Based Approach.",
                    "A Reinforcement Learning Approach of Data Forwarding in Vehicular Networks.",
                    "Privacy-Assured Large-Scale Navigation from Encrypted Approximate Shortest Path Recommendation.",
                    "An Efficient and Secure Authentication Scheme for In-vehicle Networks in Connected Vehicle.",
                    "Research of Task Scheduling Mechanism Based on Prediction of Memory Utilization.",
                    "An Effective Method for Community Search in Large Directed Attributed Graphs.",
                    "EPAF: An Efficient Pseudonymous-Based Inter-vehicle Authentication Framework for VANET.",
                    "CHAR-HMM: An Improved Continuous Human Activity Recognition Algorithm Based on Hidden Markov Model.",
                    "A Prediction Method Based on Complex Event Processing for Cyber Physical System.",
                    "A Fast Handover Scheme for SDN Based Vehicular Network.",
                    "Secret-Sharing Approach for Detecting Compromised Mobile Sink in Unattended Wireless Sensor Networks.",
                    "Understanding Trajectory Data Based on Heterogeneous Information Network Using Visual Analytics.",
                    "Automatic Prediction of Traffic Flow Based on Deep Residual Networks.",
                    "Trust Mechanism Based AODV Routing Protocol for Forward Node Authentication in Mobile Ad Hoc Network.",
                    "Hybrid Quantum-Behaved Particle Swarm Optimization for Mobile-Edge Computation Offloading in Internet of Things.",
                    "Enhancing Software Reliability Against Soft Error Using Critical Data Model.",
                    "APDL: A Practical Privacy-Preserving Deep Learning Model for Smart Devices.",
                    "Barrier Coverage Lifetime Maximization in a Randomly Deployed Bistatic Radar Network.",
                    "On Secrecy Performance of Multibeam Satellite System with Multiple Eavesdropped Users.",
                    "Gesture Recognition System Based on RFID.",
                    "Understanding Data Partition for Applications on CPU-GPU Integrated Processors.",
                    "Privacy-Preserving and Traceable Data Aggregation in Energy Internet.",
                    "Cloud Computing: Virtual Web Hosting on Infrastructure as a Service (IaaS).",
                    "Modeling and Evaluation of the Incentive Scheme in \"E-photo\".",
                    "Intelligent Environment Monitoring and Control System for Plant Growth.",
                    "TSA: A Two-Phase Scheme Against Amplification DDoS Attack in SDN.",
                    "Simulation Standardization: Current State and Cross-Platform System for Network Simulators.",
                    "Task Offloading with Execution Cost Minimization in Heterogeneous Mobile Cloud Computing."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "12th MSN 2016",
        "info": "Hefei, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2016",
                "sub_name": "12th International Conference on Mobile Ad-Hoc and Sensor Networks, MSN 2016, Hefei, China, December 16-18, 2016.",
                "count": 75,
                "papers": [
                    "The Roles of Social Network Mavens.",
                    "Accurate Combined Keystrokes Detection Using Acoustic Signals.",
                    "Understanding the Link-Level Behaviors of a Large Scale Urban Sensor Network.",
                    "Leveraging Topic Model for CSI Based Human Activity Recognition.",
                    "BRR-CVR: A Collaborative Caching Strategy for Information-Centric Wireless Sensor Networks.",
                    "Scalable Video-on-Demand Streaming for Heterogeneous Clients in Wireless Network.",
                    "Data Aggregation with Principal Component Analysis in Big Data Wireless Sensor Networks.",
                    "Low Delay and Interference Aware Data Gathering Scheme for Battery-Free Wireless Sensor Networks.",
                    "Revisiting Practical Energy Harvesting Wireless Sensor Network with Optimal Scheduling.",
                    "A Novel Approach for Path Plan of Mobile Chargers in Wireless Rechargeable Sensor Networks.",
                    "Cross-Layer Protocol Design for Wireless Communication in Hybrid Data Center Networks.",
                    "An Energy-Efficient Position Transformation Approach.",
                    "Based Point of Interest and Experience to Task Assignment on Location-Based Social Networks.",
                    "A New Fragmentation Strategy for Video of HTTP Live Streaming.",
                    "Quality-Driven Proactive Caching of Scalable Videos over Small Cell Networks.",
                    "QoS-Aware and Fair Resource Allocation with Carrier Aggregation in LTE-A Networks.",
                    "HD-MAC: A Throughput Enhancing TDMA-Based Protocol in High Dynamic Environments.",
                    "Maximizing Uniform Multicast Throughput in Multi-Channel Dense Wireless Sensor Networks.",
                    "Toward 5G: A Novel Sleeping Strategy for Green Distributed Base Stations in Small Cell Networks.",
                    "Virtual Page Behavior Based Page Management Policy for Hybrid Main Memory in Cloud Computing.",
                    "Adaptive Packet Length Strategy to Minimize End-to-End Latency for Time-Varying Channels.",
                    "Privacy Inference on Knowledge Graphs: Hardness and Approximation.",
                    "Dynamic Virtualization Security Service Construction Strategy for Software Defined Networks.",
                    "User-Demand-Oriented Privacy-Preservation in Video Delivering.",
                    "Privacy-Preserving Recoverable Photo Sharing in Mobile Social Network.",
                    "Ensuring Semantic Validity in Privacy-Preserving Aggregate Statistics.",
                    "Human Movement Detection and Gait Periodicity Analysis Using Channel State Information.",
                    "Design of P2P Application Layer Protocol.",
                    "A Quality-Aware Attribute-Based Filtering Scheme for Participatory Sensing.",
                    "Which Is the Greenest Way Home? A Lightweight Eco-Route Recommendation Framework Based on Personal Driving Habits.",
                    "Design and Implementation of Adaptive MAC Framework for UAV Ad Hoc Networks.",
                    "A Survey on Motion Detection Using WiFi Signals.",
                    "Software Defined Networking Based On-Demand Routing Protocol in Vehicle Ad Hoc Networks.",
                    "Conflict-Aware Network State Updates in SDN.",
                    "Traces and t-Distribution Based Multi-Copy Routing in Delay Tolerant Networks.",
                    "A Node Performance and Encountering Probability-Based Adaptive Routing for Delay Tolerant Networks.",
                    "Implementing Forward and Drop Policies for Improving PRoPHET's Routing Performance.",
                    "An Efficient Energy-Saving Approach for Smartphones.",
                    "Infrared Optical Wireless Communication for Smart Door Locks Using Smartphones.",
                    "Look into My Eyes: Fine-Grained Detection of Face-Screen Distance on Smartphones.",
                    "Pattern-Sensitive Web Service Access for Dual-Mode Mobile Network.",
                    "Influence Equilibrium Problem Research Based on Common Interests in Mobile Social Network.",
                    "Incentive Mechanism for Crowdsourced Mobile Video Offloading.",
                    "Home-Based Multi-Copy Routing in Mobile Social Networks.",
                    "Modeling Interest-Driven Data Dissemination in Online Social Networks.",
                    "BER-Based Comparison between AF and DF in Three-Terminal Relay Cooperative Communication with BPSK Modulation.",
                    "S-Mirror: Mirroring Sensing Signals for Mobile Robots in Indoor Environments.",
                    "TA3C: Teaching-Oriented Adaptive Wi-Fi Authorized Access Control Based on CSI.",
                    "Efficient Filter and Refinement for the Hadoop-Based Spatial Join.",
                    "Error Scene Restoration with Runtime Logs of Wireless Sensor Networks.",
                    "Bandwidth-Delay-Constrained Least-Cost Multimedia Broadcasting Based on Heuristic Genetic Algorithm on Overlay Networks.",
                    "On Minimizing Network Coding Resource: A Modified Particle Swarm Optimization Approach.",
                    "An Optimal Controller Design for CPS with Stochastic Time Delay.",
                    "Internet-Based Urban Bus Travelling Data Acquisition and Missing Data Recovery.",
                    "Graph Based Content Delivery in Mobile Social Networks.",
                    "The Coverage of Dynamic Area in Mobile Sensor Networks.",
                    "A Stable Defense Reference for Cooperative Spectrum Sensing and Its Performance Analysis.",
                    "Camera-Recognizable and Human-Invisible Labelling for Privacy Protection.",
                    "Privacy Preserving Distance Learning with Smart Phones.",
                    "Visual Secret Sharing Scheme with (k, n) Threshold Based on QR Codes.",
                    "A Progressive Threshold Secret Image Sharing with Meaningful Shares for Gray-Scale Image.",
                    "Parallel Implementation of ECC Point Multiplication on a Homogeneous Multi-Core Microcontroller.",
                    "Ocean Barrier: A Floating Intrusion Detection Ocean Sensor Networks.",
                    "Energy Preserving Detection Model for Collaborative Black Hole Attacks in Wireless Sensor Networks.",
                    "Game Based Wireless Fronthaul C-RAN Baseband Function Splitting and Placement.",
                    "Adaptive Broadcast Times for Program Codes in Software Defined Wireless Networks.",
                    "Coverage Hole Bypassing in Wireless Sensor Networks.",
                    "Cross-Layer Resource Management in Software Defined Ultra Dense Wireless Networks.",
                    "Cross-Domain Wireless Software Defined Network Based Recommendation.",
                    "Resource Analysis for Wireless Industrial Networks.",
                    "System Design of High Speed Ad Hoc Networking with Directional Antenna.",
                    "Neighbor Discovery in Wireless Network with Double-Face Phased Array Radar.",
                    "Distributed Beamforming and BS Sleep under Small Cell Network.",
                    "User Identification and Authentication Using Keystroke Dynamics with Acoustic Signal.",
                    "Near Field Service Initiation via Vibration Channel."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "11th MSN 2015",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2015",
                "sub_name": "11th International Conference on Mobile Ad-hoc and Sensor Networks, MSN 2015, Shenzhen, China, December 16-18, 2015.",
                "count": 37,
                "papers": [
                    "An Iterated Local Search Approach for Multiple Itinerary Planning in Mobile Agent-Based Sensor Fusion.",
                    "QoS Improvement with Lifetime Planning in Wireless Sensor Networks.",
                    "Priority-Based Greedy Scheduling for Confident Information Coverage in Energy Harvesting Wireless Sensor Networks.",
                    "Wearable ECG for Tension Assessment in Movie Watching and Adventure Riding.",
                    "Cross-Layer Design for Energy-Efficient Reliable Routing in Wireless Sensor Networks.",
                    "Fault Detection for Medical Body Sensor Networks Under Bayesian Network Model.",
                    "Energy-Efficient and Reliable Routing for Mobility Prediction-Based MANETs.",
                    "An Incentive Scheme for Packet Forwarding and Payment Reduction in Wireless Ad-hoc Networks Using XOR Network Coding.",
                    "Cuckoo-Filter Based Privacy-Aware Search over Encrypted Cloud Data.",
                    "Privacy-Preserving Large-Scale Location Monitoring Using Bluetooth Low Energy.",
                    "Towards Secure and Practical Targeted Mobile Advertising.",
                    "A Context-Adaptive Security Framework for Mobile Cloud Computing.",
                    "A Self-ORganizing Trust Model Based on HP2P.",
                    "An Anomaly Detection Model Based on One-Class SVM to Detect Network Intrusions.",
                    "A New Privacy-Aware Mutual Authentication Mechanism for Charging-on-the-Move in Online Electric Vehicles.",
                    "A Low Computational Complexity Authentication Scheme in Underwater Wireless Sensor Network.",
                    "Outsourcing Two-Party Privacy Preserving K-Means Clustering Protocol in Wireless Sensor Networks.",
                    "Power-Efficient Resource Utilization in Cellular Multimedia Multicast.",
                    "Relay-Assisted Device-to-Device Communications for Video Transmission in Cellular Networks.",
                    "Dynamic Resource Allocation of Gateways for Packet Transmission in Cyber-Physical Systems.",
                    "Ard-mu-Copter: A Simple Open Source Quadcopter Platform.",
                    "RSSI-Based Bluetooth Indoor Localization.",
                    "HiHeading: Smartphone-Based Indoor Map Construction System with High Accuracy Heading Inference.",
                    "DiSen: Ranging Indoor Casual Walks with Smartphones.",
                    "CoDA: Connectivity-Oriented Data Dissemination Algorithm for Vehicular Internet Access Networks.",
                    "A Lightweight Cross-Layer Cooperative Testbed for Evaluation of Connected Vehicles.",
                    "Multi-rate Based Channel Assignment Algorithm for Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Joint Node Scheduling and Radio Switching for Energy Efficiency in Multi-radio WLAN Mesh Networks.",
                    "A Weighted Network Model Based on the Correlation Degree between Nodes.",
                    "Distributed Algorithms for Maximum Clique in Wireless Networks.",
                    "On the Need of Systemic Support for Spatio-Temporal Programming of Mobile Robot Swarms.",
                    "Scalable Rumor Source Detection under Independent Cascade Model in Online Social Networks.",
                    "Dynamic Reconfiguration of Complete Binary Trees in Faulty Locally Twisted Cubes.",
                    "Impact of Radio Irregularities on Connectivity of Wireless Networks with Log-Normal Shadowing.",
                    "Fairness Counts: Simple Task Allocation Scheme for Balanced Crowdsourcing Networks.",
                    "A Novel DTN Routing Algorithm in the GEO-Relaying Satellite Network.",
                    "Penalty Function Based Anchor-Free Positioning."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "10th MSN 2014",
        "info": "Maui, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2014",
                "sub_name": "10th International Conference on Mobile Ad-hoc and Sensor Networks, MSN 2014, Maui, HI, USA, December 19-21, 2014.",
                "count": 49,
                "papers": [
                    "Minimum Cost Topology Construction for Survivable Wireless Mesh Networks in Rural Area.",
                    "Minimum-Latency Broadcast Schedule in Duty-Cycled Multihop Wireless Networks Subject to Physical Interference.",
                    "Reducing Idle Listening during Data Collection in Wireless Sensor Networks.",
                    "Imperfection Better Than Perfection: Beyond Optimal Lifetime Barrier Coverage in Wireless Sensor Networks.",
                    "A New Energy Reduction Method Based on Fire Probability Threshold Switch for WSN.",
                    "Robust Topology Using Reconfigurable Radios in Wireless Sensor Networks.",
                    "Multisensor Data Fusion for Wildfire Warning.",
                    "A New Greedy Algorithm for D-Hop Connected Dominating Set.",
                    "A Paralleling Broadcast Authentication Protocol for Sparse RSUs in Internet of Vehicles.",
                    "Backup Wi-Fi Ad-Hoc Network for Emergency Response in Scenarios with Sporadic Connectivity and Primary Users.",
                    "On the Maximum Directional Target Coverage Problem in Wireless Sensor Networks.",
                    "Barrier-Coverage for City Block Monitoring in Bandwidth Sensitive Vehicular Adhoc Networks.",
                    "Low-Cost Pyroelectric Sensor Networks for Bayesian Crowded Scene Analysis.",
                    "APCP: Adaptive Path Control Protocol for Efficient Branch-Based Multicast Routing in Wireless Sensor Networks.",
                    "Multi-sensor Data Fusion Algorithm of Triangle Module Operator in WSN.",
                    "Using Reconfigurable Radios to Increase Throughput in Wireless Sensor Networks.",
                    "How Many Target Points Can Replace a Target Area?",
                    "Fault Diagnosing ECG in Body Sensor Networks Based on Hidden Markov Model.",
                    "Online Algorithms for Optimal Resource Management in Dynamic D2D Communications.",
                    "On P2P-Share Oriented Routing over Interference-Constrained D2D Networks.",
                    "An Autonomous Clustering-Based Inter-domain Routing Protocol for Heterogeneous Mobile Ad Hoc Networks.",
                    "Development of a Real-Time System for Visualizing Network Topology and Packet Flow in MANET Field Experiments.",
                    "A Preliminary Investigation of Multi-user Interference Cancellation Techniques at Roadside Unit in Vehicular Networks.",
                    "A Realistic Underlay Concept for Delay Tolerant Networks in Disaster Scenarios.",
                    "Buffer Management for Reliable Multicast over Delay Tolerant Networks.",
                    "An Effective Message Forwarding Algorithm for Delay Tolerant Network with Cyclic Probabilistic Influences.",
                    "Fast Indoor Localization of Smart Hand-Held Devices Using Bluetooth.",
                    "Location Privacy in Buildings: A 3-Dimensional K-Anonymity Model.",
                    "HILL: A Hybrid Indoor Localization Scheme.",
                    "Indoor Relative Positioning Scheme Using Illuminance and Color Temperature.",
                    "Effective Map Matching Using Curve Tangents and Hidden Markov Model.",
                    "A Game Theory Based Vertical Handoff Scheme for Wireless Heterogeneous Networks.",
                    "Minimizing the Access Time of Multi-item Requests in Wireless Data Broadcast Environments.",
                    "Social Network Rumors Spread Model Based on Cellular Automata.",
                    "Probabilistic Snapshot Based Evolutionary Social Network Events Detection.",
                    "Analysis on Evolution and Topological Features of a Real Mobile Social Network.",
                    "New Competitive Influence Propagation Models in Social Networks.",
                    "A Survey of Research Fields for Social Network and Corresponding Techniques.",
                    "Inferring Network Structure via Cascades.",
                    "How Could a Boy Influence a Girl?",
                    "Trade-off between Service Granularity and User Privacy in Smart Meter Operation.",
                    "Analysis and Performance Evaluation of Multi-path Diversity Based SGSN Pool in Packet Switched Domain Core Networks.",
                    "Clustering and Partition Based Divide and Conquer for SAT Solving.",
                    "Load-Aware Relay Selection in LTE - A System via Global Differentiated-Fairness Control.",
                    "Cloud-Based Cyber Physical Systems: Design Challenges and Security Needs.",
                    "An Mobile Safety Monitoring System for Children.",
                    "Fast and Low-Complexity Audio Watermarking.",
                    "Research on the Forecasting Model for Hypertension Drug Efficacy Based on Medical Data.",
                    "Robust Audio Watermarking Based on Fibonacci Numbers."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "9th MSN 2013",
        "info": "Dalian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2013",
                "sub_name": "IEEE 9th International Conference on Mobile Ad-hoc and Sensor Networks, Dalian, MSN 2013, China, December 11-13, 2013.",
                "count": 102,
                "papers": [
                    "Capacity of Place Based Opportunistic Networks.",
                    "Programming and Managing the Swarm - An Operating System for an Emerging System of Mobile Devices.",
                    "A Beam Width and Direction Concerned Routing for Underwater Acoustic Sensor Networks.",
                    "SCOM: A Scalable Content Centric Network Architecture with Mobility Support.",
                    "Lehigh Explorer: A Real Time Video Streaming Application with Mobility Support for Content Centric Networks.",
                    "Congestion Control Based on Cross-Layer Game Optimization in Wireless Mesh Networks.",
                    "The Extraction and Evaluation of Skeleton in Sensor Networks.",
                    "EMOVIS: An Efficient Mobile Visual Search System for Landmark Recognition.",
                    "Gatewaying the Wireless Sensor Networks.",
                    "An Optimized Directional Distribution Strategy of the Incentive Mechanism in SenseUtil-Based Participatory Sensing Environment.",
                    "Collaborative Sensor Registration without a Priori Association.",
                    "Catch the Spike: On the Locality of Individual BGP Update Bursts.",
                    "A Determination Algorithm for Probability Density about Uncertain Data Streams Based on GMM.",
                    "A Ranking Information Forwarding Algorithm with Social Characteristic in Mobile Delay Tolerant Network.",
                    "SmartPrint: A Cloud Print System for Office.",
                    "Path Properties and Improvements of Sweep Circle Traversals.",
                    "FDCP: A High-Throughput Collision-Avoidance MAC Protocol for Underwater Acoustic Networks.",
                    "A Cube Based Model for RFID Coverage Problem in Three-Dimensional Space.",
                    "Asynchronous Binary Compressive Sensing for Wireless Body Sensor Networks.",
                    "Dynamic Opportunistic Spectrum Access of Multi-channel Multi-radio Based on Game Theory in Wireless Cognitive Network.",
                    "ELT: Energy-Level-Based Hybrid Transmission in Underwater Sensor Acoustic Networks.",
                    "An Incentive Compatible Two-Hop Multi-copy Routing Protocol in DTNs.",
                    "Achieving Handoff Optimization and Throughput Efficiency in Vehicular Networks.",
                    "Utilizing Spatial Locality to Optimize Temporal Efficiency in OLSR Route Calculations.",
                    "Path Planning for Aviation Actuators in Deploying Regular Sensor Networks.",
                    "Evaluation of Spectrum Occupancy: A Case for Cognitive Radio in Uganda.",
                    "Extended Kalman Filter Based Echo State Network for Time Series Prediction using MapReduce Framework.",
                    "An Information Entropy Approach for Sleep Scheduling in Densely-Deployed Sensor Networks.",
                    "A Localization and Tracking Approach with Sparse Reference Tags.",
                    "A Randomized Algorithm for Roadside Units Placement in Vehicular Ad Hoc Network.",
                    "Make Driver Agent More Reserved: An AIM-Based Incremental Data Synchronization Policy.",
                    "EVTQ: An Efficient Verifiable Top-k Query Processing in Two-Tiered Wireless Sensor Networks.",
                    "Feeling Sensors' Pulse: Accurate Noise Quantification in Participatory Sensing Network.",
                    "Robust Filtering Algorithm for Uncertain Systems with Observation Losses in Sensor Network.",
                    "Network Coded TCP throughput Analysis in Wireless Mesh Networks.",
                    "Sampling Traffic Analysis of Anonymous Communications in Mobile Ad Hoc Networks.",
                    "Concurrent Transmission Method for Mobile Applications using Multihoming Devices.",
                    "ARNS: Adaptive RFID Network Scheduling for Device-Free Tracking.",
                    "A Delay-Aware Scheduling for Data Aggregation in Duty-Cycled Wireless Sensor Networks.",
                    "The design model of evolutionary antenna with finite reflector.",
                    "CloudWeb: A Cloud Based Webpage Transforming for Mobile Devices.",
                    "An Efficient Privacy-Preserving Authentication Protocol in VANETs.",
                    "The Real-Time LCD System for the Pure Electric Vehicle Based on the CAN Bus.",
                    "The Research and Application of Dynamic Compatibilization Technology Based on the Optical Fiber Sensing.",
                    "Design and Implementation of Hybrid Cloud Computing Architecture Based on Cloud Bus.",
                    "Smart Home M2M Networks Architecture.",
                    "The Design of Distributed Architecture for Geological Prospecting Projection Management System.",
                    "Pyxos Based Nodes in Building Temperature Sensor Network.",
                    "Design and Performance Analysis of A Novel P2P-SIP Architecture for Network-Based Mobility Support in Intelligent Home Networks.",
                    "WSN Application Traffic Characterization for Integration within the Internet of Things.",
                    "Performance Analysis on Packet Delivery Ratio and End-to-End Delay of Different Network Topologies in Wireless Sensor Networks (WSNs).",
                    "Energy Efficient Clustered Routing for Wireless Sensor Network.",
                    "Enhanced Privacy Preserving Pattern-Code Based Data Aggregation in Wireless Sensor Networks.",
                    "Mobility Based Data Collection Algorithm for Wireless Sensor Networks.",
                    "Coverage Algorithm in Wireless Sensor Network Base on Point Set Optimization.",
                    "Data Gathering and Processing for Large-Scale Wireless Sensor Networks.",
                    "An Efficient Social Based Data Forwarding Mechanism for Mobile Cloud Computing.",
                    "Resource Efficient Mobile Computing Using Cloudlet Infrastructure.",
                    "Cloud Based Mobile Video Editing System.",
                    "An Unequal Clustering Algorithm for an Emergency Response Wireless Sensor Network.",
                    "A Framework of Temporal Data Retrieval for Unreliable WSNs Using Distributed Fountain Codes.",
                    "Design of an OSGi-Based WSN Gateway.",
                    "The Intelligent Extraction of Academic Information Based on Web Service Discovery.",
                    "The Evaluation of Security Algorithms on Mobile Platform.",
                    "Evolution of Software-Defined Sensor Networks.",
                    "Efficient Sleep Scheduling for Avoiding Inter-Cluster Interference in Wireless Sensor Networks.",
                    "Multi-label Classification based on Particle Swarm Algorithm.",
                    "Design and Development of Heterogeneous Underwater Sensor Networks.",
                    "Improve the Performance of Adaptive Sleep Scheduled Wireless Sensor Network.",
                    "The Analysis and Improvement of SMAC Protocol for Wireless Sensor Networks.",
                    "Practical Deployments of SEMAT on Wireless Sensor Networks in the Marine Environment.",
                    "Communication Ad Hoc Protocol for Intelligent Video Sensing Using AR Drones.",
                    "Input Devices to Support Communication for People with Serious Disability.",
                    "Robust H-Infinity Control of Intelligent Autonomous Navigation Wheelchair.",
                    "The Research and Application of sEMG in Massage Assessment.",
                    "The Optimization of Fuzzy Neural Network Based on Artificial Fish Swarm Algorithm.",
                    "The Nondestructive Testing Approach of Acoustic Emission for Environmentally Hazardous Objects.",
                    "Kernel Function Studies on the Support Vector Machine in Lower Limb Motion Pattern Recognition of Stoke Patients.",
                    "Tongue Rehabilitation Training Method of Hearing-Impaired Child Based on Visualization Model.",
                    "Depth Mapping Using the Hierarchical Reconstruction of Multiple Sequence.",
                    "Medical Image Fusion in Compressed Sensing Based on Non-subsampled Contourlet Transform.",
                    "Rehabilitation Training System for Children with Autism.",
                    "A Way of Image Fusion Based on Wavelet Transform.",
                    "Research on the Construction of Dynamic Chinese Natural Sign Language Corpus.",
                    "Breath Training for Hearing Impaired Hearing Chinldre Based on Computational Fluid Dynamics.",
                    "The Static Analysis of Wearable Lower Extremity Exoskeleton Based on ANSYS Workbench.",
                    "A Novel Method of sEMG Signal Segmentation.",
                    "A Walking Direction Detecting Method for Floor Display System.",
                    "JTang HSS: A Healthcare Service Platform for the Senior.",
                    "On the Simulation Using the Movement Model of Japanese Radio Calisthenics.",
                    "Improved AP Clustering Algorithm Based on Target Segmentation.",
                    "Design and Analysis of Hip Joint Parallel Rehabilitation Mechanism.",
                    "Application of Electronic Compass and Vision-Based Camera in Robot Navigation and Map Building.",
                    "Design and Research of Data Packets Transmission by Shared Memory Block Based on NDIS.",
                    "Robot Pose Estimation and Accuracy Analysis Based on Stereo Vision.",
                    "Application of Data Mining on HPLC Fingerprints of Szechwan Lovage Rhizome Analysis.",
                    "The Application and Research of the VB Programming Question's Rating System which is Based on the Windows Message Mechanism.",
                    "Research on Forecasting and Early-Warning Methods.",
                    "Blind Extraction Algorithm in Wavelet Domain Based on Structuring Observation Vectors.",
                    "Traditional Chinese Patterns Analysis Based on Moment Invariants.",
                    "A Novel Worm Drive for Rehabilitation Robot Joint.",
                    "The Three-Dimensional Modeling of Femur."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "8th MSN 2012",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2012",
                "sub_name": "8th International Conference on Mobile Ad-hoc and Sensor Networks, MSN 2012, Chengdu, China, December 14-16, 2012.",
                "count": 33,
                "papers": [
                    "Message from General Co-chairs.",
                    "Network Coding Based Mesh-Under Routing In 6LoWPAN with High End-to-End Packet Delivery Rate.",
                    "Smartphone Based Autism Social Alert System.",
                    "Public Transportation Assisted Data Delivery Scheme in Vehicular Delay Tolerant Networks.",
                    "RADD: A Replicas Adaptive Data Delivery Scheme in DTMSN.",
                    "Exploiting Network Coding for Data Availability in Vehicular Networks: Issues and Opportunities.",
                    "Performance Evaluation of Hybrid Channel Assignment for Wireless Sensor Networks.",
                    "Analysis of User Behavior in Mobile Internet Using Bipartite Network.",
                    "Exploring Alternatives to Channel Change for Improving the Coexistence of IEEE 802.15.4 and IEEE 802.11.",
                    "Improving the Performance of Hybrid Wireless Mesh Protocol.",
                    "GPS-free Localization Using Asynchronous Beacons.",
                    "Social Feature Enhanced Group-Based Routing for Wireless Delay Tolerant Networks.",
                    "Robust Relay Selection and Outage Probability Analysis for Cooperative Communications in Aircraft Approach.",
                    "A Dynamic Pseudonyms Based Anonymous Routing Protocol for Wireless Ad Hoc Networks.",
                    "Analysis on Token-Controlled Public Key Encryption.",
                    "Heterogeneous Data Source Middleware for Android E-Health Application.",
                    "Distributed and Asynchronous Solution to Operator Placement in Large Wireless Sensor Networks.",
                    "A Glimpse of Energy-Efficient Location-Triggered Mobile Application Design and Implementation in Data Collection Scenarios.",
                    "Scalable Keyword-Based Data Retrievals in Future Content-Centric Networks.",
                    "Location Privacy with Road Network Mix-Zones.",
                    "SPAWN: Sensing, Probing and Accessing with sWitching eNergy Cost in Multichannel WSN.",
                    "A Random Road Network Model for Mobility Modeling in Mobile Delay-Tolerant Networks.",
                    "RESen: Sensing and Evaluating the Riding Experience Based on Crowdsourcing by Smart Phones.",
                    "Smartphone Dual Defense Protection Framework: Detecting Malicious Applications in Android Markets.",
                    "EMP: Exploiting Mobility Patterns for Collaborative Localization in Sparse Mobile Networks.",
                    "Unscented Particle Filter with Systematic Resampling Localization Algorithm Based on RSS for Mobile Wireless Sensor Networks.",
                    "Transport Performance Optimization Based on Network Coding in WMN.",
                    "Populating Virtual Access Points for Localization in Sparse Wireless Networks.",
                    "A Van der Waals Force-Like Node Deployment Algorithm for Wireless Sensor Network.",
                    "Let Me Take Care of Myself: A Vehicle Self-Gratification System Using Vehicular Sensors and Mobile Phones.",
                    "Pre-fetching Webpages on Mobile Social Network: User-Aware Dynamic Markov Chain.",
                    "IPAD: Intelligent Parking-Assisted Ads Dissemination over Urban VANETs.",
                    "Enhanced Wi-Fi Fingerprinting with Building Structure and User Orientation."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "7th MSN 2011",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2011",
                "sub_name": "Seventh International Conference on Mobile Ad-hoc and Sensor Networks, MSN 2011, Beijing, China, December 16-18, 2011.",
                "count": 82,
                "papers": [
                    "Nonparametric Copula Density Estimation in Sensor Networks.",
                    "A Constant-Approximation for Maximum Weight Independent Set of Links under the SINR Model.",
                    "An Incomplete Coverage Control Based on Target Tracking Wireless Sensor Network.",
                    "Localized Topologies with Bounded Node Degree for Three Dimensional Wireless Sensor Networks.",
                    "An Environment Monitoring System for Precise Agriculture Based on Wireless Sensor Networks.",
                    "Applying Modified Cramér-Rao Bound to Random Sensor Deployment.",
                    "Energy-Efficient Data Gathering in High-Voltage Transmission Line Monitoring System.",
                    "A Novel Accurate Forest Fire Detection System Using Wireless Sensor Networks.",
                    "Real-Time Data Aggregation with High Success Probability in Contention-Based Wireless Sensor Networks.",
                    "Strong Barrier Coverage Using Directional Sensors with Arbitrarily Tunable Orientations.",
                    "Removing Heavily Curved Path: Improved DV-hop Localization in Anisotropic Sensor Networks.",
                    "Data Collection in Wireless Sensor Networks by Utilizing Multiple Mobile Nodes.",
                    "Robust Human Detection with Low Energy Consumption in Visual Sensor Network.",
                    "Content Based Pre-diagnosis for Wireless Sensor Networks.",
                    "Collaborative Scheduling in Highly Dynamic Environments Using Error Inference.",
                    "Semantics-Based Service Mining Method in Wireless Sensor Networks.",
                    "A Secure Data Aggregation Approach Based on Monitoring in Wireless Sensor Networks.",
                    "Design and Implementation of Network Management System for Large-Scale Wireless Sensor Networks.",
                    "Crowd Density Estimation Using Wireless Sensor Networks.",
                    "A Weighted Energy Efficient Clustering (WEEC) for Wireless Sensor Networks.",
                    "Lazy Schema: An Optimal Sampling Frequency Assignment for Real-Time Sensor Systems.",
                    "Mitigating Radio Irregularity Impact: An RSSI Calibration Method for Range-Free Localization in Sensor Networks.",
                    "Load Migrating for the Hot Spots in Wireless Sensor Networks Using CTP.",
                    "History-Aware Adaptive Backoff for Neighbor Discovery in Wireless Networks.",
                    "Collaborative Topology Control for Lifetime Maximization.",
                    "Performance Investigation on an MIMO-capable 802.11a Compliant MAC Protocol Implementation.",
                    "Modeling FPGA-based IEEE 802.11 DCF.",
                    "A Simple Channel Assignment for Opportunistic Routing in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Performance of a Multi-channel MAC Protocol Implemented in Multi-robot System.",
                    "On the Spectral Characteristics of Ad Hoc Networks and their Mobility Properties.",
                    "A Game Theoretic Approach to Increase Performance in Multihop Wireless Mesh Networks.",
                    "CRDMAC: An Effective Circular RTR Directional MAC Protocol for Wireless Ad Hoc Networks.",
                    "Minimum Cost Broadcast in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "An Efficient Unstructured P2P Overlay over MANET Using Underlying Proactive Routing.",
                    "A New Mechanism to Incorporate Network Coding Into TCP in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "An Improved Content-Based Data Dissemination In Human Contact-Based Network.",
                    "Social Relationship Enhanced Predicable Routing in Opportunistic Network.",
                    "Evolving Model of Opportunistic Routing in Delay Tolerant Networks.",
                    "On Exploiting Few Strangers for Data Forwarding in Delay Tolerant Networks.",
                    "Power-Aware Traffic Engineering with Named Data Networking.",
                    "Maximizing Saturation Throughput of Control Channel in Vehicular Networks.",
                    "A Study on Relationship Migration among Social Networking Providers.",
                    "Buffer and Switch: An Efficient Road-to-Road Routing Scheme for VANETs.",
                    "A Dynamic Spectrum Access Strategy Based on Real-Time Usability in Cognitive Radio Sensor Networks.",
                    "A Stable Joint Routing and Spectrum Scheduling Scheme for Cognitive Radio Ad Hoc Networks.",
                    "An Adaptive Modulation Selection Scheme Based on Error Estimating Coding.",
                    "A Data Correlation-Based Virtual Clustering Algorithm for Wireless Sensor Network.",
                    "Research and Implementation of an Ontology-Based Semantic Reporting System.",
                    "A Graph Configuration Method Based on UI Service Composition.",
                    "An Experimental Study of BATMAN Performance in a Campus Deployment of Wireless Mesh Networks.",
                    "A Geographic Routing Algorithm in Duty-Cycled Sensor Networks with Mobile Sinks.",
                    "A Fast Handoff Mechanism with Pre-scanning for Wireless Mesh Networks.",
                    "Performance Analysis and Improvement of SOFT MAC Scheme in 802.11p Based Vehicular Ad Hoc Networks.",
                    "The Design of Simulation Platform for Ad Hoc Based Cyber-Physical System.",
                    "A Fault Detection Algorithm Based on Cluster Analysis in Wireless Sensor Networks.",
                    "Cluster-to-Cluster Overlay Network for Video Systems over Wireless Ad Hoc Networks.",
                    "Environmental Data-Based Location Recognition for Living Space.",
                    "Comparative Analysis of Classical Routing Protocol LEACH and Its Updated Variants that Improved Network Life Time by Addressing Shortcomings in Wireless Sensor Network.",
                    "Integrating Wireless Sensor Networks with Cloud Computing.",
                    "A Location and Emergency Monitoring System for Elder Care Using ZigBee.",
                    "VISOR: A Pratical VoIP Steganography Platform.",
                    "A Simulator for Flexible Sensor Nodes in Wireless Networks.",
                    "Analytic Properties of the Binary Tree Based Multiple Access Protocol with Application to RFID Tag Collision Resolution.",
                    "Synchronization between Wireless UPnP Video and Audio Players.",
                    "SHORT: A Simple HOle-Resistant Technique for Reliable Geocasting in Location-Free Wireless Sensor Networks.",
                    "Calibrating Time of Flight in Two Way Ranging.",
                    "High-Accuracy Indoor Personnel Tracking System with a ZigBee Wireless Sensor Network.",
                    "High-Performance Temporal Object-Tracking Algorithm Using Virtual Targets in Wireless Sensor Networks.",
                    "Target Coverage in Wireless Sensor Networks.",
                    "Optimum Partition for Distant Charging in Wireless Sensor Networks.",
                    "QoE-aware Power Allocation Algorithm in Multiuser OFDM Systems.",
                    "Optimal Sequential Detection with Stochastic Energy Constraint.",
                    "An Overview of Bootkit Attacking Approaches.",
                    "One Leader at One Time: OLOT Routing in Delay Tolerant Networks.",
                    "Towards a Flaw Function Heuristic Vulnerability Static Analysis Framework for Executable File.",
                    "Shrew Attack in Cloud Data Center Networks.",
                    "Protecting Router Forwarding Table in Space.",
                    "Identity-Based Strong Key-Insulated Ring Signature Scheme in the Standard Model.",
                    "Structuring Incident Types to Streamline Incident Response.",
                    "Improvement on Secrecy Capacity of Wireless LAN Using Matched Filter.",
                    "Minimum-Energy Multicast Using Random Linear Network Coding.",
                    "A Fault Tolerant Protocol for Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "6th MSN 2010",
        "info": "Hangzhou, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2010",
                "sub_name": "Sixth International Conference on Mobile Ad-hoc and Sensor Networks, MSN 2010, Hangzhou, China, December 20-22, 2010.",
                "count": 42,
                "papers": [
                    "A Cross-Layer MAC Mechanism to Solve Performance Anomaly in MANET.",
                    "OMA: A Multi-channel MAC Protocol with Opportunistic Media Access in Wireless Sensor Networks.",
                    "NanoSD: A Flexible Service Discovery Protocol for Dynamic and Heterogeneous Wireless Sensor Networks.",
                    "Yet Another Autoconf Proposal (YAAP) for Mobile Ad Hoc NETworks.",
                    "A Trajectory-Based Power Control Scheme for Wireless Networks.",
                    "Energy Efficient Lossy Data Aggregation in Asynchronous Sensor Networks.",
                    "Towards Energy-Efficient Algorithm-Based Estimation in Wireless Sensor Networks.",
                    "Sleep-Wakeup Algorithms for Virtual Barriers of Wireless Sensor Networks in 3D Space.",
                    "Mitigate the Bottleneck of Underwater Acoustic Sensor Networks via Priority Scheduling.",
                    "Link Scheduling in Wireless Networks with Successive Interference Cancellation.",
                    "An Efficient Scheduling Algorithm for Data Collection through Multi-path Routing Structures in Wireless Sensor Networks.",
                    "Shortest Link Scheduling with Power Control under Physical Interference Model.",
                    "Integer Programming Scheme for Target Coverage in Heterogeneous Wireless Sensor Networks.",
                    "A Coverage-Aware Clustering Protocol for Wireless Sensor Networks.",
                    "Incremental Sensor Node Deployment for Low Cost and Highly Available WSNs.",
                    "Prediction-Based Activation in WSN Tracking.",
                    "A Dynamic Dual-Rate Beacon Scheduling Method of ZigBee/IEEE 802.15.4 for Target Tracking.",
                    "Maximizing Lifetime of Sensor Surveillance Systems with Directional Sensors.",
                    "SFL: Energy-Aware Spline Function Localization Scheme for Wireless Sensor Networks.",
                    "Delay Analysis for Different Resource Allocation Schemes in Wireless Networks.",
                    "Statistical QoS Provisioning in Mobile Ad Hoc Networks.",
                    "A Protocol for Self-Synchronized Duty-Cycling in Sensor Networks: Generic Implementation in Wiselib.",
                    "Clapping and Broadcasting Synchronization in Wireless Sensor Network.",
                    "Performance of Wireless Mesh Networks with Three Sector Antenna.",
                    "High Performance Firewalls in MANETs.",
                    "Mobility-Based Strategies for Energy Restoration in Wireless Sensor Networks.",
                    "Inferring Technical Constraints of a Wireless Sensor Network Application from End-User Requirements.",
                    "Towards Analysis of Intra-flow Contention in Multi-hop Wireless Networks.",
                    "Interference-Aware Channel Assignment for On-demand Routing Protocols in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "FHMESH: A Flexible Heterogeneous Mesh Networking Platform.",
                    "A Multi-reality Approach to CRN Data Representation.",
                    "Opportunistic Spectrum Access Based on Sequential Channel-Sensing in Decentralized CRN.",
                    "An Adaptive Cross-Layer Design for Prioritized Traffic in Wireless Communications.",
                    "Does Loss Rate Really Matter? An Experimental Study on Time Synchronization Protocol in Wireless Sensor Networks.",
                    "Performance Analysis of IEEE 802.11p Control Channel.",
                    "Evaluating the Energy Consumption of RFID Tag Collision Resolution Protocols.",
                    "TopCoF: A Topology Control Framework for Wireless Ad Hoc Networks.",
                    "Movement Assisted Sensor Deployment in Directional Sensor Networks.",
                    "Energy-Efficient Irregular Multicast Routing Strategies for Mobile Sensor Networks.",
                    "The Design and Implementation of a Mobile Location-Aware Digital Signage System.",
                    "User-Level Packet Filter for the IP Address Abuse/Counterfeit Problem in Wireless/Wired Networks.",
                    "CALE: A Context-Aware Living Environment Based on Zigbee Sensor Network."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "5th MSN 2009",
        "info": "Wu Yi Mountain, Fujian, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2009",
                "sub_name": "MSN 2009, The Fifth International Conference on Mobile Ad-hoc and Sensor Networks, Wu Yi Mountain, Fujian, China , December 14-16, 2009.",
                "count": 74,
                "papers": [
                    "Processing Area Queries in Wireless Sensor Networks.",
                    "Data Caching Based Queries in Multi-sink Sensor Networks.",
                    "Progressive Skyline Query Processing in Wireless Sensor Networks.",
                    "Semantic Caching for Mobile Ad Hoc Networks.",
                    "A Self Organizing Multihop Clustering Protocol for Wireless Sensor Networks.",
                    "Scalable Address Allocation Protocol for Mobile Ad Hoc Networks.",
                    "A Distributed Relay Selection Algorithm for Cooperative Multicast in Wireless Mesh Networks.",
                    "Local Optimum Algorithms for Self-Protection in Wireless Sensor Networks.",
                    "Intra-flow Network Coding Based Multipath Routing Protocol for Event-Driven Wireless Sensor Networks.",
                    "C?C: Carrefour Routing for Cluster-Based Wireless Sensor Network to Support Multiple Applications in Multiple Gateway Environments.",
                    "A Survey on Routing Techniques Supporting Mobility in Sensor Networks.",
                    "Greedy Geographic Routing Algorithms in Real Environment.",
                    "Base Station Localization in Search of Empty Spectrum Spaces in Cognitive Radio Networks.",
                    "Long-Range Beacons on Sea Surface Based 3D-Localization for Underwater Sensor Networks.",
                    "A Low-Cost and Accurate Indoor Localization Algorithm Using Label Propagation Based Semi-supervised Learning.",
                    "Power Adaptation in Multi-hop Sensor Networks for Energy Minimization.",
                    "An Improved ETR Protocol with Energy Awareness for Wireless Sensor Networks.",
                    "An Adaptive Energy-Efficient Medium Access Control Protocol for Wireless Sensor Networks.",
                    "Estimations of Border Effect on Epoch Mobility Models in Mobile Ad Hoc Networks.",
                    "Performance of TCP over Ad Hoc Networks: Analysis and Enhancement.",
                    "A SINR Threshold-Based Limited Feedback and Feedback Load Analysis for Downlink Multiuser Diversity.",
                    "A Delay-Constrained and Maximum Lifetime Data Gathering Algorithm for Wireless Sensor Networks.",
                    "Lossy Data Aggregation in Multihop Wireless Sensor Networks.",
                    "Local and Adaptive Amendment to Data Aggregation Tree in Wireless Sensor Networks.",
                    "Precision Constraint Data Aggregation for Dynamic Cluster-Based Wireless Sensor Networks.",
                    "Spanner-Aware Relay Node Placement in Wireless Ad Hoc Sensor Networks.",
                    "Gateway Selection Scheme for Throughput Optimization in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "A Robust Node Selection Strategy for Lifetime Extension in Wireless Sensor Networks.",
                    "Activating the Hot Spot Problem by Switching Multiple Sinks in Wireless Sensor Networks.",
                    "Minimum Hop Routing Wireless Sensor Networks Based on Ensuring of Data Link Reliability.",
                    "Clustering-Based Compressive Wide-Band Spectrum Sensing in Cognitive Radio Network.",
                    "Distributed Localization Protocol for Routing in a Noisy Wireless Sensor Network.",
                    "A Hop Count Based Greedy Face Greedy Routing Protocol on Localized Geometric Spanners.",
                    "Distributed Facility Location for Sensor Network Maintenance.",
                    "QoS Performance Analysis of IEEE 802.15.4 MAC in LR-WPAN with Bursty Error Channels.",
                    "Optimal Data Rate and Opportunistic Scheme on Network Coding over Rayleigh Fading Channels.",
                    "ADV-MAC: Advertisement-Based MAC Protocol for Wireless Sensor Networks.",
                    "Delay and Robustness Analysis of a Distributed Scheme for Optimized Medium Access in Power-Controlled Networks.",
                    "An Efficient Time-Bound Access Control Scheme for Dynamic Access Hierarchy.",
                    "Vehicle Positioning Using Wi-Fi Networks and GPS/DR System.",
                    "An Event-Based Wireless Navigation and Healthcare System for Group Recreational Cycling.",
                    "LTE/SAE Model and its Implementation in NS 2.",
                    "A Mobile Beacon-Assisted Localization Algorithm Based on Network-Density Clustering for Wireless Sensor Networks.",
                    "Location Updates of Mobile Node in Wireless Sensor Networks.",
                    "Fast Localization Using Robust UWB Coding in Wireless Sensor Networks.",
                    "A High-Performance Vehicle Detection Algorithm for Wireless Sensor Parking Systems.",
                    "Load Balancing Routing Algorithm for Ad Hoc Networks.",
                    "Energy Efficient Integrated Routing Protocol for MANETs.",
                    "ELCP: An Effort-Based Least Cost Path Scheme for MANETs.",
                    "A Cross-Layer AOMDV Routing Protocol for V2V Communication in Urban VANET.",
                    "Supporting Emergency Service by Retasking Delay-Tolerant Network Architecture.",
                    "Data Dissemination in Delay and Disruption Tolerant Networks Based on Content Classification.",
                    "DDBA: A Method of Dynamic Deprivable Bandwidth Allocation for Space Information Network.",
                    "Network Coding for Applications in the Delay Tolerant Network (DTN).",
                    "A Novel Congestion Control Scheme in Wireless Sensor Networks.",
                    "Congestion-Aware Clique-Based Handoff in Wireless Mesh Networks.",
                    "A Suboptimal Resource Allocation Algorithm for OFDMA-Based Multi-hop Cellular Networks.",
                    "On Uplink Superposition Coding and Multi-user Diversity for Wireless Mesh Networks.",
                    "A Signal-Time Coding Approach to Relay Networks.",
                    "An Optimal Algorithm for Neville Codes of a Tree Network.",
                    "Adaptive Randomized Epidemic Routing for Disruption Tolerant Networks.",
                    "MORT: A Technique to Improve Routing Efficiency in Fault-Tolerant Multipath Routing.",
                    "Integration of Routing and Switching in Delay-Disruption Tolerance Network.",
                    "Improved Wireless Secrecy Rate Using Distributed Auction Theory.",
                    "A Key Management Scheme for Heterogeneous Sensor Networks Using Keyed-Hash Chain.",
                    "Enhanced Location Privacy Protection of Base Station in Wireless Sensor Networks.",
                    "Lightweight Authentication for Recovery in Wireless Sensor Networks.",
                    "Light-Weight Target Tracking in Dense Wireless Sensor Networks.",
                    "Hamilton Circuit-Based Algorithm for Improving Coverage of Hybrid Sensor Network.",
                    "WiserAnalyzer: A Passive Monitoring Framework for WLANs.",
                    "Localized Routing Protocols Based on Minimum Balanced Tree in Wireless Sensor Networks.",
                    "A Cluster-Based Algorithm for Redundant Nodes Discovery in Dense Sensor Networks.",
                    "A Comprehensive Real-Time High-Performance Object-Tracking Approach for Wireless Sensor Networks.",
                    "Performance Improvement over Linux Layer-7 Content Filtering."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "4th MSN 2008",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2008",
                "sub_name": "MSN 2008, The 4th International Conference on Mobile Ad-hoc and Sensor Networks, Wuhan, China, December 10-12, 2008.",
                "count": 45,
                "papers": [
                    "Connectivity in Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Power of Discrete Nonuniformity - Optimizing Access to Shared Radio Channel in Ad Hoc Networks.",
                    "Three Dimensional Intrusion Objects Detection under Randomized Scheduling Algorithm in Sensor Networks.",
                    "Energy Efficient Topology Control Algorithms for Variant Rate Mobile Sensor Networks.",
                    "Hector is an Energy Efficient Tree-Based Optimized Routing Protocol for Wireless Networks.",
                    "A Multi-channel and Power Controlled Based AODV for Throughput Improvement in Multi-hop Ad Hoc Networks.",
                    "Secure Opportunistic Data Retrievals in Challenged Environments.",
                    "Signature Scheme with Arbitrary Length Message Recovery in CPK.",
                    "RFID and Information Security in Supply Chains.",
                    "SMNDP: A Practical and Provably Secure Multi-path Source Routing.",
                    "Sensor Deployment Strategy for Collaborative Target Detection with Guaranteed Accuracy.",
                    "Connectivity Based Greedy Algorithm with Multipoint Relaying for Mobile Ad Hoc Networks.",
                    "A Gossip-Enabled Spatial Index for Moving Object Management over Wireless Sensor Networks.",
                    "Efficient Interdomain Multicast Delivery in Disruption Tolerant Networks.",
                    "Routing Protocol Using Bloom Filters for Mobile Ad Hoc Networks.",
                    "Interference-Aware QoS Routing in Wireless Mesh Networks.",
                    "A Multi-metric QoS Routing Method for Ad Hoc Network.",
                    "NEMO-Based Multiple Interfaces Scheme between Overlay Heterogenous Access Networks.",
                    "Speed-Based Probability-Driven Seamless Handover Scheme between WLAN and UMTS.",
                    "A Tracking Range Based Ant-Colony Routing Protocol for Mobile Wireless.",
                    "Key Establishment in Multi-core Parallel Systems.",
                    "An Authentication Protocol for Proxy Mobile IPv6.",
                    "A Distributed Lightweight Group Rekeying Scheme with Speedy Node Revocation for Wireless Sensor Networks.",
                    "On-Demand Anonymous Routing with Distance Vector Protecting Traffic Privacy in Wireless Multi-hop Networks.",
                    "Design of Infrastructure Wireless Mesh Networks: Formulations and Solutions.",
                    "Topology Control for Throughput Optimization in Wireless Mesh Networks.",
                    "Optimal Selection of Aggregation Nodes in Sensor Networks with Time Delay Constraint.",
                    "Hybrid Position-Based Routing Algorithms for 3D Mobile Ad Hoc Networks.",
                    "A Holistic Routing Protocol Design in Underground Wireless Sensor Networks.",
                    "On Design of Mobile Agent Based Location Service for Geographic Routing.",
                    "A Path Reliable Routing Protocol in Mobile Ad Hoc Networks.",
                    "Adaptive Algorithms to Mitigate Inefficiency in Reliability Differentiation Mechanisms for Wireless Sensor Networks.",
                    "Geography-Aware Fume Diffusion Spotting in Sensor Networks.",
                    "MTreeTV: A Hybrid Video Broadcast Architecture.",
                    "An Indoor Sensor Network System for Pursuit-Evasion Games.",
                    "LACONIC: History-Based Code Dissemination in Programmable Wireless Sensor Networks.",
                    "Linear Optimal Hierarchical Multicast Tree Algorithms for P2P Database.",
                    "Analysis of Link Error in Reducing Broadcasting Redundancy of MANET AAPs.",
                    "Interference-Aware Broadcast Scheduling in Wireless Networks.",
                    "Active Protection in Wireless Networking.",
                    "LCO-MAC: A Low Latency, Low Control Overhead MAC Protocol for Wireless Sensor Networks.",
                    "A Congestion Avoidance and Performance Enhancement Scheme for Mobile Ad Hoc Networks.",
                    "GENTLE: Reducing Reader Collision in Mobile RFID Networks.",
                    "Versatile Model Architecture for Multi-channel MAC Simulation in NS2.",
                    "Characteristics of Frame Traffic in 802.11 Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "3rd MSN 2007",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2007",
                "sub_name": "Mobile Ad-Hoc and Sensor Networks, Third International Conference, MSN 2007, Beijing, China, December 12-14, 2007, Proceedings.",
                "count": 77,
                "papers": [
                    "Information Intensive Wireless Sensor Networks: Challenges and Solutions.",
                    "QoS-Aware Cooperative and Opportunistic Scheduling Exploiting Multi-user Diversity for Rate Adaptive Ad Hoc Networks.",
                    "Modeling the Effect of Forwarding in a Multi-hop Ad Hoc Networks with Weighted Fair Queueing.",
                    "Localized Mobility Control Routing in Robotic Sensor Wireless Networks.",
                    "A Hierarchical Multicast Routing Based on Inter-cluster Group Mesh for Mobile Ad Hoc Networks.",
                    "Load-Balancing Using Multi-path Directed Diffusion in Wireless Sensor Networks.",
                    "Flattening the Gap Between Source-Destination Paths in Energy Efficient Greedy Georouting in Wireless Sensor Networks.",
                    "Adaptive Topology Based Gossiping in VANETs Using Position Information.",
                    "A Routing Protocol for Balancing Energy Consumption in Heterogeneous Wireless Sensor Networks.",
                    "Novel Hierarchical Based Route Optimization Scheme for Nested Mobile Network: Design and Performance Evaluation.",
                    "Reputation-Based Routing in Hybrid Ad Hoc Networks.",
                    "Reducing the Message Overhead of AODV by Using Link Availability Prediction.",
                    "An Energy-Efficient and Low-Latency Sink Positioning Approach for Wireless Sensor Networks.",
                    "Applications and Performances of Extended TTDDs in Large-Scale Wireless Sensor Networks.",
                    "Crosslayer Design Protocol Using Geographical Information in Wireless Sensor Networks.",
                    "An Efficient Data Exchange Protocol Using Improved Star Trees in Wireless Sensor Networks.",
                    "Low-Latency Mobile IP Handover Based on Active-Scan Link Layer Assisted FMIPv6.",
                    "Achieving Efficiency Channel Utilization and Weighted Fairness in IEEE 802.11 WLANs with a P-Persistent Enhanced DCF.",
                    "Dynamic Hierarchical Location Management Scheme for Host Identity Protocol.",
                    "Migration Policies for Location-Centric Data Storage in Mobile Ad-Hoc Networks.",
                    "An Efficient and Low-Latency MAC Protocol for Wireless Sensor Network.",
                    "A Scalable Power-Efficient Data Gathering Protocol with Delay Guaranty for Wireless Sensor Networks.",
                    "An Efficient Rate-Adaptive MAC for IEEE 802.11.",
                    "MP-FMIPv6: MLD Proxy Based Fast Multicast Protocol for Mobile IPv6.",
                    "Performance Analysis of a Protocol for Network-Based Localized Mobility Management.",
                    "A MAC Protocol with Adaptive Preloads Considering Low Duty-Cycle in WSNs.",
                    "PTCP: Phase-Divided TCP Congestion Control Scheme in Wireless Sensor Networks.",
                    "A Low Latency MAC Scheme for Event-Driven Wireless Sensor Networks.",
                    "A Location Aided Flooding Protocol for Wireless Ad Hoc Networks.",
                    "A MAC-Layer Retransmission Algorithm Designed for Zigbee Protocol.",
                    "Performance Analysis of IEEE 802.11 in Multi-hop Wireless Networks.",
                    "ASDP: An Action-Based Service Discovery Protocol Using Ant Colony Algorithm in Wireless Sensor Networks.",
                    "Deadline Monotonic Policy over 802.11 Throughput and Average Service Time.",
                    "A Parallel Link State Routing Protocol for Mobile Ad-Hoc Networks.",
                    "Analytical Throughput for the Channel MAC Paradigm.",
                    "An Adaptive Transmission Control Scheme Based on TCP Vegas in MANETs.",
                    "A Study on the Binary Exponential Backoff in Noisy and Heterogeneous Environment.",
                    "Investigation of Power-Aware IEEE 802.11 Performance in Multi-hop Ad Hoc Networks.",
                    "Access Scheduling on the Control Channels in TDMA Wireless Mesh Networks.",
                    "An Energy Efficient Communication Protocol Based on Data Equilibrium in Mobile Wireless Sensor Network.",
                    "Distributed Computation of Maximum Lifetime Spanning Subgraphs in Sensor Networks.",
                    "Maximizing Network Lifetime for Target Coverage Problem in Heterogeneous Wireless Sensor Networks.",
                    "Balancing Security and Energy Consumption in Wireless Sensor Networks.",
                    "A Trust Approach for Node Cooperation in MANET.",
                    "A Clustering Algorithm Based on LBG and VQ in Mobile Ad Hoc Network.",
                    "Cooperation Transmission Without Perfect Synchronization for Wireless Sensor Networks Using Signal Space Diversity and STBC.",
                    "On the Temporal-Spatial Correlation Based Fault-Tolerant Dynamic Event Region Detection Scheme in Wireless Sensor Networks.",
                    "Dynamic Simulation Based Localization for Mobile Sensor Networks.",
                    "SLTP: Scalable Lightweight Time Synchronization Protocol for Wireless Sensor Network.",
                    "Ensuring Area Coverage in Hybrid Wireless Sensor Networks.",
                    "Area Localization Algorithm for Mobile Nodes in Wireless Sensor Networks Based on Support Vector Machines.",
                    "A Dual-Token-Based Fault Tolerant Mutual Exclusion Algorithm for MANETs.",
                    "Study of a Cost-Effective Localization Algorithm in Wireless Sensor Networks.",
                    "Research on Clustering Strategy for Wireless Sensor Network Based on Fuzzy Theory.",
                    "Performance Analysis of the Energy Fairness Cooperation Enforcement Mechanism (EFCEM) in Ad Hoc Networks.",
                    "Analysis of Higher Order Voronoi Diagram for Fuzzy Information Coverage.",
                    "Anonymous Mutual Authentication Protocol for RFID Tag Without Back-End Database.",
                    "ISMS-MANET: An Identifiers Separating and Mapping Scheme Based Internet Access Solution for Mobile Ad-Hoc Networks.",
                    "Using Packet Combination in Multi-query Optimization for Data Collection in Sensor Networks.",
                    "Relative Positions Within Small Teams of Mobile Units.",
                    "The Implementation of a Fully Integrated Scheme of self-Configuration and self-Organization (FISCO) on Imote2.",
                    "Truthful Resource Allocation in Selfish Sensor Web.",
                    "An Enhanced DV-hop Localization Algorithm for Irregularly Shaped Sensor Networks.",
                    "Model for Survivability of Wireless Sensor Network.",
                    "Reducing End-to-End Delay in Multi-path Routing Algorithms for Mobile Ad Hoc Networks.",
                    "Secure Intermediary Caching in Mobile Wireless Networks Using Asymmetric Cipher Sequences Based Encryption.",
                    "Secure Group Communication with Self-healing and Rekeying in Wireless Sensor Networks.",
                    "Multigrid Based Key Predistribution Scheme in Ad Hoc Networks.",
                    "A Secure Privacy-Preserving Hierarchical Location Service for Mobile Ad Hoc Networks.",
                    "LBKERS: A New Efficient Key Management Scheme for Wireless Sensor Networks.",
                    "SAPC: A Secure Aggregation Protocol for Cluster-Based Wireless Sensor Networks.",
                    "Misbehaviors Detection to Ensure Availability in OLSR.",
                    "Securing the Wireless LANs Against Internal Attacks.",
                    "Structures for Communication-Efficient Public Key Revocation in Ubiquitous Sensor Network.",
                    "A Method of Pair-Wise Key Distribution and Management in Distributed Wireless Sensor Networks.",
                    "A Stream-Data Oriented Secure Routing Protocol in Wireless Sensor Networks.",
                    "An Improved Key Management Scheme for Heterogeneity Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "2nd MSN 2006",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2006",
                "sub_name": "Mobile Ad-hoc and Sensor Networks, Second International Conference, MSN 2006, Hong Kong, China, December 13-15, 2006, Proceedings.",
                "count": 73,
                "papers": [
                    "Topology Control Made Practical: Increasing the Performance of Source Routing.",
                    "Routing Transient Traffic in Mobile Ad Hoc Networks.",
                    "Comparison of Two Self-organization and Hierarchical Routing Protocols for Ad Hoc Networks.",
                    "Location-Based Multicast Routing Protocol for Mobile Ad Hoc Networks.",
                    "Skipping Face Routing with Guaranteed Message Delivery for Wireless Ad Hoc and Sensor Networks.",
                    "An Anti-void Geographic Routing Algorithm for Wireless Sensor Networks.",
                    "A Correctness Proof of the DSR Protocol.",
                    "Scalable Proxy Routing in Multi-hop Cellular Networks.",
                    "An On-Demand Routing Protocol in Ad Hoc Network Using Label Switching.",
                    "Source-Based Multiple Gateway Selection Routing Protocol in Ad-Hoc Networks.",
                    "Smart Path-Finding with Local Information in a Sensory Field.",
                    "An Efficient Fibonacci Series Based Hierarchical Application-Layer Multicast Protocol.",
                    "Maximizing the Probability of Delivery of Multipoint Relay Broadcast Protocol in Wireless Ad Hoc Networks with a Realistic Physical Layer.",
                    "On Improving Wireless Broadcast Reliability of Sensor Networks Using Erasure Codes.",
                    "Cost-Aware Route Selection in Wireless Mesh Networks.",
                    "Novel Route Metric for High-Throughput in Multi-rate Wireless Ad Hoc Networks.",
                    "Joint Power Control and Proportional Fair Scheduling with Minimum Rate Constraints in Cluster Based MANET.",
                    "Network Coding Approach: Intra-cluster Information Exchange in Wireless Sensor Networks.",
                    "FNSCSDP: A Forward Node Selection Based Cross-Layer Service Discovery Protocol for MANETs.",
                    "Service Discovery Protocols for MANETs: A Survey.",
                    "A BDD-Based Heuristic Algorithm for Design of Reliable Networks with Minimal Cost.",
                    "Coverage-Enhancing Algorithm for Directional Sensor Networks.",
                    "Sensor Scheduling for k-Coverage in Wireless Sensor Networks.",
                    "A New Media Access Control Protocol for Ad-Hoc Wireless Sensor Networks.",
                    "Performance Evaluation of Binary Negative-Exponential Backoff Algorithm in IEEE 802.11 WLAN.",
                    "An Application-Aware Event-Oriented MAC Protocol in Multimodality Wireless Sensor Networks.",
                    "Monte-Carlo Localization for Mobile Wireless Sensor Networks.",
                    "Novel Sink-Oriented Approach for Efficient Sink Mobility Support in Wireless Sensor Networks.",
                    "Reduction of Signaling Cost and Handoff Latency with VMAPs in HMIPv6.",
                    "Adaptive Geographically Bound Mobile Agents.",
                    "Gradient-Driven Target Acquisition in Mobile Wireless Sensor Networks.",
                    "Performance Study of Robust Data Transfer Protocol for VANETs.",
                    "A Multi-layer Approach to Support Multimedia Communication in Mesh Networks with QoS.",
                    "Trust Extended Dynamic Security Model and Its Application in Network.",
                    "An Improvement of Remote User Authentication Scheme Using Smart Cards.",
                    "A Secure Architecture for Mobile Ad Hoc Networks.",
                    "Interlayer Attacks in Mobile Ad Hoc Networks.",
                    "Mutual-Authentication Mechanism for RFID Systems.",
                    "Achieving Anonymity in Mobile Ad Hoc Networks Using Fuzzy Position Information.",
                    "Proxy Signature Without Random Oracles.",
                    "Building Hierarchical Public Key Infrastructures in Mobile Ad-Hoc Networks.",
                    "Key Exchange in 802.15.4 Networks and Its Performance Implications.",
                    "An Authenticated Key Agreement Protocol for Mobile Ad Hoc Networks.",
                    "Efficient ID-Based Authenticated Group Key Agreement from Bilinear Pairings.",
                    "Efficient Augmented Password-Based Encrypted Key Exchange Protocol.",
                    "Secure Relative Location Determination in Vehicular Network.",
                    "A Local-Control Algorithm to Prolong the Lifetime of Wireless Ad Hoc Networks.",
                    "Exploiting Local Knowledge to Enhance Energy-Efficient Geographic Routing.",
                    "A Graph-Center-Based Scheme for Energy-Efficient Data Collection in Wireless Sensor Networks.",
                    "An Energy Efficient Event Processing Algorithm for Wireless Sensor Networks.",
                    "A Novel Energy-Efficient Backbone for Sensor Networks.",
                    "An Energy-Balanced Strategy for Clustering Protocols in Wireless Sensor Networks.",
                    "QoS Topology Control with Minimal Total Energy Cost in Ad Hoc Wireless Networks.",
                    "An Energy Efficient TDMA Protocol for Event Driven Applications in Wireless Sensor Networks.",
                    "Self-organization Data Gathering for Wireless Sensor Networks.",
                    "Continuous Monitoring of kNN Queries in Wireless Sensor Networks.",
                    "History-Sensitive Based Approach to Optimizing Top-k Queries in Sensor Networks.",
                    "Data Replication in Mobile Ad Hoc Networks.",
                    "Zone-Based Replication Scheme for Mobile Ad Hoc Networks Using Cross-Layer Design.",
                    "Latency of Event Reporting in Duty-Cycled Wireless Sensor Networks.",
                    "Improving Bluetooth EDR Data Throughput Using FEC and Interleaving.",
                    "Information-Accuracy-Aware Jointly Sensing Nodes Selection in Wireless Sensor Networks.",
                    "Supporting Application-Oriented Kernel Functionality for Resource Constrained Wireless Sensor Nodes.",
                    "XMAS: An eXtraordinary Memory Allocation Scheme for Resource-Constrained Sensor Operating Systems.",
                    "An Adaptive Distributed Resource Allocation Scheme for Sensor Networks.",
                    "Sequential Approach for Type-Based Detection in Wireless Sensor Networks.",
                    "System Support for Cross-Layering in Sensor Network Stack.",
                    "A Topology Controllable Testing Environment for Mobile Ad Hoc Network Software.",
                    "Microcosm: A Low Cost 3-D Wireless Sensor Test-Bed Within a Controllable Environment.",
                    "System-Level WSN Application Software Test Using Multi-platform Hardware Abstraction Layers.",
                    "An Integrated Self-deployment and Coverage Maintenance Scheme for Mobile Sensor Networks.",
                    "A Power-Aware Peer-to-Peer System for Ad-Hoc Networks.",
                    "Load Balancing by Distributed Optimisation in Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "1st MSN 2005",
        "info": "Wuhan, China",
        "venues": [
            {
                "sub_name_abbr": "conf/msn/2005",
                "sub_name": "Mobile Ad-hoc and Sensor Networks, First International Conference, MSN 2005, Wuhan, China, December 13-15, 2005, Proceedings.",
                "count": 112,
                "papers": [
                    "An Overlapping Communication Protocol Using Improved Time-Slot Leasing for Bluetooth WPANs.",
                    "Full-Duplex Transmission on the Unidirectional Links of High-Rate Wireless PANs.",
                    "Server Supported Routing: A Novel Architecture and Protocol to Support Inter-vehicular Communication.",
                    "Energy-Efficient Aggregate Query Evaluation in Sensor Networks.",
                    "Data Sampling Control and Compression in Sensor Networks.",
                    "Worst and Best Information Exposure Paths in Wireless Sensor Networks.",
                    "Cost Management Based Secure Framework in Mobile Ad Hoc Networks.",
                    "Efficient and Secure Password Authentication Schemes for Low-Power Devices.",
                    "Improving IP Address Autoconfiguration Security in MANETs Using Trust Modelling.",
                    "On-Demand Anycast Routing in Mobile Ad Hoc Networks.",
                    "MLMH: A Novel Energy Efficient Multicast Routing Algorithm for WANETs.",
                    "ZBMRP: A Zone Based Multicast Routing Protocol for Mobile Ad Hoc Networks.",
                    "A Survey of Intelligent Information Processing in Wireless Sensor Network.",
                    "Minimum Data Aggregation Time Problem in Wireless Sensor Networks.",
                    "Mobility-Pattern Based Localization Update Algorithms for Mobile Wireless Sensor Networks.",
                    "Accurate Time Synchronization for Wireless Sensor Networks.",
                    "A Service Discovery Protocol for Mobile Ad Hoc Networks Based on Service Provision Groups and Their Dynamic Reconfiguration.",
                    "Population Estimation for Resource Inventory Applications over Sensor Networks.",
                    "Segmented Broadcasting and Distributed Caching for Mobile Wireless Environments.",
                    "Range Adjustment for Broadcast Protocols with a Realistic Radio Transceiver Energy Model in Short-Range Wireless Networks.",
                    "Reliable Gossip-Based Broadcast Protocol in Mobile Ad Hoc Networks.",
                    "An Energy Consumption Estimation Model for Disseminating Query in Sensor Networks.",
                    "EasiSOC: Towards Cheaper and Smaller.",
                    "Deployment Issues in Wireless Sensor Networks.",
                    "A Geographical Cellular-Like Architecture for Wireless Sensor Networks.",
                    "EAAR: An Approach to Environment Adaptive Application Reconfiguration in Sensor Network.",
                    "A Secure Routing Protocol SDSR for Mobile Ad Hoc Networks.",
                    "Secure Localization and Location Verification in Sensor Networks.",
                    "Secure AODV Routing Protocol Using One-Time Signature.",
                    "A Security Enhanced AODV Routing Protocol.",
                    "A Constant Time Optimal Routing Algorithm for Undirected Double-Loop Networks.",
                    "A Directional Antenna Based Path Optimization Scheme for Wireless Ad Hoc Networks.",
                    "Optimized Path Registration with Prefix Delegation in Nested Mobile Networks.",
                    "BGP-GCR+: An IPv6-Based Routing Architecture for MANETs as Transit Networks of the Internet.",
                    "A Local Repair Scheme with Adaptive Promiscuous Mode in Mobile Ad Hoc Networks.",
                    "PSO-Based Energy Efficient Gathering in Sensor Networks.",
                    "Efficient Data Gathering Schemes for Wireless Sensor Networks.",
                    "Delay Efficient Data Gathering in Sensor Networks.",
                    "Localized Recursive Estimation in Wireless Sensor Networks.",
                    "Asynchronous Power-Saving Event-Delivery Protocols in Mobile USN.",
                    "Low-Complexity Authentication Scheme Based on Cellular Automata in Wireless Network.",
                    "SeGrid: A Secure Grid Infrastructure for Sensor Networks.",
                    "Handling Sensed Data in Hostile Environments.",
                    "Detecting SYN Flooding Attacks Near Innocent Side.",
                    "Network Capacity of Wireless Ad Hoc Networks with Delay Constraint.",
                    "Load-Based Dynamic Backoff Algorithm for QoS Support in Wireless Ad Hoc Networks.",
                    "Efficient Multiplexing Protocol for Low Bit Rate Multi-point Video Conferencing.",
                    "A New Backoff Algorithm to Improve the Performance of IEEE 802.11 DCF.",
                    "Enhanced Power Saving for IEEE 802.11 WLAN with Dynamic Slot Allocation.",
                    "DIAR: A Dynamic Interference Aware Routing Protocol for IEEE 802.11-Based Mobile Ad Hoc Networks.",
                    "A Low-Complexity Power Allocation Scheme for Distributed Wireless Links in Rayleigh Fading Channels with Capacity Optimization.",
                    "On Energy Efficient Wireless Data Access: Caching or Not?.",
                    "An Efficient Power Allocation Scheme for Ad Hoc Networks in Shadowing Fading Channels.",
                    "A Soft Bandwidth Constrained QoS Routing Protocol for Ad Hoc Networks.",
                    "Optimal QoS Mechanism: Integrating Multipath Routing, DiffServ and Distributed Traffic Control in Mobile Ad Hoc Networks.",
                    "A New Backoff Algorithm to Support Service Differentiation in Ad Hoc Networks.",
                    "Power Aware Multi-hop Packet Relay MAC Protocol in UWB Based WPANs.",
                    "Traffic-Adaptive Energy Efficient Medium Access Control for Wireless Sensor Networks.",
                    "An Energy-Conserving and Collision-Free MAC Protocol Based on TDMA for Wireless Sensor Networks.",
                    "Experiments Study on a Dynamic Priority Scheduling for Wireless Sensor Networks.",
                    "A BPP-Based Scheduling Algorithm in Bluetooth Systems.",
                    "On the Problem of Channel Assignment for Multi-NIC Multihop Wireless Networks.",
                    "Validity of Predicting Connectivity in Wireless Ad Hoc Networks.",
                    "A Novel Environment-Aware Mobility Model for Mobile Ad Hoc Networks.",
                    "A Low Overhead Ad Hoc Routing Protocol with Route Recovery.",
                    "Recovering Extra Routes with the Path from Loop Recovery Protocol.",
                    "Quality of Coverage (QoC) in Integrated Heterogeneous Wireless Systems.",
                    "ACOS: A Precise Energy-Aware Coverage Control Protocol for Wireless Sensor Networks.",
                    "Coverage Analysis for Wireless Sensor Networks.",
                    "On Coverage Problems of Directional Sensor Networks.",
                    "Using MDS Codes for the Key Establishment of Wireless Sensor Networks.",
                    "A Study on Efficient Key Management in Real Time Wireless Sensor Network.",
                    "Efficient Group Key Management for Dynamic Peer Networks.",
                    "Improvement of the Naive Group Key Distribution Approach for Mobile Ad Hoc Networks.",
                    "RAA: A Ring-Based Address Autoconfiguration Protocol in Mobile Ad Hoc Networks.",
                    "Dual Binding Update with Additional Care of Address in Network Mobility.",
                    "Optimistic Dynamic Address Allocation for Large Scale MANETs.",
                    "Boundary-Based Time Partitioning with Flattened R-Tree for Indexing Ubiquitous Objects.",
                    "Authentication in Fast Handover of Mobile IPv6 Applying AAA by Using Hash Value.",
                    "The Tentative and Early Binding Update for Mobile IPv6 Fast Handover.",
                    "A Simulation Study to Investigate the Impact of Mobility on Stability of IP Multicast Tree.",
                    "Fast Handover Method for mSCTP Using FMIPv6.",
                    "An Analytical Comparison of Factors Affecting the Performance of Ad Hoc Network.",
                    "Maximum Throughput and Minimum Delay in IEEE 802.15.4.",
                    "On the Capacity of Hybrid Wireless Networks in Code Division Multiple Access Scheme.",
                    "Performance Evaluation of Existing Approaches for Hybrid Ad Hoc Networks Across Mobility Models.",
                    "UDC: A Self-adaptive Uneven Clustering Protocol for Dynamic Sensor Networks.",
                    "A Backoff-Based Energy Efficient Clustering Algorithm for Wireless Sensor Networks.",
                    "Energy-Saving Cluster Formation Algorithm in Wireless Sensor Networks.",
                    "RECA: A Ring-Structured Energy-Efficient Cluster Architecture for Wireless Sensor Networks.",
                    "A Distributed Efficient Clustering Approach for Ad Hoc and Sensor Networks.",
                    "A Novel MAC Protocol for Improving Throughput and Fairness in WLANs.",
                    "Optimal Control of Packet Service Access State for Cdma2000-1x Systems.",
                    "A Cross-Layer Optimization for Ad Hoc Networks.",
                    "A Novel Media Access Control Algorithm Within Single Cluster in Hierarchical Ad Hoc Networks.",
                    "IEE-MAC: An Improved Energy Efficient MAC Protocol for IEEE 802.11-Based Wireless Ad Hoc Networks.",
                    "POST: A Peer-to-Peer Overlay Structure for Service and Application Deployment in MANETs.",
                    "An Efficient and Practical Greedy Algorithm for Server-Peer Selection in Wireless Peer-to-Peer File Sharing Networks.",
                    "Can P2P Benefit from MANET? Performance Evaluation from Users' Perspective.",
                    "Research on Dynamic Modeling and Grid-Based Virtual Reality.",
                    "Design of Wireless Sensors for Automobiles.",
                    "Mobile Tracking Using Fuzzy Multi-criteria Decision Making.",
                    "Pitfall in Using Average Travel Speed in Traffic Signalized Intersection Networks.",
                    "Static Registration Grouping Scheme to Reduce HLR Traffic Cost in Mobile Networks.",
                    "Towards Security Analysis to Binding Update Protocol in Mobile IPv6 with Formal Method.",
                    "Enhancing of the Prefetching Prediction for Context-Aware Mobile Information Services.",
                    "A Mobile Multimedia Database System for Infants Education Environment.",
                    "Towards a Symbolic Bisimulation for the Spi Calculus.",
                    "Mobile Agent-Based Framework for Healthcare Knowledge Management System.",
                    "Assurance Method of High Availability in Information Security Infrastructure System.",
                    "Fuzzy-Based Prefetching Scheme for Effective Information Support in Mobile Networks.",
                    "Duplex Method for Mobile Communication Systems."
                ]
            }
        ]
    }
]