[
    {
        "year": "2021",
        "name": "24th MSWiM 2021",
        "info": "Alicante, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2021",
                "sub_name": "MSWiM '21: 24th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, Alicante, Spain, November 22 - 26, 2021.",
                "count": 31,
                "papers": [
                    "Space-Air-Ground Integrated Networking: From Single- to Multi-Component Pareto Optimization.",
                    "Enabling the Sustainable Digital Transformation of Urban Ecosystems.",
                    "Preventing Failures of Cooperative Maneuvers Among Connected and Automated Vehicles.",
                    "Testing AGV Mobility Control Method for MANET Coverage Optimization using Procedural Generation.",
                    "Closer than Close: MEC-Assisted Platooning with Intelligent Controller Migration.",
                    "Global Energy Optimization Strategy Based on Delay Constraints in Edge Computing Environment.",
                    "RAN-aware Proxy-based Flow Control for High Throughput and Low Delay eMBB.",
                    "Profit Maximization for Service Placement and Request Assignment in Edge Computing via Deep Reinforcement Learning.",
                    "Accelerating the Simulation of Wireless Communication Protocols using Asynchronous Parallelism.",
                    "Modeling and Simulation of Reconfigurable Intelligent Surfaces for Hybrid Aerial and Ground-based Vehicular Communications.",
                    "An Evaluation of OMNeT++-based V2X Communication Frameworks: On the Path Towards 5G-V2X Simulations.",
                    "An Energy-Efficient Smart Space System using LoRa Network with Deadline and Security Constraints.",
                    "A Novel Harvesting-Aware RL-based Opportunistic Routing Protocol for Underwater Sensor Networks.",
                    "Enabling Green IoT: Energy-Aware Communication Protocols for Battery-less LoRaWAN Devices.",
                    "Duocast for Wireless Industrial Networks: an Experimental Study.",
                    "1KT: A Low-Cost 1000-Node Low-Power Wireless IoT Testbed.",
                    "No Reservations Required: Achieving Fairness between Wi-Fi and NR-U with Self-Deferral Only.",
                    "Admission Control and Scheduling of Isochronous Traffic in IEEE 802.11ad MAC.",
                    "Improving the Spatial Reuse in IEEE 802.11ax WLANs: A Multi-Armed Bandit Approach.",
                    "Simple and Efficient Collision-Free Channel Access in Multi-Hop Wireless Networks.",
                    "Reliable Consistent Multipath mmWave Communication.",
                    "Improved Fast Algorithms for Optimal Min-Max Line Barrier Coverage with Mobile Sensors on the Plane.",
                    "Scalable Machine Learning Algorithms to Design Massive MIMO Systems.",
                    "Proposing Cooperative Maneuvers Among Automated Vehicles Using Machine Learning.",
                    "MixDrones: A Mix Zones-based Location Privacy Protection Mechanism for the Internet of Drones.",
                    "Characterizing RNTI Allocation and Management in Mobile Networks.",
                    "Admission Control for URLLC Users in 5G Networks.",
                    "Adapting Named Data Networking (NDN) for Better Consumer Mobility Support in LEO Satellite Networks.",
                    "LoRaWAN Relaying: Push the Cell Boundaries.",
                    "A Video-Quality Driven Strategy in Short Video Streaming.",
                    "Determining the Center of a Line Topology with Signal Strength Measurements under Correlated Log-Normal Shadowing: Analyzing the Three Node Case."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2021divanet",
                "sub_name": "DIVANet '21: Proceedings of the 11th ACM Symposium on Design and Analysis of Intelligent Vehicular Networks and Applications, Alicante, Spain, November 22 - 26, 2021.",
                "count": 11,
                "papers": [
                    "Tutorial: Edge Computing for Mobile Internet of Things.",
                    "Interference-Aware Trajectory Optimization for Cellular-connected UAVs with Obstacle Avoidance.",
                    "Secure Drone Identification with Hyperledger Iroha.",
                    "Flexi-Compression: A Flexible Model Compression Method for Autonomous Driving.",
                    "A Novel Indirect Trust Mechanism for Addressing Black hole Attacks in MANET.",
                    "TTWiFi: Time-Triggered Communication over WiFi.",
                    "Secure Computational Offloading with gRPC: A Performance Evaluation in a Mobile Cloud Computing Environment.",
                    "Autonomous Vehicle Navigation and Communication by Passive Radio Frequency (RFID) Tags.",
                    "Edge-based V2X Efficient Traffic Emergency Responding Protocol.",
                    "A Dual Mode Privacy-Preserving Scheme Enabled Secure and Anonymous for Edge Computing Assisted Internet of Vehicle Networks.",
                    "A Novel Dynamic Split and Merge Clustering Scheme for SDVN."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2021q",
                "sub_name": "Q2SWinet 2021: Proceedings of the 17th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Alicante, Spain, November 22-26, 2021.",
                "count": 16,
                "papers": [
                    "A Digital Communication Twin for Performance Prediction and Management of Bluetooth Mesh Networks.",
                    "QCI Adaptive Load Balancing in Heterogeneous Wireless Networks of Indoor Environments.",
                    "Automated and Reproducible Application Traces Generation for IoT Applications.",
                    "Improving Ray Tracing Based Radio Propagation Model Performance Using Spatial Acceleration Structures.",
                    "Split-Protocol-Stack Wireless Network Emulation: Enabling PHY Modeling Diversity with Software-Radio-in-the-Loop.",
                    "Efficient Resource Allocation with Constrained Rate Variability in Cellular Networks.",
                    "VidQ: Video Query Using Optimized Audio-Visual Processing.",
                    "MASS: Multi-edge Assisted Fast Object Detection for Autonomous Mobile Vision in Heterogeneous Edge Networks.",
                    "Resource Allocation for Improved User Experience with Live Video Streaming in 5G.",
                    "Admission Control for mMTC Traffic in 5G Networks.",
                    "Optimizing Energy Efficiency of QoS-Based Routing in Software-Defined Networks.",
                    "Supporting Delay-Sensitive Applications with Multipath QUIC and Forward Erasure Correction.",
                    "Modeling and verification of the Multi-connection Tactile Internet Protocol.",
                    "Predicting Traffic Characteristics of Real Road Scenarios in Jordan and Gulf Region.",
                    "Optimal Searching of Prefetched DASH Segments in Fog Nodes: A Multi-Armed Bandit Approach.",
                    "On the Design of Edge-Assisted Mobile IoT Augmented and Mixed Reality Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2021",
                "sub_name": "PE-WASUN '21: Proceedings of the 18th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, Alicante, Spain, November 22 - 26, 2021.",
                "count": 16,
                "papers": [
                    "Green Road Intersections by Efficient Traffic Light Scheduling Algorithm.",
                    "Improving the Realism of the Physical Layer of NS-3 by Considering the PAPR Problem of the IEEE 802.11p Transmitter.",
                    "STGT: SUMO-Based Traffic Mobility Generation Tool for Evaluation of Vehicular Networks.",
                    "Performance Evaluation of Cooperative LTE-DSRC Vehicular Network.",
                    "Experimental Assessment of IEEE 802.11-based V2I Communications.",
                    "A Support Vector Machine Implementation for Traffic Assignment Problem.",
                    "POI-RGNN: Using Recurrent and Graph Neural Networks to Predict the Category of the Next Point of Interest.",
                    "DTMR: A Decision Tree-based Multimetric Routing Protocol for Vehicular Ad Hoc Networks.",
                    "A PUF-based Authentication Mechanism for OSCORE.",
                    "Performance Evaluation in Misbehaviour Detection Techniques for DoS Attacks in VANETs.",
                    "Social Mix-zones: Anonymizing Personal Information on Contact Tracing Data.",
                    "Study on the Impact of DASH Streaming Services using Energy Efficient Ethernet.",
                    "A Collision Avoidance Strategy For Multirrotor UAVs Based On Artificial Potential Fields.",
                    "Exploiting Frame Aggregation to Enhance Access Point Selection.",
                    "Providing Internet Access for Post-Disaster Communications using Balloon Networks.",
                    "Towards a Throughput and Energy Efficient Association Strategy for Wi-Fi/LiFi Heterogeneous Networks."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "23rd MSWiM 2020",
        "info": "Alicante, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2020",
                "sub_name": "MSWiM '20: 23rd International ACM Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, Alicante, Spain, November 16-20, 2020.",
                "count": 32,
                "papers": [
                    "Platooning on the edge.",
                    "Trajectory-Assisted Robust RFID-tagged Object Tracking and Recognition in Room Environment.",
                    "Challenges Towards the Next Generation of Mobile Communications.",
                    "Extending the ns-3 QUIC Module.",
                    "Evaluation of Dynamic Route Planning Impact on Vehicular Communications with SUMO.",
                    "Building and Simulating Multi-Dimensional Drone Topologies.",
                    "Artery-C: An OMNeT++ Based Discrete Event Simulation Framework for Cellular V2X.",
                    "A Mixture Density Channel Model for Deep Learning-Based Wireless Physical Layer Design.",
                    "PNOFA: Practical, Near-Optimal Frame Aggregation for Modern 802.11 Networks.",
                    "Quantifying Unlinkability in Multi-hop Wireless Networks.",
                    "Revisiting Wi-Fi Performance under the Impact of Corrupted Channel State Information.",
                    "Queue-Sharing Multiple Access.",
                    "Dynamic Scheduling and Optimal Reconfiguration of UPF Placement in 5G Networks.",
                    "Maximizing the Quality of User Experience of Using Services in Edge Computing for Delay-Sensitive IoT Applications.",
                    "Randomized Load Balancing under Loosely Correlated State Information in Fog Computing.",
                    "Lightweight Short-term Photovoltaic Power Prediction for Mobile Edge Computing.",
                    "Capacity of a LoRaWAN Cell.",
                    "Optimal Popularity-based Transmission Range Selection for D2D-supported Content Delivery.",
                    "Communications-based Formation Control of Mobile Robots: Modeling, Analysis and Performance Evaluation.",
                    "AutoMEC: LSTM-based User Mobility Prediction for Service Management in Distributed MEC Resources.",
                    "NeuRA: Using Neural Networks to Improve WiFi Rate Adaptation.",
                    "An Experimental Study of Rate and Beam Adaptation in 60 GHz WLANs.",
                    "Will My Packet Reach On Time?: Deadline-Based Uplink OFDMA Scheduling in 802.11ax WLANs.",
                    "An Adaptive Traffic-Flow based Controller Deployment Scheme for Software-Defined Vehicular Networks.",
                    "OBQR: Orientation-Based Source QoS Routing in VANETs.",
                    "Calibrating Bus Mobility Data for Bus-based Urban Vehicular Networks.",
                    "A Secure Barrier Coverage Scheduling Framework for WSN-based IoT Applications.",
                    "Interaction and Behaviour Evaluation for Smart Homes: Data Collection and Analytics in the ScaledHome Project.",
                    "Processing ANN Traffic Predictions for RAN Energy Efficiency.",
                    "Using Reinforcement Learning in Slotted Aloha for Ad-Hoc Networks.",
                    "Leveraging Antenna Orientation to Optimize Network Performance of Fleets of UAVs.",
                    "A Scalable Scheme for Joint Routing and Resource Allocation in LTE-D2D Based Offloading."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2020divanet",
                "sub_name": "DIVANet '20: Proceedings of the 10th ACM Symposium on Design and Analysis of Intelligent Vehicular Networks and Applications, Alicante, Spain, November 16-20, 2020.",
                "count": 9,
                "papers": [
                    "Edge Computing for Video Analytics in the Internet of Vehicles with Blockchain.",
                    "Real-Time Low-Pixel Infrared Human Detection From Unmanned Aerial Vehicles.",
                    "A Multi-stack Simulation Framework for Vehicular Applications Testing.",
                    "Advanced Models for the Simulation of AGV Communication in Industrial Environments: Model proposal and Demonstration.",
                    "Trustworthy Traffic Information Sharing Secured via Blockchain in VANETs.",
                    "Machine Learning-Based Intrusion Detection System for Controller Area Networks.",
                    "Vehicle Fusion Positioning Model based on CSI.",
                    "Reactive Overlays for Adaptive Routing in Mobile Ad hoc Networks.",
                    "Machine Learning for Self-Adaptive Internet of Underwater Things."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2020q",
                "sub_name": "Q2SWinet '20: Proceedings of the 16th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Alicante, Spain, November 16-20, 2020.",
                "count": 18,
                "papers": [
                    "Evaluation of SAC-OCDMA System Performance in Terms of BER and Q-Factor Using FBGs and M-Sequence Code.",
                    "A Robust Optimization Approach for Designing FTTx Networks Integrating Free Space Optics under Weather Uncertainty.",
                    "What can Machine Learning do for Radio Spectrum Management?",
                    "Novelty-based Intrusion Detection of Sensor Attacks on Unmanned Aerial Vehicles.",
                    "A Memory-efficient Group Key Managment for Communicating Things.",
                    "Network Anomaly Detection Using LSTM Based Autoencoder.",
                    "Multi-User Competitive Energy-Aware and QoE-Aware Video Streaming on Mobile Devices.",
                    "A Supervised Machine Learning Approach for DASH Video QoE Prediction in 5G Networks.",
                    "SMC: Alternative Smart Media Compression Techniques for Edge Storage Offloading.",
                    "Data Redundancy Management in Connected Environments.",
                    "Deep Learning for Resource-Limited Devices.",
                    "A Vertex-centric Markov Chain Algorithm for Network Clustering based on b-Coloring.",
                    "Hybrid Inspector-Inspectee-Agent Games in Mobile Cloud Computing.",
                    "Model-Oriented Methodology for Developing a Social Based Healthcare System.",
                    "An Energy Efficient Architecture of self-sustainable WSN based on Energy Harvesting and Wireless Charging with Consideration of Deployment Cost.",
                    "Adversarial Patches-based Attacks on Automated Vehicle Make and Model Recognition Systems.",
                    "A Realistic Model for Rescue Operations after an Earthquake.",
                    "A Performance Evaluation of Time-Series Mobility Prediction for Connected Vehicular Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2020",
                "sub_name": "PE-WASUN '20, Proceedings of the 17th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, Alicante, Spain, November 16-20, 2020.",
                "count": 13,
                "papers": [
                    "A Cluster-based Framework for Predicting Large Scale Road-Network Constrained Trajectories.",
                    "Detection of Position Falsification Attacks in VANETs Applying Trust Model and Machine Learning.",
                    "A Distributed Topology Discovery Protocol for Software-Defined Vehicular Networks.",
                    "Improving Link Reliability of IEEE 802.15.4g SUN with Re-Transmission Shaping.",
                    "Inferring Energy Consumption Patterns in Public Buildings.",
                    "Performance Evaluation of the CoAP Protocol with Security Support for IoT Environments.",
                    "A Low-cost Wireless Acoustic Sensor Network for the Classification of Urban Sounds.",
                    "CeTUP: Controller-equipped Topology Update Process for Tactical Ad-hoc Networks.",
                    "ROPS: Recursively Optimized Prepartitioning Strategy to allocate Key Devices Positions in Large-Scale RF Mesh Networks.",
                    "Artificial Neural Network Performance Evaluation for a Hybrid Power Domain Orthogonal / Non-Orthogonal Multiple Access (OMA / NOMA) System.",
                    "Epidemic Interference in a Cellular System.",
                    "Open Trends On TCP Performance Over Urban 5G mmWave Networks.",
                    "Towards a Fast and Efficient Strategy to Assign Channels in WLANs with Channel Bonding."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "22nd MSWiM 2019",
        "info": "Miami Beach, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2019",
                "sub_name": "Proceedings of the 22nd International ACM Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2019, Miami Beach, FL, USA, November 25-29, 2019.",
                "count": 43,
                "papers": [
                    "A Vision towards Pervasive Edge Computing.",
                    "A Roadmap for the Acceleration of Technology in Computational Science for the next Decade.",
                    "Where Are You Going Next?: A Practical Multi-dimensional Look at Mobility Prediction.",
                    "Stationarity for the Small World in Motion Mobility Model.",
                    "Dynamically Tuning IEEE 802.11's Contention Window Using Machine Learning.",
                    "Simulation and Performance Evaluation of the Intel Rate Adaptation Algorithm.",
                    "Optimal Access Point Placement for Multi-AP mmWave WLANs.",
                    "802.11ac Frame Aggregation is Bottlenecked: Revisiting the Block ACK.",
                    "A Transparent and Multimodal Malware Detection Method for Android Apps.",
                    "A Comprehensive Empirical Analysis of TLS Handshake and Record Layer on IoT Platforms.",
                    "Secrecy in Dual-Hop Relaying Network Using the Independent Randomize-and-Forward Strategy.",
                    "Three-Dimensional Matching based Resource Provisioning for the Design of Low-Latency Heterogeneous IoT Networks.",
                    "DCTP-A and DCTP-I: Collection Tree Protocols for Dual Radio Platforms.",
                    "Toward Accurate Clock Drift Modeling in Wireless Sensor Networks Simulation.",
                    "HiPR: High-Precision UWB Ranging for Sensor Networks.",
                    "Maximum Gaps in Path Coverage.",
                    "ns-3 meets OpenAI Gym: The Playground for Machine Learning in Networking Research.",
                    "A Simulation Execution Manager for ns-3: Encouraging reproducibility and simplifying statistical analysis of ns-3 simulations.",
                    "VuLCAN: A Low-cost, Low-power Embedded Visible Light Communication And Networking Platform.",
                    "Performance Evaluation of LED-to-Camera Communications.",
                    "Joint Link-level and Network-level Reconfiguration for mmWave Backhaul Survivability in Urban Environments.",
                    "Follow the Rays: Understanding the Interplay between Environment and System through In-Situ Wireless Modelling.",
                    "Analysis of Age of Information Threshold Violations.",
                    "Stochastic Modeling and Simulation for Redundancy and Coexistence in Graphs Resulting from Log-Normal Shadowing.",
                    "Received Total Wideband Power Data Analysis: Multiscale wavelet analysis of RTWP data in a 3G network.",
                    "Spatial Issues in Modeling LoRaWAN Capacity.",
                    "Evaluation of LoRaWAN Transmission Range for Wireless Sensor Networks in Riparian Forests.",
                    "Performance of a Cell-Free MIMO Under RF Mismatch.",
                    "Experimental Evaluation of Antenna Polarization and Elevation Effects on Drone Communications.",
                    "Simulation of ISO/IEEE 11073 Personal Health Devices in WBANs.",
                    "A Byzantine-Tolerant Distributed Consensus Algorithm for Connected Vehicles Using Proof-of-Eligibility.",
                    "Towards Data VSN Offloading in VANETs Integrated into the Cellular Network.",
                    "Characterizing Car Trips Through Information Theory Metrics.",
                    "COLiDeR: A Cross-Layer Protocol for Two-Path Relaying.",
                    "LAMA: Location-Assisted Medium Access for Position-Beaconing Applications.",
                    "Multi-Access Spreading over Time: MAST.",
                    "Benchmarking the Physical Layer of Wireless Cards using Software-Defined Radios.",
                    "SEE: Scheduling Early Exit for Mobile DNN Inference during Service Outage.",
                    "CrowdSenSim 2.0: a Stateful Simulation Platform for Mobile Crowdsensing in Smart Cities.",
                    "An In-depth Analysis of the Impact of Battery Usage Patterns on Performance of Task Allocation Algorithms in Sparse Mobile Crowdsensing.",
                    "Elastic Offloading of Multitasking Applications to Mobile Edge Computing.",
                    "Modeling Realistic Bit Rates of D2D Communications between Android Devices.",
                    "Secure Routing in Multi-hop IoT-based Cognitive Radio Networks under Jamming Attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2019divanet",
                "sub_name": "Proceedings of the 9th ACM Symposium on Design and Analysis of Intelligent Vehicular Networks and Applications, DIVANet 2019, Miami Beach, FL, USA, November 25-29, 2019.",
                "count": 14,
                "papers": [
                    "ASAP: An Agent-Assisted Smart Auction-Based Parking System in Internet of Things.",
                    "On Leveraging the Computational Potential of Fog-Enabled Vehicular Networks.",
                    "Ridesharing Architecture for Patterned Commute Traffic.",
                    "Multi-Vehicle Cooperative Positioning Correction Framework Based on Vehicular Blockchain.",
                    "Providing a Dynamic Milk-Run Vehicle Routing Using Vehicular Ad hoc Networks.",
                    "A Novel Framework of Vehicle Ad-Hoc Networks based on Virtualization and Distributed Ledger Technology.",
                    "Download and Fly: An Online Solution for the UAV 3D Trajectory Planning Problem in Smart Cities.",
                    "A Multilayer Low-Altitude Airspace Model for UAV Traffic Management.",
                    "Performance Analysis of IEEE 802.11p and IEEE 802.11n based on QoS for UAV networks.",
                    "Distributed Intelligent Algorithm for Interdependent Electrified Transportation and Power Networks.",
                    "Vehicular Traffic Density Forecasting through the Eyes of Traffic Cameras; a Spatio-Temporal Machine Learning Study.",
                    "A Multi-object Detection Method Based on Connected Vehicles.",
                    "Spectrum Analytic Approach for Cooperative Navigation of Connected and Autonomous Vehicles.",
                    "Taxonomy of an Application Model: Toward Building Large Scale, Connected Vehicle Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2019q",
                "sub_name": "Proceedings of the 15th ACM International Symposium on QoS and Security for Wireless and Mobile Networks, Q2SWinet 2019, Miami Beach, FL, USA, November 25-29, 2019.",
                "count": 18,
                "papers": [
                    "Session details: Session 1: Radio Communication.",
                    "MiamiMapper: Crowd Analysis using Active and Passive Indoor Localization through Wi-Fi Probe Monitoring.",
                    "Using AutoEncoders for Radio Signal Denoising.",
                    "Session details: Session 2: Security.",
                    "Countering Data and Control Plane Attack On OLSR Using Passive Neighbor Policing and Inconsistency Identification.",
                    "Real-time Traffic Monitoring and SQL Injection Attack Detection for Edge Networks.",
                    "Smart IoT Notification System for Efficient In-City Parking.",
                    "Session details: Session 3: Data Management.",
                    "EQL-CE: An Event Query Language for Connected Environment Management.",
                    "Towards Better Data Management/Gathering in Connected Environments.",
                    "Relays in Cellular Networks: A Simplified Cost-Benefit Analysis.",
                    "Session details: Session 4: IoT Systems.",
                    "A Prediction-Based Multisensor Heuristic for the Internet of Things.",
                    "Topology Control for Internet of Underwater Things.",
                    "An Efficient Handover Trigger Scheme for Vehicular Networks Using Recurrent Neural Networks.",
                    "Session details: Session 5: Security.",
                    "A Routing Protocol for Source Location Privacy in Wireless Sensor Networks with Multiple Sources.",
                    "A Distance-based Data Fusion Technique for Minimizing GPS Positioning Error in Vehicular Ad Hoc Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2019",
                "sub_name": "Proceedings of the 16th ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, PE-WASUN 2019, Miami Beach, FL, USA, November 25-29, 2019.",
                "count": 17,
                "papers": [
                    "Session details: Vehicular Networks.",
                    "UAV Mobility Model for Dynamic UAV-to-Car Communications.",
                    "An Optimized Link Duration-Based Mobility Management Scheme for Connected Vehicular Networks.",
                    "Comparison of Traffic Demand Generation Tools in SUMO: Case Study: Access Highways to Quito.",
                    "Traffic Signal Control Using Deep Reinforcement Learning with Multiple Resources of Rewards.",
                    "Session details: Smart Grid and IoT Networks.",
                    "Towards a Distributed Congestion Control mechanism for Smart Grid Neighborhood Area Networks.",
                    "Performance Evaluation of RSSI-based Positioning System with Low-cost LoRa Devices.",
                    "Rainfall Intensity Datalogger System. LoPy4-Based Design and Implementation.",
                    "Session details: Data Coding, Network Security and Aeronautical Communications.",
                    "Performance of Modulation Diversity with Polar Encoding in Rayleigh Fading Channel.",
                    "On the Robustness of Root Locus based Routing Attack-Detection in Reconfigurable Wireless Networks.",
                    "FACTS2: Framework for Aeronautical Communications and Traffic Simulations 2.",
                    "Session details: Mesh and Ubiquitous Networks.",
                    "Optimization of Key Devices Positions in Large-Scale RF Mesh Networks.",
                    "Minkowski Distance Order Effect on the Optimization of Key Devices Positions in Large-Scale RF Mesh Networks.",
                    "Automatic QoE Evaluation of DASH Streaming using ITU-T Standard P.1203 and Google Puppeteer."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "21st MSWiM 2018",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2018",
                "sub_name": "Proceedings of the 21st ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2018, Montreal, QC, Canada, October 28 - November 02, 2018.",
                "count": 49,
                "papers": [
                    "Content-centric Edge Caching for 5G Mobile Internet and Beyond.",
                    "Integrated Terrestrial/Non-Terrestrial 6G Networks for Ubiquitous 3D Super-Connectivity.",
                    "Machine Learning as a Powerful Tool to Enjoy Future Intelligent Wireless Networks.",
                    "Information-Centric Intelligent Vehicular Networks: Challenges and Guidelines.",
                    "FWB: Funneling Wider Bandwidth Algorithm for High Performance Data Collection in Wireless Sensor Networks.",
                    "Balancing Energy Harvesting and Transmission Scheduling in Aggregation Convergecast.",
                    "Routing with Renewable Energy Management in Wireless Sensor Networks.",
                    "FlyNetSim: An Open Source Synchronized UAV Network Simulator based on ns-3 and Ardupilot.",
                    "DCNs-2: A Cloud Network Simulator Extension for ns-2.",
                    "WiDet: Wi-Fi Based Device-Free Passive Person Detection with Deep Convolutional Neural Networks.",
                    "BRRA: A Bid-Revisable Reverse Auction based Framework for Incentive Mechanisms in Mobile Crowdsensing Systems.",
                    "Network Alarm Flood Pattern Mining Algorithm Based on Multi-dimensional Association.",
                    "Constructing an Accurate and a High-Performance Power Profiler for Embedded Systems and Smartphones.",
                    "On the (over)-Reactions and the Stability of a 6TiSCH Network in an Indoor Environment.",
                    "Collision-Free Broadcast Methods for IEEE 802.15.4-TSCH Networks Formation.",
                    "Reinforcement Learning Techniques for Optimized Channel Hopping in IEEE 802.15.4-TSCH Networks.",
                    "FastLink: An Efficient Initial Access Protocol for Millimeter Wave Systems.",
                    "A 3GPP NR Compliant Beam Management Framework to Simulate End-to-End mmWave Networks.",
                    "sFog: Seamless Fog Computing Environment for Mobile IoT Applications.",
                    "Maximizing Mobiles Energy Saving Through Tasks Optimal Offloading Placement in two-tier Cloud.",
                    "Delay-Sensitive Multiplayer Augmented Reality Game Planning in Mobile Edge Computing.",
                    "Effects of Routing on the Capacity of Multi-Hop Wireless Networks.",
                    "Virtual Link Embedding in Software-Defined Multi-radio Multi-channel Multi-hop Wireless Networks.",
                    "PCR: A Power Control-based Opportunistic Routing for Underwater Sensor Networks.",
                    "GreenLoading: Using the Citizens Band Radio for Energy-Efficient Offloading of Shared Interests.",
                    "When Distributed Outperforms Centralized Scheduling in D2D-Enabled Cellular Networks.",
                    "An Advanced Mobility-Aware Algorithm for Joint Beamforming and Clustering in Heterogeneous Cloud Radio Access Network.",
                    "On the Optimality of Opportunistic Routing Protocols for Underwater Sensor Networks.",
                    "A Methodology for Performance Benchmarking of Mobile Networks for Internet Video Streaming.",
                    "Implementation and Performance Evaluation of the QUIC Protocol in Linux Kernel.",
                    "Analytical Model for Performance Evaluation of Random Wireless Sensor Networks.",
                    "Vouch: A Secure Proof-of-Location Scheme for VANETs.",
                    "A Novel Protocol for Securing Network Slice Component Association and Slice Isolation in 5G Networks.",
                    "Cascading Attacks on Wi-Fi Networks with Weak Interferers.",
                    "An Intrusion Detection System for Constrained WSN and IoT Nodes Based on Binary Logistic Regression.",
                    "A Trustworthy Data Aggregation Model Based on Context and Data Density Correlation Degree.",
                    "An IoT-DaaS Approach for the Interoperability of Heterogeneous Sensor Data Sources.",
                    "MOCHA: A Tool for Mobility Characterization.",
                    "Learning the Relation Between Mobile Encounters and Web Traffic Patterns: A Data-driven Study.",
                    "TRAILS - A Trace-Based Probabilistic Mobility Model.",
                    "Video on Demand in IEEE 802.11p-based Vehicular Networks: Analysis and Dimensioning.",
                    "Distributed Probabilistic Caching with Content-location Awareness in VNDNs.",
                    "A Software-Defined Radio Analysis of the Impact of Dynamic Modulation Scaling within Low-Power Wireless Systems.",
                    "Where to Rendezvous?: Preferring Quiet Channels in Cognitive Radio Networks.",
                    "CR-GRT: A Novel SDR Platform Optimized for Real-time Cognitive Radio Applications.",
                    "Should I Stay or Should I Go?: Exploiting Visitor Movements to Derive Individualized Recommendations in Museums.",
                    "Toward Advanced Indoor Mobility Models Through Location-Centric Analysis: Spatio-Temporal Density Dynamics.",
                    "PRMS: Phase and RSSI based Localization System for Tagged Objects on Multilayer with a Single Antenna.",
                    "Demonstrating MQTT+: An Advanced Broker for Data Filtering, Processing and Aggregation."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2018q",
                "sub_name": "Proceedings of the 14th ACM International Symposium on QoS and Security for Wireless and Mobile Networks, Q2SWinet@MSWiM 2018, Montreal, QC, Canada, October 28 - November 02, 2018.",
                "count": 19,
                "papers": [
                    "Detecting Forwarding Misbehavior In Clustered IoT Networks.",
                    "TTBA: An RFID-based Tracking System for Two Basic Actions in Free-Weight Exercises.",
                    "Secure Management of Autonomous Vehicle Platooning.",
                    "A Novel Proactive Handover Scheme for Achieving Energy-Efficient Vehicular Networks.",
                    "Actor-Oriented Design Patterns for Performance Modeling of Wireless Communications in Cyber-physical Systems.",
                    "The Analysis of Synchronous All-to-All Communication Protocols for Wireless Systems.",
                    "Interference Comparison between OFDM & FH-OFDM Systems.",
                    "On TCP Simulation Fidelity in ns-2.",
                    "A Service Slicing Strategy with QoS for LTE-based Cellular Networks.",
                    "Local Topology Aware Probabilistic Routing.",
                    "MQTT+: Enhanced Syntax and Broker Functionalities for Data Filtering, Processing and Aggregation.",
                    "CEEPS4IoT: Context-aware Energy Efficient Publish/Subscribe for Internet of Things.",
                    "Athena: A Knowledge Fusion Algorithm for the Internet of Things.",
                    "Building a Coverage Hole-free Communication Tree.",
                    "Optimal Transmission Thresholds for QoS Guarantees in WSNs.",
                    "Evaluation of Channels Blacklists in TSCH Networks with Star and Tree Topologies.",
                    "An Energy-Efficient Node Deployment Strategy for Energy Harvesting-aided Wireless Sensor Networks.",
                    "Virtualized End-to-End Management Functions for Aggregated Control of Video Traffic Flows.",
                    "Joint Design of WiFi Mesh Network for Video Surveillance Application."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2018divanet",
                "sub_name": "Proceedings of the 8th ACM Symposium on Design and Analysis of Intelligent Vehicular Networks and Applications, DIVANet@MSWIM 2018, Montreal, QC, Canada, October 28 - November 02, 2018.",
                "count": 12,
                "papers": [
                    "A Deep Reinforcement Learning-based Trust Management Scheme for Software-defined Vehicular Networks.",
                    "Blockchain-Based Distributed Software-Defined Vehicular Networks via Deep Q-Learning.",
                    "Distributed SDN Controller Placement Using Betweenness Centrality & Hierarchical Clustering.",
                    "Information-Centric Strategies for Content Delivery in Intelligent Vehicular Networks.",
                    "Adaptive Forwarding Control using Network Coding for Efficient Multicasting in Mobile Ad-hoc Networks.",
                    "An Energy-efficient UAV-based Data Aggregation Protocol in Wireless Sensor Networks.",
                    "Multi-objective Approaches to Improve QoS in Vehicular Ad-hoc Networks.",
                    "Congestion Mitigation in Densely Crowded Environments for Augmenting QoS in Vehicular Clouds.",
                    "An Adaptive Power Level Control Algorithm for DSRC Congestion Control.",
                    "Optimized Anonymity Updating in VANET Based on Information and Privacy Joint Metrics.",
                    "Energy Trade-offs in Millimeter Wave Vehicular Networks by exploiting a Hyperfractal Model.",
                    "PlaSA - Platooning Service Architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2018",
                "sub_name": "Proceedings of the 15th ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, PE-WASUN@MSWiM 2018, Montreal, QC, Canada, October 28 - November 02, 2018.",
                "count": 19,
                "papers": [
                    "Session details: Session1: Ad Hoc Networks and Energy Efficiency.",
                    "Multi Channel Allocation and Congestion Control for Smart Grid Neighborhood Area Networks.",
                    "Real-time Power-splitting with Relay Selection Scheme for Wireless Multi-terminal DF-UWB Relay Network.",
                    "For An Efficient Internet of Bikes: A DTN Routing Protocol Based On Data Aggregation Approach.",
                    "Mobility Network Model for Full Electric Vehicles to Interoperate with the Smart Grid and Efficiently Manage the Power Supply in the Smart City.",
                    "Session details: Session 2: Vehicular Ad Hoc Networks.",
                    "3MRP+: An Improved Multimetric Geographical Routing Protocol for VANETs.",
                    "VTM: Vehicular Traffic Monitor via Images Processing of GoogleMaps.",
                    "An Efficient Movement-Based Handover Prediction Scheme for Hierarchical Mobile IPv6 in VANETs.",
                    "Session details: Session 3: Heterogeneous Ad Hoc Networks.",
                    "Considering Frame Aggregation in Association Optimization for High Throughput Wi-Fi Networks.",
                    "Performance Analysis of a Network Sensor's Packet Processing System using Generalized Stochastic Petri Nets.",
                    "Ubiquitous System to Monitor Transport and Logistics.",
                    "Ubiquitous Collision Avoidance System for Red Light Running.",
                    "Session details: Session 4: Wireless Sensor Networks.",
                    "Local Algorithms for Sensor Selection.",
                    "Network Dynamics Analysis and Benchmarking on an Outdoor Heterogeneous Wireless Sensor Network.",
                    "Sparse Representation of Sensor Network Signals Based on the K-SVD Algorithm.",
                    "Understanding the Impact of Circuit-Level Inaccuracy on Sensor Network Performance."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "20th MSWiM 2017",
        "info": "Miami, FL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2017",
                "sub_name": "Proceedings of the 20th ACM International Conference on Modelling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2017, Miami, FL, USA, November 21 - 25, 2017.",
                "count": 43,
                "papers": [
                    "Provisioning and Management of Internet of Things Applications: Open Issues and Insights.",
                    "Fundamental Concepts, Problems and Algorithms for Wireless Power Transfer in Adhoc Communication Networks.",
                    "Data Collection in Underwater Wireless Sensor Networks: Research Challenges and Potential Approaches.",
                    "Optimal Mapping of Stations to Access Points in Enterprise Wireless Local Area Networks.",
                    "Semi-Blind Interference Prediction in Wireless Networks.",
                    "LABeL: Link-based Adaptive BLacklisting Technique for 6TiSCH Wireless Industrial Networks.",
                    "WiFO: A Hybrid WiFi Free-Space Optical Communication Networks of Femtocells.",
                    "The Importance of Adjacent Channel Interference: Experimental Validation of ns-3 for Dense Wi-Fi Networks.",
                    "Carrier-Sense Multiple Access with Collision Avoidance and Detection.",
                    "Multi-Channel Continuous Rendezvous in Cognitive Networks.",
                    "Rendezvous with Utilities in Cognitive Radio Networks.",
                    "Improving BLE Distance Estimation and Classification Using TX Power and Machine Learning: A Comparative Analysis.",
                    "GRM: Group Regularity Mobility Model.",
                    "Quality of Experience-Aware Mobile Edge Caching through a Vehicular Cloud.",
                    "Cost-Effective Processing in Fog-Integrated Internet of Things Ecosystems.",
                    "QoS-Aware Task Offloading in Distributed Cloudlets with Virtual Network Function Services.",
                    "Providing Computing Services through Mobile Devices in a Collaborative Way - A Fog Computing Case Study.",
                    "Hardening Opportunistic HIP.",
                    "DADCA: An Efficient Distributed Algorithm for Aerial DataCollection from Wireless Sensors Networks by UAVs.",
                    "Experimental Study of Packet Loss in a UWB Sensor Network for Aircraft.",
                    "Lifetime-Aware Data Collection Using a Mobile Sink in WSNs with Unreachable Regions.",
                    "Serial In-network Processing for Large Stationary Wireless Sensor Networks.",
                    "Live Synthesis of Vehicle-Sourced Data Over 4G LTE.",
                    "Performance Model for 4G/5G Heterogeneous Networks with Different Classes of Users.",
                    "Joint User Association and Backhaul Routing for Green 5G Mesh Millimeter Wave Backhaul Networks.",
                    "Acrux: Indoor Localization Without Strings.",
                    "Pre-Crowdsourcing: Predicting Wireless Propagation with Phone-Based Channel Quality Measurements.",
                    "Rate-Compatible Transmission Schemes Based on Parallel Concatenated Punctured Polar Codes.",
                    "An Uncertain Continuous Collaborative Users Finding Algorithm for Location Privacy Protection.",
                    "Reverse Engineering Human Mobility in Large-scale Natural Disasters.",
                    "SMAFramework: Urban Data Integration Framework for Mobility Analysis in Smart Cities.",
                    "Inferring Private Demographics of New Users in Recommender Systems.",
                    "Scheduling Nodes in Underwater Networks using Voronoi Diagram.",
                    "Energy-efficient HTTP Adaptive Streaming with Anticipated Channel Throughput Prediction in Wireless Networks.",
                    "GeoRIPE: Efficiently Harvesting Field Measurements for Map-Based Path Loss Modeling.",
                    "INDIGO: Interest-Driven Data Dissemination Framework for Mobile Networks.",
                    "Synchronizing Tiny Sensors with SISP: A Convergence Study.",
                    "REPSYS: A Robust and Distributed Reputation System for Delay-Tolerant Networks.",
                    "Cross Fertilization Between Wireless Testbeds and NS-3 Simulation Models.",
                    "Tracking You through DNS Traffic: Linking User Sessions by Clustering with Dirichlet Mixture Model.",
                    "CESAR: A Testbed Infrastructure to Evaluate the Efficiency of Wireless Automotive Software Updates.",
                    "Ensuring the Reliability of an Autonomous Vehicle: A Formal Approach based on Component Interaction Protocols.",
                    "Attraction-Area Based Geo-Clustering for LTE Vehicular CrowdSensing Data Offloading."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2017q",
                "sub_name": "Proceedings of the 13th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Q2SWinet@MSWiM 2017, Miami, FL, USA, November 21 - 25, 2017.",
                "count": 16,
                "papers": [
                    "Mitigating Selective Jamming Attacks in Smart Meter Data Collection using Moving Target Defense.",
                    "Proactive Certificate Distribution for PKI in VANET.",
                    "An Efficient Source Anonymity Technique based on Exponential Distribution against a Global Adversary Model using Fake Injections.",
                    "An Empirical Characterization of Internet Round-Trip Times.",
                    "A Reusable Component-Based Model for WSN Storage Simulation.",
                    "Analysis of Underwater Target Detection Probability by Using Autonomous Underwater Vehicles.",
                    "Reactive Routing Protocol for Event Reporting in Mobile-Sink Wireless Sensor Networks.",
                    "Heuristic and Meta-Heuristic Approaches for Energy-Efficient Coverage-Preserving Protocols in Wireless Sensor Networks.",
                    "System Level Evaluation and Validation of the ns-3 LTE Module in 3GPP Reference Scenarios.",
                    "Mobile Matrix: A Multihop Address Allocation and Any-to-Any Routing in Mobile 6LoWPAN.",
                    "Location-based Mechanism for Positioning of a Mobile Relay.",
                    "Mining Historical Data towards Interference Management in Wireless SDNs.",
                    "Spatio-Temporal Compressive Sensing Technique for Data Gathering and Anomaly Detection in Wireless Sensor Networks.",
                    "Distributed Coordinate-free Boundary Nodes Identification in Wireless Sensor Networks.",
                    "Priority Aware Interference Mitigation Techniques for Coexistence of Wireless Technologies in Smart Utility Networks.",
                    "Network Coding for 5G Network and D2D Communication."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2017divanet",
                "sub_name": "Proceedings of the 6th ACM Symposium on Development and Analysis of Intelligent VehicularNetworks and Applications, MSWiM 2017, Miami, FL, USA, November 21-25, 2017.",
                "count": 19,
                "papers": [
                    "Spatially Adaptive Positioning for Molecular Geometry Inspired Aerial Networks.",
                    "Tracking Vehicles Equipped with Dedicated Short-Range Communication at Traffic Intersections.",
                    "SoLVE: A Localization System Framework for VANets using the Cloud and Fog Computing.",
                    "On the Characterization of Vehicular Mobility.",
                    "A Lightweight and Efficient Approach (LEA) for Hovering Information protocols.",
                    "nlsrSIM: Porting and Simulation of Named-data Link State Routing Protocol into ndnSIM.",
                    "Deep Reinforcement Learning (DRL)-based Resource Management in Software-Defined and Virtualized Vehicular Ad Hoc Networks.",
                    "QoS-oriented Management of Multi-vehicle Coordinated Cruise Control in Uncertain Environments.",
                    "Performance Analysis of Communication Networks for EV Charging Stations in Residential Grid.",
                    "Resource Allocation in Software Defined Fog Vehicular Networks.",
                    "Vehicular Clouds Research: What is Missing?",
                    "The Cooperative Vehicle Infrastructure System Based on Machine Vision.",
                    "Utilizing Advanced Metering Infrastructure to Build a Public Key Infrastructure for Electric Vehicles.",
                    "Mass Configuration with Confirmation in Tactical Networks.",
                    "Detection and Avoidance of Wormhole Attacks in Connected Vehicles.",
                    "Addressing the Effects of Low Vehicle Density in Highly Mobile Vehicular Named-Data Networks.",
                    "Implementation and Performance Assessment of Location-based Routing Protocols for MANETs.",
                    "Using Probabilistic Estimates to Guarantee Reliability in Crossroad VANETs.",
                    "Modeling, Analysis and Simulation of Wireless Power Transfer."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2017",
                "sub_name": "Proceedings of the 14th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, PE-WASUN 2017, Miami, FL, USA, November 21 - 25, 2017.",
                "count": 12,
                "papers": [
                    "Carrier Resolution Multiple Access.",
                    "CTMA: A More Efficient Channel Access Method for Networks with Hidden Terminals.",
                    "Revisiting the Analytical Modeling of the IEEE 802.11 Power Save Mode for Independent Basic Service Sets (IBSS).",
                    "Performance Analysis of Modified IEEE 802.15.4e MAC for Wireless Sensor Networks.",
                    "Moving Towards Wireless Sensors using RSSI Measurements and Particle Filtering.",
                    "Control of a Remote Swarm of Drones/Robots Through a Local (Possibly Model) Swarm: Qualitative and Quantitative Issues.",
                    "REPRO: Time-constrained Data Retrieval for Edge Offloading in Vehicular Clouds.",
                    "FinalComm: Leveraging Dynamic Communities to Improve Forwarding in DTNs.",
                    "On the Energy Efficiency and Performance of Neighbor Discovery Schemes for Low Duty Cycle IoT Devices.",
                    "Performance Evaluation of a Battery-Free Videogame Controller.",
                    "On the Performance Evaluation of Distributed Resource Block and Power Allocation in D2D-enabled Multi-Cell Networks.",
                    "Towards Multi-instances QoS Efficient RPL for Smart Grids."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "19th MSWiM 2016",
        "info": "Malta",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2016",
                "sub_name": "Proceedings of the 19th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2016, Malta, November 13-17, 2016.",
                "count": 48,
                "papers": [
                    "Privacy Challenges in Mobile and Pervasive Networks.",
                    "Use of Optimization Models for Resource Allocation in Wireless Ad-Hoc and Sensor Networks.",
                    "Theoretical Interference Analysis of Inter-vehicular Communication at Intersection with Power Control.",
                    "Effective Selection of Targeted Advertisements for Vehicular Users.",
                    "A Fully-distributed Traffic Management System to Improve the Overall Traffic Efficiency.",
                    "Revisiting 802.11 Rate Adaptation from Energy Consumption's Perspective.",
                    "Energy Efficiency in Mixed Access Networks.",
                    "Energy Aware Network Formation in Peer-to-Peer Wireless Power Transfer.",
                    "Passive Classification of Wi-Fi Enabled Devices.",
                    "Do LoRa Low-Power Wide-Area Networks Scale?",
                    "Impact of Time in Network Selection for Mobile Nodes.",
                    "Evaluating Video Dissemination in Realistic Urban Vehicular Ad-Hoc Networks.",
                    "T-SIMn: Towards the High Fidelity Trace-Based Simulation of 802.11n Networks.",
                    "Preference and Mobility-Aware Task Assignment in Participatory Sensing.",
                    "Experimental Validation of a Distributed Self-Configured 6TiSCH with Traffic Isolation in Low Power Lossy Networks.",
                    "A Novel Semi-Supervised Adaboost Technique for Network Anomaly Detection.",
                    "An Approach to Rule Placement in Software-Defined Networks.",
                    "Association Optimization in Wi-Fi Networks: Use of an Access-based Fairness.",
                    "Performance-Energy Trade-offs in Smartphones.",
                    "A Novel Service-oriented Architecture for Information-Centric Vehicular Networks.",
                    "Formal Analysis and Verification of the IEEE 802.15.4 DSME Slot Allocation.",
                    "Analytical Models for QoS-driven VNF Placement and Provisioning in Wireless Carrier Cloud.",
                    "Modeling and Analysis: Energy Harvesting in the Internet of Things.",
                    "Holistic Small Cell Traffic Balancing across Licensed and Unlicensed Bands.",
                    "Learning-Based Resource Allocation Scheme for TDD-Based 5G CRAN System.",
                    "Backhaul Routing and Base Station Sleep Mode Engagement in Energy Harvesting Cellular Networks.",
                    "Characterizing User Activity in WiFi Networks: University Campus and Urban Area Case Studies.",
                    "An Experimental Study of Cross-Technology Interference in In-Vehicle Wireless Sensor Networks.",
                    "A Novel Centrality Metric for Topology Control in Underwater Sensor Networks.",
                    "A Slot Sharing TDMA Scheme for Reliable and Efficient Collision Resolution in WSNs.",
                    "Multisensor Data Fusion for Patient Risk Level Determination and Decision-support in Wireless Body Sensor Networks.",
                    "On Optimal Charger Positioning in Clustered RF-power Harvesting Wireless Sensor Networks.",
                    "Examining Relationships Between 802.11n Physical Layer Transmission Feature Combinations.",
                    "Making On-Demand Routing Efficient with Route-Request Aggregation.",
                    "Neighbor Contamination to Achieve Complete Bottleneck Control.",
                    "Distributionally Robust Relay Beamforming in Wireless Communications.",
                    "Control-theoretic Scalable Device-to-Device Offloading System for Video Streaming Services.",
                    "Performance of D2D Underlay and Overlay for Elastic Traffic.",
                    "A Virtual Local-hub Solution with Function Module Sharing for Wearable Devices.",
                    "Dynamic Adaptive Access Barring Scheme For Heavily Congested M2M Networks.",
                    "A Real-time Indoor Tracking System in Smartphones.",
                    "Matrix: Multihop Address Allocation and Dynamic Any-to-Any Routing for 6LoWPAN.",
                    "Updating Wireless Signal Map with Bayesian Compressive Sensing.",
                    "An Energy-Detection-Based Cooperative Spectrum Sensing Scheme for Minimizing the Effects of NPEE and RSPF.",
                    "Dynamic Sensitivity Control to improve Spatial Reuse in Dense Wireless LANs.",
                    "Normalization of Application Performance in IEEE 802.11 Networks.",
                    "An Efficient Content Delivery Infrastructure Leveraging the Public Transportation Network.",
                    "Coverage Properties of One-Dimensional Infrastructure-Based Wireless Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2016q",
                "sub_name": "Proceedings of the 12th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Q2SWinet@MSWiM 2016, Malta, Malta, November 13-17, 2016.",
                "count": 18,
                "papers": [
                    "A Hybrid Storage Service for the Management of Big e-Health Data: A Tele-Rehabilitation Case of Study.",
                    "Profitable Task Allocation in Mobile Cloud Computing.",
                    "Decoupled Uplink/Downlink User Association in HetNets: A Matching with Contracts Approach.",
                    "Preserving Location Privacy in Radio Networks Using a Stackelberg Game Framework.",
                    "An Authentication and Authorization Infrastructure for the Web of Things.",
                    "A Distributed and Adaptive Trust Evaluation Algorithm for MANET.",
                    "Exploitation of Dual Channel Transmissions to Increase Security and Reliability in Classic Bluetooth Piconets.",
                    "Energy-efficient Multicast Screen Mirroring for QoS Support over WiFi Network.",
                    "SINR and Reliability based Hidden Terminal Estimation for Next Generation Vehicular Networks.",
                    "Lifetime-Aware Clustering and DAG-Based Routing in WSNs.",
                    "Optimal eNodeB Estimation for 5G Intra-Macrocell Handover Management.",
                    "Towards Future Situation-Awareness: A Conceptual Middleware Framework for Opportunistic Situation Identification.",
                    "Anti-Starvation Channel Assignment With Global Conflict Set Selection in IEEE 802.11 WMNs.",
                    "Wireless Network MAC Layer Performance Evaluation with Full-Duplex Capable Nodes.",
                    "Evaluation of the Power Consumption of Image Descriptors on Smartphone Platforms.",
                    "A Comparative Study of Data Aggregation Approaches for Wireless Sensor Networks.",
                    "Internet of Things: Security in the Keys.",
                    "How Interactions between RPL and Radio Duty Cycling Protocols Affect QoS in Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2016divanet",
                "sub_name": "Proceedings of the 6th ACM Symposium on Development and Analysis of Intelligent Vehicular Networks and Applications, DIVANet 2016, Malta, November 13-17, 2016.",
                "count": 16,
                "papers": [
                    "Random Access Optimization for M2M Communications in VANET with Wireless Network Virtualization.",
                    "From Random Process to Chaotic Behavior in Swarms of UAVs.",
                    "Paving the way for Intelligent Transport Systems (ITS): Privacy Implications of Vehicle Infotainment and Telematics Systems.",
                    "Identifying Relationships in Vehicular Sensor Data: A Case Study and Characterization.",
                    "Software-defined Vehicular Ad Hoc Networks with Trust Management.",
                    "A Media-Aware Transmission Framework for 3D-HEVC Over LTE Networks.",
                    "Vehicular Digital Forensics: What Does My Vehicle Know About Me?",
                    "Delay Tolerant and Predictive Data Dissemination Protocol (DTP-DDP) for urban and highway vehicular ad hoc networks (VANETs).",
                    "The Effect of Hidden Terminal Interference on Safety-Critical Traffic in Vehicular Ad Hoc Networks.",
                    "LOGR: Joint LOcalization and Geographic Routing-based Data Dissemination in Wireless Sensor Networks with Mobile Sinks.",
                    "On Developing Smart Transportation Applications in Fog Computing Paradigm.",
                    "A Deployment Algorithm for Multi-hop Wireless Networks.",
                    "Effect of Traffic Arrival Distributions on Routing Strategyin Multi-Hop Wireless Networks.",
                    "Simulating Wireless Links Within a Dynamic Environment.",
                    "Performance Evaluation of Link Metrics in Vehicle Networks: A Study from the Cologne Case.",
                    "Power in Silence: Revealing the Stationarity of Private-owned Vehicle in Urban Vehicular Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "18th MSWiM 2015",
        "info": "Cancun, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2015",
                "sub_name": "Proceedings of the 18th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2015, Cancun, Mexico, November 2-6, 2015.",
                "count": 45,
                "papers": [
                    "AVANET Services, Autonomous Vehicles and the Mobile Cloud.",
                    "Unleashing the True Power of Mobile Systems: Big Data and Analytics.",
                    "Deep Inspection of the Noise in WiFi Time-of-Flight Echo Techniques.",
                    "Delay Analysis for Wireless Fading Channels with Finite Blocklength Channel Coding.",
                    "Mechanisms for Multi-Packet Reception Protocols in Multi-Hop Networks.",
                    "Traversal Strategies for Wireless Power Transfer in Mobile Ad-Hoc Networks.",
                    "The Geometry-Based Statistical Modeling of MIMO Mobile-to-Mobile Channels Revisited.",
                    "Filling the Gaps of Vehicular Mobility Traces.",
                    "Rendezvous In Cognitive Radio Ad-Hoc Networks With Channel Ranking.",
                    "Optimal Rendezvous Strategies for Different Environments in Cognitive Radio Networks.",
                    "RFT: Identifying Suitable Neighbors for Concurrent Transmissions in Point-to-Point Communications.",
                    "Broadcast Strategies in Wireless Body Area Networks.",
                    "A Resilient Dynamic Gateway Selection Algorithm Based on Quality Aware Metrics for Smart Grids.",
                    "Modeling Multi-path TCP Throughput with Coupled Congestion Control and Flow Control.",
                    "Two-way Communications in Cognitive Personal Area Networks.",
                    "Two Hops or More: On Hop-Limited Search in Opportunistic Networks.",
                    "Modeling and Analysis of Opportunistic Routing in Low Duty-Cycle Underwater Sensor Networks.",
                    "Autoregressive Integrated Model for Time Synchronization in Wireless Sensor Networks.",
                    "Design and Evaluation of an RPL-based Multi-Sink Routing Protocol for Low-Power and Lossy Networks.",
                    "An Efficient Burst Transmission Scheme for Wireless Sensor Networks.",
                    "Connected P-Percent Coverage in Wireless Sensor Networks based on Degree Constraint Dominating Set Approach.",
                    "Minimizing Access Delay for M2M Traffic in Multi-RAT HetNets.",
                    "On the Design and Evaluation of Producer Mobility Management Schemes in Named Data Networks.",
                    "Stochastic Geometry Modeling of Cellular Networks: Analysis, Simulation and Experimental Validation.",
                    "SDN Based Control Plane Extensions for Mobility Management Improvement in Next Generation ETArch Networks.",
                    "Multiple Access Class Barring Factors Algorithm for M2M Communications in LTE-advanced Networks.",
                    "COExiST: Revisiting Transmission Count for Cognitive Radio Networks.",
                    "Communication and Block Game in Cognitive Radio Networks.",
                    "Protecting Location Information in Collaborative Sensing of Cognitive Radio Networks.",
                    "Rethinking the Importance of Accurately Simulating the Runtimes of Firmware used in Wireless Sensor Networks.",
                    "The Effect of Emerging Traffic Patterns on High Speed Wireless LANs.",
                    "Phase-based Ranging of RFID Tags with Applications to Shopping Cart Localization.",
                    "EasiPCC: Popularity-aware Collaborative Caching for Web Requests in Low-Duty-Cycle Sensor Networks.",
                    "Anticipatory Admission Control and Resource Allocation for Media Streaming in Mobile Networks.",
                    "Potential Game based Energy Efficient Resource Allocation in HeNB Networks.",
                    "Game-theoretic Analysis of Computation Offloading for Cloudlet-based Mobile Cloud Computing.",
                    "Energy-Efficient Model for Overlay Cognitive Communications.",
                    "5G MmWave Module for the ns-3 Network Simulator.",
                    "Data Dependency based Parallel Simulation of Wireless Networks.",
                    "A Computing Profiling Procedure for Mobile Developers to Estimate Energy Cost.",
                    "Modelling the Bandwidth Allocation Problem in Mobile Service-Oriented Networks.",
                    "Building a Large Dataset for Model-based QoE Prediction in the Mobile Environment.",
                    "A Bloom Filter-Based Algorithm for Routing in Intermittently Connected Mobile Networks.",
                    "Swift: A Hybrid Digital-Analog Scheme for Low-Delay Transmission of Mobile Stereo Video.",
                    "An Efficient Transmission Method for Bulk Data Based on Network Coding in Delay Tolerant Network."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2015",
                "sub_name": "Proceedings of the 12th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, & Ubiquitous Networks, PE-WASUN 2015, Cancun, Mexico, November 2-6, 2015.",
                "count": 15,
                "papers": [
                    "Reducing Duplicate Packets in Unicast VANET Communications.",
                    "Vehicular Cloud: Stochastic Analysis of Computing Resources in a Road Segment.",
                    "Understanding Interactions in Vehicular Networks Through Taxi Mobility.",
                    "DISCOVER: A Unified Protocol for Data Dissemination and Collection in VANETs.",
                    "Mechanisms for Improving the Scalable Video Streaming in Mobile Ad Hoc Networks.",
                    "Heuristic Methods in Geographical Routing Protocols for VANETs.",
                    "Performance Evaluation of OPS-SAP PAPR Reduction Technique in OFDM Systems in a Wireless Vehicular Context.",
                    "Taking Benefit from the User Density in Large Cities for Delivering SMS.",
                    "Evaluation of Advanced Congestion Control Mechanisms for Unreliable CoAP Communications.",
                    "Comparison of Application and Network Layer Name Resolution in Mobile Ad hoc Networks.",
                    "Large-Scale Performance Evaluation of the IETF Internet of Things Protocol Suite for Smart City Solutions.",
                    "Revisiting the Characterization and the Modeling of User Impatience in Ubiquitous Networks.",
                    "On the Effect of Black-hole Attack on Opportunistic Routing Protocols.",
                    "Performance Evaluation of Data Aggregation Functions using Markov Decision Processes.",
                    "Development and Evaluation of a High-Speed Simulator for Wireless Sensor Network Protocols using GPGPU."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2015q",
                "sub_name": "Proceedings of the 11th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Q2SWinet 2015, Cancun, Mexico, November 2-6, 2015.",
                "count": 23,
                "papers": [
                    "An Enhanced Quality of Context Evaluating Approach in the e-Health Sensor Platform.",
                    "Recommendations for IPsec Configuration on Homenet and M2M Devices.",
                    "Autonomic Management of Replica Voting based Data Collection Systems in Malicious Environments.",
                    "Spraying Techniques for Securing Key Exchange in Large Ad-hoc Networks.",
                    "On the Impact of Cross-Layer Information Leakage on Anonymity in Crowds.",
                    "A Proxy Gateway Solution to Provide QoS in Tactical Networks and Disaster Recovery Scenarios.",
                    "A Managing QoE Approach for Provisioning User Experience Aware Services Using SDN.",
                    "Evaluation of Quality Service Voice over Internet Protocol in WiMAX Networks based on IP/MPLS Environment.",
                    "Architectural Design of an Optimal Routed Network-based Mobility Management Function for SDN-based EPC Networks.",
                    "OMNeTA: A Hybrid Simulator for a Realistic Evaluation of Heterogeneous Networks.",
                    "Can We Predict Future Link States in Wireless Smart Grid?",
                    "Sharing the Cost of Lunch: Energy Apportionment Policies.",
                    "Inferring Smartphone Positions Based on Collecting the Environment's Response to Vibration Motor Actuation.",
                    "Location Assisted Coding (LAC): Embracing Interference in Free Space Optical Communications.",
                    "Reliability Evaluation of Imperfect K-Terminal Stochastic Networks using Polygon-to Chain and Series-parallel Reductions.",
                    "Bounding Degrees on RPL.",
                    "Performance Evaluation of the VB-TDMA Protocol for Long-term Tracking and Monitoring of Mobile Entities in the Outdoors.",
                    "An Open Source Platform for Perceived Video Quality Evaluation.",
                    "Noah: Keyed Noise Flooding for Wireless Confidentiality.",
                    "Secure and Error Resilient Approach for Multimedia Data Transmission in Constrained Networks.",
                    "Secure Routing against Wormhole Attack and Its Formal Verification based on Timed Colored Petri Net.",
                    "E-BIAS: A Pervasive EEG-Based Identification and Authentication System.",
                    "QoS Management for WiFi MAC Layer Processing in the Cloud: Demo Description."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2015divanet",
                "sub_name": "Proceedings of the 5th ACM Symposium on Development and Analysis of Intelligent Vehicular Networks and Applications, DIVANet 2015, Cancun, Mexico, November 2-6, 2015.",
                "count": 15,
                "papers": [
                    "Connectivity Stability in Autonomous Multi-level UAV Swarms for Wide Area Monitoring.",
                    "WhatIF Application: Moving Electrically without an Electric Vehicle.",
                    "Towards Efficient Vehicle Classification in Intelligent Transportation Systems.",
                    "Cooperative Spectrum Sensing with Trust Assistance for Cognitive Radio Vehicular Ad hoc Networks.",
                    "Improving the Performance of VANETs using Many-to-Many Communication.",
                    "Scalable Transportation Monitoring using the Smartphone Road Monitoring (SRoM) System.",
                    "HCI in VANET IR-CAS: Multimodal Interface for VANET Context Aware IR Systems.",
                    "Towards In Time Music Mood-Mapping for Drivers: A Novel Approach.",
                    "OnlineCruise: An Online Social Grouping Strategy for Vehicular Social Networks.",
                    "On the Provisioning of Vehicle-Based Public Sensing Services.",
                    "Smartphone-based Architecture for Smart Cities.",
                    "Geometry-Based Statistical Modeling of Non-Stationary MIMO Vehicle-to-Vehicle Channels.",
                    "An Efficient Pseudonym Change Protocol Based on Trusted Neighbours for Privacy and Anonymity in VANETs.",
                    "A Fuzzy Logic-Based Communication Medium Selection for QoS Preservation in Vehicular Networks.",
                    "Spectrum Access Quality for Mobile Broadband Video Communications in Smart Cities."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "17th MSWiM 2014",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2014",
                "sub_name": "17th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM'14, Montreal, QC, Canada, September 21-26, 2014.",
                "count": 46,
                "papers": [
                    "Wireless sensor networks in challenged environments such as underwater and underground.",
                    "DrySim: simulation-aided deployment-specific tailoring of mote-class WSN software.",
                    "Connectivity analysis of indoor wireless sensor networks using realistic propagation models.",
                    "TR-MAC: an energy-efficient MAC protocol exploiting transmitted reference modulation for wireless sensor networks.",
                    "Dirichlet's principle on multiclass multihop wireless networks: minimum cost routing subject to stability.",
                    "Energy-efficient multi-hop broadcasting in low power and lossy networks.",
                    "Wireless networking testbed and emulator (WiNeTestEr).",
                    "Exact analysis on network capacity of airborne MANETS with digital beamforming antennas.",
                    "Impact of node mobility on single-hop cluster overlap in vehicular ad hoc networks.",
                    "Entropy as a new metric for denial of service attack detection in vehicular ad-hoc networks.",
                    "Socially inspired data dissemination for vehicular ad hoc networks.",
                    "Semi-static interference coordination in OFDMA/LTE networks: evaluation of practical aspects.",
                    "Handoff rate analysis in heterogeneous cellular networks: a stochastic geometric approach.",
                    "Mobile device video caching to improve video qoe and cellular network capacity.",
                    "Towards mobility-aware predictive radio access: modeling; simulation; and evaluation in LTE networks.",
                    "Magic of wireless sensor networks.",
                    "Multi-channel slotted aloha optimization for machine-type-communication.",
                    "On optimal relay placement for improved performance in non-coverage limited scenarios.",
                    "Performance of simple polling MAC with wireless re-charging in the presence of noise.",
                    "Regret-based learning for medium access in LTE femtocell networks.",
                    "User satisfaction based joint user selection and beamforming in TD-LTE-A downlink.",
                    "Modeling of IEEE 802.11 multi-hop wireless chains with hidden nodes.",
                    "Interference-aware mesh multicast for wireless multihop networks.",
                    "Analysis of social structure and routing in human based delay tolerant network.",
                    "Efficient solutions for the authenticated fragmentation problem in delay- and disruption-tolerant networks.",
                    "Searching a needle in (linear) opportunistic networks.",
                    "Duty cycling in opportunistic networks: the effect on intercontact times.",
                    "A simple method for the deployment of wireless sensors to ensure full coverage of an irregular area with obstacles.",
                    "Organic wireless sensor networks: a resilient paradigm for ubiquitous sensing.",
                    "Transmission power control-based opportunistic routing for wireless sensor networks.",
                    "Imputing missing values in sensor networks using sparse data representations.",
                    "On control of inter-session network coding in delay-tolerant mobile social networks.",
                    "Space-time efficient wireless network coding.",
                    "Community-based forwarding for low-capacity pocket switched networks.",
                    "Lane detection and tracking system based on the MSER algorithm, hough transform and kalman filter.",
                    "Incorporating user motion information for indoor smartphone positioning in sparse Wi-Fi environments.",
                    "Extending wireless algorithm design to arbitrary environments via metricity.",
                    "Understanding the interactions of handover-related self-organization schemes.",
                    "FGPC: fine-grained popularity-based caching design for content centric networking.",
                    "Application caching for cloud-sensor systems.",
                    "Efficient data compression with error bound guarantee in wireless sensor networks.",
                    "Deterministic distributed rendezvous algorithms for multi-radio cognitive radio networks.",
                    "A semi-persistent scheduling scheme for videotelephony traffics in the uplink of LTE networks.",
                    "Channel capacity optimization for an integrated wi-fi and free-space optic communication system (WiFiFO).",
                    "Mobility in a large-scale WiFi network: from syslog events to mobile user sessions.",
                    "Demo abstract: realistic evaluation of kernel protocols and software defined wireless networks with DCE/ns-3."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2014",
                "sub_name": "Proceedings of the 11th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2014, Montreal, QC, Canada, September 21 - 26, 2014.",
                "count": 14,
                "papers": [
                    "How to choose the relevant MAC protocol for wireless smart parking urban networks?",
                    "Mobility-based opportunistic routing for mobile ad-hoc networks.",
                    "Studying traffic conditions by analyzing foursquare and instagram data.",
                    "Qos and network performance estimation in heterogeneous cellular networks validated by real-field measurements.",
                    "A distributed backbone-based framework for live video sharing in VANETs.",
                    "A predictive algorithm for mitigate swarming bees through proactive monitoring via wireless sensor networks.",
                    "Towards a simulation framework for paraglider networks.",
                    "Efficient coverage for grid-based mobile wireless sensor networks.",
                    "Bandwidth-efficient techniques for information dissemination in urban vehicular networks.",
                    "A self-adaptive data dissemination solution for intelligent transportation systems.",
                    "Realistic environment for VANET simulations to detect the presence of obstacles in vehicular ad hoc networks.",
                    "Evaluating metrics for optimal path selection in large wireless community networks.",
                    "Efficient deployment of gateways in multi-hop ad-hoc wireless networks.",
                    "Simulated analysis of connectivity issues for sleeping sensor nodes in the internet of things."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2014q",
                "sub_name": "Q2SWinet'14, Proceedings of the 10th ACM Symposium on QoS and Security for Wireless and Mobile Networks, Montreal, QC, Canada, September 21-22, 2014.",
                "count": 17,
                "papers": [
                    "Quality of experience-enabled social networks.",
                    "Qoe-based performance evaluation of video transmission using the BATMAN routing protocol.",
                    "Quality of service differentiation for smart grid neighbor area networks through multiple RPL instances.",
                    "Security and QoS tradeoff recommendation system (SQT-RS) for dynamic assessing CPRM-based systems.",
                    "HiveSign: dynamic message signatures for resource-constrained wireless networks.",
                    "Classification of technological privacy techniques for LTE-based public safety networks.",
                    "Data partitioning: an approach to preserving data privacy in computation offload in pervasive computing systems.",
                    "Patrolling wireless sensor networks: randomized intrusion detection.",
                    "MAC-TCP cross-layer attack and its defense in cognitive radio networks.",
                    "Trust-aware opportunistic routing protocol for wireless networks.",
                    "Undesired relatives: protection mechanisms against the evil twin attack in IEEE 802.11.",
                    "Secure IPsec based offload architectures for mobile data.",
                    "Design of a trust security model for smart meters in an urban power grid network.",
                    "Flow-level modeling and optimization of intercell coordination with dynamic TDD.",
                    "Storms in mobile networks.",
                    "Elastic virtual private cloud.",
                    "Traffic forecasting using a multi layer perceptron model."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2014divanet",
                "sub_name": "Proceedings of the fourth ACM international symposium on Development and analysis of intelligent vehicular networks and applications, DIVANet@MSWiM 2014, Montreal, QC, Canada, September 21-26, 2014.",
                "count": 23,
                "papers": [
                    "Swarm-based traffic lights policy selection.",
                    "Keypoint-based binocular distance measurement for pedestrian detection system.",
                    "Vehicular social systems: an overview and a performance case study.",
                    "Implementing and evaluating V2X protocols over iTETRIS: traffic estimation in the COLOMBO project.",
                    "Power efficient high-rate data service provisioning in vehicular networks.",
                    "A prediction based clustering algorithm for target tracking in vehicular ad-hoc networks.",
                    "CAMS transmission rate adaptation for vehicular safety application in LTE.",
                    "Sensor cloud computing for vehicular applications: from analysis to practical implementation.",
                    "Evaluating VANET information retrieval context aware systems using the average distance measure ADM.",
                    "Adapting to the driving context in congestion control for vehicular networks.",
                    "Towards a service centric contextualized vehicular cloud.",
                    "Improved multi-channel operation for safety messages dissemination in vehicular networks.",
                    "A model for situation and threat/impact assessment in vehicular ad-hoc networks.",
                    "Effective public key infrastructure for vehicle-to-grid network.",
                    "Trust based security enhancements for vehicular ad hocnetworks.",
                    "Propagation modeling and MAC-layer performance in EM-based underwater sensor networks.",
                    "An enhanced security scheme for query state inference in EPCglobal discovery services.",
                    "Content replication and delivery in vehicular networks.",
                    "Wireless channel resource allocation to support real-time transportation applications with multiple service classes.",
                    "Big data architecture evolution: 2014 and beyond.",
                    "Experimental evaluation of pulse-coupled oscillator synchronization in IEEE 802.15.4 networks.",
                    "Data synchronization via random network coding.",
                    "Primary-secondary resource-management on vehicular networks under soft and hard collision constraints."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "16th MSWiM 2013",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2013",
                "sub_name": "16th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM '13, Barcelona, Spain, November 3-8, 2013.",
                "count": 60,
                "papers": [
                    "Green wireless: towards minimum per-bit linear energy consumption in wireless communications.",
                    "How much can we gain by exploiting buffers in wireless relay networks?",
                    "Exploiting graph partitioning for hierarchical replica placement in WMNs.",
                    "Improving minimum flow rate in wireless mesh networks by effective placement of directional antennas.",
                    "Experimental evaluation of a wireless community mesh network.",
                    "On radio resource sharing in multi-antenna virtualized wireless networks.",
                    "Assessing the appropriateness of using markov decision processes for RF spectrum management.",
                    "Algorithms for channel assignment in mobile wireless networks using temporal coloring.",
                    "Femtocells sharing management using mobility prediction model.",
                    "An energy efficient adaptive HELLO algorithm for mobile ad hoc networks.",
                    "APDV: making distance vector routing scale using adaptive publish-subscribe mechanisms.",
                    "Performance evaluation of the anypath routing and forwarding mechanism AP-OLSR.",
                    "Sequence numbers do not guarantee loop freedom: AODV can yield routing loops.",
                    "Efficient, distributed coordination of multiple mobile chargers in sensor networks.",
                    "Performance evaluation of wireless sensor networks in realistic wildfire simulation scenarios.",
                    "Efficient data aggregation scheduling in wireless sensor networks with multi-channel links.",
                    "Optimal radius for connectivity in duty-cycled wireless sensor networks.",
                    "A multi-metric routing protocol with service differentiation for cognitive radio ad-hoc networks.",
                    "Performance modeling and analysis of IEEE 802.11 wireless networks with hidden nodes.",
                    "Hierarchical modeling of IEEE 802.11 multi-hop wireless networks.",
                    "Multiple-access channel capacity of diffusion and ligand-based molecular communication.",
                    "ATR-MAC: deadline driven data collection from smartmeters in absence of aggregation.",
                    "An intelligent routing scheme effectively utilizing mass storage embedded on satellites to mitigate network congestions.",
                    "Wake-up radio as an energy-efficient alternative to conventional wireless sensor networks MAC protocols.",
                    "Efficient algorithm for serial data fusion in wireless sensor networks.",
                    "Movement assisted-topology control and geographic routing protocol for underwater sensor networks.",
                    "Cooperative localization revisited: error bound, scaling, and convergence.",
                    "Voronoi trees for hierarchical in-network data and space abstractions in wireless sensor networks.",
                    "Indoor coverage estimation from unreliable measurements using spatial statistics.",
                    "An empirical study of link quality estimation techniques for disconnection detection in WBANs.",
                    "Equilibrium sensing time for distributed opportunistic access incognitive radio networks.",
                    "Understanding the benefits of open access in Femtocell networks: stochastic geometric analysis in the uplink.",
                    "Efficient energy management and data recovery in sensor networks using latent variables based tensor factorization.",
                    "A process algebraic framework for estimating the energy consumption in ad-hoc wireless sensor networks.",
                    "Energy management of networked, solar cells powered, wireless sensors.",
                    "Analytical revisit on the use of biased random walks for data forwarding in wireless sensor networks.",
                    "Cactus: a hybrid digital-analog wireless video communication system.",
                    "On the compound impact of opportunistic scheduling and D2D communications in cellular networks.",
                    "An open source model for the simulation of LTE handover scenarios and algorithms in ns-3.",
                    "ERCA: efficient and robust cipher algorithm for LTE data confidentiality.",
                    "A representative and accurate characterization of inter-contact times in mobile opportunistic networks.",
                    "A novel scheduling algorithm for densely-deployed wireless stations in urban areas.",
                    "RECAST: telling apart social and random relationships in dynamic networks.",
                    "Epidemic content distribution: empirical and analytic performance.",
                    "Gateway relocation avoidance-aware network function placement in carrier cloud.",
                    "How does interference dynamics influence packet delivery in cooperative relaying?",
                    "Efficient new delayed ACK for TCP: old problem, new insight.",
                    "Congestion control in reliable CoAP communication.",
                    "Analyzing the effect of client queue size on VoIP and TCP traffic over an IEEE 802.11e WLAN.",
                    "CEDO: content-centric dissemination algorithm for delay-tolerant networks.",
                    "Efficient relay deployment for controlling connectivity in delay tolerant mobile networks.",
                    "Measurement-based simulation of WiFi interference.",
                    "Energy saving strategies in WiFi indoor localization.",
                    "Solution of detecting jamming attacks in vehicle ad hoc networks.",
                    "On the selection of optimal broadcast schemes in VANETs.",
                    "Traffic aware video dissemination over vehicular ad hoc networks.",
                    "Distributed base station activation for energy-efficient operation of cellular networks.",
                    "Modelling and analysis of link adaptation for LTE-advanced.",
                    "Channel fading impact on multi-hop DSRC safety communication.",
                    "SA and PSO assisted joint scheme of channel estimation and PPIC for MIMO-SDMA/OFDM system."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2013",
                "sub_name": "Proceedings of the 10th ACM Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2013, Barcelona, Spain, November 3-8, 2013.",
                "count": 21,
                "papers": [
                    "Cloud-assisted buffer management for HTTP-based mobilevideo streaming.",
                    "A qualitative analysis on the impacts of assured quality internet interconnection.",
                    "Fast and reliable robot deployment for substitution networks.",
                    "Topology control for wireless mesh networks based on centrality metrics.",
                    "Design and implementation of architecture for multi-robot cooperation in the context of WSN.",
                    "Delay distribution of IEEE802.11 DCF: a comparative studyunder saturated conditions.",
                    "Secure handoffs for V2I communications in 802.11 networks.",
                    "A performance study of practical channel assignment solutions in multi-radio multi-hop IEEE 802.11 networks.",
                    "Analysis of energy efficient OLSR extensions and OLSR-EXT energetic optimization proposal.",
                    "A learning-based algorithm for optimal mac parameters setting in IEEE 802.15.4 wireless sensor networks.",
                    "An error-free data collection method exploiting hierarchical physical models of wireless sensor networks.",
                    "A timed petri net model for frame transmission on IEEE 802.15.4 beacon-enabled mode.",
                    "Dynamic energy aware data gathering strategy for wireless sensor networks.",
                    "Prolonging wireless sensor network lifetime in stealth mode through intelligent data compression.",
                    "WSN-inspired sleep protocols for heterogeneous LTE networks.",
                    "A geometry-based coverage strategy over urban VANETs.",
                    "Improving security in data-centric storage for wireless sensor networks.",
                    "CACBR: context aware community based routing for intermittently connected network.",
                    "On the impact of network topology on wireless sensornetworks performances: illustration with geographic routing.",
                    "Lifetime improvement method using mobile sink for IoT service.",
                    "Towards measurement-based self-management of performance properties in wireless sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2013hpmosys",
                "sub_name": "2nd ACM Workshop on High Performance Mobile Opportunistic Systems, HP-MOSys 2013, in conjunction with MSWiM '13, Barcelona, Spain, November 7, 2013.",
                "count": 12,
                "papers": [
                    "Agent-based multicast opportunistic routing protocol for wireless networks.",
                    "A study to understand the impact of node density on data dissemination time in opportunistic networks.",
                    "Dynamic group-finding in public bus networks.",
                    "Context-based opportunistic forwarding in multi-hop cellular networks using mobile relays.",
                    "Reaching for the clouds: contextually enhancing smartphones for energy efficiency.",
                    "Opportunistic message routing using multi-layer social networks.",
                    "Reinforcement learning in hierarchical cognitive radio wireless networks.",
                    "Opportunistic bi-directional scheduling under quality of experience demands.",
                    "Performance evaluation of dynamic cloud resource migration based on temporal and capacity-aware policy for efficient resource sharing.",
                    "Traffic shaping measurements and analyses in 3G network.",
                    "Optimizing radio resource management in energy-efficient cognitive radio networks.",
                    "Foreseen risks for network coding based surveillance applications."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2013pm2",
                "sub_name": "Proceedings of the 8th ACM Workshop on Performance Monitoring and Measurement of Heterogeneous Wireless and Wired Networks, PM2HW2N 2013, Barcelona, Spain, November 3-8, 2013.",
                "count": 29,
                "papers": [
                    "IEEE 802.11n dual band access points for boosting the performance of heterogeneous WiFi networks.",
                    "Alias resolution techniques: long-term analysis of alias stability in internet routers.",
                    "Network layer soft handoff for IP mobility.",
                    "Empirical performance models for P2P and two hops multi-hop cellular networks with mobile relays.",
                    "Performance evaluation of EpiChord under high churn.",
                    "Analyzing temporal metrics of public transportation for designing scalable delay-tolerant networks.",
                    "A reusable and extendable testbed for implementation and evaluation of cooperative sensing.",
                    "AEERP: AUV aided energy efficient routing protocol for underwater acoustic sensor network.",
                    "STEAM-Sim: filling the gap between time accuracy and scalability in simulation of wireless sensor networks.",
                    "Modeling CSMA/CA network under asymmetric conditions.",
                    "Modeling and simulation of agent-based complex systems and application to natural disasters.",
                    "Development of distributed and self-organized physical cell identity assignment schemes for LTE-advanced systems.",
                    "Mining associated sensor patterns for data stream of wireless sensor networks.",
                    "A study on the radio coverage in underground stations of the new copenhagen metro system.",
                    "Feedback-based cooperative content distribution for mobile networks.",
                    "On estimating the end-to-end bandwidth in multi-transceiver multi-hop cognitive radio networks.",
                    "System level simulation to evaluate the interference in macrocell-picocell downlink systems.",
                    "Modeling the performance and the energy usage of wireless sensor networks by retrial queueing systems.",
                    "Signaling game-based approach to power control management in wireless networks.",
                    "On-the-fly VoIP call quality evaluation with improved E-model.",
                    "Examining vicinity dynamics in opportunistic networks.",
                    "Performance evaluation of handoff algorithms applied in vehicular 60GHz radio-over-fiber networks.",
                    "Radio channel characterization of a metal bridge segment at 868MHz and 2.4GHz.",
                    "QoE-aware priority marking and traffic management for H.264/SVC-based mobile video delivery.",
                    "Adaptive multihop scheduling for IEEE 802.11s multiradio cognitive wireless mesh networks.",
                    "Dynamic frequency scaling on android platforms for energy consumption reduction.",
                    "A distributed hierarchical clustering algorithm for large-scale dynamic networks.",
                    "Performances of trigonometric chirp spread spectrum modulation in AWGN & rayleigh channels.",
                    "Localization in IEEE 802.11 networks by using the nelder-mead method."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2013divanet",
                "sub_name": "Proceedings of the third ACM international symposium on Design and analysis of intelligent vehicular networks and applications, DIVANet@MSWiM 2013, Barcelona, Spain, November 3-4, 2013.",
                "count": 21,
                "papers": [
                    "Available bandwidth estimation in GPSR for VANETs.",
                    "Improving throughput in highway transportation systems by entry control and virtual queue.",
                    "Dual-mode optimum distance routing scheme for vehicular ad hoc networks.",
                    "An efficient fault detection and diagnosis protocolfor vehicular networks.",
                    "Decision support protocol for intrusion detection in VANETs.",
                    "Privacy representation in VANET.",
                    "Security and privacy of electric vehicles in the smart grid context: problem and solution.",
                    "Securing vehicular ad hoc networks with mean field game theory.",
                    "Web services for VANET: a service oriented architecturefor infotainment system based on mashup using open APIs.",
                    "Semantic based networking of information in vehicular clouds based on dimensionality reduction.",
                    "Investigating mobile crowdsensing application performance.",
                    "Social drive: a crowdsourcing-based vehicular social networking system for green transportation.",
                    "Evaluation of dynamic communities in large-scale vehicular networks.",
                    "The emerging applications of intelligent vehicular networks for traffic efficiency.",
                    "Smart parking by the COIN.",
                    "Data dissemination for delay tolerant vehicular networks: using historical mobility patterns.",
                    "Assessing the impact of obstacle modeling accuracy on IEEE 802.11p based message dissemination.",
                    "Cross-layer transmit power and beacon rate adaptation for VANETs.",
                    "Network based mobility management protocol for ethernet passive optical networks.",
                    "A distributed clustering algorithm for target tracking in vehicular ad-hoc networks.",
                    "A new solution for the time-space localization problem in wireless sensor network using UAV."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "15th MSWiM 2012",
        "info": "Paphos, Cyprus",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2012",
                "sub_name": "The 15th ACM International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems, MSWiM '12, Paphos, Cyprus, October 21-25, 2012.",
                "count": 52,
                "papers": [
                    "Modeling and optimization of vehicular wireless ad-hoc networks.",
                    "Sensing, tracking and contextualizing entities in ubiquitous computing.",
                    "Influence of spatial statistics of spectrum use on the performance of cognitive wireless networks.",
                    "A class of backpressure algorithms for networks embedded in hyperbolic space with controllable delay-throughput trade-off.",
                    "Model-based analysis of a protocol for reliable communication in railway worksites.",
                    "Extending graph-based models of wireless network structure with dynamics.",
                    "Investigating the interacting two-way tcp connections over 3GPP LTE networks.",
                    "Increasing the performance of HSDPA with high-speed single frequency network.",
                    "A lightweight and accurate link abstraction model for the simulation of LTE networks in ns-3.",
                    "An analytical model for content dissemination in opportunistic networks using cognitive heuristics.",
                    "CRISP: collusion-resistant incentive-compatible routing and forwarding in opportunistic networks.",
                    "A social node model for realising information dissemination strategies in delay tolerant networks.",
                    "Lifetime aware deployment of k base stations in WSNs.",
                    "Interference-free scheduling with bounded delay in cluster-tree wireless sensor networks.",
                    "Coverage management for mobile targets in visual sensor networks.",
                    "A lifetime enhancing node deployment strategy using heterogeneous nodes in WSNs for coal mine monitoring.",
                    "Migrating operator placement for compositional stream graphs.",
                    "A novel sensor node relocation approach to maintain connectivity with a center of interest.",
                    "A 2-dimensional approach to QoS provisioning in adversarial mobile ad hoc network environments.",
                    "Evaluating resistance to jamming and casual interception in mobile wireless networks.",
                    "Evaluation of collaborative selfish node detection in MANETS and DTNs.",
                    "Security evaluation methodology for intrusion recovery protocols in wireless sensor networks.",
                    "RVIP: bridging live networks and software virtual networks for large scale network simulation at real time.",
                    "Modeling of correlated large scale channel parameters for system level simulations of mobile radio networks.",
                    "TimeSync: enabling scalable, high-fidelity hybrid network emulation.",
                    "Modeling and connectivity analysis in obstructed wireless ad hoc networks.",
                    "A rigorous analysis of AODV and its variants.",
                    "VCM: the vector-based coloring method for grid wireless ad hoc and sensor networks.",
                    "Relay-aided high-throughput path selection in multi-rate wireless mesh networks.",
                    "Energy-efficient three-phase task scheduling heuristic for supporting distributed applications in cyber-physical systems.",
                    "Dynamic TXOP HCCA reclaiming scheduler with transmission time estimation for IEEE 802.11e real-time networks.",
                    "On bounding the number of mobiles sharing a slot in a point-to-multipoint network.",
                    "Joint frequency assignment and optimal association of stations to access points in IEEE 802.11 WLAN.",
                    "Traffic-aware channel width adaptation in long-distance 802.11 mesh networks.",
                    "Efficient conditional-probability link modeling capturing temporal variations in body area networks.",
                    "Characterisation and application of idle period durations in IEEE 802.11 DCF-based multihop wireless networks.",
                    "Modelling and analysis of the split phase multi-channel MAC approach.",
                    "Towards trustworthy simulation of wireless MAC/PHY layers: a comparison framework.",
                    "Measuring channel occupancy for 802.11 wireless LAN in the 2.4 GHz ISM band.",
                    "Efficient energy management in wireless rechargeable sensor networks.",
                    "Transmission range adaptation based energy efficient neighborhood discovery.",
                    "Characterization of 3G control-plane signaling overhead from a data-plane perspective.",
                    "Combining local and global profiles for mobility prediction in LTE femtocells.",
                    "A reactive solution with a redundancy-based error correction mechanism for video dissemination over vehicular ad hoc networks.",
                    "An efficient qos based gateway selection algorithm for VANET to LTE advanced hybrid cellular network.",
                    "Enabling mobile distributed social networking on smartphones.",
                    "SAGA: socially- and geography-aware mobility modeling framework.",
                    "Understanding and modeling the small-world phenomenon in dynamic networks.",
                    "Adaptive neighbor discovery for mobile and low power wireless sensor networks.",
                    "Routing through holes in wireless sensor networks.",
                    "S-NC: structure-free network coding-aware routing in wireless sensor networks.",
                    "Distributed opportunistic and diffused coding with multiple decoders in wireless mesh networks."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2012",
                "sub_name": "Proceedings of the 9th ACM Symposium on Performance evaluation of wireless ad hoc, sensor, and ubiquitous networks, PE-WASUN 2012, Paphos, Cyprus, October 21-25, 2012.",
                "count": 17,
                "papers": [
                    "Loss reasons in safety VANETs and implications on congestion control.",
                    "Deployable aerial communication networks: challenges for futuristic applications.",
                    "Population protocols on real social networks.",
                    "Efficient measurements of IP level performance to drive interface selection in heterogeneous wireless networks.",
                    "Symptotics: a framework for analyzing the scalability of real-world wireless networks.",
                    "An efficient and robust data dissemination protocol for vehicular ad hoc networks.",
                    "Evaluation of a redirection technique in cooperative caching for MANETs.",
                    "Channel assignment strategies for optimal network capacity of IEEE 802.11s.",
                    "A hardware/software simulation environment for energy harvesting wireless sensor networks.",
                    "Minimum overhearing and transmission multicast routing protocol for sensor networks.",
                    "Performance evaluation of mobile IPv6 over 6LoWPAN.",
                    "A distributed preventive maintenance strategy for wireless sensor networks.",
                    "Congestion mitigation using in-network sensor datasummarization.",
                    "Priority based expansion of neighborhood size for heterogeneous traffic routing in WSN.",
                    "Understanding co-channel interference in LTE-based multi-tier cellular networks.",
                    "A channel busy rate-aware congestion avoidance mechanism for the wireless ad hoc network: channel busy rate-aware congestion avoidance mechanism.",
                    "Construction and evaluation of a regional protection system employing power-saving wireless terminals without using GPS modules."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2012q",
                "sub_name": "Q2SWinet'12, Proceedings of the Eighth ACM Symposium on QoS and Security for Wireless and Mobile Networks, Paphos, Cyprus, October 24-25, 2012.",
                "count": 14,
                "papers": [
                    "Scaling end-to-end measurements in heterogeneous wireless mesh networks.",
                    "Near optimal multicoloring for inter-cluster interference avoidance.",
                    "Effective service capacity analysis of opportunistic multi-carrier OFDMA systems.",
                    "An energy-efficient M2M communication method for leakage detection in underground water pipes.",
                    "A wireless sensor network based water monitoring system.",
                    "Enhancing the QoS of real-time video streaming over LTE MBMS using D2D communications.",
                    "Signs of a bad neighborhood: a lightweight metric for anomaly detection in mobile ad hoc networks.",
                    "On location privacy and quality of information in participatory sensing.",
                    "Preventing a DoS threat in vehicular ad-hoc networks using adaptive group beaconing.",
                    "Group signatures for secure and privacy preserving vehicular ad hoc networks.",
                    "Unthresholded adaptive revocation technique in mobile ad hoc networks.",
                    "Cooperative wireless sensor networks for green internet of things.",
                    "An adaptive access control model with privileges overriding and behaviour monitoring in wireless sensor networks.",
                    "Reference based approach to mitigate blackhole attacks in delay tolerant networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2012hpmosys",
                "sub_name": "1st ACM Workshop on High Performance Mobile Opportunistic Systems, HP-MOSys 2012, in conjunction with MSWiM '12, Paphos, Cyprus, October 25, 2012.",
                "count": 11,
                "papers": [
                    "Analytical model of epidemic routing for delay-tolerant networks.",
                    "Predicting encounters in opportunistic networks.",
                    "Implementation of a network of mobile sensors for air quality monitoring.",
                    "Multiple multicast trees for 3d real-time content distribution over P2P networks.",
                    "Traffic sources measurement and analysis in UMTS.",
                    "A radio resource management framework for opportunistic TVWS access.",
                    "Message-driven based energy-efficient routing in heterogeneous delay-tolerant networks.",
                    "Adaptive counter-based broadcasting scheme in mobile ad hoc networks.",
                    "Further analysis and tuning of registered multi-cycle polling in wireless medium access management.",
                    "A centralized preventive maintenance strategy for wireless sensor networks.",
                    "Analytical modeling of wireless ad hoc networks: degree distribution and maximum clique size."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2012divanet",
                "sub_name": "Proceedings of the second ACM international symposium on Design and analysis of intelligent vehicular networks and applications, DIVANet@MSWiM 2012, Paphos, Cyprus, October 21, 2012.",
                "count": 20,
                "papers": [
                    "Crowdsourcing for on-street smart parking.",
                    "Adaptive communication gateway for vehicular networking applications.",
                    "A content centric approach to dissemination of information in vehicular networks.",
                    "Fuel economy validation of the smart microhybrid system for used cars.",
                    "VSSA: a service-oriented vehicular social-networking platform for transportation efficiency.",
                    "Optimal sensing using query arrival distributions.",
                    "Congestion control in vehicular ad hoc networks using meta-heuristic techniques.",
                    "A cognitive WSN framework for highway safety based on weighted cognitive maps and Q-learning.",
                    "Grid-based hierarchy structure for mining and querying vehicular ad-hoc networks.",
                    "An efficient and robust clustered data gathering protocol (CDGP) for vehicular networks.",
                    "Time-distance path recommendation mechanisms for vanets.",
                    "A multihop supplying partner protocol for 3D streaming systems over thin mobile devices.",
                    "Distributed scheduling for unmanned aerial vehicle networks with full-duplex radios and multi-packet reception.",
                    "VANET IR-CAS: utilizing IR techniques in developing context aware system for VANET.",
                    "Examining privacy in vehicular ad-hoc networks.",
                    "Proof of concept of a security based on lifetime of communication's pseudonyms for the VANETs.",
                    "HyDi: a hybrid data dissemination protocol for highway scenarios in vehicular ad hoc networks.",
                    "Vehicle localization in VANETs using data fusion and V2V communication.",
                    "Generation of realistic traces for vehicular mobility simulations.",
                    "Security and quality of service (QoS) co-design using game theory in cooperative wireless ad hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2012pm2",
                "sub_name": "Proceedings of the 7th ACM workshop on Performance monitoring and measurement of heterogeneous wireless and wired networks, PM2HW2N 2012, Paphos, Cyprus, October 21-22, 2012.",
                "count": 25,
                "papers": [
                    "Using request queues for enhancing the performance of operations in smart homes.",
                    "Modeling video streaming over VANETs.",
                    "Flooding attacks detection in backbone traffic using power divergence.",
                    "Vertical handover: when the context matters.",
                    "A comprehensive simulation study of low latency handoffs in mobile IPv4 for VoiP in IEEE 802.11b WLAN.",
                    "Decentralized indoor wireless localization using compressed sensing of signal-strength fingerprints.",
                    "Qos-aware resource allocation for multimedia users in a multi-cell spectrum sharing radio network.",
                    "An analytical framework for evaluating MIPv6 protocols applying transport engineering concepts.",
                    "Comparative evaluation of distributed physical cell identity assignment schemes for LTE-advanced systems.",
                    "A global local modeling of internet usage in large mobile societies.",
                    "Particle swarm optimization schemes based on consensus for wireless sensor networks.",
                    "A simulation framework for LTE-A systems with femtocell overlays.",
                    "Experimental system for self-optimization of LTE networks.",
                    "Analytic comparison of wake-up receivers for WSNs and benefits over the wake-on radio scheme.",
                    "Routing protocols for delay tolerant networks: a quantitative evaluation.",
                    "Resilience and security of opportunistic communications for emergency evacuation.",
                    "Radio propagation in industrial wireless sensor network environments: from testbed to simulation evaluation.",
                    "Evaluating the energy-efficiency of key exchange protocols in wirelesssensor networks.",
                    "Optimal and resilient routing for many-to-one topologies in event triggered wireless sensor networks.",
                    "A transient reliability model of RTP video streaming over WLAN.",
                    "Secure and efficient validation of data traffic flows in fixed and mobile networks.",
                    "Modeling adaptive rate video transmission in Wi-Fi MANET.",
                    "Interference model and antenna parameters setting effects on 4G-LTE networks coverage.",
                    "Design of link-to-system mapping interface for lte-a uplink system level simulations.",
                    "Effects of sensor-to-sensor link modeling on body area network simulations."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "14th MSWiM 2011",
        "info": "Miami, Florida, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2011",
                "sub_name": "Proceedings of the 14th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2011, Miami, Florida, USA, October 31 - November 4, 2011.",
                "count": 56,
                "papers": [
                    "Redefining routing and channel access in ad hoc networks.",
                    "Living in the WAM continuum: unified design and operation of wireless and mobile networks.",
                    "Evaluating cooperative ITS applications for sustainable and safe mobility with iTETRIS.",
                    "Maximum utility rate allocation for energy harvesting wireless sensor networks.",
                    "Optimizing push/pull envelopes for energy-efficient cloud-sensor systems.",
                    "Energy evaluations in wireless sensor networks: a reality check.",
                    "Proactive reconfiguration of wireless sensor networks.",
                    "The dark side of DEMMON: what is behind the scene in engineering large-scale wireless sensor networks.",
                    "Ant colony optimization with fuzzy heuristic information designed for cooperative wireless sensor networks.",
                    "Time-space correlation for real-time, accurate, and energy-aware data reporting in wireless sensor networks.",
                    "An adaptive and composite spatio-temporal data compression approach for wireless sensor networks.",
                    "Monitoring quality optimization in wireless sensor networks with a mobile sink.",
                    "Close-to-optimal energy balanced data propagation via limited, local network density information.",
                    "Minimum latency data aggregation in the physical interference model.",
                    "On realization of reliable link layer protocols with guaranteed sustainable flows for wireless communication.",
                    "Interference cancellation-based RFID tags identification.",
                    "Modeling and performance analysis of DMAC for wireless sensor networks.",
                    "Effects of carrier sense modeling on wireless network simulation results.",
                    "A novel neighbor discovery protocol for ultraviolet wireless networks.",
                    "Analysis of link break detection using HELLO messages.",
                    "GDE: a distributed gradient-based algorithm for distance estimation in large-scale networks.",
                    "Modeling and simulation of service composition in opportunistic networks.",
                    "Motion-based routing for opportunistic ad-hoc networks.",
                    "Multipath opportunistic RPL routing over IEEE 802.15.4.",
                    "Controlled potential-based routing for large-scale wireless sensor networks.",
                    "A self-adaptive routing paradigm for wireless mesh networks based on reinforcement learning.",
                    "Adaptive overhead reduction via MEWMA control charts.",
                    "Towards optimal broadcast in wireless networks.",
                    "A greedy reclaiming scheduler for IEEE 802.11e HCCA real-time networks.",
                    "Modeling aggregation convergecast scheduling using constraints.",
                    "Adaptive real-time query scheduling for wireless sensor networks.",
                    "Channel sensing strategy for channel load estimation.",
                    "Simulation models for the performance evaluation of spectrum sharing techniques in OFDMA networks.",
                    "Closed-form approximation of the energy detection performance over generalized fading channels.",
                    "Efficient evaluation of area under the ROC curve of energy detectors over fading channels.",
                    "Designing optical metro and access networks for future cooperative cellular systems.",
                    "Modeling the effect of transmission errors on TCP controlled transfers over infrastructure 802.11 wireless LANs.",
                    "Mitigating mobility signaling congestion in LTE by overlapping tracking area lists.",
                    "An open source product-oriented LTE network simulator based on ns-3.",
                    "Throughput modeling for multi-rate IEEE 802.11 vehicle-to-infrastructure networks with asymmetric traffic.",
                    "On the reliability of safety message broadcastin urban vehicular ad hoc networks.",
                    "VLOCI2: improving 2D location coordinates using distance measurements in GPS-equipped VANETs.",
                    "A markov routing algorithm for mobile DTNs based on spatio-temporal modeling of human movement data.",
                    "Modelling inter-contact times in social pervasive networks.",
                    "Modeling and analysis of composite network embeddings.",
                    "SMOOTH: a simple way to model human mobility.",
                    "Packets travelling in non-homogeneous networks.",
                    "Analytical models of short-message reliability in mobile wireless networks.",
                    "Retransmission-based available bandwidth estimation in IEEE 802.11-based multihop wireless networks.",
                    "Modeling network traffic in mobile networks implementing offloading.",
                    "Performance repeatability of low power wireless sensor network protocols: a multi testbed study.",
                    "Multidimensional modeling and analysis of wireless users online activity and mobility: a neural-networks map approach.",
                    "TWEET: an envelope detection based broadband ultrasonic ranging system.",
                    "Quantitative uncertainty-based incremental localization and anchor selection in wireless sensor networks.",
                    "Performance of mac80211 rate control mechanisms.",
                    "Seamless rate adaptation for wireless networking."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2011",
                "sub_name": "Proceedings of the 8th ACM Symposium on Performance evaluation of wireless ad hoc, sensor, and ubiquitous networks, PE-WASUN 2011, Miami Beach, Florida, USA, October 31 - November 4, 2011.",
                "count": 18,
                "papers": [
                    "Dynamic backbone for fast information delivery invehicular ad hoc networks: an evaluation study.",
                    "Mini-sink mobility with diversity-based routing in wireless sensor networks.",
                    "A model based platform for design and optimization of multi-hop 802.11 wireless networks.",
                    "Modeling the impact of deferred transmission in CSMA/CA algorithm of IEEE 802.15.4 for acknowledged and unacknowledged traffic.",
                    "Topology-related modeling and characterization of wireless sensor networks.",
                    "Ripple flooding in wireless sensor networks.",
                    "ODMAC: an on-demand MAC protocol for energy harvesting - wireless sensor networks.",
                    "Local data gathering using opportunistic networking in a urban scenario.",
                    "Queue-exchange mechanism to improve the QoS in a multi-stack architecture.",
                    "A comparative performance study of the routing protocols LOAD and RPL with bi-directional traffic in low-power and lossy networks (LLN).",
                    "In-kernel passive measurement of the performance impact of hidden terminals in 802.11 wireless networks.",
                    "Modeling and simulation of wireless link quality (ETT) through principal component analysis of trace data.",
                    "Realistic simulation and experimental validation of adjacent-channel interference in planning of industrial wireless networks.",
                    "Design, implementation and performance evaluation of a publish-subscribe architecture for intermittently connected 802.15.4 networks.",
                    "Repairing sensors strategies in fault-tolerant wireless sensor networks.",
                    "Competition, cooperation, and optimization in Multi-Hop CSMA networks.",
                    "Analysis of TCP variants over a QoS DVB-S2 system.",
                    "Network performance of a wireless sensor network for temperature monitoring in vineyards."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2011q",
                "sub_name": "Q2SWinet'11, Proceedings of the Seventh ACM Symposium on QoS and Security for Wireless and Mobile Networks, Miami, FL, USA, October 31 - November 4, 2011.",
                "count": 10,
                "papers": [
                    "Experimental evaluation of asymmetric QoS in IEEE 802.11g wireless networks.",
                    "Performance analysis of packet bursting scheme in IEEE 802.11e WLANs under slow rayleigh fading with non markovian stochastic petri nets.",
                    "Privacy preserving neighborhood awareness in vehicular ad hoc networks.",
                    "Robust and low-cost solution for preventing sidejacking attacks in wireless networks using a rolling code.",
                    "mCoSS: a multi-Constraints Scheduling Strategy for WiMAX networks.",
                    "Fast and flexible unsupervised custering algorithm based on ultrametric properties.",
                    "Model refinement and data filtering in high-tunnel greenhouse sensor network.",
                    "Performance analysis of HIP diet exchange for WSN security establishment.",
                    "A key management method based on an AVL tree and ECC cryptography for wireless sensor networks.",
                    "Towards a balanced and reliable localization of services in heterogeneous vehicular ad hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2011divanet",
                "sub_name": "Proceedings of the first ACM international symposium on Design and analysis of intelligent vehicular networks and applications, DIVANet@MSWiM 2011, Miami, FL, USA, October 31, 2011.",
                "count": 17,
                "papers": [
                    "Optimizing OLSR in VANETS with differential evolution: a comprehensive study.",
                    "Wireless traffic safety network for incident and weather information.",
                    "A self-organizing content centric network model for hybrid vehicular ad-hoc networks.",
                    "Enhancing the broadcast process in mobile ad hoc networks using community knowledge.",
                    "Sensitivity analysis for a realistic vehicular mobility model.",
                    "LICA: robust localization using cluster analysis to improve GPS coordinates.",
                    "Finding lower bounds of localization with noisy measurements using genetic algorithms.",
                    "Cognitive wireless sensor networks for highway safety.",
                    "Towards end-to-end routing for periodic mobile objects.",
                    "Motion-path based in car gesture control of the multimedia devices.",
                    "Modeling and simulation of vehicular networks.",
                    "A semantics-based multi-agent framework for vehicular social network development.",
                    "Design of a fast handoff scheme for vehicular mesh networks with directional antennas.",
                    "Secure service discovery protocol for intelligent transport systems: proof of correctness.",
                    "Outlier detection using naïve bayes in wireless ad hoc networks.",
                    "Intrusion detection in WSN-based intelligent transportation systems.",
                    "Security and quality of service (QoS) co-design in vehicular ad hoc networks with cooperative communications."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2011pm2",
                "sub_name": "PM2HW2N@MSWiM 2011: Proceedings of the 6th ACM workshop on Performance monitoring and measurement of heterogeneous wireless and wired networks, Miami, Florida USA, 31 October 2011.",
                "count": 16,
                "papers": [
                    "Space-division repetition-based broadcasting protocol for reliable beaconing in VANETs.",
                    "A TPM-enabled remote attestation protocol (TRAP) in wireless sensor networks.",
                    "WSN with energy-harvesting: modeling and simulation based on a practical architecture using real radiation levels.",
                    "Distributed maintenance of minimum-cost path information in wireless sensor networks.",
                    "Modeling and simulating ITS applications with iTETRIS.",
                    "Optimizing network lifetime for distributed tracking with wireless sensor networks.",
                    "Convergence and performance analysis of leaderless synchronization in Wi-Fi networks.",
                    "A comparative analysis of the user behavior in academic WiFi networks.",
                    "Quorum-based channel allocation with asymmetric channel view in cognitive radio networks.",
                    "Using geolocation information for dynamic spectrum access in cellular networks.",
                    "Energy saving and capacity gain of micro sites in regular LTE networks: downlink traffic layer analysis.",
                    "Graph approximations of spatial wireless network models.",
                    "Optimal transmission modes by simulated annealing.",
                    "OpenAirInterface large-scale wireless emulation platform and methodology.",
                    "CLAP: coordinated lightweight APs architecture for wireless IPTV service in home networks.",
                    "Impact of VoIP codecs on the energy consumption of portable devices."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "13th MSWiM 2010",
        "info": "Bodrum, Turkey",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2010",
                "sub_name": "Proceedings of the 13th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2010, Bodrum, Turkey, October 17-21, 2010.",
                "count": 53,
                "papers": [
                    "Nanonetworks: a new frontier in communications.",
                    "3DTV and 3d video communications.",
                    "Empirical evaluation of signal-strength fingerprint positioning in wireless LANs.",
                    "Are you contributing trustworthy data?: the case for a reputation system in participatory sensing.",
                    "Utilizing WiMAX mesh mode for efficient IPTV transmission.",
                    "Accurate power-aware simulation of wireless sensor networks considering real-life application code.",
                    "Advanced faults patterns for WSN dependability benchmarking.",
                    "Simulating and testing mobile wireless sensor networks.",
                    "Efficient SINR queries for CSMA/CA simulation.",
                    "Sub-area localization: a simple calibration free approach.",
                    "Design and performance evaluation of QoS aware and location based service discovery protocol for vehicular networks.",
                    "Movement detection for power-efficient smartphone WLAN localization.",
                    "Adaptive geographic routing in wireless sensor networks.",
                    "Adaptive routing in mobile opportunistic networks.",
                    "A scalable and dynamic data aggregation aware routing protocol for wireless sensor networks.",
                    "A MAC interaction aware routing metric in wireless network.",
                    "Accuracy of link status detection in wireless multi-hop networks.",
                    "Advanced interference mitigation with frequency reuse schemes in the IEEE 802.16m uplink.",
                    "A novel framework for handoff analysis under generalized session and mobility statistics.",
                    "On the achievable forwarding capacity of an infinite wireless network.",
                    "Interaction engineering: taming of the CSMA.",
                    "Throughput characteristics of free-space-optical mobile ad hoc networks.",
                    "Mires++: a reliable, energy-aware clustering algorithm for wireless sensor networks.",
                    "Efficient resource allocation for energy conservation in uplink transmissions of IEEE 802.16j transparent relay networks.",
                    "Best case energy analysis of localized euclidean minimum spanning tree based multicasting in ad hoc and sensor networks.",
                    "Analysis and simulation for parameterizing the energy-latency trade-off for routing in sensor networks.",
                    "Cross layer association control for throughput optimization in wireless LANs with inter-AP interference.",
                    "Multi-objective resource allocation for the Band-AMC IEEE 802.16 downlink with proportional rate constraints.",
                    "Genetic algorithms for wireless mesh network planning.",
                    "Optimal control to improve throughput, energy consumption and fairness in wireless networks.",
                    "Extract: mining social features from WLAN traces-a gender-based case study.",
                    "Data-driven co-clustering model of internet usage in large mobile societies.",
                    "Joint bluetooth/wifi scanning framework for characterizing and leveraging people movement in university campus.",
                    "A realistic trace-based mobility model for first responder scenarios.",
                    "An accurate and analytically tractable model for human inter-contact times.",
                    "Modeling and analysis of the packet-level loss process in wireless channels.",
                    "Performance evaluation of service execution in opportunistic computing.",
                    "On the potential of IEEE 802.11s intra-mesh congestion control.",
                    "Adopting FEC for reliable multicasting over Lte networks.",
                    "Formal modelling and verification of the common hopping multi-channel MAC protocols.",
                    "Apples and oranges: comparing schedule- and contention-based medium access control.",
                    "Performance evaluation of a hybrid MAC protocol for wireless sensor networks.",
                    "A non-selfish and distributed channel selection scheme for cognitive radio ad hoc networks.",
                    "Optimal sensing strategy for opportunistic secondary users in a cognitive radio network.",
                    "Dynamic spectrum allocation based on cognitive radio for QoS support.",
                    "Optimal flexible spectrum partitioning for multihop wireless networks with software defined radios.",
                    "Minimum-latency aggregation scheduling in wireless sensor networks under physical interference model.",
                    "Energy-efficient and coverage-specific node scheduling for wireless sensor networks.",
                    "Distributed SINR based scheduling algorithm for multi-hop wireless networks.",
                    "Design and performance evaluation of an energy-aware scheduling framework for mobile WiMAX.",
                    "Supple: a flexible probabilistic data dissemination protocol for wireless sensor networks.",
                    "Dynamic random replication for data centric storage.",
                    "Building a potential field to provide real-time transmission in wireless sensor network."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2010",
                "sub_name": "Proceedings of the 7th ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2010, Bodrum, Turkey, October 17-18, 2010.",
                "count": 17,
                "papers": [
                    "2PDA: two-phase data approximation in wireless sensor network.",
                    "Multiple coverage with controlled connectivity in wireless sensor networks.",
                    "Weighted distance-based m/n track initiation methods for wireless sensor networks in clutter.",
                    "Experimental analysis and characterization of a wireless sensor network environment.",
                    "Implementation of an IEEE 802.15.4-2006 protocol stack on the Texas instrument CC2430.",
                    "Post-processing in wireless sensor networks: benchmarking sensor trace files.",
                    "Semi-flooding location service: a cross-layer design.",
                    "A framework for opportunistic routing in multi-hop wireless networks.",
                    "Performance model of flooding in OLSR.",
                    "A performance model of neighbor discovery in proactive routing protocols.",
                    "Performance evaluation of a hybrid sensor and vehicular network to improve road safety.",
                    "Performance evaluation of distributed self-organization protocols in wireless sensor networks.",
                    "Realistic performance analysis of WSN protocols through trace based simulation.",
                    "Making wireless sensor network simulators cooperate.",
                    "A genetic approach for WSN lifetime maximization through dynamic linking and management.",
                    "Acoustic multiple object positioning system.",
                    "Validation of WSN simulators through a comparison with a real testbed."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2010q",
                "sub_name": "Q2SWinet'10, Proceedings of the Sixth ACM Symposium on QoS and Security for Wireless and Mobile Networks, Bodrum, Turkey, October 20-21, 2010.",
                "count": 15,
                "papers": [
                    "Cross-layer approach for supporting QoS in IEEE802.11 DCF wireless LANs.",
                    "A distributed key establishment scheme for wireless mesh networks using identity-based cryptography.",
                    "Putting together QoS and security in autonomic pervasive systems.",
                    "Optimized HCCA schedulers for an IEEE 802.11e/AFDX hybrid network.",
                    "Applying symmetric and asymmetric key algorithms for the security in wireless networks: proof of correctness.",
                    "A probabilistic analysis of energy efficiency of wireless sensor network duty-cycled MAC protocols: application to S-MAC and Eco-MAC.",
                    "Delay QoS provisioning in cognitive radio systems using adaptive modulation.",
                    "A pragmatic testing approach for wireless sensor networks.",
                    "Diff-MAC: a QoS-aware MAC protocol with differentiated services and hybrid prioritization for wireless multimedia sensor networks.",
                    "Live forensics framework for wireless sensor nodes using sandboxing.",
                    "Security features of a generic sensor data acquisition system.",
                    "A TRNG exploiting multi-source physical data.",
                    "Slow but certain wins the race: authenticated bundle communication in delay tolerant networks.",
                    "Elliptic curve cryptography based authentication protocol for small computational capacity RFID systems.",
                    "Extending P2PSIP VoIP communication for ad hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2010pm2",
                "sub_name": "Proceedings of the 5th ACM workshop on Performance monitoring and measurement of heterogeneous wireless and wired networks, PM2HW2N@MSWiM 2010, Bodrum, Turkey, October 20-21, 2010.",
                "count": 13,
                "papers": [
                    "Design, simulation and measurement of an accurate wireless sensor network localization system.",
                    "Exploiting the distribution of distances between nodes to efficiently solve the localization problem in wireless sensor networks.",
                    "Unicast geographic routing protocols for inter-vehicle communications: a survey.",
                    "Evaluating the performance boundaries of WI-FI, WiMAX and UMTS using the network simulator (ns-2).",
                    "Realtime traffic scheduling for missed deadlines minimization in point-to-multipoint OFDMA systems.",
                    "ACK pushout to achieve TCP fairness under the existence of bandwidth asymmetry.",
                    "Candidate selection algorithms in opportunistic routing.",
                    "Snoop behaviour in multihop wireless networks.",
                    "Mobility management and call admission control for IEEE 802.16e wireless networks.",
                    "A failure diagnosis based topology reconfiguration scheme for ad hoc networks.",
                    "A novel approach to power allocation in wireless ad hoc networks.",
                    "Network coding: applications and implementations on mobile devices.",
                    "Gedda-headz: social mobile networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "12th MSWiM 2009",
        "info": "Tenerife, Canary Islands, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2009",
                "sub_name": "Proceedings of the 12th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2009, Tenerife, Canary Islands, Spain, October 26-19, 2009.",
                "count": 57,
                "papers": [
                    "Combining simulations, models and testbeds: possibilities and pitfalls.",
                    "Resource management in broadband wireless access networks.",
                    "NOTICE: an architecture for traffic incident detection.",
                    "Modeling and performance evaluation of transmission control protocol over cognitive radio ad hoc networks.",
                    "ROSA: distributed joint routing and dynamic spectrum allocation in cognitive radio ad hoc networks.",
                    "Contention in multi-hop wireless networks: model and fairness analysis.",
                    "A distributed fair MAC flow allocation and scheduling framework for IEEE 802.11 based wireless mesh networks.",
                    "Gateway-assisted max-min rate allocation for wireless mesh networks.",
                    "A performance evaluation framework for fair solutions in ad hoc networks.",
                    "Analyzing space/capacity tradeoffs of cooperative wireless networks using a probabilistic model of interference.",
                    "Delay-throughput performance in mobile ad-hoc networks with heterogeneous nodes.",
                    "Capacity-aware routing in heterogeneous mesh networks: an analytical approach.",
                    "Multicast capacity for multi-hop multi-channel multi-radio wireless networks.",
                    "On the impact of far-away interference on evaluations of wireless multihop networks.",
                    "Improving security information gathering with IEEE 802.21 to optimize handover performance.",
                    "Removal of misbehaving insiders in anonymous VANETs.",
                    "On providing location privacy for mobile sinks in wireless sensor networks.",
                    "Design and evaluation of host identity protocol (HIP) simulation framework for INET/OMNeT++.",
                    "Good news for parallel wireless network simulations.",
                    "LiLaS: a link layer simulator in matlab/octave.",
                    "Wireless multihoming modeled as a multi-WLAN game.",
                    "Socially conscious channel selection in 802.11 WLANs for coexistence in a non-cooperative environment.",
                    "Real-time trajectory estimation in mobile ad hoc networks.",
                    "A hierarchical prediction model for two nodes-based IP mobile networks.",
                    "A DBN approach for network availability prediction.",
                    "Connection availability and transient survivability analysis in wireless ad-hoc networks.",
                    "The MAC unreliability problem in IEEE 802.15.4 wireless sensor networks.",
                    "Medium access control for underwater acoustic sensor networks with MIMO links.",
                    "How do wireless chains behave?: the impact of MAC interactions.",
                    "The optimization of framed aloha based RFID algorithms.",
                    "Traffic scheduling for frame length minimization in OFDMA based systems.",
                    "When mobile services go local.",
                    "A reliable and data aggregation aware routing protocol for wireless sensor networks.",
                    "Energy efficient opportunistic routing in wireless networks.",
                    "Improving an over-the-air programming protocol for wireless sensor networks based on small world concepts.",
                    "Performance evaluation of multi-path routing in reservation-based wireless networks.",
                    "Designing an asynchronous group communication middleware for wireless users.",
                    "RENA: region-based routing in intermittently connected mobile network.",
                    "HUBCODE: message forwarding using hub-based network coding in delay tolerant networks.",
                    "Distributed virtual-movement scheme for improving energy efficiency in wireless sensor networks.",
                    "P&P protocol: local coordination of mobile sensors for self-deployment.",
                    "Generalized analysis of a distributed energy efficient algorithm for change detection.",
                    "Hybrid multiobjective approach for designing wireless sensor networks.",
                    "PROGRESSIVE: a topology discovery and scheduling protocol for wireless sensor networks.",
                    "Efficient channel assignment algorithms for infrastructure WLANs under dense deployment.",
                    "TCP performance optimization in multi-cell wireless local area networks.",
                    "Performance evaluation of a fast MAC handoff scheme using dynamic adjustment of scanning parameters.",
                    "On power and energy trends of IEEE 802.11n PHY.",
                    "A space-time batch-service queueing model for multi-user MIMO communication systems.",
                    "Directional neighbor discovery in 60 GHz indoor wireless networks.",
                    "Performance evaluation and parameterization of the IEEE 802.16 contention-based CDMA bandwidth request mechanism for the OFDMA physical layer.",
                    "An enhanced mechanism for efficient assignment of multiple MBMS sessions towards LTE.",
                    "On the possibility of applying polarization diversity to MIMO techniques in tunnels.",
                    "Using a-priori information to improve the accuracy of indoor dynamic localization.",
                    "Cognitive personal positioning based on activity map and adaptive particle filter.",
                    "The role of colinearity of sensors in target localization using distance measurements.",
                    "On the performance of target tracking algorithms using actual localization systems for wireless sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2009",
                "sub_name": "Proceedings of the 6th ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2009, Tenerife, Canary Islands, Spain, October 28-29, 2009.",
                "count": 29,
                "papers": [
                    "A fading and interference aware routing protocol for multi-channel multi-radio wireless mesh networks.",
                    "Dynamic clustering and distance aware routing protocol for wireless sensor networks.",
                    "Near-optimal data propagation by efficiently advertising obstacle boundaries.",
                    "An implementation of the multi-geo routing protocol for wireless sensor networks using quadtrees.",
                    "A warning based preemptive routing scheme for QoS maintenance in wireless ad hoc networks.",
                    "Point processes for interference modeling in CSMA/CA ad-hoc networks.",
                    "Fast simulation methods to predict wireless sensor network performance.",
                    "A new local algorithm for backbone formation in ad hoc networks.",
                    "On the comparison of performance, capacity and economics of terrestrial base station and high altitude platform based deployment of 4G.",
                    "Accelerated sensory data collection by greedy or aggregate mobility-based topology ranks.",
                    "Wireless line sensor network for distributed visual surveillance.",
                    "Acoustic counting algorithms for wireless sensor networks.",
                    "Performance evaluation of a selective cooperative scheme for wireless sensor networks.",
                    "Context-aware and location-based service discovery protocol for vehicular networks.",
                    "Selecting an appropriate routing protocol for in-field MANEMO experiments.",
                    "Performance evaluation of broadcast protocols in VANET: a point process approach.",
                    "Reliability through frequency diversity: why channel hopping makes sense.",
                    "Analysis of k-connectivity of a cognitive radio ad-hoc network.",
                    "Practical investigation of performance trade-offs in cooperative-relaying wireless networks.",
                    "Range assignment and lambda-proximity in wireless sensor networks with a realistic physical layer.",
                    "Adaptive slotted CSMA/CA algorithm for the traffic accumulated during the inactive period.",
                    "An application adaptive energy model for wireless sensor nodes.",
                    "Performance evaluation of a generalized energy efficient time based protocol under different applications.",
                    "Distributed channel selection protocol for single-hop transmissions in cognitive radio networks.",
                    "Bidirectional cooperative communications for ad-hoc wireless networks.",
                    "A new distributed dynamic algorithm for mobility patterns prediction.",
                    "Comparative analysis of LHA, MANETconf and PROPHET stateful address auto-configuration protocols in ad hoc networks.",
                    "Measuring the impact of attacks on the performance of mobile ad hoc networks.",
                    "Towards an optimal reed solomon codes selection for sensor networks: a study case using TmoteSky."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2009q",
                "sub_name": "Q2SWinet'09, Proceedings of the Fifth ACM International Symposium on QoS and Security for Wireless and Mobile Networks, Tenerife, Canary Islands, Spain - October 28-29, 2009.",
                "count": 17,
                "papers": [
                    "On the QoS tree construction in WiMAX mesh networks based on genetic algorithm approach.",
                    "A closed-form expression for queuing delay in Rayleigh fading channels using stochastic network calculus.",
                    "End-to-end security and seamless handover solution for real-time communications over 3G networks.",
                    "Distributed key management for wireless sensor networks.",
                    "A highly resilient and zone-based key predistribution protocol for multiphase wireless sensor networks.",
                    "PETRA: a secure and energy-efficient software update protocol for severely-constrained network devices.",
                    "A comparison of approaches to node and service discovery in 6lowPAN wireless sensor networks.",
                    "A cluster-based scheduling for object detection in wireless multimedia sensor networks.",
                    "QoS parameterization algorithm in data collection for wireless sensor networks.",
                    "A framework for detecting selfish misbehavior in wireless mesh community networks.",
                    "Private logical neighborhoods for wireless ad hoc networks.",
                    "Generalized self-healing key distribution in wireless adhoc networks with trade-offs in user's pre-arranged life cycle and collusion resistance.",
                    "Robust dynamic user authentication scheme for wireless sensor networks.",
                    "Run-time selection of security algorithms for networked devices.",
                    "REALISM: rendering anonymity and lightweight security with mobility in wireless ad hoc and mesh networks.",
                    "SymPa: a measurement tool for evaluating the performance of IP services in mobile networks.",
                    "Implementation of a security framework for wireless multi-hop networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2009pm2",
                "sub_name": "Proceedings of the 4th ACM workshop on Performance monitoring and measurement of heterogeneous wireless and wired networks, PM2HW2N@MSWiM 2009, Tenerife, Canary Islands, Spain, October 26, 2009.",
                "count": 30,
                "papers": [
                    "Compass enhanced ORRP for wireless sensor networks.",
                    "Analyzing the behavior of acoustic link models in underwater wireless sensor networks.",
                    "LINDONCS: localized in-network detection of network coding structures in wireless sensor networks.",
                    "Performance evaluation of the 6LoWPAN protocol on MICAz and TelosB motes.",
                    "Measuring one-way delay in wireless mesh networks: an experimental investigation.",
                    "Assessing the feasibility of a VANET driver warning system.",
                    "Multi-client video streaming over wirelessMAN-OFDMA.",
                    "Adaptive scheduling of wireless video sensor nodes for surveillance applications.",
                    "Opportunistic decoding of unequal erasure protected partially-decodable scalable source.",
                    "Using active queue management to enhance performance in IEEE802.11.",
                    "Enhanced VON-AODV based on delayed rebroadcast scheme.",
                    "Dynamic counter-based broadcast in MANETs.",
                    "Advance reservation optimization in IP-based mobile networks.",
                    "QoS mapping and connection admission control in the WiMAX - DVB-RCS access network.",
                    "Rate control for delay-sensitive traffic in multihop wireless networks.",
                    "Mobility management protocols for wireless mesh networks.",
                    "Configuring multi-objective evolutionary algorithms for design-space exploration of wireless sensor networks.",
                    "Channel assignment algorithms: a comparison of graph based heuristics.",
                    "Joint power control, scheduling and routing for multihop energy harvesting sensor networks.",
                    "An optimized handover decision for heterogenous wireless networks.",
                    "Simulating mission critical mobile ad hoc networks.",
                    "An analytical model for IEEE802.11 networks running query-based applications.",
                    "Simulating devices with adaptive antenna arrays using OPNET integrated with MATLAB.",
                    "Optimal transmission range and node degree for multi-hop routing in wireless sensor networks.",
                    "A practical security framework for a VANET-based entertainment service.",
                    "Verification and performance evaluation of a congestion control approach within vehicular ad hoc networks.",
                    "Delay analysis for symmetric nodes in mobile ad hoc networks.",
                    "Interference aware relay station location planning for IEEE 802.16j mobile multi-hop relay network.",
                    "IEEE802.11k enabled adaptive physical carrier sense mechanism for wireless networks (K-APCS).",
                    "Bursty content sharing mechanism for energy-limited mobile devices."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "11th MSWiM 2008",
        "info": "Vancouver, British Columbia, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2008",
                "sub_name": "Proceedings of the 11th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2008, Vancouver, British Columbia, Canada, October 27-31, 2008.",
                "count": 56,
                "papers": [
                    "Vehicular urban sensing: efficiency and privacy.",
                    "FairCast: fair multi-media streaming in ad hoc networks through local congestion control.",
                    "A cross-layer support for TCP enhancement in QoS-aware mobile ad hoc networks.",
                    "Improving fairness in relay-based access networks.",
                    "Towards a practical and fair rate allocation for multihop wireless networks based on a simple node model.",
                    "Revamping the IEEE 802.11a PHY simulation models.",
                    "Investigating a physically-based signal power model for robust low power wireless link simulation.",
                    "XAV: a fast and flexible tracing framework for network simulation.",
                    "Measurement-based approaches for accurate simulation of 802.11-based wireless networks.",
                    "CCMAC: coordinated cooperative MAC for wireless LANs.",
                    "Making the best of limited resources: differential sensing in cognitive PANs.",
                    "Modelling incentives and protocols for collaboration in mobile ad hoc networks.",
                    "The problem of cooperation among different wireless sensor networks.",
                    "Uniform sensing protocol for autonomous rechargeable sensor networks.",
                    "Dynamic hybrid fault models and the applications to wireless sensor networks (WSNs).",
                    "A performance evaluation of a coverage compensation based algorithm for wireless sensor networks.",
                    "DiMo: distributed node monitoring in wireless sensor networks.",
                    "Johnny Appleseed: wardriving to reduce interference in chaotic wireless deployments.",
                    "Available bandwidth-based association in IEEE 802.11 Wireless LANs.",
                    "Throughput analysis and rate control for IEEE 802.11 Wireless LAN with hidden terminals.",
                    "Need for integrated quality of service and quality of protection in mobile systems.",
                    "Adaptive redundancy for data propagation exploiting dynamic sensory mobility.",
                    "Estimation of the cost resulting from mobility management protocols using a generic mathematical model.",
                    "Expected link life time analysis in MANET under Manhattan grid mobility model.",
                    "Shannon bounds for large-scale wireless MAC's potential capacity in presence of errors.",
                    "Forwarding capacity of an infinite wireless network.",
                    "A novel mechanism for radio capacity maximization during MBMS transmissions in B3G networks.",
                    "Opportunistic relaying vs. selective cooperation: analyzing the occurrence-conditioned outage capacity.",
                    "ContentPlace: social-aware data dissemination in opportunistic networks.",
                    "Coping with episodic connectivity in heterogeneous networks.",
                    "Optimal RSS threshold selection in connectivity-based localization schemes.",
                    "Game theoretic approach to location sharing with privacy in a community-based mobile safety application.",
                    "Algorithms for improving the quality of service in wireless sensor networks with multiple mobile sinks.",
                    "A QoS-aware multicast routing protocol for multimedia applications in mobile ad hoc networks.",
                    "Binary waypoint geographical routing in wireless mesh networks.",
                    "How good is opportunistic routing?: a reality check under Rayleigh fading channels.",
                    "A hybrid-routing based intra-domain mobility management scheme for wireless mesh networks.",
                    "A unified model for joint throughput-overhead analysis of mobile ad hoc networks.",
                    "Breaking the silos: access and service convergence over the mobile internet.",
                    "Real-time evaluation of radio access technology selection policies in heterogeneous wireless systems: the AROMA testbed approach.",
                    "On the topological repeatability of experiments with wireless multihop networks.",
                    "On the design of heterogeneous sensor networks based on small world concepts.",
                    "Dynamic tag estimation for optimizing tree slotted aloha in RFID networks.",
                    "Combining opportunistic and size-based scheduling in wireless systems.",
                    "Improving flow level fairness and interactivity in WLANs using size-based scheduling policies.",
                    "Optimum multichannel random access with retransmission cut-off in OFDMA wireless systems.",
                    "Modeling the energy cost of applications on portable wireless devices.",
                    "Minimum-energy broadcast in random-grid ad-hoc networks: approximation and distributed algorithms.",
                    "Minimum energy probabilistic reliable data delivery in wireless sensor networks.",
                    "Sensor selection cost function to increase network lifetime with QoS support.",
                    "An approach for promoting contribution in GAF-based ad hoc networks: design and implementation.",
                    "On the optimal design of two-tier wireless relay networks.",
                    "Centralized feedback-driven rate allocation mechanism for CSMA/CA-based wireless mesh networks.",
                    "On the complexity of an accurate and precise performance evaluation of wireless networks using simulations.",
                    "A self-adaptive placement protocol for mobile directories in MANETs.",
                    "Performance comparison of HARQ and ARQ mechanisms in IEEE 802.16 networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2008q",
                "sub_name": "Q2SWinet'08 - Proceedings of the 4th ACM Workshop on Q2S and Security for Wireless and Mobile Networks, Vancouver, British Columbia, Canada, October 27-28, 2008.",
                "count": 17,
                "papers": [
                    "Performance evaluation of real-time schedulers for HCCA function in IEEE 802.11e wireless networks.",
                    "Throughput and QoS optimization in nonuniform multichannel wireless mesh networks.",
                    "A dynamic call admission control scheme for optimization with QoS provisioning in multiclass cellular networks.",
                    "Fast, secure handovers in 802.11: back to the basis.",
                    "MobiSEC: a novel security architecture for wireless mesh networks.",
                    "Adaptive traffic filtering for efficient and secure IP-mobility.",
                    "The cost of protecting privacy in multimedia applications.",
                    "In-network optimal rate reduction for packetized MPEG video.",
                    "A distributed resource management scheme for load-balanced QoS provisioning in heterogeneous mobile wireless networks.",
                    "ProbeCast: MANET admission control via probing.",
                    "A priority based QoS-Aware MAC protocol (PQAMP) in mobile ad hoc networks.",
                    "TSR: trust-based secure MANET routing using HMMs.",
                    "Trust transferability among similar contexts.",
                    "Using context information to evaluate cooperativeness.",
                    "Secure authentication and management scheme for RFID.",
                    "Differentiated security in wireless mesh networks.",
                    "An efficient security algorithm in mobile computing for resource constrained mobile devices."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2008",
                "sub_name": "Proceedings of the 5th ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2008, Vancouver, British Columbia, Canada, October 27-28, 2008.",
                "count": 15,
                "papers": [
                    "Modular network trace analysis.",
                    "Experimentation and performance evaluation of rate adaptation algorithms in wireless mesh networks.",
                    "Data analysis on mobile ad-hoc networks with commercial pre-wimax, EVDO and Wi-Fi products.",
                    "Fast, efficient, and robust multicast in wireless mesh networks.",
                    "Broadcast routing based on new link cost model for ad-hoc networks.",
                    "An efficient anycast scheme for discovering K services in mobile ad-hoc networks.",
                    "An efficient multicast protocol in mobile ad-hoc networks using forward error correction techniques.",
                    "The impact of delayed topology information in proactive routing protocols for MANETS.",
                    "PyraNet: an efficient and reliable pyramidal wireless sensor network.",
                    "Performance evaluation of MAC protocols for cooperative MIMO transmissions in sensor networks.",
                    "Modeling IEEE 802.15.4 based wireless sensor network with packet retry limits.",
                    "Future channel reservation medium access control (FCR-MAC) protocol for multi-radio multi-channel wireless mesh networks.",
                    "Communication models for throughput optimization in mesh networks.",
                    "A security management scheme using a novel computational reputation model for wireless and mobile ad hoc networks.",
                    "Source traffic modeling in wireless sensor networks for target tracking."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2008pm",
                "sub_name": "WMuNeP'07 - Proceedings of the 4th ACM Workshop on Wireless Multimedia Networking and Performance Modeling, Vancouver, British Columbia, Canada, October 27, 2008.",
                "count": 8,
                "papers": [
                    "Evaluating video streaming over UWB wireless networks.",
                    "On workload merging and filtering effects in hierarchical wireless media streaming.",
                    "An in-network reduction algorithm for real-time wireless sensor network applications.",
                    "Maximally radio-disjoint multipath routing for wireless multimedia sensor networks.",
                    "Sctp-based transmission of data-partitioned H.264 video.",
                    "A two-stage H.264/AVC encoder for video streaming with fast reference picture selection.",
                    "An efficient protocol for remote virtual environment exploration on wireless mobile devices.",
                    "Extending sip to enable a more efficient multimedia session control in future networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2008pm2",
                "sub_name": "Proceedings of the 3rd ACM Workshop on Performance Monitoring and Measurement of Heterogeneous Wireless and Wired Networks, PM2HW2N 2008, Vancouver, British Columbia, Canada, October 31, 2008.",
                "count": 28,
                "papers": [
                    "MR-BART: multi-rate available bandwidth estimation in real-time.",
                    "Measurements with different role-based wireless sensor network organizations.",
                    "BlueMall: a bluetooth-based advertisement system for commercial areas.",
                    "WiseObserver: a real experience with wireless sensor networks.",
                    "Performance evaluation of a hybrid adaptive service discovery protocol for next generation Heterogeneous Vehicular Networks (HVNs).",
                    "PowerTOSSIM z: realistic energy modelling for wireless sensor network environments.",
                    "AvroraZ: extending Avrora with an IEEE 802.15.4 compliant radio chip model.",
                    "Modelling secure wireless sensor networks routing protocols with timed automata.",
                    "Performance of wireless network simulators: a case study.",
                    "A scalable and energy-efficient hybrid-based MAC protocol for wireless sensor networks.",
                    "On stability and maximum throughput of exponential backoff mechanisms with two users.",
                    "The impact of the interaction between vehicular topology & traffic prioritization of broadcast protocols in VANETs.",
                    "Quality of service support and backoff strategies in wireless networks with error control protocol.",
                    "Achievable throughput and service delay for imperfect cooperative retransmission MAC protocols.",
                    "Distributed network utility maximization in wireless networks with a bounded number of paths.",
                    "A collaborative model for representing wireless sensor networks' entities and properties.",
                    "Distributed resource allocation for multiuser OFDM wireless systems.",
                    "Modeling and simulation comparison of two time synchronization protocols.",
                    "Cross-layer performance evaluation of sensor networks: routing over energy efficient MAC.",
                    "Design of path-based multicast routing protocol in MANET.",
                    "Dynamic reputation-based incentive mechanism considering heterogeneous networks.",
                    "Studying misbehavior in CSMA/CA Wireless LANs.",
                    "An efficient multi-dimensional handover scheme for next-generation networks.",
                    "Channel control for multi-radio multi-channel wireless mesh networks.",
                    "Downlink mixed-traffic scheduling with packet division multiplexing.",
                    "Analysis and enhancement of on-demand routing in wireless sensor networks.",
                    "Advanced and versatile real-time emulation platform for heterogeneous radio access systems.",
                    "RealMobiSim: realistic mobility simulator and analyzer."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "10th MSWiM 2007",
        "info": "Chania, Crete Island, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2007",
                "sub_name": "Proceedings of the 10th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2007, Chania, Crete Island, Greece, October 22-26, 2007.",
                "count": 58,
                "papers": [
                    "Multi-hop ad hoc networking: from theory to reality.",
                    "Wireless network capacity characterization and how to approach it.",
                    "Dynamic mobility management.",
                    "Modelling mobility in disaster area scenarios.",
                    "Movement-assisted sensor redeployment scheme for network lifetime increase.",
                    "Optimal route selection for highly dynamic wireless sensor and actor networks environment.",
                    "On optimality of single-path routes in massively dense wireless multi-hop networks.",
                    "Outage probability analysis of cooperative transmission protocols without and with network coding: inter-user channels based comparison.",
                    "An integrated analytical model for computation and comparison of the throughputs of the UMTS/HSDPA user equipment categories.",
                    "Performance analysis of mobility management protocols using a generic mathematical model.",
                    "Analysing qos trade-offs in wireless sensor networks.",
                    "A new in-network data reduction mechanism to gather data for mining wireless sensor networks.",
                    "Dynamic multi-resolution data dissemination in storage-centric wireless sensor networks.",
                    "Data delivery in fragmented wireless sensor networks using mobile agents.",
                    "The orphan problem in zigbee-based wireless sensor networks.",
                    "Singular spectrum analysis of traffic workload in a large-scale wireless lan.",
                    "Passive and accurate traffic load estimation for infrastructure-mode wireless lan.",
                    "An optimal station association policy for multi-rate ieee 802.11 wireless lans.",
                    "Dynamic single-user ofdm adaptation for ieee 802.11 systems.",
                    "Characterizing individual user behaviors in wlans.",
                    "Adaptive configuration of wpans and wlans communications using multi-scale statistical process control.",
                    "Sensenet: a wireless sensor network testbed.",
                    "Modeling vanet deployment in urban settings.",
                    "Overhaul of ieee 802.11 modeling and simulation in ns-2.",
                    "Evom: a software based platform for voice transmission and quality assessment over wireless ad-hoc networks.",
                    "A novel distributed connection admission control scheme for ieee 802.16 networks.",
                    "Random access game over noisy channels with capture effect.",
                    "Reconciling theory and practice: a revised pole equation for w-cdma cell powers.",
                    "Contention region allocation optimization in ieee 802.16 ofdma systems.",
                    "Analytical model for optimizing periodic route maintenance in proactive routing for manets.",
                    "A mobility prediction based relay deployment framework for conserving power in manets.",
                    "A cache management object oriented simulation for mobile environments.",
                    "A socio-aware overlay for publish/subscribe communication in delay tolerant networks.",
                    "Mobility prediction using future knowledge.",
                    "On modeling for pervasive computing environments.",
                    "Benefits and limitations of spatial reuse in wireless mesh networks.",
                    "An efficient bandwidth guaranteed routing for ad hoc networks using ieee 802.11 with interference consideration.",
                    "Power efficient radio bearer selection in mbms multicast mode.",
                    "A flow-level simulation framework for hsdpa-enabled umts networks.",
                    "Efficient broadcast disks program construction in asymmetric communication environments.",
                    "Improving tcp performance through explicit corruption and route failure notification (ecrfn).",
                    "Multicast polling and efficient voip connections in ieee 802.16 networks.",
                    "Coordinated fractional frequency reuse.",
                    "The effect of node synchronization times in ultra wideband wireless networks.",
                    "Performance analysis of the ieee 802.16 arq mechanism.",
                    "Performance evaluation of the mesh election procedure of ieee 802.16/wimax.",
                    "Indoor people tracking based on dynamic weighted multidimensional scaling.",
                    "A novel lightweight algorithm for time-space localization in wireless sensor networks.",
                    "Analysis of range-free anchor-free localization in a wsn under wormhole attack.",
                    "Adaptive medium access control for minimum energy reliable data delivery in wireless sensor networks.",
                    "Probabilistic wakeup: adaptive duty cycling for energy-efficient event detection.",
                    "Gossiping using the energy map in wireless sensor networks.",
                    "Cora: correlation-based resilient aggregation in sensor networks.",
                    "Adaptation of the breadth first search algorithm for cut-edge detection in wireless multihop networks.",
                    "Flow-optimized random access for wireless multihop networks.",
                    "On the use of sinr for interference-aware routing in wireless multi-hop networks.",
                    "An inhomogeneous spatial node distribution and its stochastic properties.",
                    "A comprehensive study of low-power operation in ieee 802.15.4."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2007q",
                "sub_name": "Q2SWinet'07 - Proceedings of the Third ACM Workshop on Q2S and Security for Wireless and Mobile Networks, Chania, Crete Island, Greece, October 22, 2007.",
                "count": 28,
                "papers": [
                    "Assessing the effectiveness of longest-in-system (lis) schedulingin ad hoc networks.",
                    "A dynamic bandwidth allocation algorithm for supporting real-time applications in 802.15.3 wpans.",
                    "Qos enhancement for multimedia traffics with dynamic txoplimit in ieee 802.11e.",
                    "A simulation study of xcp-b performance in wireless multi-hop networks.",
                    "Near optimal geographic routing with obstacle avoidance in wireless sensor networks by fast-converging trust-based algorithms.",
                    "Stimulating cooperation in route discovery of ad hoc networks.",
                    "Integration of mobility and qos in 4g scenarios.",
                    "Performance evaluation of qos-agent assisted mipv6 handoff scheme.",
                    "Multicast qos support in ieee 802.16.",
                    "Optimized ticket distribution scheme for fast re-authentication protocol (fap).",
                    "Anonymous topology discovery for multihop wireless sensor networks.",
                    "A novel solution based on mobile agent for anonymity in wireless and mobile ad hoc networks.",
                    "A multi-channel defense against jamming attacks in wireless sensor networks.",
                    "Secure, accurate and precise time synchronization for wireless sensor networks.",
                    "Methodologies and frameworks for testing ids in adhoc networks.",
                    "Decentralized group key management for dynamic networks using proxy cryptography.",
                    "Sahnet: a secure system for ad-hoc networking using ecc.",
                    "Denial-of-service resilience password-based group key agreement for wireless networks.",
                    "Providing qos for streaming traffic in mobile network with mobile router.",
                    "Qos modeling for performance evaluation over evolved 3g networks.",
                    "Integrating trust reasonings into node behavior in olsr.",
                    "On the malware spreading over non-propagative wireless ad hoc networks: the attacker's perspective.",
                    "A performance analysis of distributed qos negotiation during session establishment.",
                    "Security of predefined groups in manets.",
                    "Qos for wireless interactive multimedia streaming.",
                    "Two privacy enhanced context transfer schemes.",
                    "Regional-based authentication against dos attacks in wireless networks.",
                    "A secure voip conference system: architecture analysis and design issues."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2007",
                "sub_name": "Proceedings of the 4th ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2007, Chania, Crete Island, Greece, October 22, 2007.",
                "count": 14,
                "papers": [
                    "Worst-case lifetime computation of a wireless sensor network by model-checking.",
                    "Modeling service discovery in ad-hoc networks.",
                    "Delay and capacity in energy efficient sensor networks.",
                    "On the accuracy of omnet++ in the wireless sensornetworks domain: simulation vs. testbed.",
                    "Performance evaluation of geographic probabilistic flow-based spreading routing in wireless sensor networks.",
                    "Comparing tcp and udp performance in manets using multipath enhanced versions of dsr and dymo.",
                    "Analysis of the impact of hello protocol parameters over a wireless network self-organization.",
                    "Gwmac: a TDMA based MAC protocol for a glacial sensor network.",
                    "Maximizing network-lifetime in large scale heterogeneous wireless sensor-actuator networks: a near-optimal solution.",
                    "Exploiting id knowledge for tag identification in rfid networks.",
                    "Solving the user-to-host binding problem in ad hoc networks through photo-ids.",
                    "An energy efficient and low latency multiple events' propagation protocol for wireless sensor networks with multiple sinks.",
                    "A network model for manet nodes and actors collaboration to optimize processing in event areas.",
                    "Qos in node-disjoint routing for ad hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2007pm",
                "sub_name": "WMuNeP'07 - Proceedings of the Third ACM Workshop on Wireless Multimedia Networking and Performance Modeling, Chania, Crete Island, Greece, October 22, 2007.",
                "count": 16,
                "papers": [
                    "Peer-to-peer multimedia content provisioning for vehicular ad hoc networks.",
                    "Zipper: : a zero-infrastructure peer-to-peer system forvanet.",
                    "Evaluation of an ant colony optimization based schedulerfor the transmission of multimedia traffic in the 802.11e edca.",
                    "A framework for qos-aware multimedia service selection for wireless clients.",
                    "A framework for the implementation of adaptive streaming systems.",
                    "Hycast- podcast discovery in mobile networks.",
                    "Mmb: a mobile music blogger system for inter-vehicle entertainment.",
                    "A smooth playback technique for progressively encoded multimedia streams over the internet with wireless connections.",
                    "Delay-aware interleaving and forward-error correction for video over wireless: : a bluetooth case study.",
                    "A new decentralized mobility management service architecture for ipv6-based networks.",
                    "Power saving techniques in mbms multicast mode.",
                    "Performance evaluation for integrated high altitude platforms-terrestrial general packet radio service system.",
                    "Throughput analysis of the ieee 802.11e edca on a noisy channel in unsaturated mode.",
                    "Enhancing the performance of ieee 802.11 wlan using multi rate backoff algorithm.",
                    "Degradation of speech recognition performance over lossy data networks.",
                    "Critical vpn security analysis and new approach for securing voip communications over vpn networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2007pm2",
                "sub_name": "Proceedings of the 2nd ACM Workshop on Performance Monitoring and Measurement of Heterogeneous Wireless and Wired Networks, PM2HW2N 2007, Chania, Crete Island, Greece, October 22, 2007.",
                "count": 25,
                "papers": [
                    "Change detection and estimation for network-measurement applications.",
                    "Capacity analysis of interfering channels.",
                    "Implementation of a rule-based routing protocol for wireless sensor networks.",
                    "Enhanced communications firmware platform for co-verification of complex algorithms.",
                    "Impact of orthogonality factor on umts capacity simulation.",
                    "A distributed approach to handle topological changes in advanced switching.",
                    "Multi-path dynamic admission control in mpls networks with end-to-end delay guarantees.",
                    "Performance evaluation of packet loss differentiation algorithms for wireless networks.",
                    "Complex query processing in wireless sensor networks.",
                    "A heterogeneous role-based sensor network.",
                    "Eco-mac: an energy-efficient and low-latencyhybrid mac protocol for wireless sensor networks.",
                    "A simple automata based model for stable routing in dynamic ad hoc networks.",
                    "An application-driven perspective on wireless devises security: the case of distributed denial-of-service (ddos).",
                    "Tracking sensor node operation deviations in wireless sensor networks.",
                    "Kinetic graphs: a framework for capturing the dynamics of mobile structures in manet.",
                    "An architecture for handsets network test automation.",
                    "Lha: logical hierarchical addressing protocol for mobile ad-hoc networks.",
                    "Simulation case studies of wireless networked control systems.",
                    "Characteristics of common mobility models for opportunistic networks.",
                    "Performance modelling of the o-mac protocol.",
                    "Determination of optimal policy for code allocation in high speed downlink packet access networks with multi-state channel model.",
                    "A multi-step vertical handoff mechanism for cellular multi-hop networks.",
                    "Wm-sim: a platform for design and simulation of wireless mobile systems.",
                    "Terminal-centric ap selection algorithm based on frame retransmissions.",
                    "A peer-to-peer environment for monitoring multiple wireless sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "9th MSWiM 2006",
        "info": "Terromolinos, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2006",
                "sub_name": "Proceedings of the 9th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2006, Terromolinos, Spain, October 2-6, 2006.",
                "count": 53,
                "papers": [
                    "Context aware systems.",
                    "A peer-to-peer approach to cellular communications.",
                    "Performance modelling and measurements of TCP transfer throughput in 802.11-based WLAN.",
                    "Performance modeling of critical event management for ubiquitous computing applications.",
                    "Performance evaluation of a streaming based protocol for 3D virtual environment exploration on mobile devices.",
                    "Parallel and distributed simulation of wireless vehicular ad hoc networks.",
                    "Application of a network dynamics analysis tool to mobile ad hoc networks.",
                    "Proximity detection in distributed simulation of wireless mobile systems.",
                    "Predicting the quality of service of wireless LANs using neural networks.",
                    "The effect of the radio wave propagation model in mobile ad hoc networks.",
                    "IEEE 802.11-based one-hop broadcast communications: understanding transmission success and failure under different radio propagation environments.",
                    "Paging and power saving in IEEE 802.11-enabled networks: a simulative study.",
                    "Modeling and analysis of predictable random backoff in selfish environments.",
                    "T2-fair: a two-tiered time and throughput fair scheduler for multi-rate WLANs.",
                    "Short-term nonuniform access in IEEE 802.11-compliant WLANs: a microscopic wiew and its impact.",
                    "Ensuring the QoS requirements in 802.16 scheduling.",
                    "A model-based coordinated adaptability framework for QoS management in cooperative mobile and wireless applications.",
                    "QoS-guaranteed wireless packet scheduling for mixed services in HSDPA.",
                    "Multicast in 802.11 WLANs: an experimental study.",
                    "A decentralized location system for sensor networks using cooperative calibration and heuristics.",
                    "An efficient multicast packet delivery scheme for UMTS.",
                    "Energy-efficient multicast with directional antennae and localized tree reconfiguration.",
                    "Exploiting multihop diversity through efficient localized searching with CDMA and route metric-based power control.",
                    "Performance analysis of a distributed comparison-based self-diagnosis protocol for wireless ad-hoc networks.",
                    "Gateway adaptive pacing for TCP across multihop wireless networks and the Internet.",
                    "An analytical model to estimate path duration in MANETs.",
                    "An efficient collaborative intrusion detection system for MANET using Bayesian Approach.",
                    "Computing throughput capacity for realistic wireless multihop networks.",
                    "Optimization of a tandem router network using a fluid model.",
                    "Interference-constrained wireless coverage in a protocol model.",
                    "Analytical study of connectivity in wireless multihop networks utilizing beamforming.",
                    "The power of choice in random walks: an empirical study.",
                    "Service discovery in multi-radio networks: an assessment of existing protocols.",
                    "Pattern matching based link quality prediction in wireless mobile ad hoc networks.",
                    "Dynamic packet aggregation to solve performance anomaly in 802.11 wireless networks.",
                    "Design and analysis of grouping-based DCF (GB-DCF) scheme for the MAC layer enhancement of 802.11 and 802.11n.",
                    "Quality of service games in an IEEE 802.11 ad hoc wireless LAN.",
                    "Extended EDCA for providing bounded delay services in 802.11e WLANs.",
                    "Optimal constant-window backoff scheme for IEEE 802.11 DCF in finite load single-hop wireless networks.",
                    "An energy-efficient querying framework in sensor networks for detecting node similarities.",
                    "The scheduling and energy complexity of strong connectivity in ultra-wideband networks.",
                    "Tradeoff between network lifetime and fair rate allocation in wireless sensor networks with multi-path routing.",
                    "On computing conditional fault-tolerance measures for k-covered wireless sensor networks.",
                    "TECA: a topology and energy control algorithm for wireless sensor networks.",
                    "Location-based admission control for differentiated services in 3G cellular networks.",
                    "Analysis of soft handover measurements in 3G network.",
                    "Towards frequency reuse 1 cellular FDM/TDM systems.",
                    "Towards the fourth generation of cellular networks: improving performance using distributed negotiation.",
                    "A mobility sensitive approach for efficient routing in ad hoc mobile networks.",
                    "Bandwidth constrained routing problem in multi-hop wireless networks.",
                    "Performance evaluation of a framework to support path changes in IP-based access networks.",
                    "The QoS-RWP mobility and user behavior model for public area wireless networks.",
                    "Routing in intermittent network topologies."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2006q",
                "sub_name": "Q2SWinet'06 - Proceedings of the Second ACM Workshop on Q2S and Security for Wireless and Mobile Networks, Terromolinos, Spain, October 2, 2006.",
                "count": 20,
                "papers": [
                    "An application-driven perspective on wireless sensor network security.",
                    "Enhancing wireless video streaming using lightweight approximate authentication.",
                    "Secure access to IP multimedia services using generic bootstrapping architecture (GBA) for 3G & beyond mobile networks.",
                    "Two methods of authenticated positioning.",
                    "Securing the AODV protocol using specification-based intrusion detection.",
                    "Priority based adaptive coordination of wireless sensors and actors.",
                    "QoS dynamic routing for wireless sensor networks.",
                    "Study of an energy efficient multi rate scheme for wireless sensor network MAC protocol.",
                    "Optimal rate-oriented routing for distributed source coding in wireless sensor network.",
                    "QoS provisioning in beyond 3G heterogeneous wireless systems through common radio resource management algorithms.",
                    "Integrating SIP and IEEE 802.11e to support handoff and multi-grade QoS for VoIP applications.",
                    "An architecture for SDP-based bandwidth resource allocation with QoS for SIP in IEEE 802.16 networks.",
                    "QoS based handoff for CDMA2000-WLAN interworking.",
                    "Application of a perceptual speech quality metric in power control of UMTS.",
                    "Subjective evaluation of packet service performance in UMTS and heterogeneous networks.",
                    "HO-RSVP: a protocol providing QoS support for seamless handover between wireless networks.",
                    "A mobility monitoring based advance reservation protocol.",
                    "Ticket-based mobile commerce system and its implementation.",
                    "Closed form solution for QoS: constrained information--theoretic sum capacity of reverse link CDMA systems.",
                    "MSBR: a multi-path routing approach based on end-to-end reliability."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2006",
                "sub_name": "Proceedings of the 3rd ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2006, Torremolinos, Spain, October 6, 2006.",
                "count": 24,
                "papers": [
                    "Evaluation of the energetic impact of Bluetooth low-power modes for ubiquitous computing applications.",
                    "Experimental analysis of a transport protocol for ad hoc networks (TPA).",
                    "Dimensioning of wireless mesh networks with flow-level QoS requirements.",
                    "CEQMM: a complete and efficient quality of service model for MANETs.",
                    "A comparison of lifetime-efficient forwarding strategies for wireless sensor networks.",
                    "End-to-end performance characteristics in energy-aware wireless sensor networks.",
                    "Performance analysis of IEEE 802.15.4 and ZigBee for large-scale wireless sensor network applications.",
                    "Coverage protocols for detecting fully sponsored sensors in wireless sensor networks.",
                    "Context-aware multicast routing scheme for disruption tolerant networks.",
                    "Revisiting neighbor discovery with interferences consideration.",
                    "Performance evaluation of backoff algorithms in 802.11 ad-hoc networks.",
                    "Routing protocols for efficient communication in wireless ad-hoc networks.",
                    "Integration of physical phenomena into an experiment-based propagation model.",
                    "Analytical modeling of random waypoint mobility patterns.",
                    "Coordinated data aggregation in wireless sensor networks using the Omega failure detector.",
                    "Describing MANETS: principal component analysis of sparse mobility traces.",
                    "Towards 100% reliability in wireless monitoring networks.",
                    "Performance analysis of the link layer protocol for UWB impulse radio networks.",
                    "Look-ahead scheduling for energy-efficiency and low-latency in wireless sensor networks.",
                    "Approximating relay placement in sensor networks.",
                    "Energetic sustainability of environmentally powered wireless sensor networks.",
                    "Host-based network monitoring tools for MANETs.",
                    "Wave propagation using the photon path map.",
                    "A distributed data gathering algorithm for wireless sensor networks with uniform architecture."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2006pm",
                "sub_name": "WMuNeP'06 - Proceedings of the Second ACM Workshop on Wireless Multimedia Networking and Performance Modeling, Terromolinos, Spain, October 6, 2006.",
                "count": 10,
                "papers": [
                    "Multimedia content distribution in hybrid wireless networks using weighted clustering.",
                    "Optimal design of hybrid FEC/ARQ schemes for real-time applications in wireless networks.",
                    "Applying multipath routing to a video surveillance system deployed over a wireless mesh network.",
                    "A multicast packet forwarding mechanism for WCDMA networks using routing lists.",
                    "Protecting the privacy of user's QoS preferences for multimedia applications.",
                    "Delivery of on-demand video services in rural areas via IEEE 802.16 broadband wireless access networks.",
                    "Scheduling and buffering mechanisms for remote rendering streaming in virtual walkthrough class of applications.",
                    "Establishing how many VoIP calls a wireless LAN can support without performance degradation.",
                    "Measurements and modeling of resource consumption in wireless video streaming: the decoder case.",
                    "Aggregate modeling for TCP sessions."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2006pm2",
                "sub_name": "Proceedings of the 1st ACM Workshop on Performance Monitoring and Measurement of Heterogeneous Wireless and Wired Networks, PM2HW2N 2006, Terromolinos, Spain, October 2, 2006.",
                "count": 15,
                "papers": [
                    "Performance evaluation of web services invocation over Bluetooth.",
                    "P2PStudio: monitoring, controlling and visualization tool for peer-to-peer networks research.",
                    "Sampling time-dependent parameters in high-speed network monitoring.",
                    "Design and analysis of large-scale wireless communications networks.",
                    "An efficient management algorithm for clustering in mobile ad hoc network.",
                    "Simulation of power-aware wireless sensor network architectures.",
                    "Bandwidth overhead in WiFi mesh networks for providing fair Internet access.",
                    "Testing methodology for an ad hoc routing protocol.",
                    "Combining ACK rate control and AQM to enhance TCP performance over 3G links.",
                    "Performance analysis of The TCP SACK-based loss recovery mechanism (RFC 3517) under correlated losses.",
                    "Estimation of perceived quality of service for applications on IPv6 networks.",
                    "Enhancing routing performance for inter-vehicle communication in city environment.",
                    "Direct IP-based mobile-to-mobile communications: first phase results.",
                    "Improving route discovery in on-demand routing protocols using local topology information in MANETs.",
                    "A performance analysis of a cache-based file prediction protocol for mobile file systems."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "8th MSWiM 2005",
        "info": "Montreal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2005",
                "sub_name": "Proceedings of the 8th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2005, Montréal, Quebec, Canada, October 10-13, 2005.",
                "count": 51,
                "papers": [
                    "Cross-layer interactions and optimizations in wireless networks.",
                    "Certain limitations of reputation--based schemes in mobile environments.",
                    "Allowing multi-hops in cellular networks: an economic analysis.",
                    "Hop distances and flooding in wireless multihop networks with randomized beamforming.",
                    "Energy-efficient broadcasting in wireless ad hoc networks: performance benchmarking and distributed algorithms based on network connectivity characterization.",
                    "An architecture study of infrastructure-based vehicular networks.",
                    "Performance analysis of fault-tolerant beacon vector routing for wireless sensor networks.",
                    "A prioritized battery-aware routing protocol for wireless ad hoc networks.",
                    "Salvaging route reply for on-demand routing protocols in mobile ad-hoc networks.",
                    "Location-based broadcasting for dense mobile ad hoc networks.",
                    "Randomized energy aware routing algorithms in mobile ad hoc networks.",
                    "Content and service replication strategies in multi-hop wireless mesh networks.",
                    "On-demand content delivery in vehicular wireless networks.",
                    "A layer-2 trigger to improve QoS in content and session-oriented mobile services.",
                    "Content-aware search of multimedia data in ad hoc networks.",
                    "A low latency and energy aware event ordering algorithm for wireless actor and sensor networks.",
                    "Sensor-assisted wi-fi indoor location system for adapting to environmental dynamics.",
                    "Trade-off between energy savings and source-to-sink delay in data dissemination for wireless sensor networks.",
                    "Magnetic diffusion: disseminating mission-critical data for dynamic sensor networks.",
                    "Grand challenges for wireless sensor networks.",
                    "Huginn: a 3D visualizer for wireless ns-2 traces.",
                    "Getting urban pedestrian flow from simple observation: realistic mobility generation in wireless network simulation.",
                    "Using statistical design of experiments for analyzing mobile ad hoc networks.",
                    "YAES: a modular simulator for mobile networks.",
                    "Experimental validation of the random waypoint mobility model through a real world mobility trace for large geographical areas.",
                    "An integrated mobile surveillance and wireless sensor (iMouse) system and its detection delay analysis.",
                    "Performance analysis of CDMA 1x EV-DO revision A enhanced access channel.",
                    "Probability of successful transmission in a random slotted-aloha wireless multihop network employing constant transmission power.",
                    "Decentrally controlled wireless multi-hop mesh networks for high quality multi-media communications.",
                    "Comparison of multi-channel MAC protocols.",
                    "Performance comparison of small scale fading elimination methods.",
                    "Wireless mesh networking.",
                    "Non-saturation and saturation analysis of IEEE 802.11e EDCA with starvation prediction.",
                    "Adaptive transmission opportunity with admission control for IEEE 802.11e networks.",
                    "Performance investigation of IEEE 802.11 MAC in multihop wireless networks.",
                    "Adapting WLAN MAC parameters to enhance VoIP call capacity.",
                    "An analytical model of the virtual collision handler of 802.11e.",
                    "Topology control with better radio models: implications for energy and multi-hop interference.",
                    "Performance of urban mesh networks.",
                    "Adapting power for BER improvement in wireless channels.",
                    "Transmission power control in MAC protocols for wireless sensor networks.",
                    "A counterexample in congestion control of wireless networks.",
                    "Joint congestion control: routing and media access control optimization via dual decomposition for ad hoc wireless networks.",
                    "Resource management in 3G networks using case-based reasoning.",
                    "Effect of retransmitted packet size preservation property for wireless networks with a reliable communication protocol.",
                    "Analysis of performance issues in an IP-based UMTS radio access network.",
                    "Cellular universal IP: a low delay mobility scheme based on universal IP addressing.",
                    "A real-time transport protocol for image-based rendering over heterogeneous wireless networks.",
                    "Adaptive strategies for efficiently locating internet-based servers in MANETs.",
                    "Trade-offs in bit-rate allocation for wireless video streaming.",
                    "Handover cost and mobility-safety of content streams."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2005",
                "sub_name": "Proceedings of the 2nd ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2005, Montreal, Quebec, Canada, October 10-13, 2005.",
                "count": 48,
                "papers": [
                    "Investigating unfairness scenarios in MANET using 802.11b.",
                    "Traffic load in a dense wireless multihop network.",
                    "An adaptive wakeup scheme to support fast routing in sensor networks.",
                    "Energy efficient topology for wireless microsensor networks.",
                    "A distributed energy aware routing protocol for wireless sensor networks.",
                    "Topology control for balanced energy consumption in emergency wireless deployments.",
                    "An error model for inter-vehicle communications in highway scenarios at 5.9GHz.",
                    "An efficient group key establishment in location-aided mobile ad hoc networks.",
                    "A high performance cluster-based broadcasting algorithm for wireless ad hoc networks based on a novel gateway selection approach.",
                    "Characterizing and modeling user mobility in a cellular data network.",
                    "IS-MAC based flooding protocol for sensor networks.",
                    "Topology knowledge range control for lifetime maximization in sensor networks with data aggregation.",
                    "An M/G/1 queue with bulk service model for power management in wireless LANs.",
                    "Integrated user and network simulation for traffic control by influencing user behavior.",
                    "Pheromone-aided robust multipath and multipriority routing in wireless MANETs.",
                    "Energy-efficient and scalable group key agreement for large ad hoc networks.",
                    "A study of static versus dynamic keying schemes in sensor networks.",
                    "Low complexity source localization algorithms in sensor networks.",
                    "A receiver based protecting protocol for wireless multi-hop networks.",
                    "Impact of mobility prediction on the temporal stability of MANET clustering algorithms.",
                    "Performance of distributed algorithms for maximizing multicast lifetime in mobile ad hoc networks.",
                    "On the resiliency of mobile ad hoc networks to MAC layer misbehavior.",
                    "Railroad: virtual infrastructure for data dissemination in wireless sensor networks.",
                    "Efficient deafness avoidance in wireless ad hoc and sensor networks with directional antennas.",
                    "Impact of multipath fading in wireless ad hoc networks.",
                    "The impact of transient traffic on mobile, ad-hoc routing.",
                    "Limiting the impact of mobility on ad hoc clustering.",
                    "An energy aware coverage-preserving scheme for wireless sensor networks.",
                    "Three-dimensional routing in underwater acoustic sensor networks.",
                    "Channel assignment in cellular networks with synchronous base stations.",
                    "Virtual backbone based on MCDS for topology control in wireless ad hoc networks.",
                    "Reliable one-hop broadcasting (ROB) in mobile ad hoc networks.",
                    "New routing for balanced energy consumption in mobile ad hoc networks.",
                    "A mobility-management mechanism for broadcasting in unknown mobile ad hoc networks.",
                    "Sum capacity maximization in MIMO channels with multiuser interference.",
                    "Application of synchronous dynamic encryption system (SDES) in wireless sensor networks.",
                    "UARTP: a unicast--based self--adaptive reliable transmission protocol for wireless and mobile ad-hoc networks.",
                    "Reputed authenticated routing for ad hoc networks protocol (reputed-ARAN).",
                    "DRKH: dynamic re-keying with key hopping.",
                    "Energy and delay-constrained routing in mobile ad hoc networks: an initial approach.",
                    "A simulation study of the intelligent wireless ad hoc routing (IWAR) protocol.",
                    "Lifetime extension of border nodes in SMAC-based wireless sensor networks by unifying multiple sleep schedules among adjacent virtual clusters.",
                    "Weak signal detection performance of selective rake receivers in fading channels.",
                    "IPv6 stateless address auto-configuration in mobile ad-hoc network (T-DAD) and performance evaluation.",
                    "New energy saving mechanisms for mobile ad-hoc networks using OLSR.",
                    "Implementation and performance analysis of IEEE 802.11i standard using the IXP425 network processor.",
                    "Real-time perceptual QoS satisfactions of multimedia information.",
                    "Optimizing energy consumption in wireless ad hoc networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2005q",
                "sub_name": "Q2SWinet'05 - Proceedings of the First ACM Workshop on Q2S and Security for Wireless and Mobile Networks, Montreal, Quebec, Canada, October 13, 2005.",
                "count": 19,
                "papers": [
                    "Common data security network (CDSN).",
                    "WiMax/802.16 threat analysis.",
                    "Decentralized intrusion detection in wireless sensor networks.",
                    "Application of synchronous dynamic encryption system in mobile wireless domains.",
                    "Latency-sensitive power control for wireless ad-hoc networks.",
                    "MAC coding for QoS guarantees in multi-hop mobile wireless networks.",
                    "QoS for data relaying in hierarchical wireless sensor networks.",
                    "A swarm intelligent multi-path routing for multimedia traffic over mobile ad hoc networks.",
                    "Last hop topology sensitive multicasting key managment.",
                    "Towards resilient geographic routing in WSNs.",
                    "Balancing auditability and privacy in vehicular networks.",
                    "ANSWER: autonomous wireless sensor network.",
                    "Authentication protocols for ad hoc networks: taxonomy and research issues.",
                    "FuzzyCCG: a fuzzy logic QoS approach for congestiosn control in wireless ad hoc networks.",
                    "Enhancements for clustering stability in mobile ad hoc networks.",
                    "A controlled-access scheduling mechanism for QoS provisioning in IEEE 802.11e wireless LANs.",
                    "A delay bounded approach for streaming services in CDMA cellular networks.",
                    "Utility-maximization bandwidth adaptation for multi-class traffic QoS provisioning in wireless networks.",
                    "Real-time service adaptability in multimedia wireless networks."
                ]
            },
            {
                "sub_name_abbr": "conf/mswim/2005pm",
                "sub_name": "WMuNeP'05 - Proceedings of the First ACM Workshop on Wireless Multimedia Networking and Performance Modeling, Montreal, Quebec, Canada, October 13, 2005.",
                "count": 19,
                "papers": [
                    "Performance analysis of differentiated ARQ scheme for video transmission over wireless networks.",
                    "Optimal channel rate allocation for multimedia communication over fading wireless channels.",
                    "Adaptive streaming on heterogeneous networks.",
                    "A novel multiple access scheme in wireless multimedia networks with multi-packet reception.",
                    "Multi-object video error recovery over wireless networks.",
                    "QoS- based JPEG images transmission protocol for wireless CDMA communication systems.",
                    "Fast pre-authentication based on proactive key distribution for 802.11 infrastructure networks.",
                    "Researches on scheme of pairwise key establishment for distributed sensor networks.",
                    "A novel secure wireless video surveillance system based on Intel IXP425 network processor.",
                    "Asymmetric path delay optimization in mobile multi-homed SCTP multimedia transport.",
                    "Media and data traffic coexistence in power-controlled wireless networks.",
                    "PARM: a power-aware message scheduling algorithm for real-time wireless networks.",
                    "The optimal choice of encoding parameters for MPEG-4 AAC streamed over wireless networks.",
                    "A frequency-hopping scheme for interference control in a GSM/GPRS network.",
                    "Performance analysis of the AODV ad hoc routing protocol in a dual radio network.",
                    "Experimental comparisons between SAODV and AODV routing protocols.",
                    "Performance analysis of the intertwined effects between network layers for 802.11g transmissions.",
                    "Performance evaluation of video streaming with background traffic over IEEE 802.11 WLAN networks.",
                    "Algorithms for routing and centralized scheduling to provide QoS in IEEE 802.16 mesh networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "7th MSWiM 2004",
        "info": "Venice, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2004",
                "sub_name": "Proceedings of the 7th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2004, Venice, Italy, October 4-6, 2004.",
                "count": 45,
                "papers": [
                    "Quantile models for the threshold range for k-connectivity.",
                    "Rapid and energy efficient neighbor discovery for spontaneous networks.",
                    "Modeling the time varying behavior of mobile ad-hoc networks.",
                    "An ad hoc mobility model founded on social network theory.",
                    "Further results on selective multiuser diversity.",
                    "Channel-quality dependent earliest deadline due fair scheduling schemes for wireless multimedia networks.",
                    "Design and simulation of power-aware scheduling strategies of streaming data in wireless LANs.",
                    "An optimal packet scheduling and load balancing algorithm for LEO/MEO satellite networks.",
                    "Performance analysis of a parallel and distributed simulation framework for large scale wireless systems.",
                    "Scalable simulation of large-scale wireless networks with bounded inaccuracies.",
                    "Detailed models for sensor network simulations and their impact on network performance.",
                    "Experimental evaluation of wireless simulation assumptions.",
                    "A generic approach for including live measurements and traffic forecasts in the generation of realistic traffic scenarios in mobile radio networks.",
                    "Mobile dynamic content distribution networks.",
                    "UML based modeling and performance analysis of mobile systems.",
                    "Consistency challenges of service discovery in mobile ad hoc networks.",
                    "Rational behaviors in hotspots and in ad hoc networks.",
                    "A-DRAFT: an adaptive QoS mechanism to support absolute and relative throughput in 802.11 wireless LANs.",
                    "IEEE 802.11 rate adaptation: a practical approach.",
                    "An enhanced HCF for IEEE 802.11e wireless networks.",
                    "Why a multichannel protocol can boost IEEE 802.11 performance.",
                    "Fault management in event-driven wireless sensor networks.",
                    "A fast and reliable protocol for wireless sensor networks in critical conditions monitoring applications.",
                    "Energy map construction for wireless sensor network under a finite energy budget.",
                    "Formal specification and analysis of performance variation in sensor network diffusion protocols.",
                    "Performance measurements of motes sensor networks.",
                    "Push-to-talk performance over GPRS.",
                    "An interaction model between ad-hoc networks and fixed IP networks for QoS support.",
                    "Modeling wireless shadow networks.",
                    "Exploring long lifetime routing (LLR) in ad hoc networks.",
                    "The performance impact of traffic patterns on routing protocols in mobile ad hoc networks.",
                    "Outdoor experimental comparison of four ad hoc routing algorithms.",
                    "A reliable node-disjoint multipath routing with low overhead in wireless ad hoc networks.",
                    "A wireless traffic probe for radio resource management and QoS provisioning in IEEE 802.11 WLANs.",
                    "On utility-based radio resource management with and without service guarantees.",
                    "Using case-based reasoning in traffic pattern recognition for best resource management in 3G networks.",
                    "Rate and power control on a reverse link for multi-cell mobile data networks.",
                    "Other-cell-interference factor distribution model in downlink WCDMA systems.",
                    "Pilot power management in WCDMA networks: coverage control with respect to traffic distribution.",
                    "HSDPA flow level performance: the impact of key system and traffic aspects.",
                    "Auctioning for downlink transmission power in CDMA cellular systems.",
                    "Performance analysis of the mobile IP fast authentication protocol.",
                    "A bidirectional multi-channel MAC protocol for improving TCP performance on multihop wireless ad hoc networks.",
                    "Reducing the degrading effect of hidden terminal interference in MANETs.",
                    "Speeding up the evaluation of multimedia streaming applications in MANETs using HMMs."
                ]
            },
            {
                "sub_name_abbr": "conf/pe-wasun/2004",
                "sub_name": "Proceedings of the 1st ACM International Workshop on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks, PE-WASUN 2004, Venezia, Italy, October 4, 2004.",
                "count": 21,
                "papers": [
                    "Study of the impact of asymmetry and carrier sense mechanism in IEEE 802.11 multi-hops networks through a basic case.",
                    "Wireless sensor networks protocols for efficient collision avoidance in multi-path data propagation.",
                    "Data replication effectiveness in mobile ad-hoc networks.",
                    "Node-disjointness-based multipath routing for mobile ad hoc networks.",
                    "A novel solution for achieving anonymity in wireless ad hoc networks.",
                    "Adaptive service differentiation for QoS provisioning in IEEE 802.11 wireless ad hoc networks.",
                    "Multipath routing and multiple description coding in ad-hoc networks: a simulation study.",
                    "A modified IEEE 802.11 MAC protocol for MC-CDMA.",
                    "Ad hoc networks connection availability modeling.",
                    "Energy-efficient broadcasting in ad-hoc networks: combining MSTs with shortest-path trees.",
                    "A routing protocol for power constrained networks with asymmetric links.",
                    "A differentiated distributed coordination function MAC protocol for cluster-based wireless ad hoc networks.",
                    "Link quality-aware routing.",
                    "A simulation study on multi-rate mobile ad hoc networks.",
                    "A framework of secure location service for position-based ad hoc routing.",
                    "An M/MMGI/1/K queuing model for IEEE 802.11 ad hoc networks.",
                    "State based key hop protocol: a lightweight security protocol for wireless networks.",
                    "Energy efficient data retrieval for networked multi-mode wireless sensors.",
                    "Power-efficient communication algorithms for wireless mobile sensor networks.",
                    "A performance evaluation framework for IEEE 802.11 ad-hoc networks.",
                    "Evaluation of probing strategy for ad hoc networks over UTRA-TDD protocol."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "6th MSWiM 2003",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2003",
                "sub_name": "Proceedings of the 6th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2003, San Diego, CA, USA, September 19, 2003.",
                "count": 22,
                "papers": [
                    "Effective bandwidth aggregation over multiple interfaces for real-time and TCP applications.",
                    "Performance comparisons of power allocation mechanisms for downlink handoff in the WCDMA system with microcellular environments.",
                    "Opportunistic scheduling for wireless systems with multiple interfaces and multiple constraints.",
                    "Assessing the user-perceived quality of packet voice in networks with mobile users.",
                    "Connectivity of wireless multihop networks in a shadow fading environment.",
                    "Flooding strategy for target discovery in wireless networks.",
                    "Energy-aware data-centric routing in microsensor networks.",
                    "Simulation of large ad hoc networks.",
                    "A comparison of network and application layer multicast for mobile IPv6 networks.",
                    "Randomized location service in mobile ad hoc networks.",
                    "SMM: mathematical framework of a scalable mobility model.",
                    "Effect of node mobility on highway mobile infostation networks.",
                    "Adaptive range control using directional antennas in mobile ad hoc networks.",
                    "Markov-based modeling of wireless local area networks.",
                    "On flow reservation and admission control for distributed scheduling strategies in IEEE802.11 wireless LAN.",
                    "On the application of traffic engineering over bluetooth ad hoc networks.",
                    "Impact of location inconsistencies on geographic routing in wireless networks.",
                    "Modeling the sociological aspects of mobility in ad hoc networks.",
                    "Modeling multicast packet losses in wireless LANs.",
                    "Parallel adaptive mobile web clipping.",
                    "Dynamic bandwidth allocation for multimedia traffic with rate guarantee and fair access in WCDMA systems.",
                    "Improving UMTS throughput by utilizing ad hoc routing."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th MSWiM 2002",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2002",
                "sub_name": "Proceedings of the 5th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2002, Atlanta, Georgia, USA, September 28, 2002.",
                "count": 17,
                "papers": [
                    "Flow-oriented protocols for scalable wireless networks.",
                    "Stochastic properties of the random waypoint mobility model: epoch length, direction distribution, and cell change rate.",
                    "Simplifying automated hoarding methods.",
                    "Performance analysis of optimized smooth handoff in mobile IP.",
                    "A statistical analysis of the long-run node spatial distribution in mobile ad hoc networks.",
                    "Comparison of ECN-ELFN and SACK on TCP's performance for ad hoc networks.",
                    "Energy-aware routing in MANETs: analysis and enhancements.",
                    "An epidemic model for information diffusion in MANETs.",
                    "Network survivability performance evaluation: : a quantitative approach with applications in wireless ad-hoc networks.",
                    "Modelling location operations in UMTS networks.",
                    "Nsclick: : bridging network simulation and deployment.",
                    "Simulation tools for advanced signal processing in UMTS systems.",
                    "Analysis of adaptation strategies for mobile QoS-aware applications.",
                    "A novel network allocation scheme in wireless mobile networks.",
                    "Adaptive load control algorithms for 3rd generation mobile networks.",
                    "Improving transport layer performance by using A novel medium access control protocol with fast collision resolution in wireless LANs.",
                    "A novel analytical model for optimal channel partitioning in the next generation integrated wireless and mobile networks."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4th MSWiM 2001",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2001",
                "sub_name": "Proceedings of the 4th International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2001, Rome, Italy, 2001.",
                "count": 17,
                "papers": [
                    "System and process modelling for design, management and performance evaluation of present and future mobile networks.",
                    "Interference of bluetooth and IEEE 802.11: simulation modeling and performance evaluation.",
                    "Smooth is better than sharp: a random mobility model for simulation of wireless networks.",
                    "A Markov-based channel model algorithm for wireless networks.",
                    "Capacity model for the CDMA/HDR high-speed wireless data service.",
                    "Performance analysis of internet based software retrieval systems using Petri Nets.",
                    "QoS of internet access with GPRS.",
                    "Performance evaluation of mobile wireless networks: a new perspective.",
                    "A simulation study of load balancing algorithms in cellular packet networks.",
                    "Self organized terminode routing simulation.",
                    "Routing with load balancing in wireless Ad hoc networks.",
                    "Mobile router technology development.",
                    "Message traffic control capabilities of the R-DSDV protocol in mobile ad hoc networks.",
                    "A simulation study of update techniques for cyclic data broadcast.",
                    "A new hybrid broadcast scheduling algorithm for asymmetric communication systems: push and pull data based on optimal cut-off point.",
                    "A scalable approach for broadcasting data in a wireless network.",
                    "A self-adaptive scheduling algorithm of on-demand broadcasts."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd MSWiM 2000",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/mswim/2000",
                "sub_name": "Proceedings of the 3rd International Symposium on Modeling Analysis and Simulation of Wireless and Mobile Systems, MSWiM 2000, Boston, Massachusetts, USA, August 20, 2000.",
                "count": 15,
                "papers": [
                    "Analytical comparison of different GPRS introduction strategies.",
                    "WAP traffic: description and comparison to WWW traffic.",
                    "Effects of circuit switched transmissions over GPRS performance.",
                    "Impact of statistical multiplexing on voice quality in cellular networks.",
                    "A performance study of a distributed algorithm for dynamic channel allocation.",
                    "An integrated admission-degradation framework for optimizing real-time call mix in wireless cellular networks.",
                    "Estimation of reverse-link capacity for multiband DS-CDMA systems.",
                    "Multicast tree construction and flooding in wireless ad hoc networks.",
                    "Analytical comparison of local and end-to-end error recovery in reactive routing protocols for mobile ad hoc networks.",
                    "Prefetching policies for energy saving and latency reduction in a wireless broadcast data delivery system.",
                    "Performance analysis of mobile agents for filtering data streams on wireless networks.",
                    "SensorSim: a simulation framework for sensor networks.",
                    "Visualization of real-time survivability metrics for mobile networks.",
                    "QoS and simulation models in mobile communication networks.",
                    "Flexible simulation of distributed protocols for mobile computing."
                ]
            }
        ]
    }
]