[
    {
        "year": "2021",
        "name": "Networking 2021",
        "info": "Espoo and Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2021",
                "sub_name": "IFIP Networking Conference, IFIP Networking 2021, Espoo and Helsinki, Finland, June 21-24, 2021.",
                "count": 83,
                "papers": [
                    "Fully Decentralized Trading Games with Evolvable Characters using NFTs and IPFS.",
                    "It's Good to Relax: Fast Profit Approximation for Virtual Networks with Latency Constraints.",
                    "Robustness of AutoML for Time Series Forecasting in Sensor Networks.",
                    "Implementation of Virtual Network Function Allocation with Diversity and Redundancy in Kubernetes.",
                    "Decentralized identifiers for peer-to-peer service discovery.",
                    "Resource Allocation Method for Network Slicing Using Constrained Reinforcement Learning.",
                    "Blockchain based Mobile Crowd Sensing for Reliable Data Sharing in IoT Systems.",
                    "LightPIR: Privacy-Preserving Route Discovery for Payment Channel Networks.",
                    "Parallel VM Deployment with Provable Guarantees.",
                    "Onion Pass: Token-Based Denial-of-Service Protection for Tor Onion Services.",
                    "Demand-Aware Plane Spanners of Bounded Degree.",
                    "Co-Virality of Competing Content over OSNs?",
                    "Poster: Network Performance Upgrade by Cut Spanners.",
                    "Solid over the Interplanetary File System.",
                    "TeleNoise: A Network-Noise Module for In-Band Real-Time Telemetry.",
                    "Queuing Network Topology Inference Using Passive Measurements.",
                    "Poster: Multipath Extensions for WireGuard.",
                    "ECTSA: An Efficient Charging Time Scheduling Algorithm for Wireless Rechargeable UAV Network.",
                    "Combating Imbalance in Network Traffic Classification Using GAN Based Oversampling.",
                    "ARMHH: Accurate, Rapid and Memory-Efficient Heavy Hitter Detection with Sliding Window in the Software-Defined Network Context.",
                    "Minimizing Effort and Risk with Network Change Deployment Planning.",
                    "SRPT-based Congestion Control for Flows with Unknown Sizes.",
                    "HTMT: High-Throughput Multipath Tunnelling for Asymmetric Paths.",
                    "Performance Study of P4 Programmable Devices: Flow Scalability and Rule Update Responsiveness.",
                    "The Case for AI Based Web3 Reputation Systems.",
                    "Priority Re-assignment for Improving Schedulability and Mixed-Criticality of ARINC 664.",
                    "From Single Lane to Highways: Analyzing the Adoption of Multipath TCP in the Internet.",
                    "ASIMOV: a Fully Passive WiFi Device Tracking.",
                    "DC-PoET: Proof-of-Elapsed-Time Consensus with Distributed Coordination for Blockchain Networks.",
                    "Poster: Automated Neural Network Structure Selection for IoT Botnet Detection.",
                    "IPLS: A Framework for Decentralized Federated Learning.",
                    "Two-Level Processing Scheme for 3D-Image Sensing Network.",
                    "Temporal Graph based Energy-limited Max-flow Routing over Satellite Networks.",
                    "All Roads Lead to Rome: An MPTCP-Aware Layer-4 Load Balancer.",
                    "TSMF: Network Latency Estimation using Matrix Factorization and Time Series Forecasting.",
                    "Hotcount: A High-Precision Traffic Statistics for Multi-Tenants.",
                    "Towards Large-Scale Deterministic IP Networks.",
                    "Pulsarcast: Scalable, Reliable Pub-Sub over P2P Nets.",
                    "Dynamic Real-Time Stream Reservation with TAS and Shared Time Windows.",
                    "Deadline-Aware TDMA Scheduling for Multihop Networks Using Reinforcement Learning.",
                    "On the Complexity of Weight-Dynamic Network Algorithms.",
                    "Towards Identifying Internet Applications Using Early Classification of Traffic Flow.",
                    "Energy-Efficient and Interference-Aware VNF Placement with Deep Reinforcement Learning.",
                    "Network Telemetry by Observing and Recording on Programmable Data Plane.",
                    "CacheNet: Leveraging the Principle of Locality in Reconfigurable Network Design.",
                    "Simulation framework for EtherCAT over TSN.",
                    "Containers Resource Allocation in Dynamic Cloud Environments.",
                    "Estimating the Impact of BGP Prefix Hijacking.",
                    "Few-Shot Class-Adaptive Anomaly Detection with Model-Agnostic Meta-Learning.",
                    "Poster: SmartTE: Partially Deployed Segment Routing for Smart Traffic Engineering with Deep Reinforcement Learning.",
                    "KadRTT: Routing with network proximity and uniform ID arrangement in Kademlia.",
                    "Source Selection in Transfer Learning for Improved Service Performance Predictions.",
                    "Enabling self-verifiable mutable content items in IPFS using Decentralized Identifiers.",
                    "A state consistency framework leveraging packet cloning and piggybacking for programmable network data planes.",
                    "Adaptive Semi-Persistent Scheduling for Enhanced On-road Safety in Decentralized V2X Networks.",
                    "MultilayerTuple: A General, Scalable and High-performance Packet Classification Algorithm for Software Defined Network System.",
                    "INVEST: Flow-based Traffic Volume Estimation in Data-plane Programmable Networks.",
                    "Distributed Sketching with Traffic-Aware Summaries.",
                    "Real-Time Channel Management in WLANs: Deep Reinforcement Learning versus Heuristics.",
                    "Investigating Automatic Code Generation for Network Packet Parsing.",
                    "Simulative Evaluation of the TSN Mechanisms Time-Aware Shaper and Frame Preemption and Their Suitability for Industrial Use Cases.",
                    "Evaluating Public DNS Services in the Wake of Increasing Centralization of DNS.",
                    "Boundaries of Flow Table Usage Reduction Algorithms Based on Elephant Flow Detection.",
                    "Network Slicing with Multi-Topology Routing.",
                    "Leveraging Flexibility of Time-Sensitive Networks for dynamic Reconfigurability.",
                    "Abstracting Networks with Measurable Guarantees.",
                    "A Zero-Touch Solution for Transport Layer Adaptation to Applications and Networks.",
                    "FlowToss: Fast Wait-Free Scheduling of Deterministic Flows in Time Synchronized Networks.",
                    "Poster: COVID-19 Case Prediction using Cellular Network Traffic.",
                    "IPFS-FAN: A Function-Addressable Computation Network.",
                    "Network Automation for Path Selection: A New Knowledge Transfer Approach.",
                    "Introducing Peer Copy - A Fully Decentralized Peer-to-Peer File Transfer Tool.",
                    "VPN-Zero: A Privacy-Preserving Decentralized Virtual Private Network.",
                    "Poster: Understanding Human Mobility during COVID-19 using Cellular Network Traffic.",
                    "Noise Measurement and Removal for Data Streaming Algorithms with Network Applications.",
                    "How to Network Delay-Sensitive Applications.",
                    "(How Much) Can Edge Computing Change Network Latency?",
                    "Estimating Distributions of Large Graphs from Incomplete Sampled Data.",
                    "Poster: DDoSGrid: a Platform for the Post-mortem Analysis and Visualization of DDoS Attacks.",
                    "Applying 5G and Edge Processing in Smart Manufacturing.",
                    "Service Function Chain Graph Transformation for Enhanced Resource Efficiency in NFV.",
                    "Poster: eID in Europe - Password Authentication Revisited.",
                    "SIP Bruteforcing in the Wild - An Assessment of Adversaries, Techniques and Tools."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "Networking 2020",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2020",
                "sub_name": "2020 IFIP Networking Conference, Networking 2020, Paris, France, June 22-26, 2020.",
                "count": 128,
                "papers": [
                    "PBC: Effective Prefix Caching for Fast Name Lookups.",
                    "Packet Delay Minimization in Multi-hop Wireless Sensor Networks with Periodic Traffic.",
                    "Efficient User-Cell Association for 360 Video Streaming over Wireless Networks.",
                    "Performance Comparison of Messaging Protocols and Serialization Formats for Digital Twins in IoV.",
                    "IoT Content Object Security with OSCORE and NDN: A First Experimental Comparison.",
                    "Revealing QoE of Web Users from Encrypted Network Traffic.",
                    "On the Practical Detection of Hierarchical Heavy Hitters.",
                    "How Online Social Ties Influence the Epidemic Spreading of a Multiplex Network?",
                    "Virtual Network Functions Placement and Routing Problem: Path formulation.",
                    "A Rank-based Mechanism for Service Placement in the Fog.",
                    "FlexMesh: Flexibly Chaining Network Functions on Programmable Data Planes at Runtime.",
                    "Anytime Backtrack Unimodal Bandits and Applications to Cloud Computing.",
                    "NFV Performance Profiling on Multi-core Servers.",
                    "On Max-Min Fairness of Completion Times for Multi-Task Job Scheduling.",
                    "Achieving Optimal Edge-based Congestion-aware Load Balancing in Data Center Networks.",
                    "Measuring Decentralized Video Streaming: A Case Study of DTube.",
                    "EnDASH - A Mobility Adapted Energy Efficient ABR Video Streaming for Cellular Networks.",
                    "On the Internet-scale Streaming of Holographic-type Content with Assured User Quality of Experiences.",
                    "Optimized Dynamic Cache Instantiation.",
                    "Precise and Adaptable: Leveraging Deep Reinforcement Learning for GAP-based Multipath Scheduler.",
                    "Online Fault-tolerant VNF Chain Placement: A Deep Reinforcement Learning Approach.",
                    "Joint Coreset Construction and Quantization for Distributed Machine Learning.",
                    "Performance Prediction of Big Data Transfer Through Experimental Analysis and Machine Learning.",
                    "Characterizing the Root Landscape of Certificate Transparency Logs.",
                    "Scaling website fingerprinting.",
                    "Tracking Down Sources of Spoofed IP Packets.",
                    "Quantifying TCP SYN DDoS Resilience: A Longitudinal Study of Internet Services.",
                    "RTCP - Reduce Delay Variability with an End-to-end Approach.",
                    "Enabling Premium Service for Streaming Video in Cellular Networks.",
                    "A Deep Deterministic Policy Gradient Based Network Scheduler For Deadline-Driven Data Transfers.",
                    "Approaching Fair Collision-Free Channel Access with Slotted ALOHA Using Collaborative Policy-Based Reinforcement Learning.",
                    "Fast Reinforcement Learning Algorithms for Resource Allocation in Data Centers.",
                    "Privacy-Preserving Blockchain-Based Data Sharing Platform for Decentralized Storage Systems.",
                    "Mapping the Interplanetary Filesystem.",
                    "How to Securely Prune Bitcoin's Blockchain.",
                    "An Analytical Model for Assessing the Performance of IEEE 802.11ad Beamforming Training.",
                    "Implications of Routing Coherence and Consistency on Network Optimization.",
                    "Performance Analysis of VPN Gateways.",
                    "Quantifying the Influence of Regulatory Instructions over the Detection of Network Neutrality Violations.",
                    "Evaluation of Centralised vs Distributed Collaborative Intrusion Detection Systems in Multi-Access Edge Computing.",
                    "Line-Speed and Scalable Intrusion Detection at the Network Edge via Federated Learning.",
                    "An agent-based model of IPv6 adoption.",
                    "A Nation-Wide Wi-Fi RSSI Dataset: Statistical Analysis and Resulting Insights.",
                    "Estimating Server Load Based on its Correlation with TCP SYN Response Time.",
                    "QWIN: Facilitating QoS in Wireless Industrial Networks Through Cooperation.",
                    "MixCAN: Mixed and Backward-Compatible Data Authentication Scheme for Controller Area Networks.",
                    "CSBR: A Cosine Similarity Based Selective Broadcast Routing Protocol for Vehicular Ad-Hoc Networks.",
                    "P4rt-OVS: Programming Protocol-Independent, Runtime Extensions for Open vSwitch with P4.",
                    "Sequential Zeroing: Online Heavy-Hitter Detection on Programmable Hardware.",
                    "Defeating Protocol Abuse with P4: Application to Explicit Congestion Notification.",
                    "Routing Oblivious Measurement Analytics.",
                    "Moving a step forward in the quest for Deterministic Networks (DetNet).",
                    "Decoupling of Distributed Consensus, Failure Detection and Agreement in SDN Control Plane.",
                    "Cost-Efficient Embedding of Virtual Networks With and Without Routing Flexibility.",
                    "Baking the ruleset: A heat propagation relaxation to packet classification.",
                    "Polymorphic Encryption and Pseudonymisation of IP Network Flows.",
                    "Encrypted Application Classification with Convolutional Neural Network.",
                    "Securing Route Origin Authorization with Blockchain for Inter-Domain Routing.",
                    "Preventing Route Leaks using a Decentralized Approach.",
                    "Multi-Cloud Chaining with Segment Routing.",
                    "Amalgam: Distributed Network Control With Scalable Service Chaining.",
                    "Optimizing Social Welfare for Task Offloading in Mobile Edge Computing.",
                    "Toward an Efficient Real-Time Anomaly Detection System for Cloud Datacenters.",
                    "A Delicate Union of Batching and Parallelization Models in Distributed Computing and Communication.",
                    "Modelling Edge Computing in Urban Mobility Simulation Scenarios.",
                    "A Social Spider Optimisation Algorithm for 3D Unmanned Aerial Base Stations Placement.",
                    "Feedback-Based Hidden-Terminal Mitigation for Distributed Scheduling in Cellular V2X.",
                    "Virtual Cross-Flow Detouring in the Deterministic Network Calculus Analysis.",
                    "Zero-Day Traffic Identification Using One-Dimension Convolutional Neural Networks And Auto Encoder Machine.",
                    "Human Physical Status detection related to Danger Situations based on Smartwatch and Smartphone.",
                    "Optimizing Spectrum Use in Wireless Networks by Learning Agents.",
                    "Dynamic Backup Workers for Parallel Machine Learning.",
                    "Deep Neural Networks approach for Power Head-Room Predictions in 5G Networks and Beyond.",
                    "Multi-User collaborative scheduling in 5G massive MIMO heterogeneous networks.",
                    "Voting Credential Management System for Electronic Voting Privacy.",
                    "MHM: A Novel Collaborative Spectrum Sensing Method based on Markov-chains and Harmonic Mean for 5G Networks.",
                    "Differentiated Transmission based on Traffic Classification with Deep Learning in DataCenter.",
                    "An Energy-Aware SDN/NFV Architecture for the Internet of Things.",
                    "LoRaWAN Class B Multicast Scalability.",
                    "Practical evaluation of carrier sensing for a LoRa wildlife monitoring network.",
                    "Poster: CO2: Collaborative Packet Classification for Network Functions with Overselection.",
                    "Priority-Aware Per-flow Measurement using Cuckoo Sketch.",
                    "Poster: Word embedding for deployment descriptors in NFV.",
                    "Im-OFDP: An Improved OpenFlow-based Topology Discovery Protocol for Software Defined Network.",
                    "SmartSharing: A CDN with Smart Contract-based Local OTT Sharing.",
                    "Poster: IsoRAN: Isolation and Scaling for 5G RAN via User-Level Data Plane Virtualization.",
                    "Poster: Seamless Client Integration for Fast Roaming in Wireless Mesh Networks.",
                    "Poster: Distributed and Privacy Preserving Routing of Connected Vehicles to Minimize Congestion.",
                    "Poster: SafeSmart - A VANET system for efficient communication for emergency vehicles.",
                    "Poster: TrueNets, a Topology Generator for Realistic Network Analysis.",
                    "Poster: A Semi-Supervised Framework to Detect Botnets in IoT Devices.",
                    "Poster: Evolution of Ethereum: A Temporal Graph Perspective.",
                    "OIDPR: Optimized Insulin Dosage based on Privacy-Preserving Reinforcement Learning.",
                    "Auditable secure network overlays for multi-domain distributed applications.",
                    "Poster: Controlling Quality of Service of Container Networks in a Hyperconverged Platform.",
                    "Poster: Per-Hop Bridge-Local Latency Bounds with Strict Priority Transmission Selection.",
                    "A Practical Analysis on Mirai Botnet Traffic.",
                    "Securing messages in C-ITS: a proof of concept.",
                    "User identification by matching radio \"vision\" and computer vision through means of machine learning.",
                    "Autonomous Anomaly Detector for Cloud-Radio Access Network Key Performance Indicators.",
                    "Seamless Multimedia Streaming in Controller-Less Wireless Mesh Networks With Mobile Stations.",
                    "FORCH: An Orchestrator for Fog Computing service deployment.",
                    "Crawling the IPFS Network.",
                    "Optimum Rooted Trees for Failover in Switched Networks.",
                    "Evaluation of Path States of Large IoT Networks Using Locally and Remotely Controlled Measurements.",
                    "Evolution Toward the Next Generation Radio Access Network.",
                    "Cost Effective Troubleshooting of NFV Infrastructure.",
                    "A Lightweight Network-based Android Malware Detection System.",
                    "Characterizing Packet Loss in City-Scale LoRaWAN Deployment: Analysis and Implications.",
                    "A DRAM-friendly priority queue Internet packet scheduler implementation and its effects on TCP.",
                    "SRPT-ECF: challenging Round-Robin for stream-aware multipath scheduling.",
                    "Rethinking ACKs at the Transport Layer.",
                    "A QUIC Simulation Model for INET and its Application to the Acknowledgment Ratio Issue.",
                    "SABES: Statistical Available Bandwidth EStimation from passive TCP measurements.",
                    "On the Incompatibility of Scalable Congestion Controls over the Internet.",
                    "Evaluating QUIC's Performance Against Performance Enhancing Proxy over Satellite Link.",
                    "Evaluation of Multi-operator dynamic 5G Network Slicing for Vehicular Emergency Scenarios.",
                    "Integration of U-space and 5GS for UAV services.",
                    "Information Exchange to Support Multi-Domain Slice Service Provision for 5G/NFV.",
                    "The case for serverless mobile networking.",
                    "Load Balancing for Deterministic Networks.",
                    "P4 In-Network Source Protection for Sensor Failover.",
                    "Coupling Source Routing with Time-Sensitive Networking.",
                    "Integrated Industrial Ethernet Networks: Time-sensitive Networking over SDN Infrastructure for mixed Applications.",
                    "The Internet in Crimea: a Case Study on Routing Interregnum.",
                    "Measuring Basic Load-Balancing and Fail-Over Setups for Email Delivery via DNS MX Records.",
                    "General Knapsack Bounds of Web Caching Performance Regarding the Properties of each Cacheable Object.",
                    "A Link Scheduling Algorithm for Underwater Optical Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "Networking 2019",
        "info": "Warsaw, Poland",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2019",
                "sub_name": "2019 IFIP Networking Conference, Networking 2019, Warsaw, Poland, May 20-22, 2019.",
                "count": 48,
                "papers": [
                    "BeamSniff: Enabling Seamless Communication under Mobility and Blockage in 60 GHz Networks.",
                    "Dynamic Property Enforcement in Programmable Data Planes.",
                    "Let there be Chaining: How to Augment your IGP to Chain your Services.",
                    "Balancing Performance Characteristics of Hierarchical Heavy Hitters.",
                    "On Polynomial-Time Congestion-Free Software-Defined Network Updates.",
                    "A Distributed Algorithm for Throughput Optimal Routing in Overlay Networks.",
                    "Incentives for Stable Mining in Pay Per Last N Shares Pools.",
                    "Towards Tile Based Distribution Simulation in Immersive Video Streaming.",
                    "LEMoNet; Low Energy Wireless Sensor Network Design for Data Center Monitoring.",
                    "QUIC-FEC: Bringing the benefits of Forward Erasure Correction to QUIC.",
                    "On the Impact of the Network Hypervisor on Virtual Network Performance.",
                    "Triptych: Multi-objective Optimisation of Service Deployment Costs, Application Delay and Bandwidth Usage.",
                    "Full Downlink Channel Reconstruction Using Incomplete Uplink Channel Measurements in Massive MIMO Networks.",
                    "DeepMPLS: Fast Analysis of MPLS Configurations Using Deep Learning.",
                    "BRAIN: Blockchain-based Reverse Auction for Infrastructure Supply in Virtual Network Functions-as-a -Service.",
                    "Analytical Study of License-Assisted Access in 5G Networks.",
                    "The Risk of Successive Disasters: A Blow-by-Blow Network Vulnerability Analysis.",
                    "Latency and Consistent Flow Migration: Relax for Lossless Updates.",
                    "Advancing User Quality of Experience in 360-degree Video Streaming.",
                    "AMP: An Adaptive Multipath TCP for Data Center Networks.",
                    "Privacy-Preserving MAX/MIN Query Processing for WSN -as-a -Service.",
                    "ICNLoWPAN - Named-Data Networking for Low Power IoT Networks.",
                    "Data Collection and Node Counting by Opportunistic Communication.",
                    "Spectrum Management in Elastic Optical Networks: Perspectives of Topology, Traffic and Routing.",
                    "The Curious Case of Port 0.",
                    "From Network Traffic Measurements to QoE for Internet Video.",
                    "A Mathematical Measure for Flexibility in Communication Networks.",
                    "TCP BBR for Ultra-Low Latency Networking: Challenges, Analysis, and Solutions.",
                    "Beyond socket options: making the Linux TCP stack truly extensible.",
                    "A Black-box Method for Accelerating Measurement Algorithms with Accuracy Guarantees.",
                    "Efficient Non-Segregated Routing for Reconfigurable Demand-Aware Networks.",
                    "Composing 5G Network Slices by Co-locating VNFs in μslices.",
                    "Poster: persistent DNS connections for improved performance.",
                    "Topology discovery using path interference.",
                    "Poster: FFBquick: fast convergence to fairness for delay-bounded congestion controls.",
                    "Poster: fast and reliable alert delivery in Wi-Fi HaLow sensor networks.",
                    "EFusion: correcting unreliable labels with expert knowledge for mobile crowdsensing.",
                    "Poster: a novel mechanism for rewards distribution in pool mining of proof of work.",
                    "Poster: a minimally disruptive network reconfiguration approach in SDN.",
                    "Poster: online adaptive sampling for network delay measurement via matrix completion.",
                    "Poster: rQUIC - integrating FEC with QUIC for robust wireless communications.",
                    "Poster: design of survivable SDN/NFV-enabled networks with bandwidth-optimal failure recovery.",
                    "Poster: Impact of traffic characteristics on request aggregation in an NDN router.",
                    "Poster: A framework to secure IoT networks against network layer attacks.",
                    "Poster : Minimizing range rules for packet filtering using a double mask representation.",
                    "Poster: Characterizing the performance of WiFi in dense IoT deployments.",
                    "Poster: Don't interrupt me when you reconfigure my service function chains.",
                    "Performance study of the constrained application protocol in lossy networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "Networking 2018",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2018",
                "sub_name": "17th International IFIP TC6 Networking Conference, Networking 2018, Zurich, Switzerland, May 14-16, 2018.",
                "count": 66,
                "papers": [
                    "Rasch Analysis of HTTPS Reachability.",
                    "PathFinder: Capturing DDoS Traffic Footprints on the Internet.",
                    "CellPAD: Detecting Performance Anomalies in Cellular Networks via Regression Analysis.",
                    "An M: N Shared Regenerator Protection Scheme in Translucent WDM Networks.",
                    "SRv6Pipes: Enabling In-network Bytestream Functions.",
                    "SERA: SEgment Routing Aware Firewall for Service Function Chaining Scenarios.",
                    "Charting the Complexity Landscape of Virtual Network Embeddings.",
                    "Breaking Service Function Chains with Khaleesi.",
                    "Factors Affecting Performance of Web Flows in Cellular Networks.",
                    "Measurement and Analysis of the Reviews in Airbnb.",
                    "Wrinkles in Time: Detecting Internet-wide Events via NTP.",
                    "State Acquisition in Computer Networks.",
                    "Towards a Deeper Understanding of TCP BBR Congestion Control.",
                    "Cellular Controlled Delay TCP (C2TCP).",
                    "The Virtue of Gentleness: Improving Connection Response Times with SYN Priority Active Queue Management.",
                    "Policy-oriented AQM Steering.",
                    "Adaptive Robust Traffic Engineering in Software Defined Networks.",
                    "An Online Power-Aware Routing in SDN with Congestion-Avoidance Traffic Reallocation.",
                    "Proactive Rerouting in Network Overlays.",
                    "SWIFT: Bringing SDN-Based Flow Management to Commodity Wi-Fi Access Pointes.",
                    "Multipath IP Routing on End Devices: Motivation, Design, and Performance.",
                    "QAware: A Cross-Layer Approach to MPTCP Scheduling.",
                    "The Effect of Network topology on the Control Traffic in Distributed SDN.",
                    "HARMLESS: Cost-Effective Transitioning to SDN for Small Enterprises.",
                    "I DPID It My Way! A Covert Timing Channel in Software-Defined Networks.",
                    "Blockage-Robust 5G mm-Wave Access Network Planning.",
                    "D2D Multihop Energy-Efficient Routing and OFDMA Resource Allocation in 5G Networks.",
                    "Dynamic Load Balancing in 5G HetNets for Optimal Performance-Energy Tradeoff.",
                    "Making Name-Based Content Routing More Efficient than Link-State Routing.",
                    "PopNetCod: A Popularity-based Caching Policy for Network Coding enabled Named Data Networking.",
                    "NEST: Efficient Transport of Data Summaries over Named Data Networks.",
                    "MUCA: New Routing for Named Data Networking.",
                    "Association Optimization in Wi-Fi Networks based on the Channel Busy Time Estimation.",
                    "Carrier-Sense Multiple Access with Transmission Acquisition (CSMA/TA).",
                    "Prescriptive Analytics for MEC Orchestration.",
                    "Profit and Strategic Analysis for MNO-MVNO Partnership.",
                    "HyLine: a Simple and Practical Flow Scheduling for Commodity Datacenters.",
                    "Dynamic Load Balancing with Tokens.",
                    "Moving Bits with a Fleet of Shared Virtual Routers.",
                    "Real-time Money Routing by Trusting Strangers with your Funds.",
                    "Virtual Network Embedding Approximations: Leveraging Randomized Rounding.",
                    "AHAB: Data-Driven Virtual Cluster Hunting.",
                    "Controlling Software Router Resource Sharing by Fair Packet Dropping.",
                    "A New Dependence Model for Heterogeneous Markov Modulated Poisson Processes.",
                    "Improving Output Bounds in the Stochastic Network Calculus Using Lyapunov's Inequality.",
                    "Hierarchical Layer Selection with Low Overhead in Prioritized Network Coding.",
                    "A Blockchain Consensus Protocol with Horizontal Scalability.",
                    "On the Delay Performance of Browser-based Interactive TCP Free-viewpoint Streaming.",
                    "Alternative Handshake Mechanism for the Stream Control Transmission Protocol.",
                    "A Framework for Evaluating Caching Policies in a Hierarchical Network of Caches.",
                    "Neural Networks for Measurement-based Bandwidth Estimation.",
                    "Decentralized Scheduling for Offloading of Periodic Tasks in Mobile Edge Computing.",
                    "Experience-Availability Analysis of Online Cloud Services using Stochastic Models.",
                    "Tuning Multipath TCP for Interactive Applications on Smartphones.",
                    "Waypoint Routing in Special Networks.",
                    "Complex Services Offloading in Opportunistic Networks.",
                    "PPAD: Privacy Preserving Group-Based ADvertising in Online Social Networks.",
                    "Is There a Case for Parallel Connections with Modern Web Protocols?",
                    "A Protocol-Ignorance Perspective on Incremental Deployability of Routing Protocols.",
                    "Demo: Chaining of Segment Routing Aware and Unaware Service Functions.",
                    "Demo: Intent-Based 5G IoT Application Slice Energy Monitoring.",
                    "Demo: Enabling In-Network Processing utilizing Nearby.",
                    "Demo: Controlling Software Router Resource Sharing by Fair Packet Dropping.",
                    "Poster: Impact of Prioritized Network Coding on Sensor Data Collection in Smart Factories.",
                    "Poster: Design and Evaluation of a Time Efficient Vertical Handoff Algorithm between LTE-A and IEEE 802.11ad Wireless Networks.",
                    "Poster: WebMaDa 2.0 - Automated Handling of User Requests."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "Networking 2017",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2017",
                "sub_name": "2017 IFIP Networking Conference, IFIP Networking 2017 and Workshops, Stockholm, Sweden, June 12-16, 2017.",
                "count": 71,
                "papers": [
                    "Remote measurement of interrupt-coalescence latency of internet hosts.",
                    "Packing strictly-shortest paths in a tree for QoS-aware routing.",
                    "Available bandwidth estimation from passive TCP measurements using the probe gap model.",
                    "Efficient multipath flow monitoring.",
                    "Traffic engineering using segment routing and considering requirements of a carrier IP network.",
                    "Design and performance evaluation of bearer aggregation method in mobile core network with C/U plane separation.",
                    "How HTTP/2 pushes the web: An empirical study of HTTP/2 server push.",
                    "Network recovery from massive failures under uncertain knowledge of damages.",
                    "On broadcast-based self-learning in named data networking.",
                    "A deployable identifier-locator split architecture.",
                    "Can SDN accelerate BGP convergence? - A performance analysis of inter-domain routing centralization.",
                    "PRIVO: A privacy-preserving opportunistic routing protocol for delay tolerant networks.",
                    "Packer: Minimizing multi-resource fragmentation and performance interference in datacenters.",
                    "Joint backup capacity allocation and embedding for survivable virtual networks.",
                    "Towards an adaptive selection of loss estimation techniques in software-defined networks.",
                    "A mood value for fair resource allocations.",
                    "Model-based design and analysis of cache hierarchies.",
                    "A crowdsourcing and simulation based approach for fast and accurate Wi-Fi radio map construction in urban environment.",
                    "BFR: A bloom filter-based routing approach for information-centric networks.",
                    "Raptor: Scalable rule placement over multiple path in software defined networks.",
                    "Multi-Channel Scatter (MCS): Traffic balancing based on edge-switching in datacenter networks.",
                    "How fast can you reconfigure your partially deployed SDN network?",
                    "SEMUD: Secure multi-hop device-to-device communication for 5G public safety networks.",
                    "SoDA: Enabling CDN-ISP collaboration with software defined anycast.",
                    "DTN-RPC: Remote procedure calls for disruption-tolerant networking.",
                    "Resilient placement of virtual process control functions in mobile edge clouds.",
                    "Securing virtual network function placement with high availability guarantees.",
                    "Ads versus regular contents: Dissecting the web hosting ecosystem.",
                    "FlowScope: Efficient packet capture and storage in 100 Gbit/s networks.",
                    "A framework for less than best effort congestion control with soft deadlines.",
                    "A template approach for group key distribution in dynamic ad-hoc groups.",
                    "Load balancing memcached traffic using software defined networking.",
                    "On per-flow delay bounds in tandem queues under (In)dependent arrivals.",
                    "Decentralized network protection games in adversarial environments.",
                    "DRENCH: A semi-distributed resource management framework for NFV based service function chaining.",
                    "Greedy caching: A latency-aware caching strategy for information-centric networks.",
                    "DISCO: Distributed traffic flow consolidation for power efficient data center network.",
                    "Mobile sessions in content-centric networks.",
                    "Protecting the long tail: Transparent packet security in content-centric networks.",
                    "Alternative backoff: Achieving low latency and high throughput with ECN and AQM.",
                    "Cascade size prediction in online social networks.",
                    "A graph theoretic approach to fast and accurate malware detection.",
                    "Early detection of in-the-wild botnet attacks by exploiting network communication uniformity: An empirical study.",
                    "Execution state management in named function networking.",
                    "In-network live stream processing with named functions.",
                    "A content-based centrality metric for collaborative caching in information-centric fogs.",
                    "Raising the datagram API to support transport protocol evolution.",
                    "A green small cells deployment in 5G - Switch ON/OFF via IoT networks & energy efficient mesh backhauling.",
                    "Binary contention resolution for M2M random access prioritization in LTE-A and 5G.",
                    "Predicting SLA conformance for cluster-based services.",
                    "Post sockets: Towards an evolvable network transport interface.",
                    "Understanding multistreaming for web traffic: An experimental study.",
                    "Transparent flow mapping for NEAT.",
                    "Benchmarking and simulating the fundamental scaling behaviors of a MapReduce engine.",
                    "Observing IoT resources over ICN.",
                    "Session support for SCN.",
                    "Edge-ICN and its application to the Internet of Things.",
                    "Isolated in-band communication for distributed SDN controllers.",
                    "Evaluating CAIA delay gradient as a candidate for deadline-aware less-than-best-effort transport.",
                    "Implementation of PI2 queuing discipline for classic TCP traffic in ns-3.",
                    "Fragility risks of low latency dynamic queuing in large-scale clouds: Complex system perspective.",
                    "Probe or wait: Handling tail losses using multipath TCP.",
                    "A lightweight measurement platform for home internet monitoring.",
                    "A NEAT framework for application-awareness in SDN environments.",
                    "Measuring PHY layer interactions between LoRa and IEEE 802.15.4g networks.",
                    "Distributing dynamic divisible loads.",
                    "On the impact of sybil attacks in cooperative driving scenarios.",
                    "Remote controlled performance analysis of embedded wireless sensor networks.",
                    "Secure chain replication.",
                    "Guard: Secure routing in skip graph.",
                    "Access control management and orchestration in NFV environment."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "Networking 2016",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2016",
                "sub_name": "2016 IFIP Networking Conference, Networking 2016 and Workshops, Vienna, Austria, May 17-19, 2016.",
                "count": 64,
                "papers": [
                    "Consistent updates in software defined networks: On dependencies, loop freedom, and blackholes.",
                    "Arrange your network updates as you wish.",
                    "Action computation for compositional software-defined networking.",
                    "Anomaly-free policy composition in software-defined networks.",
                    "Resilience of interdependent communication and power distribution networks against cascading failures.",
                    "Connectivity-aware virtual network embedding.",
                    "Time-aware congestion-free routing reconfiguration.",
                    "Scalable, self-healing, and self-optimizing routing overlays.",
                    "A hierarchical control plane for software-defined networks-based industrial control systems.",
                    "DistTM: Collaborative traffic matrix estimation in distributed SDN control planes.",
                    "STEAN: A storage and transformation engine for advanced networking context.",
                    "Efficient virtual network isolation in multi-tenant data centers on commodity ethernet switches.",
                    "FLOWer - Device benchmarking beyond 100 Gbit/s.",
                    "On time-stamp accuracy of passive monitoring in a container execution environment.",
                    "Congestion aware priority flow control in data center networks.",
                    "Overlaying delay-tolerant service using SDN.",
                    "Demand-aware centralized traffic scheduling in Wireless LANs.",
                    "A stochastic frame based approach to RFID tag searching.",
                    "Centralized multi-cell resource and power allocation for multiuser OFDMA networks.",
                    "Content-centric networking using anonymous datagrams.",
                    "BEAD: Best effort autonomous deletion in content-centric networking.",
                    "Improving the freshness of NDN forwarding states.",
                    "Performance evaluation of JT CoMP approach: Tractable model using spatial fluid modeling.",
                    "AMONET: A method for detecting and mitigating the data rate degradation due to interference over wireless networks.",
                    "On the delay performance of interference channels.",
                    "Investigating packet loss in mobile broadband networks under mobility.",
                    "\"Infect-me-not\": A user-centric and site-centric study of web-based malware.",
                    "Securing the Private Realm Gateway.",
                    "Verified iptables firewall analysis.",
                    "Does scale, size, and locality matter? Evaluation of collaborative BGP security mechanisms.",
                    "Measurement-based coalescing control for 802.3az.",
                    "Consolidating flows with implicit deadlines for energy-proportional data center networks.",
                    "Blending photons with electrons to reduce the energy footprint of IPTV networks.",
                    "Pin it! Improving Android network security at runtime.",
                    "End-to-end transparent transport-layer security for Internet-integrated mobile sensing devices.",
                    "User location tracking attacks for LTE networks using the interworking functionality.",
                    "Representation selection problem: Optimizing video delivery through caching.",
                    "MC3: A cloud caching strategy for next generation virtual content distribution networks.",
                    "Enhanced caching strategies at the edge of LTE mobile networks.",
                    "Optimized cooperative streaming in wireless mesh networks.",
                    "Tube streaming: Modelling collaborative media streaming in urban railway networks.",
                    "Energy-aware cooperative computation in mobile devices.",
                    "Device-to-device mobile data offloading for music streaming.",
                    "Analysing and leveraging client heterogeneity in swarming-based live streaming.",
                    "Mistrustful P2P: Privacy-preserving file sharing over untrustworthy Peer-to-Peer networks.",
                    "Go-with-the-winner: Performance based client-side server selection.",
                    "Utility-maximizing server selection.",
                    "TCP Hollywood: An unordered, time-lined, TCP for networked multimedia applications.",
                    "BLEST: Blocking estimation-based MPTCP scheduler for heterogeneous networks.",
                    "Multi-flow congestion control with network assistance.",
                    "Characterizing Interest aggregation in content-centric networks.",
                    "Let's collect names: How PANINI limits FIB tables in name based routing.",
                    "Scalable URL matching with small memory footprint.",
                    "Network quality differentiation: Regional effects, market entrance, and empirical testability.",
                    "Economics models and policies for cloud federations.",
                    "Backward-shifted strategies based on SVC for HTTP adaptive video streaming.",
                    "Sacrificing efficiency for quality of experience: YouTube's redundant traffic behavior.",
                    "Clique-aware mobile social clouds.",
                    "On the technical and social structure of community networks.",
                    "A flexible workload model based on roles of interactive users in social networks.",
                    "On improving tie strength estimates by aggregating multiple communication channels.",
                    "Group-based communication in WhatsApp.",
                    "Online engagement and well-being at higher education institutes: A German case study.",
                    "Performance of real-time collaborative editors at large scale: User perspective."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "Networking 2015",
        "info": "Toulouse, France",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2015",
                "sub_name": "Proceedings of the 14th IFIP Networking Conference, Networking 2015, Toulouse, France, 20-22 May, 2015.",
                "count": 48,
                "papers": [
                    "LT codes based distributed coding for efficient distributed storage in Wireless Sensor Networks.",
                    "Performance of in-network processing for visual analysis in wireless sensor networks.",
                    "2D-UBDA: A novel 2-Dimensional underwater WSN barrier deployment algorithm.",
                    "Congestion games in caching enabled heterogeneous cellular networks.",
                    "CCndnS: A strategy for spreading content and decoupling NDN caches.",
                    "Pragmatic router FIB caching.",
                    "Active Sense Queue Management (ASQM).",
                    "Non-intrusive scheduling of TCP flows.",
                    "Queue-aware uplink scheduling: Analysis, implementation, and evaluation.",
                    "An encryption-based access control framework for content-centric networking.",
                    "Information resilience through user-assisted caching in disruptive Content-Centric Networks.",
                    "A fault-tolerant forwarding strategy for interest-based information centric networks.",
                    "AS path inference: From complex network perspective.",
                    "Traffic duplication through segmentable disjoint paths.",
                    "Source-specific routing.",
                    "MDTC: An efficient approach to TCAM-based multidimensional table compression.",
                    "Automatic protocol field inference for deeper protocol understanding.",
                    "On the inter-domain scalability of route-by-name Information-Centric Network Architectures.",
                    "VoIP-based calibration of the DQX model.",
                    "Network-layer fairness for adaptive video streams.",
                    "Towards joint resource allocation and routing to optimize video distribution over future internet.",
                    "Network service embedding across multiple providers with nestor.",
                    "Multihomed Mobile Network Architecture.",
                    "Toward fully coordinated multi-level multi-carrier energy efficient networks.",
                    "Cloudlet network design optimization.",
                    "Dynamic service migration in mobile edge-clouds.",
                    "Energy-aware opportunistic mobile data offloading for users in urban environments.",
                    "Geographically fair in-network caching for mobile data offloading.",
                    "DHA: Distributed decisions on the switch migration toward a scalable SDN control plane.",
                    "Online virtual links resource allocation in Software-Defined Networks.",
                    "Achieving near-optimal traffic engineering in hybrid Software Defined Networks.",
                    "Developing a traffic classification platform for enterprise networks with SDN: Experiences & lessons learned.",
                    "IPv4 versus IPv6 - who connects faster?",
                    "Lightweight mobile bandwidth availability measurement.",
                    "Exploiting intra-packet dependency for fine-grained protocol format inference.",
                    "Online Social Networks anatomy: On the analysis of Facebook and WhatsApp in cellular networks.",
                    "Impact of provider failures on the traffic at a university campus.",
                    "FastID: An undeceived router for real-time identification of WiFi terminals.",
                    "Global VoIP security threats - large scale validation based on independent honeynets.",
                    "Survivable routing meets diversity coding.",
                    "Scalable sensor localization via ball-decomposition algorithm.",
                    "Dynamic active area clustering with inertial information for fingerprinting based indoor localization systems.",
                    "Algorithms for distributed feature extraction in multi-camera visual sensor networks.",
                    "Decentralized credit mining in P2P systems.",
                    "How dynamic is the ISPs address space? Towards internet-wide DHCP churn estimation.",
                    "TOPT: Supporting flash crowd events in hybrid overlay-based live streaming.",
                    "Spectrum aware virtual coordinates assignment and routing in multihop cognitive radio network.",
                    "Distributed spectrum management in TV White Space Cognitive Radio Networks."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "Networking 2014",
        "info": "Trondheim, Norway",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2014",
                "sub_name": "2014 IFIP Networking Conference, Trondheim, Norway, June 2-4, 2014.",
                "count": 55,
                "papers": [
                    "Peering vs transit: A game theoretical model for autonomous systems connectivity.",
                    "DROid: Adapting to individual mobility pays off in mobile data offloading.",
                    "On bufferbloat and delay analysis of multipath TCP in wireless networks.",
                    "Approximating the optimal weights for discrete-time generalized processor sharing.",
                    "Policy-compliant virtual network embedding.",
                    "Linking network usage patterns to traffic Gaussianity fit.",
                    "Understanding HTTP flow rates in cellular networks.",
                    "Hybrid multicast-unicast streaming over mobile networks.",
                    "On the topology maintenance of dynamic P2P overlays through self-healing local interactions.",
                    "Robust confidentiality preserving data delivery in federated coalition networks.",
                    "Differential games of competition in online content diffusion.",
                    "An optimal Cache management framework for information-centric networks with network coding.",
                    "Interference identification and resource management in OFDMA femtocell networks.",
                    "Characterizing Mobile Open APIs in smartphone apps.",
                    "Privacy and integrity preserving multi-dimensional range queries for cloud computing.",
                    "A first look at 802.11ac in action: Energy efficiency and interference characterization.",
                    "On the quality of BGP route collectors for iBGP policy inference.",
                    "A measurement study on the application-level performance of LTE.",
                    "NetSearch: Googling large-scale network management data.",
                    "pWeb: A personal interface to the world wide web.",
                    "Socially-aware caching strategy for content centric networking.",
                    "A distributed infrastructure to analyse SIP attacks in the Internet.",
                    "Price competition between road side units operators in vehicular networks.",
                    "On the controller placement for designing a distributed SDN control layer.",
                    "Distributed storage in the plane.",
                    "We are all treated equal, aren't we? - Flow-level performance as a function of flow size.",
                    "Optimal performance trade-offs in MAC for wireless sensor networks powered by heterogeneous ambient energy harvesting.",
                    "A study on traceroute potentiality in revealing the Internet AS-level topology.",
                    "Dynamic overload balancing in server farms.",
                    "On the scalability of interdomain path computations.",
                    "A storage-free data parasitizing scheme for wireless body area networks.",
                    "Migrating to Ipv6 - The role of basic coordination.",
                    "TB2F: Tree-bitmap and bloom-filter for a scalable and efficient name lookup in Content-Centric Networking.",
                    "CREATE: Correlation enhanced traffic matrix estimation in Data Center Networks.",
                    "Economics of traffic attraction by transit providers.",
                    "TRANSIT: Supporting transitions in Peer-to-Peer live video streaming.",
                    "Hybrid spectrum sharing through adaptive spectrum handoff for cognitive radio networks.",
                    "On the state of OSN-based Sybil defenses.",
                    "Analyzing anomalies in anonymized SIP traffic.",
                    "MaxiNet: Distributed emulation of software-defined networks.",
                    "Virtual network migration on real infrastructure: A PlanetLab case study.",
                    "GPS: A method for data sharing in Mobile Social Networks.",
                    "Coordinated fair resource sharing in dense indoor wireless networks.",
                    "When AIMD meets ICN: A bandwidth sharing perspective.",
                    "Game theoretic framework for power control in intercell interference coordination.",
                    "Can SPDY really make the web faster?",
                    "Understanding mobile Internet usage behavior.",
                    "Measuring the degree distribution of routers in the core internet.",
                    "A cascading framework for uncovering spammers in social networks.",
                    "SWAP: Security aware provisioning and migration of phone clones over mobile clouds.",
                    "Paid prioritization and its impact on net neutrality.",
                    "On the trade-off between cost and availability of virtual networks.",
                    "CQNCR: Optimal VM migration planning in cloud data centers.",
                    "Understanding the topological properties of Internet traffic: A view from the edge.",
                    "On the performance of the LISP beta network."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "Networking 2013",
        "info": "Brooklyn, New York, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2013",
                "sub_name": "IFIP Networking Conference, 2013, Brooklyn, New York, USA, 22-24 May, 2013.",
                "count": 50,
                "papers": [
                    "FERN: A unifying framework for name resolution across heterogeneous architectures.",
                    "H-Tree: An efficient index structure for event matching in publish/subscribe systems.",
                    "SamaritanCloud: Secure and scalable infrastructure for enabling location-based services.",
                    "CobWeb: In-network cobbling of web traffic.",
                    "ReSurf: Reconstructing web-surfing activity from network traffic.",
                    "Estimating traffic correlations from sampling and active network probing.",
                    "Interest flooding attack and countermeasures in Named Data Networking.",
                    "Implementation and evaluation of an information-centric network.",
                    "Pricing in Information-Centric Network interconnection.",
                    "Lessons from the past: Why data-driven states harm future information-centric networking.",
                    "Spatial and temporal locality of content in BitTorrent: A measurement study.",
                    "Open2Edit: A peer-to-peer platform for collaboration.",
                    "Balance visual saliency, reusability and potential relevance for caching P2P 3D streaming contents.",
                    "Entelecheia: Detecting P2P botnets in their waiting stage.",
                    "Understanding the complexity of 3G UMTS network performance.",
                    "Characterizing high-frequency subscriber sessions in cellular data networks.",
                    "Energy-efficient subcarrier allocation in SC-FDMA wireless networks based on multilateral model of bargaining.",
                    "Spectrum-aware radio resource management for scalable video multicast in LTE-advanced systems.",
                    "Routing with joker links for maximized robustness.",
                    "Critical regions and region-disjoint paths in a network.",
                    "Adaptive failure detection timers for IGP networks.",
                    "p-Cycle-based node failure protection for survivable virtual network embedding.",
                    "Edge versus host pacing of TCP traffic in small buffer networks.",
                    "(Deployable) reduction of multicast state with in-packet bloom filters.",
                    "SwitchReduce: Reducing switch state and controller involvement in OpenFlow networks.",
                    "A multi-level approach for evaluating internet topology generators.",
                    "Improving IP geolocation by crawling the internet PoP level graph.",
                    "The large-scale geography of Internet round trip times.",
                    "A network science perspective of a distributed reputation mechanism.",
                    "On a way to improve cyber-insurer profits when a security vendor becomes the cyber-insurer.",
                    "End-to-end transport-layer security for Internet-integrated sensing applications with mutual and delegated ECC public-key authentication.",
                    "Trust-based grouping for cloud datacenters: Improving security in shared infrastructures.",
                    "On the efficiency of non-cooperative load balancing.",
                    "Green IGP link weights for energy-efficiency and load-balancing in IP backbone networks.",
                    "Optimal OSPF traffic engineering using legacy Equal Cost Multipath load balancing.",
                    "Efficient traffic matrix estimation for data center networks.",
                    "Multi-domain virtual network embedding with limited information disclosure.",
                    "A general distributed approach to slice embedding with guarantees.",
                    "Design and analysis of schedules for virtual network migration.",
                    "Gaussian traffic revisited.",
                    "SANTaClass: A Self Adaptive Network Traffic Classification system.",
                    "Adaptive load-aware sampling for network monitoring on multicore commodity hardware.",
                    "Comparing underwater MAC protocols in real sea experiment.",
                    "Fast wireless protocol: A network stack design for wireless transmission.",
                    "A reliable, traffic-adaptive and energy-efficient link layer for wireless sensor networks.",
                    "The price of evolution in incremental network design: The case of mesh networks.",
                    "Modeling the guaranteed delivery of bulk data.",
                    "Reducing communication overhead for average consensus.",
                    "Data transfer paradigms for future networks: Fountain coding or congestion control?",
                    "Socially aware data partitioning for distributed storage of social data."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "Networking 2012",
        "info": "Prague, Czech Republic",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2012-1",
                "sub_name": "NETWORKING 2012 - 11th International IFIP TC 6 Networking Conference, Prague, Czech Republic, May 21-25, 2012, Proceedings, Part I.",
                "count": 32,
                "papers": [
                    "Efficient User-Assisted Content Distribution over Information-Centric Network.",
                    "On Inter-Domain Name Resolution for Information-Centric Networks.",
                    "Cache \"Less for More\" in Information-Centric Networks.",
                    "Collaborative Forwarding and Caching in Content Centric Networks.",
                    "Crawling and Detecting Community Structure in Online Social Networks Using Local Information.",
                    "Distributed Content Backup and Sharing Using Social Information.",
                    "Trans-Social Networks for Distributed Processing.",
                    "Context-Sensitive Sentiment Classification of Short Colloquial Text.",
                    "Resilience in Computer Network Management.",
                    "An Experimental Study on the Impact of Network Segmentation to the Resilience of Physical Processes.",
                    "On the Vulnerability of Hardware Hash Tables to Sophisticated Attacks.",
                    "Degree and Principal Eigenvectors in Complex Networks.",
                    "Resilient Virtual Network Design for End-to-End Cloud Services.",
                    "Dynamic Scaling of Call-Stateful SIP Services in the Cloud.",
                    "Remedy: Network-Aware Steady State VM Management for Data Centers.",
                    "Building a Flexible and Scalable Virtual Hardware Data Plane.",
                    "Permutation Routing for Increased Robustness in IP Networks.",
                    "Routing On Demand: Toward the Energy-Aware Traffic Engineering with OSPF.",
                    "Minimization of Network Power Consumption with Redundancy Elimination.",
                    "Sign What You Really Care about - Secure BGP AS Paths Efficiently.",
                    "Estimating Network Layer Subnet Characteristics via Statistical Sampling.",
                    "Sparsity without the Complexity: Loss Localisation Using Tree Measurements.",
                    "Efficient and Secure Decentralized Network Size Estimation.",
                    "A Panoramic View of 3G Data/Control-Plane Traffic: Mobile Device Perspective.",
                    "Towards a Robust Framework of Network Coordinate Systems.",
                    "BSense: A Flexible and Open-Source Broadband Mapping Framework.",
                    "Validity of Router Responses for IP Aliases Resolution.",
                    "Semantic Exploration of DNS.",
                    "On the Dynamics of Locators in LISP.",
                    "A Local Approach to Fast Failure Recovery of LISP Ingress Tunnel Routers.",
                    "An Analytical Model for the LISP Cache Size.",
                    "Path Computation in Multi-layer Multi-domain Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2012-2",
                "sub_name": "NETWORKING 2012 - 11th International IFIP TC 6 Networking Conference, Prague, Czech Republic, May 21-25, 2012, Proceedings, Part II.",
                "count": 32,
                "papers": [
                    "Quality Adaptation in P2P Video Streaming Based on Objective QoE Metrics.",
                    "Playback Policies for Live and On-Demand P2P Video Streaming.",
                    "SmoothCache: HTTP-Live Streaming Goes Peer-to-Peer.",
                    "Leveraging Video Viewing Patterns for Optimal Content Placement.",
                    "Enhancing Traffic Locality in BitTorrent via Shared Trackers.",
                    "A Task-Based Model for the Lifespan of Peer-to-Peer Swarms.",
                    "Using Centrality Metrics to Predict Peer Cooperation in Live Streaming Applications.",
                    "Content Publishing and Downloading Practice in BitTorrent.",
                    "Towards a Statistical Characterization of the Interdomain Traffic Matrix.",
                    "Characterizing Inter-domain Rerouting after Japan Earthquake.",
                    "Measuring the Evolution of Internet Peering Agreements.",
                    "Obscure Giants: Detecting the Provider-Free ASes.",
                    "Detecting Stealthy Backdoors with Association Rule Mining.",
                    "Security Adoption in Heterogeneous Networks: the Influence of Cyber-Insurance Market.",
                    "Secure Client Puzzles Based on Random Beacons.",
                    "Heterogeneous Secure Multi-Party Computation.",
                    "Competition in Access to Content.",
                    "Modelling the Tradeoffs in Overlay-ISP Cooperation.",
                    "Reducing the History in Decentralized Interaction-Based Reputation Systems.",
                    "On the Problem of Revenue Sharing in Multi-domain Federations.",
                    "On the Impact of a Road-Side Infrastructure for a DTN Deployed on a Public Transportation System.",
                    "Estimating File-Spread in Delay Tolerant Networks under Two-Hop Routing.",
                    "A Distributed Smart Application for Solar Powered WSNs.",
                    "A Two-Layer Approach for Energy Efficiency in Mobile Location Sensing Applications.",
                    "Maximizing Lifetime of Connected-Dominating-Set in Cognitive Radio Networks.",
                    "Traffic-Aware Channel Assignment for Multi-radio Wireless Networks.",
                    "QoE Analysis of Media Streaming in Wireless Data Networks.",
                    "Competition between Wireless Service Providers Sharing a Radio Resource.",
                    "Relay Placement for Two-Connectivity.",
                    "A 2-Approximation Algorithm for Optimal Deployment of k Base Stations in WSNs.",
                    "A Semi-dynamic Evolutionary Power Control Game.",
                    "Gossip-Based Counting in Dynamic Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2012w",
                "sub_name": "NETWORKING 2012 Workshops - International IFIP TC 6 Workshops, ETICS, HetsNets, and CompNets, Held at NETWORKING 2012, Prague, Czech Republic, May 25, 2012. Proceedings.",
                "count": 21,
                "papers": [
                    "A Fairness Model for Resource Allocation in Wireless Networks.",
                    "An Extension and Cooperation Mechanism for Heterogeneous Overlay Networks.",
                    "Dynamic Pricing Coalitional Game for Cognitive Radio Networks.",
                    "Evaluation of ON-OFF Schemes and Linear Prediction Methods for Increasing Energy Efficiency in Mobile Broadband Networks.",
                    "Challenge-Aware Traffic Protection in Wireless Mobile Backhaul Networks.",
                    "A Distributed Signaling Fast Mobile IPv6 Scheme for Next Generation Heterogeneous IP Networks.",
                    "Energy Efficiency Gains Using VHOs in Heterogeneous Networks.",
                    "Inter-Domain Route Diversity for the Internet.",
                    "A Proposal of Business Model Design Parameters for Future Internet Carriers.",
                    "Reputation-Aware Learning for SLA Negotiation.",
                    "From Quality of Experience to Willingness to Pay for Interconnection Service Quality.",
                    "An Instance-Based Approach for the Quantitative Assessment of Key Value Network Dependencies.",
                    "Evaluating Impacts of Oversubscription on Future Internet Business Models.",
                    "Inter-domain Coordination Models.",
                    "In Which Content to Specialize? A Game Theoretic Analysis.",
                    "Estimation of Expectable Network Quality in Wireless Mesh Networks.",
                    "Development of Localization Module for Various Smart Devices Platforms.",
                    "Improved GSM-Based Localization by Incorporating Secondary Network Characteristics.",
                    "Visualization of Complex Networks Dynamics: Case Study.",
                    "PCI Planning Strategies for Long Term Evolution Networks.",
                    "Effective Packet Loss Estimation on VoIP Jitter Buffer."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "Networking 2011",
        "info": "Valencia, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2011-1",
                "sub_name": "NETWORKING 2011 - 10th International IFIP TC 6 Networking Conference, Valencia, Spain, May 9-13, 2011, Proceedings, Part I.",
                "count": 36,
                "papers": [
                    "BotTrack: Tracking Botnets Using NetFlow and PageRank.",
                    "Learning Entropy.",
                    "Machine Learning Approach for IP-Flow Record Anomaly Detection.",
                    "UNADA: Unsupervised Network Anomaly Detection Using Sub-space Outliers Ranking.",
                    "Efficient Processing of Multi-connection Compressed Web Traffic.",
                    "The Resource Efficient Forwarding in the Content Centric Network.",
                    "Modelling and Evaluation of CCN-Caching Trees.",
                    "Empirical Evaluation of HTTP Adaptive Streaming under Vehicular Mobility.",
                    "MAC Layer Support for Delay Tolerant Video Transport in Disruptive MANETs.",
                    "DTN Support for News Dissemination in an Urban Area.",
                    "Stochastic Scheduling for Underwater Sensor Networks.",
                    "Using SensLAB as a First Class Scientific Tool for Large Scale Wireless Sensor Network Experiments.",
                    "Using Coordinated Transmission with Energy Efficient Ethernet.",
                    "Online Job-Migration for Reducing the Electricity Bill in the Cloud.",
                    "Stochastic Traffic Engineering for Live Audio/Video Delivering over Energy-Limited Wireless Access Networks.",
                    "VMFlow: Leveraging VM Mobility to Reduce Network Power Costs in Data Centers.",
                    "A Collaborative AAA Architecture to Enable Secure Real-World Network Mobility.",
                    "Markov Modulated Bi-variate Gaussian Processes for Mobility Modeling and Location Prediction.",
                    "Mobility Prediction Based Neighborhood Discovery in Mobile Ad Hoc Networks.",
                    "STEPS - An Approach for Human Mobility Modeling.",
                    "Epidemic Spread in Mobile Ad Hoc Networks: Determining the Tipping Point.",
                    "Small Worlds and Rapid Mixing with a Little More Randomness on Random Geometric Graphs.",
                    "A Random Walk Approach to Modeling the Dynamics of the Blogosphere.",
                    "A Nash Bargaining Solution for Cooperative Network Formation Games.",
                    "Optimal Node Placement in Distributed Wireless Security Architectures.",
                    "Geographical Location and Load Based Gateway Selection for Optimal Traffic Offload in Mobile Networks.",
                    "Femtocell Coverage Optimisation Using Statistical Verification.",
                    "Points of Interest Coverage with Connectivity Constraints Using Wireless Mobile Sensors.",
                    "A Deep Dive into the LISP Cache and What ISPs Should Know about It.",
                    "Data Plane Optimization in Open Virtual Routers.",
                    "Performance Comparison of Hardware Virtualization Platforms.",
                    "A Novel Scalable IPv6 Lookup Scheme Using Compressed Pipelined Tries.",
                    "oBGP: An Overlay for a Scalable iBGP Control Plane.",
                    "Scalability of iBGP Path Diversity Concepts.",
                    "MultiPath TCP: From Theory to Practice.",
                    "Stealthier Inter-packet Timing Covert Channels."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2011-2",
                "sub_name": "NETWORKING 2011 - 10th International IFIP TC 6 Networking Conference, Valencia, Spain, May 9-13, 2011, Proceedings, Part II.",
                "count": 28,
                "papers": [
                    "UDP NAT and Firewall Puncturing in the Wild.",
                    "Enhancing Peer-to-Peer Traffic Locality through Selective Tracker Blocking.",
                    "Defending against Sybil Nodes in BitTorrent.",
                    "Traffic Localization for DHT-Based BitTorrent Networks.",
                    "BGP and Inter-AS Economic Relationships.",
                    "Network Non-neutrality Debate: An Economic Analysis.",
                    "Strategyproof Mechanisms for Content Delivery via Layered Multicast.",
                    "A Flexible Auction Model for Virtual Private Networks.",
                    "Collaboration between ISPs for Efficient Overlay Traffic Management.",
                    "Optimal Joint Call Admission Control with Vertical Handoff on Heterogeneous Networks.",
                    "Balancing by PREFLEX: Congestion Aware Traffic Engineering.",
                    "EFD: An Efficient Low-Overhead Scheduler.",
                    "Flexible Dynamic Spectrum Allocation in Cognitive Radio Networks Based on Game-Theoretical Mechanism Design.",
                    "Channel Assignment and Access Protocols for Spectrum-Agile Networks with Single-Transceiver Radios.",
                    "The Problem of Sensing Unused Cellular Spectrum.",
                    "Adaptive Transmission of Variable-Bit-Rate Video Streams to Mobile Devices.",
                    "Multiscale Fairness and Its Application to Resource Allocation in Wireless Networks.",
                    "Fast-Converging Scheduling and Routing Algorithms for WiMAX Mesh Networks.",
                    "OFDMA Downlink Burst Allocation Mechanism for IEEE 802.16e Networks.",
                    "Adaptive On-The-Go Scheduling for End-to-End Delay Control in TDMA-Based Wireless Mesh Networks.",
                    "SMS: Collaborative S\\mathcal{S}treaming in M\\mathcal{M}obile S\\mathcal{S}ocial Networks.",
                    "Assessing the Effects of a Soft Cut-Off in the Twitter Social Network.",
                    "Characterising Aggregate Inter-contact Times in Heterogeneous Opportunistic Networks.",
                    "Are Friends Overrated? A Study for the Social Aggregator Digg.com.",
                    "Revisiting TCP Congestion Control Using Delay Gradients.",
                    "NF-TCP: A Network Friendly TCP Variant for Background Delay-Insensitive Applications.",
                    "Impact of Queueing Delay Estimation Error on Equilibrium and Its Stability.",
                    "On the Uplink Performance of TCP in Multi-rate 802.11 WLANs."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2011w",
                "sub_name": "NETWORKING 2011 Workshops - International IFIP TC 6 Workshops, PE-CRN, NC-Pro, WCNS, and SUNSET 2011, Held at NETWORKING 2011, Valencia, Spain, May 13, 2011, Revised Selected Papers.",
                "count": 28,
                "papers": [
                    "Discrete Time Analysis of Cognitive Radio Networks with Saturated Source of Secondary Users.",
                    "Cross-Entropy Optimized Cognitive Radio Policies.",
                    "Greedy versus Dynamic Channel Aggregation Strategy in CRNs: Markov Models and Performance Evaluation.",
                    "An Overview of Spectrum Occupancy Models for Cognitive Radio Networks.",
                    "Capacity Limits for a Cognitive Radio Network under Fading Channel.",
                    "Techno-Economic Evaluation of Cognitive Radio in a Factory Scenario.",
                    "A New Multicast Opportunistic Routing Protocol for Wireless Mesh Networks.",
                    "On Optimal Distributed Channel Allocation for Access Points in WLANs.",
                    "Realizing the Broker Based Dynamic Spectrum Allocation through LTE Virtualization and Uniform Auctioning.",
                    "Experimental Evaluation of a Robust MAC Protocol for Network Coded Two-Way Relaying.",
                    "An Implementation of Network Coding with Association Policies in Heterogeneous Networks.",
                    "When Both Transmitting and Receiving Energies Matter: An Application of Network Coding in Wireless Body Area Networks.",
                    "Decoding Algorithms for Random Linear Network Codes.",
                    "Energy-Aware Hardware Implementation of Network Coding.",
                    "Kodo: An Open and Research Oriented Network Coding Library.",
                    "BlueSnarf Revisited: OBEX FTP Service Directory Traversal.",
                    "Short and Efficient Certificate-Based Signature.",
                    "Privacy-Preserving Environment Monitoring in Networks of Mobile Devices.",
                    "Rescuing Wireless Sensor Networks Security from Science Fiction.",
                    "Decorrelating WSN Traffic Patterns with Maximally Uninformative Constrained Routing.",
                    "Low-Power Low-Rate Goes Long-Range: The Case for Secure and Cooperative Machine-to-Machine Communications.",
                    "Towards a Cooperative Intrusion Detection System for Cognitive Radio Networks.",
                    "Mobile Agent Code Updating and Authentication Protocol for Code-Centric RFID System.",
                    "Mobility in Collaborative Alert Systems: Building Trust through Reputation.",
                    "On the Impact of the TCP Acknowledgement Frequency on Energy Efficient Ethernet Performance.",
                    "The Trade-Off between Power Consumption and Latency in Computer Networks.",
                    "Characterization of Power-Aware Reconfiguration in FPGA-Based Networking Hardware.",
                    "Analyzing Local Strategies for Energy-Efficient Networking."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "Networking 2010",
        "info": "Chennai, India",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2010",
                "sub_name": "NETWORKING 2010, 9th International IFIP TC 6 Networking Conference, Chennai, India, May 11-15, 2010. Proceedings.",
                "count": 32,
                "papers": [
                    "Using Torrent Inflation to Efficiently Serve the Long Tail in Peer-Assisted Content Delivery Systems.",
                    "Network Distance Prediction Based on Decentralized Matrix Factorization.",
                    "Topology-Awareness and Reoptimization Mechanism for Virtual Network Embedding.",
                    "Survivable Virtual Network Embedding.",
                    "Toward Efficient On-Demand Streaming with BitTorrent.",
                    "Synapse: A Scalable Protocol for Interconnecting Heterogeneous Overlay Networks.",
                    "A Longitudinal Study of Small-Time Scaling Behavior of Internet Traffic.",
                    "Measurement Study of Multi-party Video Conferencing.",
                    "Passive Online RTT Estimation for Flow-Aware Routers Using One-Way Traffic.",
                    "A Flow Scheduler Architecture.",
                    "Stateless RD Network Services.",
                    "Multicast in Multi-channel Wireless Mesh Networks.",
                    "Ambient Interference Effects in Wi-Fi Networks.",
                    "A Zone Assignment Algorithm for Fractional Frequency Reuse in Mobile WiMAX Networks.",
                    "Handling Transient Link Failures Using Alternate Next Hop Counters.",
                    "Efficient Recovery from False State in Distributed Routing Algorithms.",
                    "IP Fast Reroute in Networks with Shared Risk Links.",
                    "EAU: Efficient Address Updating for Seamless Handover in Multi-homed Mobile Environments.",
                    "Speculative Validation of Web Objects for Further Reducing the User-Perceived Latency.",
                    "Dynamic Service Placement in Shared Service Hosting Infrastructures.",
                    "Evaluating the Impact of a Novel Warning Message Dissemination Scheme for VANETs Using Real City Maps.",
                    "Resource Optimization Algorithm for Sparse Time-Driven Sensor Networks.",
                    "Routing Protocol for Anycast Communications in a Wireless Sensor Network.",
                    "Fault-Tolerant Power-Aware Topology Control for Ad-Hoc Wireless Networks.",
                    "Server Guaranteed Cap: An Incentive Mechanism for Maximizing Streaming Quality in Heterogeneous Overlays.",
                    "End-to-End Throughput with Cooperative Communication in Multi-channel Wireless Networks.",
                    "Cost Bounds of Multicast Light-Trees in WDM Networks.",
                    "Bidirectional Range Extension for TCAM-Based Packet Classification.",
                    "Estimating the Economic Value of Flexibility in Access Network Unbundling.",
                    "Intercarrier Compensation between Providers of Different Layers: Advantages of Transmission Initiator Determination.",
                    "Application of Secondary Information for Misbehavior Detection in VANETs.",
                    "Path Attestation Scheme to Avert DDoS Flood Attacks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "Networking 2009",
        "info": "Aachen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2009",
                "sub_name": "NETWORKING 2009, 8th International IFIP-TC 6 Networking Conference, Aachen, Germany, May 11-15, 2009. Proceedings.",
                "count": 75,
                "papers": [
                    "Calibrating Wireless Sensor Network Simulation Models with Real-World Experiments.",
                    "Experimental Study: Link Quality and Deployment Issues in Wireless Sensor Networks.",
                    "Aggregation Protocols for High Rate, Low Delay Data Collection in Sensor Networks.",
                    "Event Based Fairness for Video Surveillance Sensor Networks.",
                    "Humpty Dumpty: Putting iBGP Back Together Again.",
                    "Performance Evaluation of Weighted Fair Queuing System Using Matrix Geometric Method.",
                    "Counting Flows over Sliding Windows in High Speed Networks.",
                    "Heterogeneous Protection in Regular and Complete Bi-partite Networks.",
                    "Conducting and Optimizing Eclipse Attacks in the Kad Peer-to-Peer Network.",
                    "On the Optimal Scheduling of Streaming Applications in Unstructured Meshes.",
                    "Identify P2P Traffic by Inspecting Data Transfer Behaviour.",
                    "Where Is My Peer? Evaluation of the Vivaldi Network Coordinate System in Azureus.",
                    "IP Fast ReRoute: Lightweight Not-Via.",
                    "QoS Support for Mobile Users Using NSIS.",
                    "Real Time Identification of SSH Encrypted Application Flows by Using Cluster Analysis Techniques.",
                    "Evaluation of a Multiobjective Alternative Routing Method in Carrier IP/MPLS Networks.",
                    "Dimensioning and Location Planning for Wireless Networks under Multi-level Cooperative Relaying.",
                    "Multi-user OFDMA Frame Aggregation for Future Wireless Local Area Networking.",
                    "WIFE: Wireless Indoor Positioning Based on Fingerprint Evaluation.",
                    "Performance Analysis of Packet Aggregation in WLANs with Simultaneous Multi-user Access.",
                    "Revisiting the Performance of Short TCP Transfers.",
                    "Why Are Peers Less Stable in Unpopular P2P Streaming Channels?.",
                    "Enhancing Application Identification by Means of Sequential Testing.",
                    "The Illusion of Being Deterministic - Application-Level Considerations on Delay in 3G HSPA Networks.",
                    "Phoenix: Towards an Accurate, Practical and Decentralized Network Coordinate System.",
                    "Topology Dynamics in a P2PTV Network.",
                    "Collaboration in BitTorrent Systems.",
                    "Detecting Triangle Inequality Violations in Internet Coordinate Systems by Supervised Learning.",
                    "Analysis of the Effects of XLFrames in a Network.",
                    "Complementing TCP Congestion Control with Forward Error Correction.",
                    "Collateral Damage: The Impact of Optimised TCP Variants on Real-Time Traffic Latency in Consumer Broadband Environments.",
                    "Why Rely on Blind AIMDs?",
                    "SBA: A Simple Backoff Algorithm for Wireless Ad Hoc Networks.",
                    "Hashing Backoff: A Collision-Free Wireless Access Method.",
                    "Optimal Placement of Multiple Interconnected Gateways in Heterogeneous Wireless Sensor Networks.",
                    "Extended Cooperative Balanced Space-Time Block Coding for Increased Efficiency in Wireless Sensor Networks.",
                    "Congestion and Flow Control in the Context of the Message-Oriented Protocol SCTP.",
                    "Compound TCP with Random Losses.",
                    "Preventing the Unnecessary Propagation of BGP Withdraws.",
                    "Backup Path Classification Based on Failure Risks for Efficient Backup Path Computation.",
                    "An Efficient Analytical Model for the Dimensioning of WiMAX Networks.",
                    "Performance Evaluation of Gradient Routing Strategies for Wireless Sensor Networks.",
                    "Online Estimation of Available Bandwidth and Fair Share Using Kalman Filtering.",
                    "A New Metric for Robustness with Respect to Virus Spread.",
                    "Practical Random Linear Network Coding on GPUs.",
                    "Peer-assisted On-demand Video Streaming with Selfish Peers.",
                    "Video Broadcasting to Heterogeneous Mobile Devices.",
                    "Scan Surveillance in Internet Networks.",
                    "Optimizing the Association Procedure for Low-Power 802.15.4 Nonbeacon Sensor Networks.",
                    "Impact of Misbehaviour on QoS in Wireless Mesh Networks.",
                    "An Uplink Bandwidth Management Framework for IEEE 802.16 with QoS Guarantees.",
                    "A Coalitional Game Model for Heat Diffusion Based Incentive Routing and Forwarding Scheme.",
                    "Performance Analysis of Centralized versus Distributed Recovery Schemes in P2P Storage Systems.",
                    "Analyzing Network Coverage in Unstructured Peer-to-Peer Networks: A Complex Network Approach.",
                    "Decentralized Bootstrapping of P2P Systems: A Practical View.",
                    "Performance Evaluation of Fast Startup Congestion Control Schemes.",
                    "A Unified Framework for Sub-stream Scheduling in P2P Hybrid Streaming Systems and How to Do Better?.",
                    "A Novel Content Distribution Mechanism in DHT Networks.",
                    "CHAP: Enabling Efficient Hardware-Based Multiple Hash Schemes for IP Lookup.",
                    "PUB-2-SUB: A Content-Based Publish/Subscribe Framework for Cooperative P2P Networks.",
                    "Minimum-Delay Load-Balancing through Non-parametric Regression.",
                    "A Power Benchmarking Framework for Network Devices.",
                    "MPLS Label Stacking on the Line Network.",
                    "Modelling and Performance Evaluation of Improved Access Mechanisms in a Novel Multiservice OPS Architecture.",
                    "On the Impact of Clustering on Measurement Reduction.",
                    "Topology Design for Service Overlay Networks with Economic and QoS Constraints.",
                    "Bandwidth Optimization for Multicast Transmissions in Virtual Circuit Networks.",
                    "Harmony - Advance Reservations in Heterogeneous Multi-domain Environments.",
                    "Creating Butterflies in the Core - A Network Coding Extension for MPLS/RSVP-TE.",
                    "Why Is This Web Page Coming Up so Slow? Investigating the Loss of SYN Packets.",
                    "Gravity-Based Local Clock Synchronization in Wireless Sensor Networks.",
                    "Two ID-Free Distributed Distance-2 Edge Coloring Algorithms for WSNs.",
                    "A Performance Model for Maintenance Tasks in an Environment of Virtualized Servers.",
                    "Towards Automated Secure Web Service Execution.",
                    "Performance Study of a Video Application over Multi Hop Wireless Networks with Statistic-Based Routing."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "Networking 2008",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2008",
                "sub_name": "NETWORKING 2008, Ad Hoc and Sensor Networks, Wireless Networks, Next Generation Internet , 7th International IFIP-TC6 Networking Conference, Singapore, May 5-9, 2008, Proceedings.",
                "count": 82,
                "papers": [
                    "XIAN Automated Management and Nano-Protocol to Design Cross-Layer Metrics for Ad Hoc Networking.",
                    "Cross-Layer Optimized Congestion, Contention and Power Control in Wireless Ad Hoc Networks.",
                    "Early Overhearing Avoidance in Wireless Sensor Networks.",
                    "Preamble MAC Protocols with Non-persistent Receivers in Wireless Sensor Networks.",
                    "An Overlay Maintenance Protocol for Overlay Routing on Top of Ad Hoc Networks.",
                    "An Overlay Architecture for Vehicular Networks.",
                    "DBR: Depth-Based Routing for Underwater Sensor Networks.",
                    "Channel Allocation for Multiple Channels Multiple Interfaces Communication in Wireless Ad Hoc Networks.",
                    "Resilience to Dropping Nodes in Mobile Ad Hoc Networks with Link-State Routing.",
                    "3-D Localization Schemes of RFID Tags with Static and Mobile Readers.",
                    "Performance Evaluation and Enhancement of Surface Coverage Relay Protocol.",
                    "On Extending Coverage of UMTS Networks Using an Ad-Hoc Network with Weighted Fair Queueing.",
                    "A Performance Analysis of Authentication Using Covert Timing Channels.",
                    "PassPattern System (PPS): A Pattern-Based User Authentication Scheme.",
                    "A Secure and Efficient Three-Pass Authenticated Key Agreement Protocol Based on Elliptic Curves.",
                    "On the Robustness of Complex Networks by Using the Algebraic Connectivity.",
                    "On the Social Cost of Distributed Selfish Content Replication.",
                    "On Performance Evaluation of Handling Streaming Traffic in IP Networks Using TFRC Protocol.",
                    "Efficient Heuristic for Minimum Cost Trees Construction in Multi-Groups Multicast.",
                    "Delay Bounds and Scalability for Overlay Multicast.",
                    "A Distributed Algorithm for Overlay Backbone Multicast Routing in Content Delivery Networks.",
                    "Network Performance Assessment Using Adaptive Traffic Sampling.",
                    "On the Applicability of Knowledge Based NAT-Traversal for Home Networks.",
                    "IP Performance Management Infrastructure for ISP.",
                    "Can Critical Real-Time Services of Public Infrastructures Run over Ethernet and MPLS Networks?.",
                    "Shim6: Reference Implementation and Optimization.",
                    "A Measurement Study of Bandwidth Estimation in IEEE 802.11g Wireless LANs Using the DCF.",
                    "Hierarchical Logical Topology in WDM Ring Networks with Limited ADMs.",
                    "A Novel Class-Based Protection Algorithm Providing Fast Service Recovery in IP/WDM Networks.",
                    "End-to-End Proportional Loss Differentiation in OBS Networks.",
                    "The Effect of Peer Selection with Hopcount or Delay Constraint on Peer-to-Peer Networking.",
                    "T2MC: A Peer-to-Peer Mismatch Reduction Technique by Traceroute and 2-Means Classification Algorithm.",
                    "Towards an ISP-Compliant, Peer-Friendly Design for Peer-to-Peer Networks.",
                    "Cache Placement Optimization in Hierarchical Networks: Analysis and Performance Evaluation.",
                    "Towards a Two-Tier Internet Coordinate System to Mitigate the Impact of Triangle Inequality Violations.",
                    "Efficient Multi-source Data Dissemination in Peer-to-Peer Networks.",
                    "Modeling Priority-Based Incentive Policies for Peer-Assisted Content Delivery Systems.",
                    "AQCS: Adaptive Queue-Based Chunk Scheduling for P2P Live Streaming.",
                    "E2E Blocking Probability of IPTV and P2PTV.",
                    "Cooperative Replication in Content Networks with Nodes under Churn.",
                    "Congestion Avoiding Mechanism Based on Inter-domain Hierarchy.",
                    "A Novel Bandwidth Broker Architecture Based on Topology Aggregation in Delay|Bandwidth Sensitive Networks.",
                    "Client-Side Adaptive Search Optimisation for Online Game Server Discovery.",
                    "A Model for Endpoint Admission Control Based on Packet Loss.",
                    "Convergence of Intra-domain Routing with Centralized Control.",
                    "Improving the Interaction between Overlay Routing and Traffic Engineering.",
                    "Designing Optimal iBGP Route-Reflection Topologies.",
                    "A Study of Path Protection in Self-Healing Routing.",
                    "The CPBT: A Method for Searching the Prefixes Using Coded Prefixes in B-Tree.",
                    "On the Effectiveness of Proactive Path-Diversity Based Routing for Robustness to Path Failures.",
                    "On Robustness and Countermeasures of Reliable Server Pooling Systems Against Denial of Service Attacks.",
                    "DDoS Mitigation in Non-cooperative Environments.",
                    "Generalized Self-healing Key Distribution Using Vector Space Access Structure.",
                    "A Model for Covert Botnet Communication in a Private Subnet.",
                    "Traffic Engineering and Routing in IP Networks with Centralized Control.",
                    "Distributed PLR-Based Backup Path Computation in MPLS Networks.",
                    "Adaptive Multi-topology IGP Based Traffic Engineering with Near-Optimal Network Performance.",
                    "Modeling TCP in Small-Buffer Networks.",
                    "Active Window Management: Performance Assessment through an Extensive Comparison with XCP.",
                    "AIRA: Additive Increase Rate Accelerator.",
                    "Performance Evaluation of Quick-Start TCP with a Linux Kernel Implementation.",
                    "Lightweight Fairness Solutions for XCP and TCP Cohabitation.",
                    "Concurrent Multipath Transfer Using SCTP Multihoming: Introducing the Potentially-Failed Destination State.",
                    "Energy-Efficient Mobile Middleware for SIP on Ubiquitous Multimedia Systems.",
                    "A Secure Mechanism for Address Block Allocation and Distribution.",
                    "Asset Localization in Data Centers Using WUSB Radios.",
                    "Improving the Performance of DCH Timing Adjustment in 3G Networks.",
                    "Link Adaptation Algorithm for the IEEE 802.11n MIMO System.",
                    "Thorough Analysis of 802.11e Star Topology Scenarios in the Presence of Hidden Nodes.",
                    "A Mobility-Adaptive TDMA MAC for Real-Time Data in Wireless Networks.",
                    "High Performance Distributed Coordination Function for Wireless LANs.",
                    "Turning Hidden Nodes into Helper Nodes in IEEE 802.11 Wireless LAN Networks.",
                    "Performance Evaluation of 802.11 Broadcasts for A Single Cell Network With Unsaturated Nodes.",
                    "Optimal Placement of Mesh Points in Wireless Mesh Networks.",
                    "A Distributed Channel Access Scheduling Scheme with Clean-Air Spatial Reuse for Wireless Mesh Networks.",
                    "A Unified Service Discovery Architecture for Wireless Mesh Networks.",
                    "Using Predictive Triggers to Improve Handover Performance in Mixed Networks.",
                    "Medium Access Cooperations for Improving VoIP Capacity over Hybrid 802.16/802.11 Cognitive Radio Networks.",
                    "ERA: Effective Rate Adaptation for WLANs.",
                    "On the Probability of Finding Non-interfering Paths in Wireless Multihop Networks.",
                    "Multi-commodity Flow Problem for Multi-hop Wireless Networks with Realistic Smart Antenna Model.",
                    "Evolutionary Power Control Games in Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "Networking 2007",
        "info": "Atlanta, GA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2007",
                "sub_name": "NETWORKING 2007. Ad Hoc and Sensor Networks, Wireless Networks, Next Generation Internet, 6th International IFIP-TC6 Networking Conference, Atlanta, GA, USA, May 14-18, 2007, Proceedings.",
                "count": 123,
                "papers": [
                    "On the Resilient Overlay Topology Formation in Multi-hop Wireless Networks.",
                    "Placing and Maintaining a Core Node in Wireless Ad Hoc Sensor Networks.",
                    "Flooding Speed in Wireless Multihop Networks with Randomized Beamforming.",
                    "Power Amplifier Characteristic-Aware Energy-Efficient Transmission Strategy.",
                    "Energy Efficient Throughput Optimization in Multi-hop Wireless Networks.",
                    "Election Based Hybrid Channel Access.",
                    "Asynchronous Data Aggregation for Real-Time Monitoring in Sensor Networks.",
                    "A Novel Agent-Based User-Network Communication Model in Wireless Sensor Networks.",
                    "Realistic Mobility and Propagation Framework for MANET Simulations.",
                    "Localization for Large-Scale Underwater Sensor Networks.",
                    "Location-Unaware Sensing Range Assignment in Sensor Networks.",
                    "A Distributed Energy-Efficient Topology Control Routing for Mobile Wireless Sensor Networks.",
                    "Integrated Clustering and Routing Strategies for Large Scale Sensor Networks.",
                    "On-Demand Routing in Disrupted Environments.",
                    "Delivery Guarantees in Predictable Disruption Tolerant Networks.",
                    "PWave: A Multi-source Multi-sink Anycast Routing Framework for Wireless Sensor Networks.",
                    "Simple Models for the Performance Evaluation of a Class of Two-Hop Relay Protocols.",
                    "Maximum Energy Welfare Routing in Wireless Sensor Networks.",
                    "Analysis of Location Privacy/Energy Efficiency Tradeoffs in Wireless Sensor Networks.",
                    "Efficient Error Recovery Using Network Coding in Underwater Sensor Networks.",
                    "Key Predistribution Schemes for Sensor Networks for Continuous Deployment Scenario.",
                    "Using Auxiliary Sensors for Pairwise Key Establishment in WSN.",
                    "Privacy-Aware Multi-Context RFID Infrastructure Using Public Key Cryptography.",
                    "Minimum Cost Configuration of Relay and Channel Infrastructure in Heterogeneous Wireless Mesh Networks.",
                    "Optimization Models for the Radio Planning of Wireless Mesh Networks.",
                    "Interference-Aware Multicasting in Wireless Mesh Networks.",
                    "Characterizing the Capacity Gain of Stream Control Scheduling in MIMO Wireless Mesh Networks.",
                    "AP and MN-Centric Mobility Prediction: A Comparative Study Based on Wireless Traces.",
                    "A Flexible and Distributed Home Agent Architecture for Mobile IPv6-Based Networks.",
                    "Using PANA for Mobile IPv6 Bootstrapping.",
                    "Detecting 802.11 Wireless Hosts from Remote Passive Observations.",
                    "A Scheme for Enhancing TCP Fairness and Throughput in IEEE 802.11 WLANs.",
                    "TCP NJ+: Packet Loss Differentiated Transmission Mechanism Robust to High BER Environments.",
                    "TCP WestwoodVT: A Novel Technique for Discriminating the Cause of Packet Loss in Wireless Networks.",
                    "Modeling TCP in a Multi-rate Multi-user CDMA System.",
                    "IEEE 802.11b Cooperative Protocols: A Performance Study.",
                    "It Is Better to Give Than to Receive - Implications of Cooperation in a Real Environment.",
                    "Modeling Approximations for an IEEE 802.11 WLAN Under Poisson MAC-Level Arrivals.",
                    "Performance and Equilibrium Analysis of Heterogeneous IEEE 802.11 Based WLANs.",
                    "Exploring a New Approach to Collision Avoidance in Wireless Ad Hoc Networks.",
                    "Video Rate Adaptation and Scheduling in Multi-rate Wireless Networks.",
                    "On Scheduling and Interference Coordination Policies for Multicell OFDMA Networks.",
                    "Distributed Uplink Scheduling in CDMA Networks.",
                    "Resource Allocation in DVB-RCS Satellite Systems.",
                    "Enhanced Downlink Capacity in UMTS Supported by Direct Mobile-to-Mobile Data Transfer.",
                    "Impact of Technology Overlap in Next-Generation Wireless Heterogeneous Systems.",
                    "An On-Line Measurement-Based Admission Control for VBR Video Traffic in Wireless Multimedia Home Networks.",
                    "On Event Signal Reconstruction in Wireless Sensor Networks.",
                    "Peer-Assisted On-Demand Streaming of Stored Media Using BitTorrent-Like Protocols.",
                    "Multiple Identities in BitTorrent Networks.",
                    "Graph Based Modeling of P2P Streaming Systems.",
                    "Modeling Seed Scheduling Strategies in BitTorrent.",
                    "Streaming Performance in Multiple-Tree-Based Overlays.",
                    "Path Selection Using Available Bandwidth Estimation in Overlay-Based Video Streaming.",
                    "Fundamental Tradeoffs in Distributed Algorithms for Rate Adaptive Multimedia Streams.",
                    "Optimal Policies for Playing Buffered Media Streams.",
                    "Non-parametric and Self-tuning Measurement-Based Admission Control.",
                    "Optimal Rate Allocation in Overlay Content Distribution.",
                    "SLA Adaptation for Service Overlay Networks.",
                    "Virtual Private Network to Spanning Tree Mapping.",
                    "Optimal Topology Design for Overlay Networks.",
                    "Construction of a Proxy-Based Overlay Skeleton Tree for Large-Scale Real-Time Group Communications.",
                    "Increasing the Coverage of a Cooperative Internet Topology Discovery Algorithm.",
                    "Robust IP Link Costs for Multilayer Resilience.",
                    "Integer SPM: Intelligent Path Selection for Resilient Networks.",
                    "Beyond Centrality - Classifying Topological Significance Using Backup Efficiency and Alternative Paths.",
                    "Incorporating Protection Mechanisms in the Dynamic Multi-layer Routing Schemes.",
                    "Accelerated Packet Placement Architecture for Parallel Shared Memory Routers.",
                    "RSVP-TE Extensions to Provide Guarantee of Service to MPLS.",
                    "An Adaptive Management Approach to Resolving Policy Conflicts.",
                    "Reinforcement Learning-Based Load Shared Sequential Routing.",
                    "An Adaptive Neuron AQM for a Stable Internet.",
                    "Light-Weight Control of Non-responsive Traffic with Low Buffer Requirements.",
                    "The Effects of Fairness in Buffer Sizing.",
                    "Time to Buffer Overflow in an MMPP Queue.",
                    "Fundamental Effects of Clustering on the Euclidean Embedding of Internet Hosts.",
                    "A Multihoming Based IPv4/IPv6 Transition Approach.",
                    "Offline and Online Network Traffic Characterization.",
                    "Catching IP Traffic Burstiness with a Lightweight Generator.",
                    "Importance of the Maturity of Photonic Component Industry on the Business Prospects of Optical Access Networks: A Techno-Economic Analysis.",
                    "The Token Based Switch: Per-Packet Access Authorisation to Optical Shortcuts.",
                    "Online Multicasting in WDM Networks with Shared Light Splitter Bank.",
                    "Evaluation of Optical Burst-Switching as a Multiservice Environment.",
                    "The TCP Minimum RTO Revisited.",
                    "Improving XCP to Achieve Max-Min Fair Bandwidth Allocation.",
                    "TCP Libra : Exploring RTT-Fairness for TCP.",
                    "Interactions of Intelligent Route Control with TCP Congestion Control.",
                    "Fast and Scalable Classification of Structured Data in the Network.",
                    "An Efficient and Secure Event Signature (EASES) Protocol for Peer-to-Peer Massively Multiplayer Online Games.",
                    "Unified Defense Against DDoS Attacks.",
                    "Integrity-Aware Bandwidth Guarding Approach in P2P Networks.",
                    "Measuring Bandwidth Signatures of Network Paths.",
                    "A Non-cooperative Active Measurement Technique for Estimating the Average and Variance of the One-Way Delay.",
                    "The P2P War: Someone Is Monitoring Your Activities!",
                    "On-Line Predictive Load Shedding for Network Monitoring.",
                    "On the Schedulability of Measurement Conflict in Overlay Networks.",
                    "SEA-LABS: A Wireless Sensor Network for Sustained Monitoring of Coral Reefs.",
                    "Capacity-Fairness Performance of an Ad Hoc IEEE 802.11 WLAN with Noncooperative Stations.",
                    "Multi-rate Support for Network-Wide Broadcasting in MANETs.",
                    "BRD: Bilateral Route Discovery in Mobile Ad Hoc Networks.",
                    "Correction, Generalisation and Validation of the \"Max-Min d-Cluster Formation Heuristic\".",
                    "Analytical Performance Evaluation of Distributed Multicast Algorithms for Directional Communications in WANETs.",
                    "Beyond Proportional Fair: Designing Robust Wireless Schedulers.",
                    "A Voluntary Relaying MAC Protocol for Multi-rate Wireless Local Area Networks.",
                    "Throughput Analysis Considering Capture Effect in IEEE 802.11 Networks.",
                    "Performance Improvement of IEEE 802.15.4 Beacon-Enabled WPAN with Superframe Adaptation Via Traffic Indication.",
                    "Analysis of WLAN Traffic in the Wild.",
                    "Enhanced Rate Adaptation Schemes with Collision Awareness.",
                    "A Study of Performance Improvement in EAP.",
                    "Characterization of Ultra Wideband Channel in Data Centers.",
                    "Evaluating Internal BGP Networks from the Data Plane.",
                    "Performance of a Partially Shared Buffer with Correlated Arrivals.",
                    "Filter-Based RFD: Can We Stabilize Network Without Sacrificing Reachability Too Much?",
                    "Network Access in a Diversified Internet.",
                    "Outburst: Efficient Overlay Content Distribution with Rateless Codes.",
                    "Adaptive Window-Tuning Algorithm for Efficient Bandwidth Allocation on EPON.",
                    "Optical Burst Control Algorithm for Reducing the Effect of Congestion Reaction Delay.",
                    "Incremental Provision of QoS Discarding Non-feasible End-to-End Paths.",
                    "Enhancing Guaranteed Delays with Network Coding.",
                    "LPD Based Route Optimization in Nested Mobile Network.",
                    "PIBUS: A Network Memory-Based Peer-to-Peer IO Buffering Service.",
                    "A Subgradient Optimization Approach to Inter-domain Routing in IP/MPLS Networks.",
                    "Cost-Based Approach to Access Selection and Vertical Handover Decision in Multi-access Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "Networking 2006",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2006",
                "sub_name": "NETWORKING 2006 - Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; Mobile and Wireless Communications Systems, 5th International IFIP-TC6 Networking Conference, Coimbra, Portugal, May 15-19, 2006, Proceedings.",
                "count": 119,
                "papers": [
                    "A Scheme to Provide Proportionally Differentiated End-to-End Packet Delay in Wireless Multi-hop Ad Hoc Networks.",
                    "Service Differentiation Via Adaptive Gateway Discovery in Ad Hoc Networks Connected to Wired Networks.",
                    "Stability-Throughput Tradeoff and Routing in Multi-hop Wireless Ad-Hoc Networks.",
                    "EASR: An Energy Aware Source Routing with Disjoint Multipath Selection for Energy-Efficient Multihop Wireless Ad Hoc Networks.",
                    "On Improving the Accuracy of OSPF Traffic Engineering.",
                    "Achieving Bursty Traffic Guarantees by Integrating Traffic Engineering and Buffer Management Tools.",
                    "How Well Do Traffic Engineering Objective Functions Meet TE Requirements?.",
                    "Variable Step Fluid Simulation for Communication Network.",
                    "Estimating Link Capacity in High Speed Networks.",
                    "Internet Traffic Mid-term Forecasting: A Pragmatic Approach Using Statistical Analysis Tools.",
                    "Semantic Compression of TCP Traces.",
                    "Traffic Anomaly Detection and Characterization in the Tunisian National University Network.",
                    "B-EDCA: A New IEEE 802.11e-Based QoS Protocol for Multimedia Wireless Communications.",
                    "A Lagrangian Approach for the Optimal Placement of Wireless Relay Nodes in Wireless Local Area Networks.",
                    "Correlated Equilibrium in Access Control for Wireless Communications.",
                    "Design and Analysis of an Adaptive Backoff Algorithm for IEEE 802.11 DCF Mechanism.",
                    "A Comparison of Exact and epsilon-Approximation Algorithms for Constrained Routing.",
                    "Path Selection Techniques to Establish Constrained Interdomain MPLS LSPs.",
                    "Reliable Routings in Networks with Generalized Link Failure Events.",
                    "Making Outbound Route Selection Robust to Egress Point Failure.",
                    "An Approach to Off-Line Inter-domain QoS-Aware Resource Optimization.",
                    "A Distributed QoS Scheduler for Smoothing Output Traffic of Input Buffered Switches.",
                    "VoD QAM Resource Allocation Algorithms.",
                    "Performance of Experience-Based Admission Control in the Presence of Traffic Changes.",
                    "Topologically-Aware AAA Overlay Network in Mobile IPv6 Environment.",
                    "QoS-Aware Multi-tier Location Managements for Integrated WLAN/UMTS Networks.",
                    "Leveraging Buffering Delay Estimation for Geolocation of Internet Hosts.",
                    "A Feedback Control Approach to Mitigating Mistreatment in Distributed Caching Groups.",
                    "Locality of Reference in an Hierarchy of Web Caches.",
                    "DMTP: Controlling Spam Through Message Delivery Differentiation.",
                    "Delay Performance Analysis for an Agile All-Photonic Star Network.",
                    "Designing Scalable WDM Optical Interconnects Using Predefined Wavelength Conversion.",
                    "Designing Fast and Bandwidth Efficient Protection Scheme for WDM Optical Networks.",
                    "Increasing Fairness and Efficiency Using the MadMac Protocol in Ad Hoc Networks.",
                    "Duplicate Address Detection in Wireless Ad Hoc Networks Using Wireless Nature.",
                    "Fault Monitoring in Ad-Hoc Networks Based on Information Theory.",
                    "Performance Analysis of Exposed Terminal Effect in IEEE 802.11 Ad Hoc Networks in Finite Load Conditions.",
                    "Modeling and Performance Evaluation of SCTP as Transport Protocol for Firewall Control.",
                    "Transport Layer Issues in Delay Tolerant Mobile Networks.",
                    "Performance of Competing High-Speed TCP Flows.",
                    "On the Accuracy of Analytical Models of TCP Throughput.",
                    "High Speed Packet Logging on a Budget.",
                    "An Efficient Overlay Link Performance Monitoring Technique.",
                    "Measurement of Radio Propagation Path Loss over the Sea for Wireless Multimedia.",
                    "Workload Loss Examinations with a Novel Probabilistic Extension of Network Calculus.",
                    "Optimized Handoff Decision Mechanisms for Scalable Network Mobility Support.",
                    "Fast Re-authentication for Handovers in Wireless Communication Networks.",
                    "Handover Operation in Mobile IP-over-MPLS Networks.",
                    "The Design and Implementation of a Quality-Based Handover Trigger.",
                    "An Efficient Algorithm for Resource Sharing in Peer-to-Peer Networks.",
                    "On the Identification and Analysis of P2P Traffic Aggregation.",
                    "A Decentralized Recommendation System Based on Self-organizing Partnerships.",
                    "Enhancing the P2P Protocols to Support Advanced Multi-keyword Queries.",
                    "Chasing: An Efficient Streaming Mechanism for Scalable and Resilient Video-on-Demand Service over Peer-to-Peer Networks.",
                    "A Practical Approach to SIP, QoS and AAA Integration.",
                    "Efficient Overlay Audio Conferencing.",
                    "On the Stability of End-Point-Based Multimedia Streaming.",
                    "Multicast Tree Aggregation in Large Domains.",
                    "Analysis and Performance Evaluation of a Multicast File Transfer Solution for Congested Asymmetric Networks.",
                    "Multi-Layer Traffic Engineering Through Adaptive lambda-Path Fragmentation and De-fragmentation.",
                    "Managing Traffic Demand Uncertainty in Replica Server Placement with Robust Optimization.",
                    "An Information Theoretic Approach for Systems with Parallel Distributions: Case Studying Internet Traffic.",
                    "Characterization of the Burst Aggregation Process in Optical Burst Switching.",
                    "Improving Bandwidth Efficiency in a Multi-service Slotted Dual Bus Optical Ring Network.",
                    "Issues on Performance Assessment of Optical Burst Switched Networks: Burst Loss Versus Packet Loss Metrics.",
                    "A Multi-hop MAC Forwarding Protocol for Inter-vehicular Communication.",
                    "Route Lifetime Based Optimal Hop Selection in VANETs on Highway: An Analytical Viewpoint.",
                    "On the Performances of the Routing Protocols in MANET: Classical Versus Self-organized Approaches.",
                    "Performance Modeling of Epidemic Routing.",
                    "Maximum Lifetime Routing and Data Aggregation for Wireless Sensor Networks.",
                    "Managing Random Sensor Networks by means of Grid Emulation.",
                    "Distributed Data Gathering in Multi-sink Sensor Networks with Correlated Sources.",
                    "Abstract Frames for Reducing Overhearing in Wireless Sensor Networks.",
                    "Dynamic Resource Allocation in Communication Networks.",
                    "Fair Assured Services Without Any Special Support at the Core.",
                    "Max-Min Fair Distribution of Modular Network Flows on Fixed Paths.",
                    "Anticipatory Distributed Packet Filter Configuration for Carrier-Grade IP-Networks.",
                    "Fast Handoff Scheme for Seamless Multimedia Service in Wireless LAN.",
                    "On the Tradeoff Between Blocking and Dropping Probabilities in CDMA Networks Supporting Elastic Services.",
                    "A Point-to-Point Protocol Improvement to Reduce Data Call Setup Latency in Cdma2000 System.",
                    "Performance and Analysis of CDM-FH-OFDMA for Broadband Wireless Systems.",
                    "Multi-service Routing: A Routing Proposal for the Next Generation Internet.",
                    "Quantifying the BGP Routes Diversity Inside a Tier-1 Network.",
                    "Distributed QoS Routing for Backbone Overlay Networks.",
                    "Distributed Linear Time Construction of Colored Trees for Disjoint Multipath Routing.",
                    "Cross-Virtual Concatenation for Ethernet-over-SONET/SDH Networks.",
                    "Optimal Wavelength Converter Placement with Guaranteed Wavelength Usage.",
                    "Estimating Network Offered Load for Optical Burst Switching Networks.",
                    "An Adaptive Parameter Deflection Routing to Resolve Contentions in OBS Networks.",
                    "Bandwidth Utilization in Sorted-Priority Schedulers.",
                    "A Multicast Approach for UMTS: A Performance Study.",
                    "Echidna: Efficient Clustering of Hierarchical Data for Network Traffic Analysis.",
                    "Cross-Layer Performance of a Distributed Real-Time MAC Protocol Supporting Variable Bit Rate Multiclass Services in WPANs.",
                    "Performance Analysis of IEEE802.16e Random Access Protocol with Mobility.",
                    "Cost-Benefit Analysis of Web Prefetching Algorithms from the User's Point of View.",
                    "An MPLS-Based Micro-mobility Solution.",
                    "A Comparative Performance Study of IPv6 Transitioning Mechanisms - NAT-PT vs. TRT vs. DSTM.",
                    "CAC: Context Adaptive Clustering for Efficient Data Aggregation in Wireless Sensor Networks.",
                    "On the Performance of Cooperative Diversity in Infrastructure-Based Networks with Two Relays.",
                    "IP Mobility Support with a Multihomed Mobile Router.",
                    "Performance Analysis and Design: Power Saving Backoff Algorithm for IEEE 802.11 DCF.",
                    "A Fast Pattern-Matching Algorithm for Network Intrusion Detection System.",
                    "Multicast OLSP Establishment Scheme in OVPN over IP/GMPLS over DWDM.",
                    "Directional Reception vs. Directional Transmission for Maximum Lifetime Multicast Delivery in Ad-Hoc Networks.",
                    "Micro- and Macroscopic Analysis of RTT Variability in GPRS and UMTS Networks.",
                    "Control Plane Protection Using Link Management Protocol (LMP) in the ASON/GMPLS CARISMA Network.",
                    "A Novel Resource Allocation Scheme for Reducing MAP Overhead and Maximizing Throughput in MIMO-OFDM Systems.",
                    "Secure Routing Using Factual Correctness.",
                    "Entropy Based Flow Aggregation.",
                    "Monitoring Wireless Sensor Networks Using a Model-Aided Approach.",
                    "VBF: Vector-Based Forwarding Protocol for Underwater Sensor Networks.",
                    "Hybrid ARQ Scheme with Antenna Permutation for MIMO Systems in Slow Fading Channels.",
                    "Scalable Quantitative Delay Guarantee Support in DiffServ Networks Through NSIS.",
                    "SDC: A Distributed Clustering Protocol for Peer-to-Peer Networks.",
                    "A New Burst Scheduling Algorithm for Edge/Core Node Combined Optical Burst Switched Networks.",
                    "Distributed Real-Time Monitoring with Accuracy Objectives.",
                    "Improving Load Balance of Ethernet Carrier Networks Using IEEE 802.1S MSTP with Multiple Regions.",
                    "A Simple Sink Mobility Support Algorithm for Routing Protocols in Wireless Sensor Networks.",
                    "Concurrent Diagnosis of Clustered Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "Networking 2005",
        "info": "Waterloo, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2005",
                "sub_name": "NETWORKING 2005: Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; Mobile and Wireless Communication Systems, 4th International IFIP-TC6 Networking Conference, Waterloo, Canada, May 2-6, 2005, Proceedings.",
                "count": 141,
                "papers": [
                    "Topology-Aware Peer-to-Peer On-demand Streaming.",
                    "The Scalability of Swarming Peer-to-Peer Content Delivery.",
                    "Leopard: A Locality Aware Peer-to-Peer System with No Hot Spot.",
                    "PeerMint: Decentralized and Secure Accounting for Peer-to-Peer Applications.",
                    "Highly Responsive and Efficient QoS Routing Using Pre- and On-demand Computations Along with a New Normal Measure.",
                    "An Architecture for Software-Based iSCSI: Experiences and Analyses.",
                    "Reorder Density (RD): A Formal, Comprehensive Metric for Packet Reordering.",
                    "Batch Scheduling Algorithms for Optical Burst Switching Networks.",
                    "ECC Based Threshold Cryptography for Secure Data Forwarding and Secure Key Exchange in MANET (I).",
                    "Mutual Authentication and Key Exchange Protocols with Anonymity Property for Roaming Services.",
                    "An Energy-Efficient Image Representation for Secure Mobile Systems.",
                    "Efficient Clustering for Multicast Key Distribution in MANETs.",
                    "Using Secure Coprocessors to Protect Access to Enterprise Networks.",
                    "Trusted Security Devices for Bandwidth Conservation in IPSec Environments.",
                    "LIPS: Lightweight Internet Permit System for Stopping Unwanted Packets.",
                    "Victim-Assisted Mitigation Technique for TCP-Based Reflector DDoS Attacks.",
                    "Performance Analysis of the Uplink of a CDMA Cell Supporting Elastic Services.",
                    "Queue Analysis for Wireless Packet Data Traffic.",
                    "Modeling a Beacon Enabled 802.15.4 Cluster with Bidirectional Traffic.",
                    "Analysis of Windowing and Peering Schemes for Cache Coherency in Mobile Devices.",
                    "Fast Scalable Robust Node Enumeration.",
                    "gTrace: Simple Mechanisms for Monitoring of Multicast Sessions.",
                    "Toward Feasibility and Scalability of Session Initiation and Dynamic QoS Provisioning in Policy-Enabled Networks.",
                    "Modeling Soft State Protocols with SDL.",
                    "Inferring Traffic Burstiness by Sampling the Buffer Occupancy.",
                    "Modeling Available Bandwidth for an Efficient QoS Characterization of a Network Path.",
                    "Reducing Large Internet Topologies for Faster Simulations.",
                    "Dimensioning the Contention Channel of DOCSIS Cable Modem Networks.",
                    "CONTI: Constant-Time Contention Resolution for WLAN Access.",
                    "Efficient 3G/WLAN Interworking Techniques for Seamless Roaming Services with Location-Aware Authentication.",
                    "A New per-Class Flow Fixed Proportional Differentiated Service for Multi-service Wireless LAN.",
                    "Reservation and Grouping Stations for the IEEE 802.11 DCF.",
                    "Path Switching in OBS Networks.",
                    "A Priority-Aware Protection Technique for Quality of Service Enabled WDM Networks.",
                    "Wavelength Rerouting in Survivable WDM Networks.",
                    "Performance of Server Selection Algorithms for Content Replication Networks.",
                    "Local Utility Aware Content Replication.",
                    "Improving Network Convergence Time and Network Stability of an OSPF-Routed IP Network.",
                    "Non-cooperative Forwarding in Ad-Hoc Networks.",
                    "Efficient Broadcasting in Ad Hoc Networks Using Directional Antennas.",
                    "Trellis-Based Virtual Regular Addressing Structures in Self-organized Networks.",
                    "Network of Shortcuts: An Adaptive Data Structure for Tree-Based Search Methods.",
                    "Multipath Routing Algorithms for Congestion Minimization.",
                    "Improving TCP in Wireless Networks with an Adaptive Machine-Learnt Classifier of Packet Loss Causes.",
                    "A Multiple Time-Scale Model for TCP Bandwidth Sharing Under User Heterogeneity.",
                    "A Multizone Pipelined Cache for IP Routing.",
                    "Aggregated Aggressiveness Control on Groups of TCP Flows.",
                    "Multi-level Dynamic Guard Channels for Priority Access in Cellular Systems.",
                    "Slotted Aloha with Priorities and Random Power.",
                    "Downlink Packet Scheduling with Minimum Throughput Guarantee in TDD-OFDMA Cellular Network.",
                    "Making IGP Routing Robust to Link Failures.",
                    "Interdomain Ingress Traffic Engineering Through Optimized AS-Path Prepending.",
                    "Describing and Simulating Internet Routes.",
                    "A Growth-Based Address Allocation Scheme for IPv6.",
                    "Are Multiple Descriptions Better Than One?.",
                    "An Approximate Queueing Model for Limited-Range Wavelength Conversion in an OBS Switch.",
                    "On Fairness, Optimal Download Performance and Proportional Replication in Peer-to-Peer Networks.",
                    "A Novel Direct Upper Approximation for Workload Loss Ratio in General Buffered Systems.",
                    "PISA: Automatic Extraction of Traffic Signatures.",
                    "FPL-3: Towards Language Support for Distributed Packet Processing.",
                    "Efficient Deployment of Honeynets for Statistical and Forensic Analysis of Attacks from the Internet.",
                    "Measuring Round Trip Times to Determine the Distance Between WLAN Nodes.",
                    "End-to-End Asymmetric Link Capacity Estimation.",
                    "Impact of Resource Sharability on Dual Failure Restorability in Optical Mesh Networks.",
                    "Efficient Distributed Solution for MPLS Fast Reroute.",
                    "Pricing for Heterogeneous Services at a Discriminatory Processor Sharing Queue.",
                    "Joint Sensor Selection and Data Routing in Sensor Networks.",
                    "Peer Collaboration in Wireless Ad Hoc Networks.",
                    "Fireworks: An Adaptive Group Communications Protocol for Mobile Ad Hoc Networks.",
                    "An Optimized TCP for Internet Access of Vehicular Ad Hoc Networks.",
                    "Cooperative Failure Detection in Overlay Multicast.",
                    "Eliminating Bottlenecks in Overlay Multicast.",
                    "TOMA: A Viable Solution for Large-Scale Multicast Service Support.",
                    "The Burstiness Behavior of Regulated Flows in Networks.",
                    "A Credit-Based Active Queue Management (AQM) Mechanism to Achieve Fairness in the Internet.",
                    "Optimizing End-to-End Throughput for Data Transfers on an Overlay-TCP Path.",
                    "Randomized Coverage-Preserving Scheduling Schemes for Wireless Sensor Networks.",
                    "Dynamic Scheduling for Scalable Media Transmission over cdma2000 1xEV-DO Broadcast and Multicast Networks.",
                    "Proxy-Assisted Scheduling for Energy-Efficient Multimedia Streaming over Wireless LAN.",
                    "Encodings of Multicast Trees.",
                    "Efficient Bandwidth Guaranteed Restoration Algorithms for Multicast Connections.",
                    "Scheduling Uplink Bandwidth in Application-Layer Multicast Trees.",
                    "A Novel Packet Marking Function for Real-Time Interactive MPEG-4 Video Applications in a Differentiated Services Network.",
                    "On Multipath Routing with Transit Hubs.",
                    "Comparison of Border-to-Border Budget Based Network Admission Control and Capacity Overprovisioning.",
                    "RIDA: Robust Intrusion Detection in Ad Hoc Networks.",
                    "Self-configurable Key Pre-distribution in Mobile Ad Hoc Networks.",
                    "Efficient Use of Route Requests for Loop-Free On-demand Routing in Ad Hoc Networks.",
                    "Penalty Shaper to Enforce Assured Service for TCP Flows.",
                    "QoS Dynamic Routing in Content Delivery Networks.",
                    "Exploiting Traffic Localities for Efficient Flow State Lookup.",
                    "The Interaction of Forward Error Correction and Active Queue Management.",
                    "ELIP: Embedded Location Information Protocol.",
                    "Coordinated Interaction Using Reliable Broadcast in Mobile Wireless Networks.",
                    "Delay Tolerant Mobile Networks (DTMNs): Controlled Flooding in Sparse Mobile Networks.",
                    "Application Signal Threshold Adaptation for Vertical Handoff in Heterogeneous Wireless Networks.",
                    "Justice: Flexible and Enforceable Per-Source Bandwidth Allocation.",
                    "A Novel Approach for Transparent Bandwidth Conservation.",
                    "Efficient Bandwidth Sharing in Bus-Based Optical Access Networks.",
                    "Cross-Layer Radio Resource Allocation in Packet CDMA Wireless Mobile Networks with LMMSE Receivers.",
                    "Stabilization of Contention-Based CDMA Ranging Channel in Wireless Metropolitan Area Networks.",
                    "Load Balancing and Relaying Framework in TDD W-CDMA Multi-hop Cellular Networks.",
                    "Stochastic Decision-Based Analysis of Admission Control Policy in Multimedia Wireless Networks.",
                    "Improving the performance of rate adaptation schemes in heterogeneous wireless networks.",
                    "Stochastic Admission Control for Quality of Service in Wireless Packet Networks.",
                    "Extending the Birkhoff-Von Neumann Switching Strategy to Multicast Switches.",
                    "A New TCP-Friendly Rate Control Algorithm for Scalable Video Streams.",
                    "802.11 Link Interference: A Simple Model and A Performance Enhancement.",
                    "Impact of Routing Lags on Internet Routing Failures.",
                    "Control and Forwarding Plane Interaction in Distributed Routers.",
                    "Performance Analysis of 802.11 WLANs Under Sporadic Traffic.",
                    "Virtual Multi-Homing: On the Feasibility of Combining Overlay Routing with BGP Routing.",
                    "Measurement of Rain Attenuation of Microwaves at 12.25GHz in Korea.",
                    "Scalable Route Selection for IPv6 Multihomed Sites.",
                    "On the Efficient Resource Allocation for High Quality Video Streams and FTP Traffic over Next Generation Wireless Networks.",
                    "A Self-organizing Routing Scheme for Random Networks.",
                    "A Novel Extension for On-Demand Routing Protocol in Event-Driven Sensor Networks.",
                    "Equivalent Gibbs Duhem Law in Network Queue.",
                    "Bandwidth Sharing of Low Priority Services for Efficient Call Admission Control in Cellular Networks.",
                    "COPACC: A Cooperative Proxy-Client Caching System for On-Demand Media Streaming.",
                    "A Rule-Based Approach for Consistent Proportional Delay Differentiation (Extended Abstract).",
                    "Extended Dominating Set in Ad Hoc Networks Using Cooperative Communication.",
                    "INTERMON: An Architecture for Inter-domain Monitoring, Modelling and Simulation.",
                    "An UNA-Based Approach to Support Mobility in the Internet.",
                    "QoS Scalable Tree Aggregation.",
                    "Supermedia Transport for Teleoperations over Overlay Networks.",
                    "A Simple and Fast Algorithm for Bluetooth Network Formation.",
                    "A Node Cooperative ARQ Scheme for Wireless Ad-Hoc Networks.",
                    "SWATCH: A StepWise AdapTive Clustering Hierarchy in Wireless Sensor Networks.",
                    "Design and Performance Evaluation of WDM/TDMA-Based MAC Protocol in AWG-Based WDM-PON.",
                    "A Backup Tree Algorithm for Multicast Overlay Networks.",
                    "Tradeoffs for Web Communications Fast Analysis.",
                    "Benefits of Multiple Battery Levels for the Lifetime of Large Wireless Sensor Networks.",
                    "Enhanced Data Services in GPRS Networks via Auction-Based Prices for Admission.",
                    "Achieving Stability and Fairness in Mobile Ad Hoc Networks.",
                    "A Novel Method for SCTP Load Sharing.",
                    "Attaining VoIP-Grade QoS via Deflection: A Buffer Space Tradeoff Study.",
                    "Applying the DiffServ Model to a Resilient Packet Ring Network.",
                    "Maximizing the Number of Connections in Multifiber WDM Chain, Ring and Star Networks.",
                    "A Hierarchical Secure Ring-Oriented Multicast Protocol over Mobile Ad Hoc Network.",
                    "Performance Analysis of a Multimedia CDMA System Using Dynamic Rate Control."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "Networking 2004",
        "info": "Athens, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2004",
                "sub_name": "NETWORKING 2004, Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; Mobile and Wireless Communication, Third International IFIP-TC6 Networking Conference, Athens, Greece, May 9-14, 2004, Proceedings.",
                "count": 143,
                "papers": [
                    "A New Digital Signature and Certificate Architecture with Shortest Certification Path.",
                    "Inter/Intra Core Network Security with PKI for 3G-and-Beyond Systems.",
                    "Improving Distributed Firewalls Performance through Vertical Load Balancing.",
                    "Performance Modelling and Evaluation of Firewall Architectures for Multimedia Applications.",
                    "A Multi-level TCP Model with Heterogeneous RTTs.",
                    "Improving the Performance of TCP in the Presence of Interacting UDP Flows in Ad Hoc Networks.",
                    "The Sensitivity of TCP to Sudden Delay Variations in Mobile Networks.",
                    "Lost Retransmission Detection for TCP Part 2: TCP Using SACK Option.",
                    "High Coverage Broadcasting for Mobile Ad Hoc Networks.",
                    "Combining Source- and Localized Recovery to Achieve Reliable Multicast in Multi-hop Ad Hoc Networks.",
                    "A Lightweight Content Replication Scheme for Mobile Ad Hoc Environments.",
                    "Scalable Service Discovery in Mobile Ad Hoc Networks.",
                    "Fiber Cost Reduction and Wavelength Minimization in Multifiber WDM Networks.",
                    "Static WDM Network Planning with TDM Channel Partitioning.",
                    "Traffic Grooming in WDM Ring Networks with the Min-Max Objective.",
                    "A Case for Mesh-Tree-Interaction in End System Multicasting.",
                    "On Core Selection Algorithm for Reducing Delay Variation of Many-to-Many Multicasts with Delay-Bounds.",
                    "Overlay Multicast Tree Minimizing Average Time Delay.",
                    "Maximum Throughput Analysis in Ad Hoc Networks.",
                    "Performance of Wireless Ad Hoc Networks under Balanced Fairness.",
                    "Cell Throughput Analysis of the Proportional Fair Scheduling Policy.",
                    "On Detection of Anomalous Routing Dynamics in BGP.",
                    "Multi-objective Egress Router Selection Policies for Inter-domain Traffic with Bandwidth Guarantees.",
                    "On Properties of Internet Exchange Points and Their Impact on AS Topology and Relationship.",
                    "Scalable Packet Classification through Maximum Entropy Hashing.",
                    "Diagonal Tuple Space Search in Two Dimensions.",
                    "An Evaluation of Delay-Aware Receiver Playout Strategies for VoIP Applications.",
                    "A Secure Web Services for Location Based Services in Wireless Networks.",
                    "Distributed Channel Monitoring for Wireless Bandwidth Aggregation.",
                    "Benefit of Admission Control in Aggregation Network Dimensioning for Video Services.",
                    "Call Admission Control for Voice/Data Integration in Broadband Wireless Networks.",
                    "Self-Admission Control for IP Telephony Using Early Quality Estimation.",
                    "Fair and Performance Guaranteed Methods for Flat-Rate Unlimited Access Service Plan.",
                    "Bounds on Benefits and Harms of Adding Connections to Noncooperative Networks.",
                    "Fair Packet Forwarding in MANETs with Anonymous Stations: A Game-Theoretic Approach.",
                    "Pricing Differentiated Services: A Game-Theoretic Approach.",
                    "Performance Planning, Quality-of-Service, and Pricing under Competition.",
                    "Delay Sensitivity Based Assignment of OVSF Codes for the Downlink DCH in WCDMA.",
                    "Interoperability Criteria and Mechanisms for Seamless Inter-working between UMTS-HSDPA and HIPERLAN/2 Networks Enhanced with MIMO Techniques.",
                    "Efficient Location-Based Hard Hando. Algorithms for Cellular Systems.",
                    "Priority Queuing for IP-Based Service Differentiation in the UMTS Radio Access Network.",
                    "Multi-hour Design of Dynamically Reconfigurable MPLS Networks.",
                    "A Tabu Search Heuristic for the Offline MPLS Reduced Complexity Layout Design Problem.",
                    "Self-Protecting Multipaths - A Simple and Resource-Effcient Protection Switching Mechanism for MPLS Networks.",
                    "Integrated Dynamic Routing of LSPs in IP over WDM Networks: Full Protection and Partial Spatial-Protection.",
                    "A Receiver Based Single-Layer Multicast Congestion Control Protocol for Multimedia Streaming.",
                    "The Role of Information Update in Flow Control.",
                    "Stabilized Edge-to-Edge Aggregate Flow Control.",
                    "MaxNet: Faster Flow Control Convergence.",
                    "Improving MAC Performance in Wireless Ad Hoc Networks Using Enhanced Carrier Sensing (ECS).",
                    "Modeling the Short-Term Unfairness of IEEE 802.11 in Presence of Hidden Terminals.",
                    "Analytical Modeling of TCP Clients in Wi-Fi Hot Spot Networks.",
                    "On the Feasibility of Integrated MPEG Teleconference and Data Transmission, over IEEE 802.11 WLANs.",
                    "Differentiated Quality-of-Protection Provisioning in Optical/MPLS Networks.",
                    "Hierarchical Routing with QoS Constraints in Optical Transport Networks.",
                    "Analysis of a Finite Number of Deflections in Fully and Uniformly Loaded Regular Networks.",
                    "Improving Perceived Web Performance by Size Based Congestion Control .",
                    "An Adaptive AIMD Congestion Control Protocol for Communication Networks .",
                    "TCP-DCR: Making TCP Robust to Non-congestion Events.",
                    "An Enhanced Hybrid Key Management Protocol for Secure Multicast in Ad Hoc Networks.",
                    "On Dynamic Subset Difference Revocation Scheme.",
                    "Efficient, Authenticated, and Fault-Tolerant Key Agreement for Dynamic Peer Groups.",
                    "Proactively Detecting Distributed Denial of Service Attacks Using Source IP Address Monitoring.",
                    "Secure Name Service: A Framework for Protecting Critical Internet Resources.",
                    "Detecting and Blocking Unauthorized Access in Wi-Fi Networks.",
                    "Secure Reverse Communication in a Multicast Tree.",
                    "Stealth Multicast: A Novel Catalyst for Network-Level Multicast Deployment.",
                    "AMBTS: A Scheme of Aggregated Multicast Based on Tree Splitting.",
                    "Cooperative Caching with Optimal Radius in Hybrid Wireless Networks.",
                    "Power Adaptation Based Optimization for Energy Efficient Reliable Wireless Paths.",
                    "Adaptive Broadcast Consumption (ABC), a New Heuristic and New Bounds for the Minimum Energy Broadcast Routing Problem.",
                    "Access Protocols to Support Different Service Classes in an Optical Burst Switching Ring.",
                    "Prioritized Multiplexing of Traffic Accessing an FSAN-Compliant GPON.",
                    "Traffic Regulation and Control in the Manhattan Street Network.",
                    "Fairness Issues in Bus-Based Optical Access Networks.",
                    "Loss Strategies for Competing TCP/IP Connections.",
                    "Modelling TCP Throughput and Fairness.",
                    "The Undismissible Rats: How Do Short Connections Affect Long-Lived TCP Flows under Moderate Traffic Load?",
                    "Theoretical Analysis of Performances of TCP/IP Congestion Control Algorithm with Different Distances.",
                    "Last Encounter Routing under Random Waypoint Mobility.",
                    "A-STAR: A Mobile Ad Hoc Routing Strategy for Metropolis Vehicular Communications.",
                    "Enhancing the Route Discovery Process of On-Demand Routing in Networks with Directional Antennas.",
                    "Hash-Based Dynamic Source Routing.",
                    "A New Method of Primary Routes Selection for Local Restoration.",
                    "Multi-domain Diagnosis of End-to-End Service Failures in Hierarchically Routed Networks.",
                    "Detecting Traffic Anomalies through Aggregate Analysis of Packet Header Data.",
                    "Lazy Agent Replication and Asynchronous Consensus for the Fault-Tolerant Mobile Agent System.",
                    "LMPS: Localized Multi-path Selection for QoS Routing in VoIP Networks.",
                    "Link-Based Fair Aggregation: A Simple Approach to Scalable Support of Per-Flow Service Guarantees.",
                    "Reducing Packet-Loss by Taking Long-Range Dependences into Account.",
                    "A Family of Performance Bounds for QoS Measures in Packet-Based Networks.",
                    "Impact of Frequency-Based Cache Management Policies on the Performance of Segment Based Video Caching Proxies.",
                    "Traffic Conscious Distribution of Service Components.",
                    "Network-Embedded Programmable Storage and Its Applications.",
                    "Distributed Algorithm for Service Replication in Service Overlay Network.",
                    "Routing in Turn-Prohibition Based Feed-Forward Networks.",
                    "On the Representability of Arbitrary Path Sets as Shortest Paths: Theory, Algorithms, and Complexity.",
                    "Precomputation of Constrained Widest Paths in Communication Networks.",
                    "A Traffic Engineering-Aware Shortest-Path Routing Algorithm in IP Networks.",
                    "Performance of Directional Collision Avoidance in Ad Hoc Networks.",
                    "On the Performance of the European LMDS System.",
                    "Computing Call Dropping and Waiting Probabilities in LEO Satellite Systems for Voice Communications.",
                    "Performance Modelling of a Wireless GSM/GPRS Cell under Partial Sharing Scheme.",
                    "An Efficient Probabilistic Packet Marking Scheme for IP Traceback.",
                    "A Geomulticast Architecture and Analysis Model for Ad-Hoc Networks.",
                    "An Architecture to Support QoS Multicast Routing for Ad-Hoc Networks.",
                    "Linkcast: Fast and Scalable Multicast Routing Protocol.",
                    "Towards an Erlang-Like Formula for the Performance Evaluation of GPRS/EDGE Networks with Finite-Length Sessions.",
                    "Multicast Transport Protocol Analysis: Self-Similar Sources.",
                    "SPEED: Scalable Protocols for Efficient Event Delivery in Sensor Networks.",
                    "Improved Position Estimation in Wireless Heterogeneous Networks.",
                    "A Geometric Derivation of the Probability of Finding a Relay in Multi-rate Networks.",
                    "Metadata Design for Introspection-Capable Reconfigurable Systems.",
                    "Security Clustering: A Network-Wide Secure Computing Mechanism in Pervasive Computing.",
                    "A Game Theoretic Approach to Web Caching.",
                    "Transient Analysis of the D-BMAP/G/1 Queue with an Application to the Dimensioning of a Playout Buffer for VBR Video.",
                    "A Kerberos-Based Authentication Architecture for Wireless LANs.",
                    "A Preliminary Study of Scalability of TCP/IP Based Clusters under Database Workloads.",
                    "Evaluation of Smart Antenna Algorithms for cdma2000 Reverse Link.",
                    "Control Theoretic Modelling and Design of Admission Control Mechanisms for Server Systems.",
                    "A Fair Service Work Scheduling Approach for Differentiated Services in Optical Access Networks.",
                    "Integrating (m, k)-Firm Real-Time Guarantees into the Internet QoS Model.",
                    "Adaptive Channel Allocation in OFDM/SDMA Wireless LANs with Limited Transceiver Resources.",
                    "Fast End-to-End Mobility Support Using SIP for Vertical Handoffs in 4G Wireless Communication Networks.",
                    "Optimal Monitoring Equipment Placement for Fault and Attack Location in Transparent Optical Networks.",
                    "Introducing Service Differentiation in a Bluetooth Piconet.",
                    "Call-Burst Blocking Probabilities of ON-OFF Traffic Sources under the Bandwidth Reservation Policy.",
                    "The Connection Dependent Threshold Model for Finite Sources - A Generalization of the Engset Multirate Loss Model.",
                    "Analysis of Protocol Operations and Scalability of COPS-SLS Negotiation System.",
                    "Outage Analysis for Multi-connection Multiclass Services in the Uplink of Wideband CDMA Cellular Mobile Networks.",
                    "Experimental Analysis of the SABUL Congestion Control Algorithm.",
                    "Rational Server Selection for Mobile Agents: Problem Solution and Performance Analysis.",
                    "Collaborative Trust-Based Secure Routing in Multihop Ad Hoc Networks.",
                    "Comparative Evaluation of Two Scalable QoS Architectures.",
                    "An Efficient ID-Based Authenticated Key Agreement Protocol from Pairings.",
                    "Fast Flooding in Power Save Mode of IEEE 802.11 DCF Based Mobile Ad Hoc Networks.",
                    "Seamless Congestion Control over Wired and Wireless IEEE 802.11 Networks.",
                    "Shared Protection by Concatenated Rings in Optical WDM Networks.",
                    "Distributed Scheduling of Recording Tasks with Interconnected Servers.",
                    "Impairment Constrained Based Routing for Managed Reach WDM Optical Networks.",
                    "Performance Analysis of Variable Bit Rate Multiclass Services in the Uplink of a Dynamic Complete Partitioning Round-Robin Carrier-Hopping Multirate Multi-carrier DS-CDMA System.",
                    "ORBIS: A Reconfigurable Hybrid Optical Metropolitan Area Network Architecture.",
                    "A Layer Assignment and Resource Reservation Scheme for Hierarchical Cell Structures."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "Networking 2002",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2002",
                "sub_name": "NETWORKING 2002, Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; and Mobile and Wireless Communications, Second International IFIP-TC6 Networking Conference, Pisa, Italy, May 19-24, 2002, Proceedings.",
                "count": 115,
                "papers": [
                    "Channel Islands in a Reflective Ocean: Large Scale Event Distribution in Heterogeneous Networks.",
                    "A Reliable Multicast Protocol with Delay Guarantees.",
                    "Optimizing QoS-Based Multicast Routing in Wireless Networks: A Multi-objective Genetic Algorithmic Approach.",
                    "An Experimental Study of Probing-Based Admission Control for DiffServ Architectures.",
                    "High Performance DiffServ Mechanism for Routers and Switches: Packet Arrival Rate Based Queue Management for Class Based Scheduling.",
                    "Session-Aware Popularity Resource Allocation for Assured Differentiated Services.",
                    "Most Probable Path Techniques for Gaussian Queueing Systems.",
                    "On the Queue Tail Asymptotics for General Multifractal Traffic.",
                    "Some Models for Contention Resolution in Cable Networks.",
                    "Adaptive Creation of Network Applications in the Jack-in-the-Net Architecture.",
                    "Anchored Path Discovery in Terminode Routing.",
                    "Distributed Transmission Scheduling Using Code-Division Channelization.",
                    "Towards Efficient Decision Rules for Admission Control Based on the Many Sources Asymptotics.",
                    "QoS with an Edge-Based Call Admission Control in IP Networks.",
                    "Admission Control and Capacity Management for Advance Reservations with Uncertain Service Duration.",
                    "Performance Evaluation of the Deadline Credit Scheduling Algorithm for Soft-Real-Time Applications in Distributed Video-on-Demand Systems.",
                    "The Impact of Replacement Granularity on Video Caching.",
                    "Utility Analysis of Simple FEC Schemes for VoIP.",
                    "A Power Saving Architecture for Web Access from Mobile Computers.",
                    "A Resource/Connection Management Scheme for HTTP Proxy Servers.",
                    "Measurement-Based Modeling of Internet Round-Trip Time Dynamics Using System Identification.",
                    "Optimal Link Capacity Dimensioning in Proportionally Fair Networks.",
                    "Load Balancing in WDM Networks through Adaptive Routing Table Changes.",
                    "Models for the Logical Topology Design Problem.",
                    "Dynamic Shaping for Self-Similar Traffic Using Network Calculus.",
                    "Is Admission-Controlled Traffic Self-Similar?",
                    "Analysis of CMPP Approach in Modeling Broadband Traffic.",
                    "A Mathematical Model for IP over ATM.",
                    "Analysis and Comparison of Internet Topology Generators.",
                    "Energy Efficient Design of Wireless Ad Hoc Networks.",
                    "Performance of Multipoint Relaying in Ad Hoc Mobile Routing Protocols.",
                    "An Adaptive Location-Aware MAC Protocol for Multichannel Multihop Ad-Hoc Networks.",
                    "Capacity Assignment in Bluetooth Scatternets - Analysis and Algorithms.",
                    "Optimization-Based Congestion Control for Multicast Communications.",
                    "Severe Congestion Handling with Resource Management in Diffserv on Demand.",
                    "Resource Allocation with Persistent and Transient Flows.",
                    "A Novel and Simple MAC Protocol for High Speed Passive Optical LANs.",
                    "The Bluetooth Technology: State of the Art and Networking Aspects.",
                    "Time and Frequency Synchronization for Hiperlan/2.",
                    "Performance Analysis of a Forwarding Scheme for Handoff in HAWAII.",
                    "Evaluating the Performance of a Network Management Application Based on Mobile Agents.",
                    "Performance Evaluation on WAP and Internet Protocol over 3G Wireless Networks.",
                    "Performance Evaluation of H.263-Based Video Transmission in an Experimental Ad-Hoc Wireless LAN System.",
                    "Differentiated Services Based Priority Dropping and Its Application to Layered Video Streams.",
                    "Optimal Feedback for Quality Source-Adaptive Schemes in Multicast Multi-layered Video Environments.",
                    "A Fibre Channel Dimensioning for a Multimedia System with Deterministic QoS.",
                    "On the Resource Efficiency of Explicit Congestion Notification.",
                    "Sender-Side TCP Modifications: An Analytical Study.",
                    "Modeling a Mixed TCP Vegas and TCP Reno Scenario.",
                    "Performance Sensitivity and Fairness of ECN-Aware 'Modified TCP'.",
                    "Call Admission Control for 3G CDMA Networks with Differentiated QoS.",
                    "Performance Evaluation of Channel Switching Scheme for Packet Data Transmission in Radio Network Controller.",
                    "An Optimal Reservation-Pool Approach for Guaranteeing the Call-Level QoS in Next-Generation Wireless Networks.",
                    "A New Adaptive Channel Reservation Scheme for Handoff Calls in Wireless Cellular Networks.",
                    "Connection of Extruded Subnets: A Solution Based on RSIP.",
                    "Adjusted Probabilistic Packet Marking for IP Traceback.",
                    "Tuning Delay Differentiation in IP Networks Using Priority Queueing Models.",
                    "QoS-Conditionalized Handoff for Mobile IPv6.",
                    "On Loss Probabilities in Presence of Redundant Packets with Random Drop.",
                    "Performance Analysis of a GI-G-1 Preemptive Resume Priority Buffer.",
                    "Analysis of the Discrete-Time GG/Geom/c Queueing Model.",
                    "On a Theory of Interacting Queues.",
                    "Analysis of a MAC Protocol for a Time-Code Air Interface in LEO Mobile Satellite Systems.",
                    "Performance Analysis of LEO Satellite Networks.",
                    "Gateway Architecture for DVB-RCS Satellite Networks.",
                    "Connection Admission Control CAC and Differentiated Resources Allocation RA in a Low Earth Orbit LEO Satellite Constellation.",
                    "Dimensioning Bandwidth for Elastic Traffic.",
                    "Fair Adaptive Bandwidth Allocation: A Rate Control Based Active Queue Management Discipline.",
                    "Distributed Scheduling via Pricing in a Communication Network.",
                    "A Simulation Study of Access Protocols for Optical Burst-Switched Ring Networks.",
                    "Capacity Efficiency of Distributed Path Restoration Mechanisms in Optical Mesh Networks.",
                    "Helios: A Broadcast Optical Architecture.",
                    "Service and Network Management Interworking in Future Wireless Systems.",
                    "Scheduling Differentiated Traffic in Multicarrier Unlicensed Systems.",
                    "A Simple Model for Calculating SIP Signalling Flows in 3GPP IP Multimedia Subsystems.",
                    "Dynamic Online Routing Algorithm for MPLS Traffic Engineering.",
                    "Optimal Capacity Provisioning for Label Switched Paths in MPLS Networks.",
                    "A New Class of Online Minimum-Interference Routing Algorithms.",
                    "Performance Analysis of Dynamic Lightpath Configuration for WDM Asymmetric Ring Networks.",
                    "A Queueing Model for a Wireless GSM/GPRS Cell with Multiple Service Classes.",
                    "Integrated Multi-purposed Testbed to Characterize the Performance of Internet Access over Hybrid Fiber Coaxial Access Networks.",
                    "1 LANs: Saturation Throughput in the Presence of Noise.",
                    "Efficient Simulation of Blocking Probabilities for Multi-layer Multicast Streams.",
                    "Aggregated Multicast - A Comparative Study.",
                    "New Center Location Algorithms for Shared Multicast Trees.",
                    "A Multicast FCFS Output Queued Switch without Speedup.",
                    "Fault-Tolerant Support for Reliable Multicast in Mobile Wireless Systems.",
                    "JumpStart: A Just-in-Time Signaling Architecture for WDM Burst-Switched Networks.",
                    "Device Discovery in Bluetooth Networks: A Scatternet Perspective.",
                    "QoS Evaluation of Real-Time Applications over a Multi-domain DiffServ Experimental Test-Bed.",
                    "A New Policy Based Management of Mobile IP Users.",
                    "A Framework for Policy-Based Management of QoS Aware IP Networks.",
                    "SIP-H323: A Solution for Interworking Saving Existing Architecture.",
                    "High Router Flexibility and Performance by Combining Dedicated Lookup Hardware (IFT), off the Shelf Switches and Linux.",
                    "Group Security Policy Management for IP Multicast and Group Security.",
                    "Issues in Internet Radio.",
                    "I/O Bus Usage Control in PC-Based Software Routers.",
                    "Multiple Access in Ad-Hoc Wireless LANs with Noncooperative Stations.",
                    "Next Generation Networks and Services in Slovenia.",
                    "Minimizing the Routing Delay in Ad Hoc Networks through Route-Cache TTL Optimization.",
                    "Long-Range Dependence of Internet Traffic Aggregates.",
                    "Improved Initial Synchronisation in the Presence of Frequency Offset in UMTS FDD Mode.",
                    "Scalable Adaptive Hierarchical Clustering.",
                    "How to Achieve Fair Differentiation.",
                    "Measurement-Based Admission Control for Dynamic Multicast Groups in Diff-Serv Networks.",
                    "A Framework to Service and Network Resource Management in Composite Radio Environments.",
                    "JESA Service Discovery Protocol.",
                    "Performance Simulations of a QoS Aware Caching Method.",
                    "Call Admission Control for Multimedia Cellular Networks Using Neuro-dynamic Programming.",
                    "Aspects of AMnet Signaling.",
                    "Virtual Home Environment for Multimedia Services in 3rd Generation Networks.",
                    "On Providing End-To-End QoS Introducing a Set of Network Services in Large-Scale IP Networks.",
                    "SaTPEP: A TCP Performance Enhancing Proxy for Satellite Links.",
                    "An Overlay for Ubiquitous Streaming over Internet.",
                    "A Measurement-Based Dynamic Guard Channel Scheme for Handover Prioritization in Cellular Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2002w",
                "sub_name": "Web Engineering and Peer-to-Peer Computing, NETWORKING 2002 Workshops, Pisa, Italy, May 19-24, 2002, Revised Papers.",
                "count": 31,
                "papers": [
                    "A Parsimonious Multifractal Model for WWW Traffic.",
                    "Characteristics of Temporal and Spatial Locality of Internet Access Patterns.",
                    "A Scalable Architecture for Cooperative Web Caching.",
                    "Caching Web Services: Aspect Orientation To The Rescue.",
                    "Replicated Web Services: A Comparative Analysis of Client-Based Content Delivery Policies.",
                    "Internet Cache Location and Design of Content Delivery Networks.",
                    "A Server Placement Algorithm Conscious of Communication Delays and Relocation Costs.",
                    "The Yoix Scripting Language as a Tool for Building Web-Based Systems.",
                    "XGuide - A Practical Guide to XML-Based Web Engineering.",
                    "Process-Based Optimisation of Data Exchange for B2B Interaction.",
                    "Client-Side Profile Storage.",
                    "Boosting the Performance of Three-Tier Web Servers Deploying SMP Architecture.",
                    "Overload Behaviour and Protection of Event-driven Web Servers.",
                    "Scalable Benchmarking and Performance Monitoring: a Coordination and Mobility Perspective.",
                    "Towards Specification-based Web Testing.",
                    "Routing in Mobile Ad-hoc and Peer-to-Peer Networks A Comparison.",
                    "Multi-layer Clusters in Ad-hoc Networks - An Approach to Service Discovery.",
                    "NeuroGrid: Semantically Routing Queries in Peer-to-Peer Networks.",
                    "Storage, Mutability and Naming in Pasta.",
                    "Text-Based Content Search and Retrieval in Ad-hoc P2P Communities.",
                    "Freeing Cooperation from Servers Tyranny.",
                    "BuddyWeb: A P2P-Based Collaborative Web Caching System.",
                    "Reliable Unicast Streaming with Multiple Peers in IP Networks.",
                    "The Client Utility as a Peer-to-Peer System.",
                    "P: Parallel Peer to Peer.",
                    "Peer-to-Peer Programming with Teaq.",
                    "Towards a Data-Driven Coordination Infrastructure for Peer-to-Peer Systems.",
                    "Towards Adaptive, Resilient and Self-organizing Peer-to-Peer Systems.",
                    "Peer Pressure: Distributed Recovery from Attacks in Peer-to-Peer Systems.",
                    "Implementing a Reputation-Aware Gnutella Servent.",
                    "Transaction-Based Charging in Mnemosyne: A Peer-to-Peer Steganographic Storage System."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2002t",
                "sub_name": "Advanced Lectures on Networking, NETWORKING 2002 [This book presents the revised version of seven tutorials given at the NETWORKING 2002 Conference in Pisa, Italy in May 2002].",
                "count": 7,
                "papers": [
                    "Peer to Peer: Peering into the Future.",
                    "Mobile Computing Middleware.",
                    "Network Security in the Multicast Framework.",
                    "Categorizing Computing Assets According to Communication Patterns.",
                    "Remarks on Ad Hoc Networking.",
                    "Communications through Virtual Technologies.",
                    "A Tutorial on Optical Networks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "Networking 2000",
        "info": "Paris, France",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/2000",
                "sub_name": "NETWORKING 2000, Broadband Communications, High Performance Networking, and Performance of Communication Networks, IFIP-TC6 / European Commission International Conference, Paris, France, May 14-19, 2000, Proceedings.",
                "count": 81,
                "papers": [
                    "Multi-criteria Arguments for Improving the Fairness of Layered Multicast Applications.",
                    "Network-Driven Layered Multicast with IPv6.",
                    "Analysis of the Requirements for ATM Multicasting Based on Per-PDU ID Assignment.",
                    "Sensitivity of ABR Congestion Control Algorithms to Hurst Parameter Estimates.",
                    "Probiding GFR Guarantees for TCP/IP Traffic over APON Access Systems.",
                    "Buffer Size Requirements for Delay Sensitive Traffic Considering Discrete Effects and Service-Latency in ATM Switches.",
                    "Distributed Input and Deflection Routing Based Packet Switch Using Shuffle Pattern Network.",
                    "A Distributed Dynamic Scheduling Algorithm for a Terabit Multicast Packet Switch.",
                    "An Interworking Call Control Solution for a Multidiscipline Switch.",
                    "Generic Multicast Transport Services: Router Support for Multicast Applications.",
                    "RP-Based Multicast Receiver Access Control in PIM-SM.",
                    "An Algorithm for Multicast with Multiple QoS Constraints and Dynamic Membership.",
                    "Optimal Traffic Partitioning in MPLS Networks.",
                    "Impact of the Ethernet Capture Effect on Bandwidth Measurements.",
                    "Statistical Study of the Correlation Between Topology and Wavelength Usage in Optical Networks with and without Conversion.",
                    "Computing Blocking Probabilities in Multi-class Wavelength Routing Networks.",
                    "A Comparative Study of Mesh and Multi-ring Designs for Survivable WDM Networks.",
                    "Membership-Insensitive Totally Ordered Multicast: Properties and Performance.",
                    "On Finding Feasible Solutions to the Group Multicast Routing Problem.",
                    "Analysis of Cell Spacing on a TCP Flow Mapped onto an ATM Connection.",
                    "Mapping of Loss and Delay Between IP and ATM Using Network Calculus.",
                    "A Self-Similar Point Process Through Fractal Construction.",
                    "Tail Transitions in Queues with Long Range Dependent Input.",
                    "An Exact Algorithm for Calculating Blocking Probabilities in Multicast Networks.",
                    "Approximations for Call-Blocking Probabilities in Multirouting Multicasting Multirate Loss Networks.",
                    "Consolidation Algorithm Interoperability in Point-to-Multipoint ABR Services in ATM Networks.",
                    "Evaluation of the INSIGNIA Signaling System.",
                    "Design and Implementation of RSVP Based on Object-Relationships.",
                    "Indirect RSVP for Virtual Cluster Cellular Mobile IP Networks.",
                    "Aggregation of Markovian Sources: Approximations with Error Control.",
                    "Multi-scaling Models of Sub-frame VBR Video Traffic.",
                    "An Accurate Closed-Form Formula to Calculate the Dejittering Delay in Packetised Voice Transport.",
                    "Interworking of B-ISDN Signaling and Internet Protocol.",
                    "Mapping an Internet Assured Service on the GFR ATM Service.",
                    "Real-Time Cell Arrival Sequence Estimation and Simulator for IP/ATM Networks.",
                    "Computing Stochastical Bounds for the Tail Distribution of an M/GI/1 Queue.",
                    "Analysis of Packet Delay in a GI-G-1 Queue with Non-preemptive Priority Scheduling.",
                    "New Results on the Numerical Stability of the Stochastic Fluid Flow Model Analysis.",
                    "QoS Support for Real-Time Applications Using the Integration of RSVP/Intserv and Diffserv: A Testbed Experiment.",
                    "Efficient End-to-End Transport of Soft Real-Time Applications.",
                    "Real-Time Traffic Transmission over the Internet.",
                    "High Speed Wireless Internet Access: Combination of MPLS and BRAN HIPERLAN/2 Technologies.",
                    "Effect of Turn-Around Times on the Performance of High Speed Ad-hoc MAC Protocols.",
                    "Experimental Investigation of the Effects of Delay and Error Rate on Throughput and Performance of ATM Satellit Links Serving LAN Islands.",
                    "Dynamic Algorithms with Worst-Case Performance for Packet Classification.",
                    "Intelligent Traffic Conditioners for Assured Forwarding Based Differentiated Services Networks.",
                    "DiffServ in the Web: Different Approaches for Enabling Better Services in the Worl Wide Web.",
                    "Performance of Short TCP Transfers.",
                    "Performance Study of Satellite-Linked Web Caches and Filtering Policies.",
                    "Distributed Control System for Low Priority Controllable Traffic in Packet Switched Backbone Networks.",
                    "Application-Independent End-to-End Security in Shared-Link Access Networks.",
                    "Fair Efficient Call Admission Control Policies for Heterogeneous Traffic Streams in a Packet Routing Server Using the DTM Technology.",
                    "An Agent-Based Framework for Large Scale Internet Applications.",
                    "Benchmarking of Signaling Based Resource Reservation in the Internet.",
                    "Kalman and Neural Network Approaches for the Control of a VP Bandwidth in an ATM Network.",
                    "Fairness and Aggregation: A Primal Decomposition Study.",
                    "On Learning and the Quality of Service in a Wireless Network.",
                    "Distributed Fair Bandwidth Allocation of a Wireless Base Station.",
                    "Fast Approximate Algorithms for Maximum Lifetime Routing in Wireless Ad-hoc Networks.",
                    "Performance Evaluation of Resource Division Policies for PGPS Scheduling in ATM Networks.",
                    "Worst-Case Deterministic Delay Bounds for Arbitrary Weighted Generalized Processor Sharing Schedulers.",
                    "Deterministic End-to-End Delay Bounds in an Accumulation Network.",
                    "Performance Analysis of IP Switching and Tag Switching.",
                    "A Distributed Mechanism for Identification and Discrimination of Non-TCP-friendly Flows in the Internet.",
                    "New Handoff Strategies in Microcell/Macrocell Overlaying Systems.",
                    "Dynamic IEEE 802.11: Design, Modeling and Performance Evaluation.",
                    "TCP/IP over the Bluetooth Wireless Ad-hoc Network.",
                    "A Scheme for Time-Dependent Resource Reservation in QoS-Enabled IP Networks.",
                    "Impact of \"Trunk Reservation\" on Elastic Flow Routing.",
                    "New Distributed Multicast Routing and Its Performance Evaluation.",
                    "Distance-Vector QoS-Based Routing with Three Metrics.",
                    "On Shortest Path Problems with \"Non-Markovian\" Link Contribution to Path Lengths.",
                    "Adaptive QoS Platform in Multimedia Networks.",
                    "Quality-of-Service (QoS) in Heterogeneous Networks: CLIP, LANE and MPOA Performance Test.",
                    "Experiments with Dynamic Multiplexing and UPC Renegotiation for Video over ATM.",
                    "The Study of Burst Admission Control in an Integrated Voice/Data CDMA Cellular System.",
                    "Model and Optimal Call Admission Policy in Cellular Mobile Networks.",
                    "Measurement-Based Pre-assignment Scheme with Connection-Level QoS Support for Multiservice Mobile Networks.",
                    "QoS Rewards and Risks: A Multi-market Approach to Resource Allocation.",
                    "Spare Capacity Planning for Survivable Mesh Networks.",
                    "A Cooperative Game Theory Approach to Resource Allocation in Wireless ATM Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/networking/2000w",
                "sub_name": "Mobile and Wireless Communication Networks, IFIP-TC6/European Commission NETWORKING 2000 International Workshop, MWCN 2000, Paris, France, May 16-17, 2000, Proceedings.",
                "count": 14,
                "papers": [
                    "An Overview of Wireless Indoor Geolocation Techniques and Systems.",
                    "Priority Based Multiple Access for Service Differentiation in Wireless Ad-Hoc Networks.",
                    "Survivability Analysis of Ad Hoc Wireless Network Architecture.",
                    "A Token Passing Tree MAC Scheme for Wireless Ad Hoc Networks to Support Real-Time Traffic.",
                    "Challenges for Mobile Voice-over-IP.",
                    "Smart Delivery of Multimedia Content for Wireless Applications.",
                    "IPv6: The Solution for Future Universal Networks.",
                    "Performance Measurement Methodologies and Quality of Service Evaluation in VoIP and Desktop Videoconferencing Networks.",
                    "Efficient Network Utilization for Multimedia Wireless Networks.",
                    "Mobility Management and Roaming with Mobile Agents.",
                    "Traffic Characteristics in Adaptive Prioritized-Handoff Control Method Considering Reattempt Calls.",
                    "Threshold-Based Registration (TBR) in Mobile IPv6.",
                    "Enhanced Mobile IP Protocol.",
                    "A Reliable Subcasting Protocol for Wireless Environments."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "NetWORKing 1993",
        "info": "Vienna, Austria",
        "venues": [
            {
                "sub_name_abbr": "conf/networking/1993",
                "sub_name": "NetWORKing: Connecting Workers In and Between Organizations, Proceedings of the IFIP WG9.1 Working Conference on NetWORKing, Vienna, Austria, 16-18 June, 1993.",
                "count": 26,
                "papers": [
                    "Introductory Remarks on Speed and Development.",
                    "Reconstructing Understandings of Organisation.",
                    "Tele-Racism: The Role of IT in Making Fascist Images Socially Acceptable.",
                    "Networking: Participation and Power.",
                    "\"Engaged Effort\" and Local Area Networks.",
                    "Social Control and Social Contract in Networking: Total Quality Management and the Control of Knowledge Work.",
                    "Network Technology and Organizational Control: A Case Study of Decision Making and Industrial Relations in a Privatized Public Enterprise.",
                    "Computer-Mediated Communication as Employee Voice: The Profit Sharing Plan.",
                    "From Electronic Networks to Mediated Collaborative Research: The Optimism and Obstacles.",
                    "Loss of Situative Context and its Relevance for Computer Mediated Communication and Cooperation.",
                    "Telecommunication and Strategic Networks in Rural Areas.",
                    "Trouble at the Boundaries: Changes in Everyday Life Through Computer Networks.",
                    "Networking: Transparency versus Privacy.",
                    "Working in (and on) the Electronic Fischbowl? Privacy Aspects of Multi-Media Communications.",
                    "Considering Privacy-Aspects in Designing CSCW-Applications.",
                    "The Ambivalence of Network Visibility in an Organizational Context.",
                    "Risks of Networking as Risks of Discourses.",
                    "Distributing Resources Through Network Utilisation.",
                    "The Politics of Networking in Health Care.",
                    "Torn Between Values and Interests: Standardization in a European Context.",
                    "Interorganizational Networking and the Institutional Gap.",
                    "When Negotiation and Interpretation Processes Limit Computer-Based Networks.",
                    "Networking in Services: Organisational and Professional Changes.",
                    "Integrated Gender Perspectives on Human-Centred Approaches to Developing Computerised Office Systems.",
                    "Empowering Team Work with Coordination Techologies: An Organizational Learning Perspective.",
                    "Cognitive Couplers: Toward a New Generation of Organizational Support Systems."
                ]
            }
        ]
    }
]