[
    {
        "name": "Networks",
        "year": "2022",
        "info": "2022: Volumes\n79,",
        "count": 13,
        "papers": [
            "An integer program and new lower bounds for computing the strong rainbow connection numbers of graphs.",
            "On matchings, T-joins, and arc routing in road networks.",
            "The b-bibranching problem: TDI system, packing, and discrete convexity.",
            "The family traveling salesman problem with incompatibility constraints.",
            "Combinatorial acyclicity models for potential-based flows.",
            "Min-sum controllable risk problems with concave risk functions of the same value range.",
            "A multi-vehicle covering tour problem with speed optimization.",
            "Optimal hierarchical clustering on a graph.",
            "Approximation algorithms for Steiner forest: An experimental study.",
            "The node cop-win reliability of unicyclic and bicyclic graphs.",
            "New computational approaches for the power dominating set problem: Set covering and the neighborhoods of zero forcing forts.",
            "Finding minimum label spanning trees using cross-entropy method.",
            "On the Complexity of Computing Maximum and Minimum Min-Cost-Flows."
        ]
    },
    {
        "name": "Networks",
        "year": "2021",
        "info": "2021: Volumes\n77,\n78",
        "count": 66,
        "papers": [
            "Preface.",
            "Twenty-one years in the life of Networks (2000 to 2020).",
            "The Early Days of Networks.",
            "Applications and efficient algorithms for integer programming problems on monotone constraints.",
            "Networks in economics and finance in Networks and beyond: A half century retrospective.",
            "On the road to better routes: Five decades of published research on the vehicle routing problem.",
            "Arc routing problems: A review of the past, present, and future.",
            "Future directions in drone routing research.",
            "Large-scale zone-based evacuation planning - Part I: Models and algorithms.",
            "Network reliability: Heading out on the highway.",
            "Tangle bases: Revisited.",
            "Preface.",
            "Solving Steiner trees: Recent advances, challenges, and perspectives.",
            "Telecommunications network design: Technology impacts and future directions.",
            "In search of network resilience: An optimization-based view.",
            "Recent challenges in Routing and Inventory Routing: E-commerce and last-mile delivery.",
            "\"Make no little plans\": Impactful research to solve the next generation of transportation problems.",
            "A fast maximum flow algorithm.",
            "An extreme-point tabu-search algorithm for fixed-charge network problems.",
            "Large-scale zone-based evacuation planning, Part II: Macroscopic and microscopic evaluations.",
            "Fixed interval scheduling with third-party machines.",
            "The firebreak problem.",
            "Efficient algorithms for finding 2-medians of a tree.",
            "Parameter estimation in a 3-parameter p-star random graph model.",
            "A polynomial algorithm for minimizing travel time in consistent time-dependent networks with waits.",
            "A story of diameter, radius, and (almost) Helly property.",
            "Packing returning secretaries.",
            "Preface: Special issue on network analytics and optimization.",
            "Minimum color-degree perfect b-matchings.",
            "Optimizing the investments in mobile networks and subscriber migrations for a telecommunication operator.",
            "Optimizing concurrency under Scheduling by Edge Reversal.",
            "An efficient approach to optimization of semi-stable routing in multicommodity flow networks.",
            "On undirected two-commodity integral flow, disjoint paths and strict terminal connection problems.",
            "In search of dense subgraphs: How good is greedy peeling?",
            "Weighted target set selection on trees and cycles.",
            "APPRECIATION TO REFEREES.",
            "Preface: Special issue on freight transportation and logistics.",
            "A Lagrangean relaxation approach to lifetime maximization of directional sensor networks.",
            "The constrained forward shortest path tour problem: Mathematical modeling and GRASP approximate solutions.",
            "A Lagrangian approach for the minimum spanning tree problem with conflicting edge pairs.",
            "An integrated user-system approach for shelter location and evacuation routing.",
            "A two-step optimization model for the distribution of perishable products.",
            "Multiperiod transshipment location-allocation problem with flow synchronization under stochastic handling operations.",
            "A novel pseudo-polynomial approach for shortest path problems.",
            "Deciding feasibility of a booking in the European gas market on a cycle is in P for the case of passive networks.",
            "Roots of two-terminal reliability polynomials.",
            "The Gross-Saccoman conjecture is true.",
            "Generating large scale-free networks with the Chung-Lu random graph model.",
            "Unimodal eccentricity in trees.",
            "Controller placement problem in software-defined networking: A survey.",
            "Special issue of Networks: New network models and approaches for logistics and transportation.",
            "A combinatorial auction-based approach for ridesharing in a student transportation system.",
            "Grocery distribution plans in urban networks with street crossing penalties.",
            "Braess' paradox: A cooperative game-theoretic point of view.",
            "Optimization of gas metering maintenance services: A multiobjective vehicle routing problem with a set of predefined overlapping time windows.",
            "Modeling the flying sidekick traveling salesman problem with multiple drones.",
            "ILP-based heuristics for a virtual network function placement and routing problem.",
            "An innovative operation-time-space network for solving different logistic problems with capacity and time constraints.",
            "Trucks and drones cooperation in the last-mile delivery process.",
            "Parcel delivery cost minimization with time window constraints using trucks and drones.",
            "Minimum cost flow problem with conflicts.",
            "Solving the team orienteering problem with nonidentical agents: A Lagrangian approach.",
            "A two-tier urban delivery network with robot-based deliveries.",
            "The invisible-hand heuristic for origin-destination integer multicommodity network flows.",
            "A solution approach for multi-trip vehicle routing problems with time windows, fleet sizing, and depot location.",
            "A mathematical formulation and an LP-based neighborhood search matheuristic solution method for the integrated train blocking and shipment path problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2020",
        "info": "2020: Volumes\n75,\n76",
        "count": 57,
        "papers": [
            "Stronger path-based extended formulation for the Steiner tree problem.",
            "Lexicographically optimal earliest arrival flows.",
            "Parameterized algorithms and data reduction for the short secluded s-t-path problem.",
            "Adaptive large neighborhood search for the vehicle routing problem with synchronization constraints at the delivery location.",
            "An extended formulation for the 1-wheel inequalities of the stable set polytope.",
            "A modeling and computational study of the frustration index in signed networks.",
            "Complexity of inventory routing problems when routing is easy.",
            "A linear programming based approach to the Steiner tree problem with a fixed number of terminals.",
            "A branch-and-cut algorithm for a bipartite graph construction problem in digital communication systems.",
            "On a virtual network functions placement and routing problem: Some properties and a comparison of two formulations.",
            "A strong formulation for the graph partition problem.",
            "On the distance between random events on a network.",
            "Two-stage stochastic minimum s - t cut problems: Formulations, complexity and decomposition algorithms.",
            "Parameterized complexity of finding a spanning tree with minimum reload cost diameter.",
            "Covering edges in networks.",
            "Primal column generation framework for vehicle and crew scheduling problems.",
            "Fixed parameter tractability of a biconnected bottleneck Steiner network problem.",
            "Minimum shared-power edge cut.",
            "Resilience of communication networks to random failures and disasters: An optimization perspective.",
            "The Earth is nearly flat: Precise and approximate algorithms for detecting vulnerable regions of networks in the plane and on the sphere.",
            "Design/upgrade of a transparent optical network topology resilient to the simultaneous failure of its critical nodes.",
            "Shared Risk Link Group disjointness and geodiverse routing: A trade-off between benefit and practical effort.",
            "Content placement in 5G-enabled edge/core data center networks resilient to link cut attacks.",
            "Dual-failure restorability analysis of span-restorable meta-mesh networks.",
            "A robust optimization model for affine/quadratic flow thinning: A traffic protection mechanism for networks with variable link capacity.",
            "Robust network function virtualization.",
            "The policy graph decomposition of multistage stochastic programming problems.",
            "Linear edge costs and labeling algorithms: The case of the time-dependent vehicle routing problem with time windows.",
            "Routing and scheduling of network flows with deadlines and discrete capacity allocation.",
            "Rational roots of all-terminal reliability.",
            "A branch-and-cut approach for the least cost influence problem on social networks.",
            "Empirical study on sufficient numbers of minimum cuts in strongly connected directed random graphs.",
            "Appreciation to Referees.",
            "Preface to the special issue on optimization in vehicle routing and logistics.",
            "An exact bidirectional pulse algorithm for the constrained shortest path.",
            "Integrating production scheduling and transportation procurement through combinatorial auctions.",
            "A branch-and-cut approach and alternative formulations for the traveling salesman problem with drone.",
            "Routing electric vehicles with a single recharge per route.",
            "Avoiding unnecessary demerging and remerging of multi-commodity integer flows.",
            "Delivery systems with crowd-sourced drivers: A pickup and delivery problem with transfers.",
            "Adaptive large variable neighborhood search for a multiperiod vehicle and technician routing problem.",
            "Columnwise neighborhood search: A novel set partitioning matheuristic and its application to the VeRoLog Solver Challenge 2019.",
            "Exact and hyper-heuristic solutions for the distribution-installation problem from the VeRoLog 2019 challenge.",
            "The K-partitioning problem: Formulations and branch-and-cut.",
            "Spanning tree modulus for secure broadcast games.",
            "An integer program for positive semidefinite zero forcing in graphs.",
            "The stochastic critical node problem over trees.",
            "Improved methods to compare distance metrics in networks using uniform random spanning trees (DIMECOST).",
            "Most reliable two-terminal graphs with node failures.",
            "Preface: Special issue on arc routing problems and other related topics.",
            "Secure and efficient routing on nodes, edges, and arcs of simple-graphs and of multi-graphs.",
            "Plowing with precedence in polynomial time.",
            "The mixed capacitated general routing problem with time-dependent demands.",
            "On approximate data reduction for the Rural Postman Problem: Theory and experiments.",
            "A branch-and-dive heuristic for single vehicle snow removal.",
            "Effects of update frequencies in a dynamic capacitated arc routing problem.",
            "The parking warden tour problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2019",
        "info": "2019: Volumes\n73,\n74",
        "count": 55,
        "papers": [
            "Stochastic network interdiction with incomplete preference.",
            "A more fine-grained complexity analysis of finding the most vital edges for undirected shortest paths.",
            "A note on the rainbow cycle cover problem.",
            "Detecting critical node structures on graphs: A mathematical programming approach.",
            "Computing minimum 2-edge-connected Steiner networks in the Euclidean plane.",
            "Cost allocation mechanisms in a peer-to-peer network.",
            "A computation-implementation parallelization approach to the vehicle loading and routing problem.",
            "A note on \"A linear-size zero-one programming model for the minimum spanning tree problem in planar graphs\".",
            "A decomposition approach to solve the selective graph coloring problem in some perfect graph families.",
            "Algorithms and complexity of range clustering.",
            "An exact bidirectional A⋆ approach for solving resource-constrained shortest path problems.",
            "Reduction techniques for the prize collecting Steiner tree problem and the maximum-weight connected subgraph problem.",
            "Optimizing ground station networks for free space optical communications: Maximizing the data transfer.",
            "Navigating free-floating minefields via time-varying Voronoi graphs.",
            "Anticipation versus reactive reoptimization for dynamic vehicle routing with stochastic requests.",
            "Inverse optimization in minimum cost flow problems on countably infinite networks.",
            "Algorithmic results for potential-based flows: Easy and hard cases.",
            "The most reliable flight itinerary problem.",
            "Complexity of edge coloring with minimum reload/changeover costs.",
            "Minimum-risk routing through a mapped minefield.",
            "Preface: Special issue on the future of route optimization/vehicle routing.",
            "Leveraging single-objective heuristics to solve bi-objective problems: Heuristic box splitting and its application to vehicle routing.",
            "A branch-and-price algorithm for the vehicle routing problem with time windows on a road network.",
            "An empirical validation and data-driven extension of continuum approximation approaches for urban route distances.",
            "Robust optimization of dynamic route planning in same-day delivery networks with one-time observation of new demand.",
            "Team orienteering with uncertain rewards and service times with an application to phlebotomist intrahospital routing.",
            "Impact of congestion pricing schemes on costs and emissions of commercial fleets in urban areas.",
            "The cost of incentive compatibility in auction-based mechanisms for carrier collaboration.",
            "Appreciation to Referees.",
            "A branch-and-price algorithm for the rainbow cycle cover problems.",
            "A new algorithm for the shortest-path problem.",
            "Decomposable robust two-stage optimization: An application to gas network operations under uncertainty.",
            "The Firefighter problem: Saving sets of vertices on cubic graphs.",
            "Max flow vitality in general and st-planar graphs.",
            "Distributionally robust project crashing with partial or no correlation information.",
            "Preface: Special issue on network optimization in transportation, logistics, and industry.",
            "Evaluation of flow dependent external costs in freight logistics networks.",
            "An optimization approach for congestion control in network routing with quality of service requirements.",
            "A multiethnic genetic approach for the minimum conflict weighted spanning tree problem.",
            "Heuristics for the strong generalized minimum label spanning tree problem.",
            "Some properties of transportation network cooperative games.",
            "A three-stage p-median based exact method for the optimal diversity management problem.",
            "A polyhedral analysis of the capacitated edge activation problem with uncertain demands.",
            "An adaptive large neighborhood search with path relinking for a class of vehicle-routing problems with simultaneous pickup and delivery.",
            "On bilevel minimum and bottleneck spanning tree problems.",
            "Minimum reload cost cycle cover in complete graphs.",
            "Time-dependent shortest paths with discounted waits.",
            "Monotonicity and conformality in multicommodity network-flow problems.",
            "Editorial: 2018 Glover-Klingman Prize Winners.",
            "Preface: Special Issue on Network Optimization in Transportation, Logistics, and Industry (Part 2).",
            "Bilateral trade with risk-averse intermediary using linear network optimization.",
            "A two-level local search heuristic for pickup and delivery problems in express freight trucking.",
            "The forwarder planning problem in a two-echelon network.",
            "An exact method for a class of robust shortest path problems with scenarios.",
            "An MIP formulation for the open location-routing problem considering the topological characteristic of the solution-paths."
        ]
    },
    {
        "name": "Networks",
        "year": "2018",
        "info": "2018: Volumes\n71,\n72",
        "count": 59,
        "papers": [
            "Discounted average degree density metric and new algorithms for the densest subgraph problem.",
            "Network design with probabilistic capacities.",
            "Polyhedral results, branch-and-cut and Lagrangian relaxation algorithms for the adjacent only quadratic minimum spanning tree problem.",
            "Optimal and heuristic network coding algorithms for multi-layered video broadcast.",
            "Multiple searchers searching for a randomly distributed immobile target on a unit network.",
            "Safe sets, network majority on weighted trees.",
            "Preface: Recent advances in telecommunications networks planning and operation.",
            "Virtual function placement for service chaining with partial orders and anti-affinity rules.",
            "Energy efficiency of data center operating practices: Server clustering, powering on/off, and bang-bang control.",
            "Open shortest path first routing under random early detection.",
            "On maximum degree-based γ-quasi-clique problem: Complexity and exact approaches.",
            "Uncertainty in FTTH splitter installation.",
            "Editorial.",
            "New assignment-based neighborhoods for traveling salesman and routing problems.",
            "A branch-and-price algorithm for the single-path virtual network embedding problem.",
            "Online scheduling with multi-state machines.",
            "Domain clustering for inter-domain path computation speed-up.",
            "A note on scheduling container storage operations of two non-passing stacking cranes.",
            "On the analysis of independent sets via multilevel splitting.",
            "Probabilistic N-k failure-identification for power systems.",
            "Preface: Theoretical and algorithmic contributions to network optimization problems.",
            "On the p-median polytope and the odd directed cycle inequalities: Oriented graphs.",
            "Evangelism in social networks: Algorithms and complexity.",
            "Faster computation of successive bounds on the group betweenness centrality.",
            "The capacity formulation of the capacitated edge activation problem.",
            "The Backbone Packet Radio Network coloring for Time Division Multiple Access link scheduling in Wireless Multihop Networks.",
            "Critical arcs detection in influence networks.",
            "Integer programming models for detecting graph bipartitions with structural requirements.",
            "Combining and projecting flow models for the (precedence constrained) asymmetric traveling salesman problem.",
            "New advances and applications in deterministic and stochastic network optimization.",
            "An adjustable sample average approximation algorithm for the stochastic production-inventory-routing problem.",
            "Multi-budgeted matching problems.",
            "Optimal wind farm cable routing: Modeling branches and offshore transformer modules.",
            "Towards simulation based mixed-integer optimization with differential equations.",
            "Extensions of labeling algorithms for multi-objective uncertain shortest path problems.",
            "The cone of flow matrices: Approximation hierarchies and applications.",
            "Solving the bifurcated and nonbifurcated robust network loading problem with k-adaptive routing.",
            "Editorial: 2017 Glover-Klingman Prize Winners.",
            "An approximation algorithm for the Steiner connectivity problem.",
            "Deterministic gathering with crash faults.",
            "On uniformly most reliable two-terminal graphs.",
            "A disjunctive program formulation to generate regular public transit timetables adhering to prioritized planning requirements.",
            "Algorithms for node-weighted Steiner tree and maximum-weight connected subgraph.",
            "Integer programming formulations for minimum deficiency interval coloring.",
            "Lifting and separation of robust cover inequalities.",
            "Erratum.",
            "Preface: Emerging challenges in transportation planning.",
            "A two-phase Pareto local search heuristic for the bi-objective pollution-routing problem.",
            "The multiple vehicle balancing problem.",
            "A flow-first route-next heuristic for liner shipping network design.",
            "A branch-and-bound algorithm for the time-dependent travelling salesman problem.",
            "Vehicle routing problems with road-network information: State of the art.",
            "Preface: Special issue on Drone Delivery Systems.",
            "Optimization approaches for civil applications of unmanned aerial vehicles (UAVs) or aerial drones: A survey.",
            "An iterative two-step heuristic for the parallel drone scheduling traveling salesman problem.",
            "Same-day delivery with heterogeneous fleets of drones and vehicles.",
            "Drone delivery from trucks: Drone scheduling for given truck routes.",
            "Dynamic programming approaches for the traveling salesman problem with drone.",
            "Drone arc routing problems."
        ]
    },
    {
        "name": "Networks",
        "year": "2017",
        "info": "2017: Volumes\n69,\n70",
        "count": 58,
        "papers": [
            "Preface: Static and dynamic optimization models for network routing problems.",
            "Survivable green traffic engineering with shared protection.",
            "Cheapest paths in dynamic networks.",
            "A node-based ILP formulation for the node-weighted dominating Steiner problem.",
            "A penalized best-response algorithm for nonlinear single-path routing problems.",
            "The budgeted minimum cost flow problem with unit upgrading cost.",
            "Network pricing problem with unit toll.",
            "Finding a Nash equilibrium and an optimal sharing policy for multiagent network expansion game.",
            "A Lagrangian heuristic algorithm for the time-dependent combined network design and routing problem.",
            "An Improved DSATUR-Based Branch-and-Bound Algorithm for the Vertex Coloring Problem.",
            "Reduced-size formulations for metric and cut polyhedra in sparse graphs.",
            "Lightpath admission control and rerouting in dynamic flex-grid optical transport networks.",
            "Bidirected minimum Manhattan network problem.",
            "Cancel-and-tighten algorithm for quickest flow problems.",
            "Detecting resilient structures in stochastic networks: A two-stage stochastic optimization approach.",
            "The stochastic close-enough arc routing problem.",
            "Restricted swap-based neighborhood search for the minimum connected dominating set problem.",
            "Preface: Special issue on the VeRoLog 2015 conference.",
            "A biased-randomized metaheuristic for the vehicle routing problem with clustered and mixed backhauls.",
            "An adaptive and diversified vehicle routing approach to reducing the security risk of cash-in-transit operations.",
            "Full-load route planning for balancing bike sharing systems by logic-based benders decomposition.",
            "Partitioning a street network into compact, balanced, and visually appealing routes.",
            "Iterated local search for the capacitated vehicle routing problem with sequence-based pallet loading and axle weight constraints.",
            "An iterated beam search algorithm for the green vehicle routing problem.",
            "On an effective approach for the coach trip with shuttle service problem of the VeRoLog solver challenge 2015.",
            "Zone-based tariff design in public transportation networks.",
            "Two extended formulations for cardinality maximum flow network interdiction problem.",
            "Hardness and approximation for network flow interdiction.",
            "Approaches for finding cohesive subgroups in large-scale social networks via maximum k-plex detection.",
            "A recursive formula for the two-edge connected and biconnected reliability of a complete graph.",
            "Editorial.",
            "Branch-cut-price algorithms for solving a class of search problems on general graphs.",
            "An inexact sample average approximation approach for the stochastic connected facility location problem.",
            "The vehicle routing problem with drones: Extended models and connections.",
            "Adaptive large neighborhood search algorithm for the rural postman problem with time windows.",
            "Minimizing the makespan in multiserver network restoration problems.",
            "Editorial: 2016 Glover-Klingman Prize Winners.",
            "New upper bound on m-time-relaxed k-broadcast graphs.",
            "Quadratic unconstrained binary optimization problem preprocessing: Theory and empirical analysis.",
            "Duality in convex minimum cost flow problems on infinite networks and hypernetworks.",
            "Computing cyclic invariants for molecular graphs.",
            "Bounds on the fault-diameter of graphs.",
            "Preface: Special issue on Arc Routing Problems.",
            "An updated annotated bibliography on arc routing problems.",
            "Solving the large-scale min-max K-rural postman problem for snow plowing.",
            "Aesthetic considerations for the min-max K-Windy Rural Postman Problem.",
            "Dissimilar arc routing problems.",
            "New path elimination constraints for multi-depot routing problems.",
            "A parameterized approximation algorithm for the mixed and windy capacitated arc routing problem: Theory and experiments.",
            "Preface: Design of Resilient Communication Networks.",
            "Factorization and exact evaluation of the source-terminal diameter-constrained reliability.",
            "Efficient heuristics for determining node-disjoint path pairs visiting specified nodes.",
            "Toward fast calculation of communication paths for resilient routing.",
            "Unambiguous switching link group failure localization in all-optical networks.",
            "Robust spectrum allocation in elastic flexgrid optical networks: Complexity and formulations.",
            "Dedicated protection of multicast sessions in mixed-graph sparse-splitting optical networks.",
            "Protection strategies for virtual network functions placement and service chains provisioning.",
            "Toward fault-tolerant multi-robot networks."
        ]
    },
    {
        "name": "Networks",
        "year": "2016",
        "info": "2016: Volumes\n67,\n68",
        "count": 50,
        "papers": [
            "Dynamic vehicle routing problems: Three decades and counting.",
            "Heuristic Based Real-Time Train Rescheduling System.",
            "Metric tree-like structures in real-world networks: an empirical study.",
            "Partitioning a graph into connected components with fixed centers and optimizing cost-based objective functions or equipartition criteria.",
            "Robust reconstruction of Barabási-Albert networks in the broadcast congested clique model.",
            "The traveling salesman problem with pickup, delivery, and ride-time constraints.",
            "The wireless network jamming problem subject to protocol interference.",
            "A matheuristic approach to integrate humping and pullout sequencing operations at railroad hump yards.",
            "Line-broadcasting in complete k-ary trees.",
            "Integer programming formulations for the k-edge-connected 3-hop-constrained network design problem.",
            "A linear time algorithm for the unbalanced Hitchcock transportation problem.",
            "Preface.",
            "An iterated local search algorithm for water distribution network design optimization.",
            "A simple and efficient strategy for solving very large-scale generalized cable-trench problems.",
            "Local search metaheuristics for the critical node problem.",
            "An equi-model matheuristic for the multi-depot ring star problem.",
            "On provably best construction heuristics for hard combinatorial optimization problems.",
            "Metaheuristics for a job scheduling problem with smoothing costs relevant for the car industry.",
            "Editorial: 2015 Glover-Klingman Prize Winners.",
            "Inflection points of reliability polynomials are dense in [0, 1].",
            "A note on detecting unbounded instances of the online shortest path problem.",
            "Reformulation and decomposition approaches for traffic routing in optical networks.",
            "Three-partition flow cover inequalities for constant capacity fixed-charge network flow problems.",
            "Two node-disjoint hop-constrained survivable network design and polyhedra.",
            "Algorithms and complexity results for finding graphs with extremal Randić index.",
            "Preface to the 2nd Special Issue on metaheuristics in network optimization.",
            "Mathematical models and empirical analysis of a simulated annealing approach for two variants of the static data segment allocation problem.",
            "Doubly-rooted stem-and-cycle ejection chain algorithm for the asymmetric traveling salesman problem.",
            "Partial target coverage to extend the lifetime in wireless multi-role sensor networks.",
            "Heuristics for a hub location-routing problem.",
            "Editorial.",
            "Locating depots for capacitated vehicle routing.",
            "The power edge set problem.",
            "A characterization of irreducible infeasible subsystems in flow networks.",
            "The ring/κ-rings network design problem: Model and branch-and-cut algorithm.",
            "Capacitated network design games with weighted players.",
            "A branch-and-cut-and-price algorithm for the mixed capacitated general routing problem.",
            "Robust capacity expansion of a network under demand uncertainty: A bi-objective approach.",
            "Robust models for linear programming with uncertain right hand side.",
            "The driver assignment vehicle routing problem.",
            "Availability-driven optimal design of shared path protection in WDM networks.",
            "On the roots of the node reliability polynomial.",
            "Editorial.",
            "Minimal disconnected cuts in planar graphs.",
            "The Rainbow Cycle Cover Problem.",
            "Mixed planar and network single-facility location problems.",
            "Designing networks: A mixed-integer linear optimization approach.",
            "Minimum bottleneck spanning trees with degree bounds.",
            "Dynamic shortest-path interdiction.",
            "The bottleneck selected-internal and partial terminal Steiner tree problems."
        ]
    },
    {
        "name": "Networks",
        "year": "2015",
        "info": "2015: Volumes\n65,\n66",
        "count": 58,
        "papers": [
            "Several 2-facility location problems on networks with equity objectives.",
            "Scatter search for the profile minimization problem.",
            "Evasive flow capture: Optimal location of weigh-in-motion systems, tollbooths, and security checkpoints.",
            "The stacker crane problem and the directed general routing problem.",
            "Efficient algorithms for the maximum concurrent flow problem.",
            "A compact linear programming formulation of the maximum concurrent flow problem.",
            "Reaching the elementary lower bound in the vehicle routing problem with time windows.",
            "Guest editorial: Recent trends in vehicle routing.",
            "Timing problems and algorithms: Time decisions for sequences of activities.",
            "Single-item reformulations for a vendor managed inventory routing problem: Computational experience with benchmark instances.",
            "A branch-and-cut algorithm for the multi-vehicle traveling purchaser problem with pairwise incompatibility constraints.",
            "Waste collection routing - limited multiple landfills and heterogeneous fleet.",
            "Optimal vehicle routing with lower and upper bounds on route durations.",
            "The school bus routing and scheduling problem with transfers.",
            "The next-to-shortest path problem on directed graphs with positive edge weights.",
            "Real-time scheduling of aircraft arrivals and departures in a terminal maneuvering area.",
            "The complexity of integrating passenger routing decisions in public transportation models.",
            "Traffic signal optimization using cyclically expanded networks.",
            "Computing network tolls with support constraints.",
            "Stochastic maximum weight forest problem.",
            "An incremental algorithm for the uncapacitated facility location problem.",
            "Network spot-checking games: Theory and application to toll enforcing in transportation networks.",
            "Formulations and exact solution approaches for the degree preserving spanning tree problem.",
            "On the complexity of equal shortest path routing.",
            "A branch-and-price algorithm for the (k, c)-coloring problem.",
            "Branch-and-cut and Branch-and-cut-and-price algorithms for the adjacent only quadratic minimum spanning tree problem.",
            "Efficient Edge-swapping heuristics for the reload cost spanning tree problem.",
            "Timetabling and assignment problems in railway planning and integer multicommodity flow.",
            "Solving the two-facility network design problem with 3-partition facets.",
            "Freight car dispatching with generalized flows.",
            "A railroad maintenance problem solved with a cut and column generation matheuristic.",
            "Robust bottleneck routing games.",
            "On a Random Walk Survivability problem with arc failures and memory.",
            "Editorial: 2013 Glover-Klingman Prize winners.",
            "Stability of adversarial routing with feedback.",
            "Robust constrained shortest path problems under budgeted uncertainty.",
            "The time-dependent quickest path problem: Properties and bounds.",
            "Rate-adaptive multipath routing: Distributed, centralized, and hybrid architectures.",
            "Selecting vertex disjoint paths in plane graphs.",
            "Optimal response to epidemics and cyber attacks in networks.",
            "The cut property under demand uncertainty.",
            "Editorial: 2014 Glover-Klingman Prize winners.",
            "Critical nodes for distance-based connectivity and related problems in graphs.",
            "Graph orientation and flows over time.",
            "Robust recoverable perfect matchings.",
            "Multilayer variable neighborhood search for two-level uncapacitated facility location problems with single assignment.",
            "A simpler load-balancing algorithm for range-partitioned data in peer-to-peer systems.",
            "Preface: Optimization issues in resilient network design and modeling.",
            "Integer programming, Constraint programming, and metaheuristic approaches for static optimization of anycast flows in elastic optical networks.",
            "Generalized elastic flow rerouting scheme.",
            "An effective algorithm for computing all-terminal reliability bounds.",
            "Diameter constrained reliability: Complexity, distinguished topologies and asymptotic behavior.",
            "Availability-based path selection and network vulnerability assessment.",
            "Optimizing robustness in geometric routing via embedding redundancy and regeneration.",
            "Geodiverse routing with path delay and skew requirement under area-based challenges.",
            "SRLG failure localization using nested m-trails and their application to adaptive probing.",
            "A Rolling Horizon Heuristic for the Multiperiod Network Design and Routing Problem.",
            "Region-based fault-tolerant distributed file storage system design in networks."
        ]
    },
    {
        "name": "Networks",
        "year": "2014",
        "info": "2014: Volumes\n63,\n64",
        "count": 57,
        "papers": [
            "Forty years of periodic vehicle routing.",
            "The split delivery capacitated team orienteering problem.",
            "A branch-price-and-cut algorithm for the min-max k-vehicle windy rural postman problem.",
            "The multi-commodity pickup-and-delivery traveling salesman problem.",
            "A template-based adaptive large neighborhood search for the consistent vehicle routing problem.",
            "A stochastic inventory routing problem for infectious medical waste collection.",
            "Finding least fuel emission paths in a network with time-varying speeds.",
            "Solving the close-enough arc routing problem.",
            "Branch-and-cut algorithms for the vehicle routing problem with trailers and transshipments.",
            "Incomplete service and split deliveries in a routing problem with profits.",
            "Nonexistence of optimal graphs for all terminal reliability.",
            "Minisum multipurpose trip location problem on trees.",
            "Network analysis for active and passive propagation models.",
            "Complexity and approximability of the k-way vertex cut.",
            "An improved approximation algorithm for the capacitated TSP with pickup and delivery on a tree.",
            "Scheduling unit time arc shutdowns to maximize network flow over time: Complexity results.",
            "Revisiting deadlock prevention: A probabilistic approach.",
            "A new consistent vehicle routing problem for the transportation of people with disabilities.",
            "Generalized measures for fault tolerance of star networks.",
            "Submodularity of minimum-cost spanning tree games.",
            "A note on shortest path problems with forbidden paths.",
            "Fully dynamic update of arc-flags.",
            "Strategic placement of telemetry to reduce routing costs.",
            "Forty years of periodic vehicle routing.",
            "Vector connectivity in graphs.",
            "Bicriterion discrete equilibrium network design problem.",
            "Integrated network design and scheduling problems with parallel identical machines: Complexity results and dispatching rules.",
            "On the difficulty of virtual private network instances.",
            "Cooperative covering problems on networks.",
            "A comparison of several models for the hamiltonian p-median problem.",
            "Reliability polynomials having arbitrarily many inflection points.",
            "Finding k shortest simple paths in directed graphs: A node classification algorithm.",
            "A flow-dependent quadratic steiner tree problem in the Euclidean plane.",
            "Solving multitrip vehicle routing under order incompatibilities: A VRP arising in supply chain management.",
            "Accumulation games on graphs.",
            "Minimum vertex blocker clique problem.",
            "Substitutes, complements, and ripples in multicommodity flows on suspension graphs.",
            "Bounds on the radius and status of graphs.",
            "Online traveling salesman problems with rejection options.",
            "Centroidal bases in graphs.",
            "Exact algorithms for solving a Euclidean maximum flow network interdiction problem.",
            "Adaptive large neighborhood search for the periodic capacitated arc routing problem with inventory constraints.",
            "Editorial.",
            "A Branch-Price-and-Cut approach for solving the medium-term home health care planning problem.",
            "A branch-and-price algorithm for the multivehicle covering tour problem.",
            "The Rural Postman Problem with time windows.",
            "Security routing games with multivehicle Chinese postman problem.",
            "Vehicle routing problems in which consistency considerations are important: A survey.",
            "Reoptimization strategies for a dynamic vehicle routing problem with mixed backhauls.",
            "Editorial.",
            "More facets for survivable networks.",
            "A matheuristic algorithm for the mixed capacitated general routing problem.",
            "Vehicle routing problems with different service constraints: A branch-and-cut-and-price algorithm.",
            "The relocation problem for the one-way electric vehicle sharing.",
            "Sorting common operations to minimize the number of tardy jobs.",
            "Maximizing lifetime and handling reliability in wireless sensor networks.",
            "A memetic algorithm for the weighted feedback vertex set problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2013",
        "info": "2013: Volumes\n61,\n62",
        "count": 53,
        "papers": [
            "Integer programming models and algorithms for the graph decontamination problem with mobile agents.",
            "On the super-restricted arc-connectivity of s -geodetic digraphs.",
            "Proximity graphs inside large weighted graphs.",
            "Simplifications and speedups of the pseudoflow algorithm.",
            "A branch-and-bound algorithm for the double travelling salesman problem with two stacks.",
            "Robust mean absolute deviation problems on networks with linear vertex weights.",
            "Editorial.",
            "A branch-and-cut algorithm for the ring spur assignment problem.",
            "The orienteering problem with variable profits.",
            "Algebraic methods applied to shortest path and maximum flow problems in stochastic networks.",
            "Robust network design: Formulations, valid inequalities, and computations.",
            "Stabilizing branch-and-price for constrained tree problems.",
            "Hop-level flow formulation for the survivable network design with hop constraints problem.",
            "Affine recourse for the robust network design problem: Between static and dynamic routing.",
            "Editorial: 2011 Glover-Klingman Prize Winners.",
            "Balancing profits and costs on trees.",
            "Tolerant identification with Euclidean balls.",
            "Routing and scheduling for energy and delay minimization in the powerdown model.",
            "The Gilbert arborescence problem.",
            "Integrated job scheduling and network routing.",
            "On building multiple spanning trees and VLAN assignment in metro ethernet networks.",
            "Linearly many faults in arrangement graphs.",
            "Analyses of advanced iterated tour partitioning heuristics for generalized vehicle routing problems.",
            "Reverse multistar inequalities and vehicle routing problems with a lower bound on the number of customers per route.",
            "Shortest paths avoiding forbidden subpaths.",
            "Minimum-weight subgraphs with unicyclic components and a lower-bounded girth.",
            "Benders decomposition approach for the robust network design problem with flow bifurcations.",
            "A polyhedral study of the capacity formulation of the multilayer network design problem.",
            "Local versus global search in channel graphs.",
            "Distance edge coloring and collision-free communication in wireless sensor networks.",
            "Parametrized relocation of low-mobility resources.",
            "A branch-and-bound algorithm for representative integer efficient solutions in multiple objective network programming problems.",
            "Search games on networks with travelling and search costs and with arbitrary searcher starting points.",
            "A note on \"Multistage Methods for Freight Train Classification\".",
            "The price of anarchy in nonatomic consumption-relevance congestion games.",
            "Efficient algorithms for a simple network design problem.",
            "Computation of the optimal value function in time-dependent networks.",
            "Complexity and approximability of the maximum flow problem with minimum quantities.",
            "Analysis of an exact algorithm for the vessel speed optimization problem.",
            "Faster strongly polynomial algorithms for the unbalanced transportation problem and assignment problem with monge costs.",
            "Complexity of a classical flow restoration problem.",
            "Single bend paths on a grid have strong helly number 4: errata atque emendationes ad \"edge intersection graphs of single bend paths on a grid\".",
            "Optimal edge-coloring with edge rate constraints.",
            "A survey of resource constrained shortest path problems: Exact solution approaches.",
            "Nonoblivious 2-Opt heuristics for the traveling salesman problem.",
            "Solutions to conjectures on the (k, ℓ)-rainbow index of complete graphs.",
            "Theoretical and computational advances for network diversion.",
            "Effectiveness-equity models for facility location problems on tree networks.",
            "Robust capacity assignment solutions for telecommunications networks with uncertain demands.",
            "Decomposition algorithms for solving the minimum weight maximal matching problem.",
            "Fast algorithms for convex cost flow problems on circles, lines, and trees.",
            "A maritime inventory routing problem: Discrete time formulations and valid inequalities.",
            "The dispatching problem on multitrack territories: Heuristic approaches based on mixed integer linear programming."
        ]
    },
    {
        "name": "Networks",
        "year": "2012",
        "info": "2012: Volumes\n59, 60",
        "count": 58,
        "papers": [
            "Editorial.",
            "A quadratic semidefinite relaxation approach for resource allocation in orthogonal frequency division multiple access.",
            "The complexity of the node capacitated in-tree packing problem.",
            "The load-distance balancing problem.",
            "On the minimum cut separator problem.",
            "Survivability in hierarchical telecommunications networks.",
            "Cover inequalities for robust knapsack sets - Application to the robust bandwidth packing problem.",
            "Network flow methods for electoral systems.",
            "Exact approaches to the single-source network loading problem.",
            "On a stochastic bilevel programming problem.",
            "Improving an interior-point algorithm for multicommodity flows by quadratic regularizations.",
            "Complexity of column generation in network design with path-based survivability mechanisms.",
            "Branch-and-cut and hybrid local search for the multi-level capacitated minimum spanning tree problem.",
            "Exactly solving a two-level location problem with modular node capacities.",
            "Recoverable robust shortest path problems.",
            "Parametric maximum flow methods for minimax approximation of target quotas in biproportional apportionment.",
            "Approximation algorithms for distance constrained vehicle routing problems.",
            "A note on Steiner tree games.",
            "Lagrangean decomposition/relaxation for the routing and wavelength assignment problem.",
            "Bidirectional A* search on time-dependent road networks.",
            "The complexity of welfare maximization in congestion games.",
            "A note on a generalization of eigenvector centrality for bipartite graphs and applications.",
            "Editorial: Preface to the special issue.",
            "Succinct greedy drawings do not always exist.",
            "Real-time monitoring of undirected networks: Articulation points, bridges, and connected and biconnected components.",
            "Optimal gossiping in geometric radio networks in the presence of dynamical faults.",
            "Localization and scheduling protocols for actor-centric sensor networks.",
            "A mobility model for studying wireless communication and the complexity of problems in the model.",
            "Deterministic rendezvous in networks: A comprehensive survey.",
            "Matching preclusion and conditional matching preclusion for bipartite interconnection networks I: Sufficient conditions.",
            "Matching preclusion and conditional matching preclusion for bipartite interconnection networks II: Cayley graphs generated by transposition trees and hyper-stars.",
            "Reload cost trees and network design.",
            "Computing approximate Nash equilibria in network congestion games.",
            "A branch-and-cut algorithm for the preemptive swapping problem.",
            "Coverings and matchings in r-partite hypergraphs.",
            "Models and heuristics for the k -degree constrained minimum spanning tree problem with node-degree costs.",
            "Large neighborhood search for the pickup and delivery traveling salesman problem with multiple stacks.",
            "On stackelberg pricing with computationally bounded customers.",
            "Deception tactics for network interdiction: A multiobjective approach.",
            "Completely independent spanning trees in torus networks.",
            "A model of self-avoiding random walks for searching complex networks.",
            "Constructing optimal subnetworks for the crossed cube network.",
            "The ℓp-function on trees.",
            "Polynomial-time algorithms for solving a class of critical node problems on trees and series-parallel graphs.",
            "Margining option portfolios by network flows.",
            "Oblivious OSPF routing with weight optimization under polyhedral demand uncertainty.",
            "Column generation algorithm for sensor coverage scheduling under bandwidth constraints.",
            "Integer models and upper bounds for the 3-club problem.",
            "Property Pd, m and efficient design of reliable networks.",
            "A fast heuristic approach for large-scale cell-transmission-based evacuation route planning.",
            "Bottleneck links, variable demand, and the tragedy of the commons.",
            "Connectedness of finite distance graphs.",
            "Editorial: 2010 Glover-Klingman prize winners.",
            "A branch-and-cut algorithm for the pickup and delivery traveling salesman problem with multiple stacks.",
            "Simple linear flow decomposition algorithms on trees, circles, and augmented trees.",
            "Distributed tree comparison with nodes of limited memory.",
            "Approximating survivable networks with minimum number of steiner points.",
            "Min-Max quickest path problems."
        ]
    },
    {
        "name": "Networks",
        "year": "2011",
        "info": "2011: Volumes\n57, 58",
        "count": 69,
        "papers": [
            "Special issue of Networks on optimization in scheduled transportation networks.",
            "Periodic railway timetabling with event flexibility.",
            "How to find good night train connections.",
            "A note on the online nature of the railway delay management problem.",
            "Experimental study of speed up techniques for timetable information systems.",
            "Modeling and solving a multimodal transportation problem with flexible-time and scheduled services.",
            "A MIP-based local search method for the railway rescheduling problem.",
            "Multistage methods for freight train classification.",
            "Line planning, path constrained network flow and inapproximability.",
            "A note on the upper bound for the paired-domination number of a graph with minimum degree at least two.",
            "Stackelberg network pricing is hard to approximate.",
            "Constructions of small regular bipartite graphs of girth 6.",
            "Single-vehicle scheduling problems with release and service times on a line.",
            "A minimum cost flow formulation for approximated MLC segmentation.",
            "On cut-based inequalities for capacitated network design polyhedra.",
            "Nonadaptive broadcasting in trees.",
            "Earliest arrival flows on series-parallel graphs.",
            "On terminal delta-wye reducibility of planar graphs.",
            "Optimal online ring routing.",
            "Editorial: Preface to the Special Issue.",
            "Optimal power control in OFDMA cellular networks.",
            "Exact algorithms for the vertex separator problem in graphs.",
            "A multistart heuristic for the equality generalized traveling salesman problem.",
            "On the cardinality constrained matroid polytope.",
            "On LP relaxations for the pattern minimization problem.",
            "On minimum reload cost paths, tours, and flows.",
            "A decomposition for total-coloring partial-grids and list-total-coloring outerplanar graphs.",
            "Uncertainty feature optimization: An implicit paradigm for problems with noisy data.",
            "An experimental study of maximum profit wavelength assignment in WDM rings.",
            "Locating median paths on connected outerplanar graphs.",
            "Editorial: 2009 Glover-Klingman Prize winners.",
            "Connectivity and diameter in distance graphs.",
            "On large (Δ, D, D, 1)-graphs.",
            "Least central subtrees, center, and centroid of a tree.",
            "Nonblocking multirate log2(N, m, p) switching networks with multicast connections.",
            "Finding hidden hubs and dominating sets in sparse graphs by randomized neighborhood queries.",
            "Balancing two spanning trees.",
            "Optimum steiner ratio for gradient-constrained networks connecting three points in 3-space, part II: The gradient-constraint m satisfies 1 <= m <= sqrt(3).",
            "Finding integer efficient solutions for multiple objective network programming problems.",
            "High-confidence estimation of small s-t reliabilities in directed acyclic networks.",
            "Big segment small segment global optimization algorithm on networks.",
            "Approximation of a batch consolidation problem.",
            "Traffic grooming in bidirectional WDM ring networks.",
            "Compression and expansion in graphs using overlays.",
            "Power domination in cylinders, tori, and generalized Petersen graphs.",
            "Resource allocation by means of project networks: Dominance results.",
            "Resource allocation by means of project networks: Complexity results.",
            "The most likely path on series-parallel networks.",
            "Editorial: Preface to the Special Issue.",
            "The preemptive swapping problem on a tree.",
            "Proximity and remoteness in graphs: Results and conjectures.",
            "Scheduling two chains of unit jobs on one machine: A polyhedral study.",
            "Progressive hedging-based metaheuristics for stochastic network design.",
            "Generalized network design polyhedra.",
            "Online traveling salesman problems with service flexibility.",
            "Minimax regret path location on trees.",
            "A mathematical analysis of the R-MAT random graph generator.",
            "GRASP with path relinking heuristics for the antibandwidth problem.",
            "Combinatorial algorithms for inverse absolute and vertex 1-center location problems on trees.",
            "Edge-superconnectivity of semiregular cages with odd girth.",
            "Graph labelings derived from models in distributed computing: A complete complexity classification.",
            "The connected hub number and the connected domination number.",
            "ROUTE 2009: Recent advances in vehicle routing optimization.",
            "A column generation approach for the split delivery vehicle routing problem.",
            "New facets and an enhanced branch-and-cut for the min-max K-vehicles windy rural postman problem.",
            "The vehicle routing problem with time windows and temporal dependencies.",
            "Improved exact method for the double TSP with multiple stacks.",
            "Cutting planes for branch-and-price algorithms.",
            "A multilevel variable neighborhood search heuristic for a practical vehicle routing and driver scheduling problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2010",
        "info": "2010: Volumes\n55, 56",
        "count": 60,
        "papers": [
            "Preface.",
            "Almost sure asymptotic optimality for online routing and machine scheduling problems.",
            "A branch-and-cut algorithm for the k-edge connected subgraph problem.",
            "k-Splittable delay constrained routing problem: A branch-and-price approach.",
            "A branch-and-cut algorithm for the pickup and delivery traveling salesman problem with LIFO loading.",
            "A fast parametric assignment algorithm with applications in max-algebra.",
            "Integrating facility location and production planning decisions.",
            "Linearly many faults in 2-tree-generated networks.",
            "The beta-reliable minimax and maximin location problems on a network with probabilistic weights.",
            "On the complexity of resilient network design.",
            "Sufficient conditions for a graph to be lambdak-optimal with given girth and diameter.",
            "Optimal routing with failure-independent path protection.",
            "Constrained decompositions of integer matrices and their applications to intensity modulated radiation therapy.",
            "Optimal permutation routing for low-dimensional hypercubes.",
            "Editorial.",
            "Lagrangean-based decomposition algorithms for multicommodity network design problems with penalized constraints.",
            "Distinguished vertices in probabilistic rooted graphs.",
            "Application of semi definite relaxation and variable neighborhood search for multiuser detection in synchronous CDMA.",
            "A branch-and-cut algorithm for partition coloring.",
            "The regenerator location problem.",
            "Solving a resource allocation problem in wireless mesh networks: A comparison between a CP-based and a classical column generation.",
            "A polyhedral study of the network pricing problem with connected toll arcs.",
            "Computational experience with a SDP-based algorithm for maximum cut with limited unbalance.",
            "The generalized minimum edge-biconnected network problem: Efficient neighborhood structures for variable neighborhood search.",
            "SNDlib 1.0 - Survivable Network Design Library.",
            "Exact and performance-guaranteed multicast algorithms for lifetime optimization in WANETs.",
            "A computational investigation of heuristic algorithms for 2-edge-connectivity augmentation.",
            "Minimal selectors and fault tolerant networks.",
            "Gossiping and routing in undirected triple-loop networks.",
            "Join tree propagation with prioritized messages.",
            "Rainbow trees in graphs and generalized connectivity.",
            "Public congestion network situations and related games.",
            "Solving the Job Sequencing and Tool Switching Problem as a nonlinear least cost Hamiltonian cycle problem.",
            "Bounding the expected number of rectilinear full Steiner trees.",
            "Neighborhood conditions for graphs to be super restricted edge connected.",
            "Complexity of some inverse shortest path lengths problems.",
            "Wavelength assignment in multifiber star networks.",
            "Probabilistic models for the Steiner Tree problem.",
            "Recent results on Arc Routing Problems: An annotated bibliography.",
            "Insertion heuristics for central cycle problems.",
            "On the connectivity of semiregular cages.",
            "Editorial: 2008 Glover-Klingman prize winners.",
            "Simultaneous embeddings of graphs as median and antimedian subgraphs.",
            "Optical index of fault tolerant routings in WDM networks.",
            "The diameter and connectivity of networks with random dependent faults.",
            "Fixed-parameter tractability results for full-degree spanning tree and its dual.",
            "Kernelization and complexity results for connectivity augmentation problems.",
            "On superconnectivity of (4, g)-cages with even girth.",
            "Polynomial time algorithm for constructing vertex-disjoint paths in transposition graphs.",
            "Network flow spanners.",
            "A branch-and-cut-and-price algorithm for vertex-biconnectivity augmentation.",
            "The degree-preserving spanning tree problem in strongly chordal and directed path graphs.",
            "An ejection chain algorithm for the quadratic assignment problem.",
            "Mixed search number and linear-width of interval and split graphs.",
            "A mean-variance model for the minimum cost flow problem with stochastic arc costs.",
            "Exact solutions to the double travelling salesman problem with multiple stacks.",
            "Approximating minimum Steiner point trees in Minkowski planes.",
            "Ranking measures for radially Moore graphs.",
            "A new formulation of the resource-unconstrained project scheduling problem with generalized precedence relations to minimize the completion time.",
            "Independent spanning trees on folded hyper-stars."
        ]
    },
    {
        "name": "Networks",
        "year": "2009",
        "info": "2009: Volumes\n53, 54",
        "count": 66,
        "papers": [
            "Some new large (delta, 3)-graphs.",
            "On the use of guided design search for discovering significant decision variables in the fixed-charge capacitated multicommodity network design problem.",
            "Component evolution in a secure wireless sensor network.",
            "On the L(h, k)-labeling of co-comparability graphs and circular-arc graphs.",
            "New bounds on the minimum number of calls in failure-tolerant gossiping.",
            "The backup 2-center and backup 2-median problems on trees.",
            "Collection depots facility location problems in trees.",
            "The multi-integer set cover and the facility terminal cover problem.",
            "A Hit-and-Run approach for generating scale invariant Small World networks.",
            "Optimal pricing of capacitated networks.",
            "Preface.",
            "Decomposition algorithms for the design of a nonsimultaneous capacitated evacuation tree network.",
            "A novel approach to phylogenetic trees: d-Dimensional geometric Steiner trees.",
            "The minimum evolution problem: Overview and classification.",
            "Mathematical models to reconstruct phylogenetic trees under the minimum evolution criterion.",
            "Models and branch-and-cut algorithms for the Steiner tree problem with revenues, budget and hop constraints.",
            "A linear-time algorithm for broadcast domination in a tree.",
            "A distributed dual ascent algorithm for Steiner problems in multicast routing.",
            "A note on trees, tables, and algorithms.",
            "Lower bounds for strictly fundamental cycle bases in grid graphs.",
            "On irreducible no-hole L(2, 1)-coloring of trees.",
            "Optimum Steiner ratio for gradient-constrained networks connecting three points in 3-space, part I.",
            "The continuous and discrete path-variance problems on trees.",
            "On a capacity scaling algorithm for the constrained maximum flow problem.",
            "Network design for reverse and closed-loop supply chains: An annotated bibliography of models and solution approaches.",
            "Joint vehicle assembly-routing problems: An integrated modeling and optimization approach.",
            "Cost minimization in wireless networks with a bounded and unbounded number of interfaces.",
            "Minimizing SONET Add-Drop Multiplexers in optical UPSR networks using the minimum number of wavelengths.",
            "A linear algorithm for finding the k-broadcast center of a tree.",
            "Matchings in connection with ground delay program planning.",
            "Edge-fault-tolerant pancyclicity of alternating group graphs.",
            "New largest known graphs of diameter 6.",
            "The forwarding indices of wrapped butterfly networks.",
            "Lower bounding techniques for the degree-constrained network design problem.",
            "Approximating the smallest k-edge connected spanning subgraph by LP-rounding.",
            "Simultaneous solution of Lagrangean dual problems interleaved with preprocessing for the weight constrained shortest path problem.",
            "Cost-effective designs of fault-tolerant access networks in communication systems.",
            "Searching symmetric networks with Utilitarian-Postman paths.",
            "Panconnectivity and edge-pancyclicity of k-ary n-cubes.",
            "On the complexity of distributed graph coloring with local minimality constraints.",
            "A note on the k-degree Cayley graph.",
            "Approximability of unsplittable shortest path routing problems.",
            "On the cycle polytope of a directed graph and its relaxations.",
            "A branch-and-cut algorithm for the undirected prize collecting traveling salesman problem.",
            "A eulogy for Frank Boesch.",
            "Liar's domination.",
            "The rainbow connectivity of a graph.",
            "A generalization of an edge-connectivity theorem of Chartrand.",
            "Packing the Steiner trees of a graph.",
            "Sufficient degree conditions for k-edge-connectedness of a graph.",
            "A survey of some network reliability analysis and synthesis results.",
            "On the roots of strongly connected reliability polynomials.",
            "Minimax flow tree problems.",
            "Edge intersection graphs of single bend paths on a grid.",
            "Polyhedral structure of the 4-node network design problem.",
            "Improper coloring of unit disk graphs.",
            "ROUTE 2007: Recent advances in vehicle routing optimization.",
            "A robust branch-cut-and-price algorithm for the heterogeneous fleet vehicle routing problem.",
            "Valid inequalities for the fleet size and mix vehicle routing problem with fixed costs.",
            "A branch-and-price-based large neighborhood search algorithm for the vehicle routing problem with time windows.",
            "Edge assembly-based memetic algorithm for the capacitated vehicle routing problem.",
            "Min-Max K-vehicles windy rural postman problem.",
            "A heuristic two-phase solution approach for the multi-objective dial-a-ride problem.",
            "The balanced billing cycle vehicle routing problem.",
            "A two-stage vehicle routing model for large-scale bioterrorism emergencies.",
            "Fixed routes with backup vehicles for stochastic vehicle routing problems with time constraints."
        ]
    },
    {
        "name": "Networks",
        "year": "2008",
        "info": "2008: Volumes\n51, 52",
        "count": 56,
        "papers": [
            "Foreword.",
            "A Tabu search heuristic for the vehicle routing problem with two-dimensional loading constraints.",
            "Solving the hub location problem in a star-star network.",
            "Models and heuristics for a minimum arborescence problem.",
            "New approaches for solving the block-to-train assignment problem.",
            "A simple method for improving the primal simplex method for the multicommodity flow problem.",
            "Polynomial algorithms for partitioning a tree into single-center subtrees to minimize flat service costs.",
            "Editorial: 2006 Glover-Klingman Prize winners.",
            "Some edge-fault-tolerant properties of the folded hypercube.",
            "The maximum congested cut problem and its robust counterpart: Exact and approximation algorithms for the single and the multicommodity case.",
            "Transversals of subtree hypergraphs and the source location problem in digraphs.",
            "New facets for the planar subgraph polytope.",
            "Cycle-based algorithms for multicommodity network flow problems with separable piecewise convex costs.",
            "A graph theory approach for designing conservation reserve networks with minimal fragmentation.",
            "Erratum: A Tabu search heuristic for the vehicle routing problem with two-dimensional loading constraints.",
            "New dynamic programming algorithms for the resource constrained elementary shortest path problem.",
            "w-Rabin numbers and strong w-Rabin numbers of folded hypercubes.",
            "The computational complexity of graph contractions I: Polynomially solvable and NP-complete cases.",
            "The fractional congestion bound for efficient edge disjoint routing.",
            "Sufficient conditions for a graph to be super restricted edge-connected.",
            "Techniques for analyzing dynamic random graph models of web-like networks: An overview.",
            "On a graph coloring problem arising from discrete tomography.",
            "A Reach and Bound algorithm for acyclic dynamic-programming networks.",
            "Spectral bounds for the maximum cut problem.",
            "A simplex algorithm for minimum-cost network-flow problems in infinite networks.",
            "The computational complexity of graph contractions II: Two tough polynomially solvable cases.",
            "Analysis and computational study of several integer programming formulations for minimum-energy multicasting in wireless ad hoc networks.",
            "The number of spanning trees in a class of double fixed-step loop networks.",
            "On super connectivity of Cartesian product graphs.",
            "Minimum work paths in elevated networks.",
            "Exact algorithms for the master ring problem.",
            "Preface.",
            "Minimizing a stochastic maximum-reliability path.",
            "Reformulation and sampling to solve a stochastic network interdiction problem.",
            "Shortest path network interdiction with asymmetric information.",
            "Price competition with elastic traffic.",
            "Network search games, with arbitrary searcher starting point.",
            "Hide-and-seek games on a tree to which Eulerian networks are attached.",
            "Decontamination of hypercubes by mobile agents.",
            "Editorial: 2007 Glover-Klingman Prize winners.",
            "On the diameter of the generalized undirected de Bruijn graphs UGB(n, m), n2 < m <= n3.",
            "On the hardness of range assignment problems.",
            "Conditional diameter saturated graphs.",
            "Reliability of interconnection networks modeled by Cartesian product digraphs.",
            "Valid cycles: A source of infeasibility in open shortest path first routing.",
            "Approximation bounds for Black Hole Search problems.",
            "A linear programming approach to increasing the weight of all minimum spanning trees.",
            "Competitive algorithms and lower bounds for online randomized call control in cellular networks.",
            "Cyclic sums, network sharing, and restricted edge cuts in graphs with long cycles.",
            "Lagrangian relaxation and enumeration for solving constrained shortest-path problems.",
            "On persistent directed graphs.",
            "Multirate nonblocking multicast Log2(N, m, p) networks.",
            "Linear inequalities among graph invariants: Using GraPHedron to uncover optimal relationships.",
            "Lower bounds for two-period grooming via linear programming duality.",
            "Grooming for two-period optical networks.",
            "F-Chord: Improved uniform routing on Chord."
        ]
    },
    {
        "name": "Networks",
        "year": "2007",
        "info": "2007: Volumes\n49, 50",
        "count": 62,
        "papers": [
            "Preface.",
            "Acceleration of cutting-plane and column generation algorithms: Applications to network design.",
            "Implementing a proximal algorithm for some nonlinear multicommodity flow problems.",
            "A hub covering model for cargo delivery systems.",
            "Network optimization for the design of underground mines.",
            "Survivable IP network design with OSPF routing.",
            "Tailoring neighborhood search for the internet protocol network design problem with reliability and routing constraints.",
            "Multicommodity flow problems with a bounded number of paths: A flow deviation approach.",
            "Multicommodity network design with discrete node costs.",
            "Provisioning virtual private networks under traffic uncertainty.",
            "The two-edge connected hop-constrained network design problem: Valid inequalities and branch-and-cut.",
            "Integer programming formulations for the two 4-hop-constrained paths problem.",
            "Uniformly optimal digraphs for strongly connected reliability.",
            "On super edge-connectivity of Cartesian product graphs.",
            "Maximum independent set for intervals by divide and conquer with pruning.",
            "Approximation algorithm for the group Steiner network problem.",
            "Dilation-free graphs in the l1 metric.",
            "The stochastic time-cost tradeoff problem: A robust optimization approach.",
            "Editorial.",
            "Leonhard Euler: A brief appreciation.",
            "The bridges of Königsberg - A historical perspective.",
            "Approximate L(delta1, delta2, ..., deltat)-coloring of trees and interval graphs.",
            "Vertex disjoint routings of cycles over tori.",
            "The two-median problem on Manhattan meshes.",
            "Sufficient conditions for graphs to be lambda'-optimal and super-lambda'.",
            "Route 2005: Recent advances in vehicle routing optimization.",
            "A branch & cut algorithm for the windy general routing problem and special cases.",
            "Models and branch-and-cut algorithms for pickup and delivery problems with time windows.",
            "Path inequalities for the vehicle routing problem with time windows.",
            "Metaheuristics for the vehicle routing problem with loading constraints.",
            "Competitive analysis for dynamic multiperiod uncapacitated routing problems.",
            "The split delivery vehicle routing problem: Applications, algorithms, test problems, and computational results.",
            "A branch-and-regret heuristic for stochastic and dynamic vehicle routing problems.",
            "Preface.",
            "An extended model and a column generation algorithm for the planar multicommodity flow problem.",
            "Network design arc set with variable upper bounds.",
            "Inapproximability results for the inverse shortest paths problem with integer lengths and unique shortest paths.",
            "Joint optimization of pricing and resource allocation in competitive telecommunications networks.",
            "Hardness of robust network design.",
            "Lower and upper bounds for the degree-constrained minimum spanning tree problem.",
            "Heuristic solutions for general concave minimum cost network flow problems.",
            "Incremental flow.",
            "On the minimum path problem in Knödel graphs.",
            "Locating a cycle in a transportation or a telecommunications network.",
            "Multiperiod network design with incremental routing.",
            "Linear time algorithms for approximating the facility terminal cover problem.",
            "The 1-minimax and 1-maximin problems with demand weights of general probability distributions.",
            "Robust capacity expansion of network flows.",
            "Panpositionable hamiltonicity of the alternating group graphs.",
            "On stochastic programs over trees with partially dependent arc capacities.",
            "Multiterminal resilience for series-parallel networks.",
            "Matching preclusion for some interconnection networks.",
            "The maximum residual flow problem: NP-hardness with two-arc destruction.",
            "Continuum approximation techniques for the design of integrated package distribution systems.",
            "Some results about f-critical graphs.",
            "On tree 3-spanners in directed path graphs.",
            "The vehicle rescheduling problem: Model and algorithms.",
            "A linear-time algorithm for the k-fixed-endpoint path cover problem on cographs.",
            "Large vertex symmetric digraphs.",
            "Majorization and distances in trees.",
            "The one-commodity pickup-and-delivery traveling salesman problem: Inequalities and algorithms.",
            "Approximability of the k-server disconnection problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2006",
        "info": "2006: Volumes\n47, 48",
        "count": 47,
        "papers": [
            "Nearly optimal three dimensional layout of hypercube networks.",
            "Fault tolerant on-board networks with priorities.",
            "The k-degree Cayley graph and its topological properties.",
            "Distributed delay constrained multicast routing algorithm with efficient fault recovery.",
            "Exact methods based on node-routing formulations for undirected arc-routing problems.",
            "Black hole search in common interconnection networks.",
            "Upgrading arcs to minimize the maximum travel time in a network.",
            "The multiroute maximum flow problem revisited.",
            "Fixed tree games with multilocated players.",
            "All (k;g)-cages are edge-superconnected.",
            "Lower bounds for the relative greedy algorithm for approximating Steiner trees.",
            "An integer programming approach to routing in daisy networks.",
            "k-Partition-based facets of the network design problem.",
            "Two new families of large compound graphs.",
            "Approximation algorithms for some k-source shortest paths spanning tree problems.",
            "A column generation approach for SONET ring assignment.",
            "Harmonic broadcasting is bandwidth-optimal assuming constant bit rate.",
            "Approximation algorithms for the k-source multicast tree construction problem.",
            "A bidirected generalization of network matrices.",
            "Variations of the prize-collecting Steiner tree problem.",
            "Obtaining online approximation algorithms for facility dispersion from offline algorithms.",
            "Minimum multiple message broadcast graphs.",
            "Approximation algorithms for channel allocation problems in broadcast networks.",
            "The bi-criteria doubly weighted center-median path problem on a tree.",
            "Further contributions to network optimization.",
            "Route discovery with constant memory in oriented planar geometric networks.",
            "A linear time algorithm for the reverse 1-median problem on a cycle.",
            "The one-commodity pickup and delivery travelling salesman problem on a path or a tree.",
            "A simple algorithm that proves half-integrality of bidirected network programming.",
            "Minimum cost flow-dependent communication networks.",
            "Fault-tolerant routings with minimum optical index.",
            "The approach-dependent, time-dependent, label-constrained shortest path problem.",
            "Flows on few paths: Algorithms and lower bounds.",
            "On extended formulations for the precedence constrained asymmetric traveling salesman problem.",
            "State-space partition techniques for multiterminal flows in stochastic networks.",
            "Editorial: 2005 Glover-Klingman prize winners.",
            "Reliability of interconnection networks modeled by a product of graphs.",
            "Hyper hamiltonian laceability of Cayley graphs generated by transpositions.",
            "Solution methods for the p-median problem: An annotated bibliography.",
            "Algorithms to calculate the distribution of the longest path length of a stochastic activity network with continuous activity durations.",
            "Collective tree exploration.",
            "An improved deniable authentication protocol.",
            "The shortest path problem on large-scale real-road networks.",
            "Solving minimum K-cardinality cut problems in planar graphs.",
            "Extreme point characterizations for infinite network flow problems.",
            "Efficiency and fairness of system-optimal routing with user constraints.",
            "On the spanning w-wide diameter of the star graph."
        ]
    },
    {
        "name": "Networks",
        "year": "2005",
        "info": "2005: Volumes\n45, 46",
        "count": 47,
        "papers": [
            "Solving the undirected minimum cost flow problem with arbitrary costs.",
            "Strict nonblockingness of reduced shuffle-exchange networks.",
            "Parallel scheduling problems in next generation wireless networks.",
            "Adversarial models for priority-based networks.",
            "A network flow algorithm to minimize beam-on time for unconstrained multileaf collimator problems in cancer radiation therapy.",
            "On the minimum number of wavelengths in multicast trees in WDM networks.",
            "Diameter vulnerability of iterated line digraphs in terms of the girth.",
            "Graphs, branchwidth, and tangles! Oh my!",
            "Strong formulations for network design problems with connectivity requirements.",
            "Connectedness of digraphs and graphs under constraints on the conditional diameter.",
            "On the fault-tolerant diameter and wide diameter of omega-connected graphs.",
            "All-port line broadcasting in highly connected graphs.",
            "Balanced paths in acyclic networks: Tractable cases and related approaches.",
            "On restricted connectivities of permutation graphs.",
            "Constructions of sparse asymmetric connectors with number theoretic methods.",
            "A branch-and-price algorithm for the capacitated p-median problem.",
            "The sequential sum problem and performance bounds on the greedy algorithm for the on-line Steiner problem.",
            "The strongly connected reliability of complete digraphs.",
            "Leader election in oriented star graphs.",
            "Exact solution of the centralized network design problem on directed graphs.",
            "A simple protocol for deniable authentication based on ElGamal cryptography.",
            "Efficient neighborhood search for the Probabilistic Pickup and Delivery Travelling Salesman Problem.",
            "Minimizing the cost of placing and sizing wavelength division multiplexing and optical crossconnect equipment in a telecommunications network.",
            "Matchings in 3-vertex-critical graphs: The even case.",
            "Greedy approximation algorithms for directed multicuts.",
            "Minimal feedback vertex sets in directed split-stars.",
            "Optimal broadcasting with universal lists based on competitive analysis.",
            "Lowering eccentricity of a tree by node upgrading.",
            "Design of Survivable Networks: A survey.",
            "Competitive routing in multicast communications.",
            "A hybrid genetic algorithm for the weight setting problem in OSPF/IS-IS routing.",
            "An approximation algorithm for Stackelberg network pricing.",
            "On a routing and scheduling problem concerning multiple edge traversals in graphs.",
            "On large (Delta, 6)-Graphs.",
            "Reliable broadcasting in double loop networks.",
            "Near-shortest and K-shortest simple paths.",
            "Mutually independent hamiltonian paths in star networks.",
            "Minimum path bases and relevant paths.",
            "Fixed-parameter tractability and data reduction for multicut in trees.",
            "Wide diameter and minimum length of disjoint Menger path systems.",
            "Flexibility of Steiner trees in uniform orientation metrics.",
            "Maximal vertex-connectivity of.",
            "Nonblocking conditions of multicast three-stage interconnection networks.",
            "Equivalence of buddy networks with arbitrary number of stages.",
            "Dynamic programming algorithms for the conditional covering problem on path and extended star graphs.",
            "A dynamic programming algorithm for the conditional covering problem on tree graphs.",
            "A branch-and-price approach for the maximum weight independent set problem."
        ]
    },
    {
        "name": "Networks",
        "year": "2004",
        "info": "2004: Volumes\n43, 44",
        "count": 58,
        "papers": [
            "Branch decompositions and minor containment.",
            "Connectivity-splitting models for survivable network design.",
            "Fault-tolerant cycle embedding in hierarchical cubic networks.",
            "Optimization of Internet Protocol network design and routing.",
            "Edge-superconnectivity of cages.",
            "Minimal path broadcast networks.",
            "The generalized minimum spanning tree problem: Polyhedral analysis and branch-and-cut algorithm.",
            "An exact algorithm for the min-cost network containment problem.",
            "On some properties of suboptimal colorings of graphs.",
            "The absolute center of a network.",
            "A randomized algorithm for gossiping in radio networks.",
            "A hybrid multicommodity routing algorithm for traffic engineering.",
            "Bisectored unit disk graphs.",
            "Minimum-cost dynamic flows: The series-parallel case.",
            "Low-connectivity network design on series-parallel graphs.",
            "The Ring Star Problem: Polyhedral analysis and exact algorithm.",
            "The 2-path network problem.",
            "From the editors.",
            "A note on a secure voting system on a public network.",
            "Minimizing beam-on time in cancer radiation treatment using multileaf collimators.",
            "Large-scale local search heuristics for the capacitated vertex p-center problem.",
            "Algorithms for a network design problem with crossing supermodular demands.",
            "Complete binary trees in folded and enhanced cubes.",
            "The maximum-leaf spanning tree problem: Formulations and facets.",
            "A directed cycle-based column-and-cut generation method for capacitated survivable network design.",
            "2003 Glover-Klingman prize winners.",
            "Packing cuts in undirected graphs.",
            "A stochastic integer programming approach to solving a synchronous optical network ring design problem.",
            "Some recent contributions to network optimization.",
            "Solving the asymmetric traveling salesman problem with periodic constraints.",
            "An improved algorithm for the distance constrained p-center location problem with mutual communication on tree networks.",
            "Algorithms for minimum-cost paths in time-dependent networks with waiting policies.",
            "Probabilistic location problems with discrete demand weights.",
            "Foreword.",
            "A local branching heuristic for mixed-integer programs with 2-level variables, with an application to a telecommunication network design problem.",
            "On the impact of the solution representation for the Internet Protocol Network Design Problem with max-hop constraints.",
            "Projecting the flow variables for hub location problems.",
            "Solving the Hub location problem in telecommunication network design: A local search approach.",
            "Grid scheduling by on-line rectangle packing.",
            "Cardinality constrained path covering problems in grid graphs.",
            "A competitive scheduling problem and its relevance to UMTS channel assignment.",
            "Decomposition techniques for the minimum toll revenue problem.",
            "An implicit enumeration scheme for the batch selection problem.",
            "A neighborhood search algorithm for the combined through and fleet assignment model with time windows.",
            "Embedding of cycles and wheels into arbitrary trees.",
            "Trade-offs on the location of the core node in a network.",
            "Optimal grid representations.",
            "The ring grooming problem.",
            "Approximation algorithms for finding low-degree subgraphs.",
            "An exact algorithm for the elementary shortest path problem with resource constraints: Application to some vehicle routing problems.",
            "Bounding vertex coloring by truncated multistage branch and bound.",
            "Minimum k-geodetically connected digraphs.",
            "A 2-path approach for odd-diameter-constrained minimum spanning and Steiner trees.",
            "On d-threshold graphs and d-dimensional bin packing.",
            "The Push Tree problem.",
            "The proof of a conjecture of Bouabdallah and Sotteau.",
            "A network flow approach to cost allocation for rooted trees.",
            "Panconnectivity, fault-tolerant hamiltonicity and hamiltonian-connectivity in alternating group graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "2003",
        "info": "2003: Volumes\n41, 42",
        "count": 47,
        "papers": [
            "Multifacility ordered median problems on networks: A further analysis.",
            "The SONET edge-partition problem.",
            "Upgrading trees under diameter and budget constraints.",
            "Toward faster algorithms for dynamic traffic assignment. I. Parametric quickest-path trees.",
            "Social network coordination and graph routing.",
            "Optimal rectangular partitions.",
            "Report: Some recent developments in network economics.",
            "Towards minimum k-geodetically connected graphs.",
            "Minimizing SONET ADMs in unidirectional WDM rings with grooming ratio 3.",
            "Reserving resilient capacity for a single commodity with upper-bound constraints.",
            "An improved algorithm for the minmax regret median problem on a tree.",
            "A GRASP with path-relinking for private virtual circuit routing.",
            "A polynomial-time algorithm to find shortest paths with recourse.",
            "The single-vehicle routing problem with unrestricted backhauls.",
            "Balanced network flows. VIII. A revised theory of phase-ordered algorithms and the O( log(n2/m)/log n) bound for the nonbipartite cardinality matching problem.",
            "A branch-and-cut algorithm for the single-commodity, uncapacitated, fixed-charge network flow problem.",
            "Network flow models for designing diameter-constrained minimum-spanning and Steiner trees.",
            "Small-worlds: A review of recent books.",
            "Ernesto de Queirós Vieira Martins (1945-2000): An appreciation.",
            "The determination of the path with minimum-cost norm value.",
            "Dynamic shortest paths minimizing travel times and costs.",
            "A bicriterion approach for routing problems in multimedia networks.",
            "Upper bounds for single-source uncapacitated concave minimum-cost network flow problems.",
            "A numerical tool for multiattribute ranking problems.",
            "Trees, slices, and wheels: On the floorplan area minimization problem.",
            "Algorithms for source-to-all maximum cost-to-time ratio problem in acyclic networks.",
            "The spectra of wrapped butterfly digraphs.",
            "A general construction for nonblocking crosstalk-free photonic switching networks.",
            "An exact algorithm for the Traveling Salesman Problem with Deliveries and Collections.",
            "The facility location problem with general cost functions.",
            "Solving the p-Center problem with Tabu Search and Variable Neighborhood Search.",
            "Editorial: Glover-Klingman prize.",
            "Network optimization in supply chain management and financial engineering: An annotated bibliography.",
            "Cycle embedding in faulty wrapped butterfly graphs.",
            "The performance of QoS-aware IP multicast routing protocols.",
            "Some recent contributions to routing and location problems.",
            "An annotated bibliography of network interior point methods.",
            "Broadcasting in generalized chordal rings.",
            "Improved preprocessing, labeling and scaling algorithms for the Weight-Constrained Shortest Path Problem.",
            "Reoptimizing the traveling salesman problem.",
            "A linear algorithm for compact box-drawings of trees.",
            "The linear arrangement problem on recursively constructed graphs.",
            "Locating information with uncertainty in fully interconnected networks: The case of nondistributed memory.",
            "Unilaterally connected large digraphs and generalized cycles.",
            "Fault Hamiltonicity and fault Hamiltonian connectivity of the (n, k)-star graphs.",
            "A polynomial-time approximation scheme for the minimum-connected dominating set in ad hoc wireless networks.",
            "On the power of BFS to determine a graph's diameter."
        ]
    },
    {
        "name": "Networks",
        "year": "2002",
        "info": "2002: Volumes\n39, 40",
        "count": 48,
        "papers": [
            "On the geodetic number of a graph.",
            "Minimax inverse problems of minimum cuts.",
            "The simplex algorithm for multicommodity networks.",
            "A comparative analysis of several formulations for the generalized minimum spanning tree problem.",
            "Balanced network flows. VII. Primal-dual algorithms.",
            "On multiroute maximum flows in networks.",
            "A linear-size zero - one programming model for the minimum spanning tree problem in planar graphs.",
            "Partial line directed hypergraphs.",
            "A simple linear time algorithm for finding a maximum independent set of circular arcs using intervals alone.",
            "Edge-cutsets in the directed hypercube.",
            "Minimum-weight rooted not-necessarily-spanning arborescence problem.",
            "Deterministic radio broadcasting at low cost.",
            "Oriented hypercubes.",
            "Models for the design and analysis of a large package sort facility.",
            "Degree- and time-constrained broadcast networks.",
            "Light graphs with small routing cost.",
            "Worst-case incremental analysis for a class of p-facility location problems.",
            "Efficient algorithms for centers and medians in interval and circular-arc graphs.",
            "Superconnected digraphs and graphs with small conditional diameters.",
            "Exact algorithms for minimum routing cost trees.",
            "Lazy evaluation in penniless propagation over join trees.",
            "Forbidden subpaths for Steiner minimum networks in uniform orientation metrics.",
            "Better approximation ratios for the single-vehicle scheduling problems on line-shaped networks.",
            "Length-constrained path-matchings in graphs.",
            "Dimensioning multicast-enabled communications networks.",
            "Parallel NC-algorithms for multifacility location problems with mutual communication and their applications.",
            "A branch-and-price algorithm for switch-box routing.",
            "A note on the traveling repairman problem.",
            "Approximation algorithms for constructing wavelength routing networks.",
            "Preprocessing Steiner problems from VLSI layout.",
            "Embedding iterated line digraphs in books.",
            "Source location problems considering vertex-connectivity and edge-connectivity simultaneously.",
            "Augmented cubes.",
            "Fast permutation routing in a class of interconnection networks.",
            "Super edge- and point-connectivities of the Cartesian product of regular graphs.",
            "Shortest-path network interdiction.",
            "Minimax problems with bitonic matrices.",
            "Network fair bandwidth share using hash rate estimation.",
            "Node-disjoint paths and related problems on hierarchical cubic networks.",
            "Isomorphisms of the De Bruijn digraph and free-space optical networks.",
            "Increasing the connectivity of the star graphs.",
            "Solving partial constraint satisfaction problems with tree decomposition.",
            "Combinatorial algorithms for inverse network flow problems.",
            "Multistars and directed flow formulations.",
            "Design of fault-tolerant networks for satellites (TWTA redundancy).",
            "Efficient algorithms for finding the (k, l)-core of tree networks.",
            "On the online shortest path problem with limited arc cost dependencies.",
            "The fractional matching numbers of graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "2001",
        "info": "2001: Volumes\n37, 38",
        "count": 46,
        "papers": [
            "The early days of Networks.",
            "An improved approximation scheme for the Group Steiner Problem.",
            "Allocation of partially renewable resources: Concept, capabilities, and applications.",
            "Adaptive least-expected time paths in stochastic, time-varying transportation and data networks.",
            "Cooperative triangulation in MSBNs without revealing subnet structures.",
            "How hard is it to determine if a graph has a 2-role assignment?",
            "A branch and cut method for the degree-constrained minimum spanning tree problem.",
            "Embedding longest fault-free paths in arrangement graphs with faulty vertices.",
            "Improved upper and lower bounds for k-broadcasting.",
            "Scattering number in graphs.",
            "Minimizing drop cost for SONET/WDM networks with wavelength requirements.",
            "Homogeneous sets and domination: A linear time algorithm for distance - hereditary graphs.",
            "On the number of spanning trees in directed circulant graphs.",
            "The capacitated arc routing problem with intermediate facilities.",
            "Multigraph augmentation under biconnectivity and general edge-connectivity requirements.",
            "Minimum spanners of butterfly graphs.",
            "On the construction of combined k-fault-tolerant Hamiltonian graphs.",
            "A new - old algorithm for minimum-cut and maximum-flow in closure graphs.",
            "Balanced network flows. IV. Duality and structure theory.",
            "Balanced network flows. V. Cycle-canceling algorithms.",
            "Balanced network flows. VI. Polyhedral descriptions.",
            "Stability of networks and protocols in the adversarial queueing model for packet routing.",
            "Characterization results of all shortest paths interval routing schemes.",
            "Characterizing the bit permutation networks obtained from the line digraphs of bit permutation networks.",
            "An algorithm for constructing minimal c-broadcast networks.",
            "Electronic voting in a large-scale distributed system.",
            "The ultracenter and central fringe of a graph.",
            "Efficient communication in unknown networks.",
            "Local search with perturbations for the prize-collecting Steiner tree problem in graphs.",
            "On the traveling salesman problem restricted to inputs satisfying a relaxed triangle inequality.",
            "A polynomial algorithm for a constrained traveling salesman problem.",
            "A catalog of Hanan grid problems.",
            "The center function on trees.",
            "Solving the minimum-weighted coloring problem.",
            "Robust location problems with pos/neg weights on a tree.",
            "Universally maximum flow with piecewise-constant capacities.",
            "Worst-case ratios of networks in the rectilinear plane.",
            "File distribution in networks with multimedia storage servers.",
            "Minimum linear gossip graphs and maximal linear (Delta, k)-gossip graphs.",
            "k-Broadcasting in trees.",
            "A network based model of a promotion-sensitive grocery logistics system.",
            "Solving the undirected multicommodity flow problem using a shortest path-based pricing algorithm.",
            "Low-cost minimum-time line-broadcasting schemes in complete binary trees.",
            "Maximizing residual flow under an arc destruction.",
            "Area efficient layouts of the Batcher sorting networks.",
            "The clique partitioning problem: Facets and patching facets."
        ]
    },
    {
        "name": "Networks",
        "year": "2000",
        "info": "2000: Volumes\n35, 36",
        "count": 53,
        "papers": [
            "A hierarchy of hop-indexed models for the Capacitated Minimum Spanning Tree Problem.",
            "The single allocation problem in the interacting three-hub network.",
            "Degree-preserving trees.",
            "Source-limited inclusive routing: A new paradigm for multicast communication.",
            "Hypercomplete: A pancyclic recursive topology for large-scale distributed multicomputer systems.",
            "A general framework for functional networks.",
            "Cluster fault-tolerant routing in star graphs.",
            "A truncated primal-infeasible dual-feasible network interior point method.",
            "Network reliability with node failures.",
            "State space partition algorithms for stochastic systems with applications to minimum spanning trees.",
            "Orienting split-stars and alternating group graphs.",
            "On the performance and feasibility of multicast core selection heuristics.",
            "Optimal fault-tolerant networks with a server.",
            "Cycles in butterfly graphs.",
            "Clustering for faster network simplex pivots.",
            "Robust path choice in networks with failures.",
            "The searchlight guarding problem on weighted split graphs and weighted cographs.",
            "Shortest path routing and fault-tolerant routing on de Bruijn networks.",
            "Dynamic slope scaling and trust interval techniques for solving concave piecewise linear network flow problems.",
            "A branch-and-cut algorithm for solving an intraring synchronous optical network design problem.",
            "Construction schemes for fault-tolerant Hamiltonian graphs.",
            "Wavelength allocation on trees of rings.",
            "Improvement on vertex cover for low-degree graphs.",
            "Minimizing number of wavelengths in multicast routing trees in WDM networks.",
            "A probabilistic local majority polling game on weighted directed graphs with an application to the distributed agreement problem.",
            "Orthogonal (g, f)-factorizations in networks.",
            "Load-balanced routing in counter rotated SONET rings.",
            "Reducing the Steiner problem in four uniform orientations.",
            "The cardinality-constrained shortest path problem in 2-graphs.",
            "A characterization of the two-commodity network design problem.",
            "Constrained length connectivity and survivable networks.",
            "On the cycle polytope of a directed graph.",
            "Minimizing the complexity of an activity network.",
            "New polynomial-time cycle-canceling algorithms for minimum-cost flows.",
            "Realizability of p-point, q-line graphs with prescribed maximum degree and line connectivity or minimum degree.",
            "A polyhedral study of the asymmetric traveling salesman problem with time windows.",
            "Efficient modeling of travel in networks with time-varying link speeds.",
            "Embedding interconnection networks in grids via the layered cross product.",
            "Impact of topographic information on graph exploration efficiency.",
            "The local Steiner problem in normed planes.",
            "Channel assignment and weighted coloring.",
            "Compounding of gossip graphs.",
            "Tabu search for the Steiner problem in graphs.",
            "Minimum-diameter covering problems.",
            "The graph Voronoi diagram with applications.",
            "On the unilateral (Delta, D*)-problem.",
            "Approximating multiroot 3-outconnected subgraphs.",
            "Fault-tolerant routings in chordal ring networks.",
            "Low-congested interval routing schemes for hypercubelike networks.",
            "The full-degree spanning tree problem.",
            "Topological expansion of multiple-ring metropolitan area networks.",
            "Hamiltonian-laceability of star graphs.",
            "An aggregation approach to solving the network p-median problem with link demands."
        ]
    },
    {
        "name": "Networks",
        "year": "1999",
        "info": "1999: Volumes\n33, 34",
        "count": 60,
        "papers": [
            "Balanced network flows. I. A unifying framework for design and analysis of matching algorithms.",
            "Balanced network flows. II. Simple augmentation algorithms.",
            "Balanced network flows. III. Strongly polynomial augmentation algorithms.",
            "Minimum-cost strong network orientation problems: Classification, complexity, and algorithms.",
            "Small congestion embedding of graphs into hypercubes.",
            "Multicriteria network location problems with sum objectives.",
            "Dynamic multi-sector, multi-instrument financial networks with futures: Modeling and computation.",
            "A dual-ascent procedure for the file allocation and join site selection problem on a telecommunications network.",
            "Rectilinear full Steiner tree generation.",
            "A polynomial time algorithm for rectilinear Steiner trees with terminals constrained to curves.",
            "Super edge connectivity properties of connected edge symmetric graphs.",
            "On diameter of permutation graphs.",
            "Transmissions in a network with capacities and delays.",
            "Pseudo-Gilbert-Steiner trees.",
            "All-to-all communication for some wavelength-routed all-optical networks.",
            "A note on the bottleneck graph partition problem.",
            "An expert system for coherent assessment of probabilities in multigraph models.",
            "The probabilistic longest path problem.",
            "Congestion-free, dilation-2 embedding of complete binary trees into star graphs.",
            "Various results on the toughness of graphs.",
            "Multidimensional assortment problem with an application.",
            "Upper and lower bounds for the average-case complexity of path-search.",
            "Characterizing bit permutation networks.",
            "Extended generalized shuffle networks: Ssufficient conditions for strictly nonblocking operation.",
            "Strictly nonblocking conference networks using high-dimensional meshes.",
            "Deferred-query: An efficient approach for some problems on interval graphs.",
            "On the memory overhead of distributed snapshots.",
            "Path problems in networks with vector-valued edge weights.",
            "Lower bounds for linear interval routing.",
            "Deadlock-free interval routing schemes.",
            "Optimal edge coloring of large graphs.",
            "An optimal algorithm for layered wheel floorplan designs.",
            "A competitive analysis for retransmission timeout.",
            "Optimal tree 3-spanners in directed path graphs.",
            "An efficient implementation of an algorithm for finding K shortest simple paths.",
            "Analysis of LP relaxations for multiway and multicut problems.",
            "Eccentric graphs.",
            "Optimum requirement spanning trees and reliability of tree networks.",
            "On a condition for obtaining an explicit solution of optimum requirement spanning tree.",
            "Greedy online algorithms for routing permanent virtual circuits.",
            "New large graphs with given degree and diameter six.",
            "A tabu search heuristic for the Steiner Tree Problem.",
            "On crossings, the Crossing Postman Problem, and the Rural Postman Problem.",
            "The pilot method: A strategy for heuristic repetition with application to the Steiner problem in graphs.",
            "Tenacity of complete graph products and grids.",
            "On the superconnectivity and the conditional diameter of graphs and digraphs.",
            "Optimal adaptive fault diagnosis for simple multiprocessor systems.",
            "Crossing properties of multiterminal cuts.",
            "Modeling K-coteries by well-covered graphs.",
            "Heuristic and exact algorithms for scheduling aircraft landings.",
            "A survey of sequences of central subgraphs.",
            "Locations on time-varying networks.",
            "On Steiner centers and Steiner medians of graphs.",
            "Balance vertices in trees.",
            "The subtree center of a tree.",
            "Properties of edge-deleted distance stable graphs.",
            "A unified approach to network location problems.",
            "Eulerian location problems.",
            "Center, median, and centroid subgraphs.",
            "Generalized eccentricity, radius, and diameter in graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "1998",
        "info": "1998: Volumes\n31, 32",
        "count": 51,
        "papers": [
            "Recognizing triangle-free graphs with induced path-cycle double covers is NP-complete.",
            "A strong lower bound for the Node Weighted Steiner Tree Problem.",
            "On capacitated stochastic chain problems in a network.",
            "Tough enough chordal graphs are Hamiltonian.",
            "A branch and cut algorithm for the Steiner problem in graphs.",
            "Reliability analysis of circulant graphs.",
            "Fast collective communication by packets in the postal model.",
            "Location problems with grouped structure of demand: Complexity and algorithms.",
            "Minmax-regret robust 1-median location on a tree.",
            "Topological properties and algorithms for two-level hypernet networks.",
            "Process network synthesis: Problem definition.",
            "Tools for studying paths and cycles in digraphs.",
            "Flow-dependent networks: Existence and behavior at Steiner points.",
            "Edge connectivity between nodes and node-subsets.",
            "Feasibility in transportation networks with supply eating arcs.",
            "A linear-time algorithm for connected r-domination and Steiner tree on distance-hereditary graphs.",
            "Verification of DAG structures in cooperative belief network-based multiagent systems.",
            "A dynamic programming algorithm for the shortest path problem with time windows and linear node costs.",
            "The critical-item, upper bounds, and a branch-and-bound algorithm for the tree knapsack problem.",
            "Uniformly optimally reliable graphs.",
            "A new proximal decomposition algorithm for routing in telecommunication networks.",
            "Undirected graphs rearrangeable by 2-length walks.",
            "Solving the all-pair shortest path query problem on interval and circular-arc graphs.",
            "The time-dependent shortest pair of disjoint paths problem: Complexity, models, and algorithms.",
            "A branch-and-cut algorithm for solving generalized multiperiod Steiner problems in graphs.",
            "Approximating Steiner trees in graphs with restricted weights.",
            "Hub network games.",
            "Diameter-preserving orientations of the torus.",
            "On the chromatic number of disk graphs.",
            "Topological properties of incomplete WK-recursive networks.",
            "Compressing cube-connected cycles and butterfly networks.",
            "An extended planar algorithm for maximum integral two-flow.",
            "Routing in asymmetrical multiconnection three-stage Clos networks.",
            "Proportional lot sizing and scheduling: Some extensions.",
            "Partial characterizations of networks supporting shortest path interval labeling schemes.",
            "Max-min partitioning of grid graphs into connected components.",
            "Embedding into the rectilinear grid.",
            "On shortest two-connected Steiner networks with Euclidean distance.",
            "On the relationship between dynamic Nash and instantaneous user equilibria.",
            "Sense of direction: Definitions, properties, and classes.",
            "Fault-tolerant graphs for tori.",
            "How to test a tree.",
            "Paired-domination in graphs.",
            "Solving Steiner tree problems in graphs to optimality.",
            "Scheduling in broadcast networks.",
            "A polynomial algorithm for the p-centdian problem on a tree.",
            "A branch-and-cut algorithm for the undirected selective traveling salesman problem.",
            "Constructions of large planar networks with given degree and diameter.",
            "Project scheduling with multiple modes: A comparison of exact algorithms.",
            "On optimal orientations of Cartesian products of even cycles.",
            "On container length and connectivity in unidirectional hypercubes."
        ]
    },
    {
        "name": "Networks",
        "year": "1997",
        "info": "1997: Volumes\n29, 30",
        "count": 53,
        "papers": [
            "Multiple message broadcasting in the postal model.",
            "Optimal packet fragmentation and routing in computer networks.",
            "Tracking the P-NP boundary for well-covered graphs.",
            "Counting small cycles in generalized de Bruijn digraphs.",
            "A lower bound for interval routing in general networks.",
            "A branch-and-cut algorithm for the resource-constrained minimum-weight arborescence problem.",
            "On the bisection width of the transposition network.",
            "Balanced graphs and network flows.",
            "A secure voting system on a public network.",
            "Efficient path and vertex exchange in steiner tree algorithms.",
            "The tree center problems and the relationship with the bottleneck knapsack problems.",
            "A note on Bertsekas' small-label-first strategy.",
            "Algorithms for computing message delay for wireless networks.",
            "Dual algorithms for the shortest path tree problem.",
            "Minimum bandwidth problem for embedding graphs in cycles.",
            "Time-varying shortest path problems with constraints.",
            "Minimum-weight cycles in 3-separable graphs.",
            "A tabu search algorithm for the Capacitated Shortest Spanning Tree Problem.",
            "A GRASP for graph planarization.",
            "Edge coloring a k-tree into two smaller trees.",
            "Reliability analysis of replicated and-or graphs.",
            "Restricted delivery problems on a network.",
            "An infinite class of reach-preservable graphs.",
            "Layered cross product - A technique to construct interconnection networks.",
            "A computationally efficient method for nonlinear multicommodity network flow problems.",
            "Constructing a bipartite graph of maximum connectivity with prescribed degrees.",
            "On optimal orientations of Cartesian products of even cycles and paths.",
            "State space partitioning methods for stochastic shortest path problems.",
            "Maximizing spanning trees in almost complete graphs.",
            "Locating replicas of a database on a network.",
            "Linear time algorithms for computing the most reliable source on an unreliable tree network.",
            "On the asymptotic behavior of the maximum number of spanning trees in circulant graphs.",
            "Commodity family extended formulations of uncapacitated fixed charge network flow problems.",
            "Introduction to graph theory.",
            "Optimality of consecutive and nested tree partitions.",
            "Exact reliabilities of most reliable double-loop networks.",
            "A note on genetic algorithms for degree-constrained spanning tree problems.",
            "Maximizing spanning trees in almost complete graphs.",
            "A tabu search heuristic for periodic and multi-depot vehicle routing problems.",
            "r-domination problems on homogeneously orderable graphs.",
            "The node multiterminal cut polyhedron.",
            "Euclidean Steiner minimum trees: An improved exact algorithm.",
            "The vertex-face total chromatic number of Halin graphs.",
            "The assignment problem with external interactions.",
            "Mean eccentricities of de Bruijn networks.",
            "De Bruijn and Kautz bus networks.",
            "On the Rabin number problem.",
            "The structure of max lambda-min m+1 graphs used in the design of reliable networks.",
            "A characterization of 3-Steiner distance hereditary graphs.",
            "Graphs with given connectivity properties.",
            "The polytope of block diagonal matrices and complete bipartite partitionings.",
            "Link-disjoint embedding of complete binary trees in meshes.",
            "(K, j)-domination and (K, j)-reliability."
        ]
    },
    {
        "name": "Networks",
        "year": "1996",
        "info": "1996: Volumes\n27, 28",
        "count": 47,
        "papers": [
            "Embedding grids into grids: Techniques for large compression ratios.",
            "Node fault tolerance in graphs.",
            "A feedback strategy for periodic network flows.",
            "A comparative study of doubly connected directed topologies for LANs and MANs.",
            "Components and graph automorphisms of standard 2 x 2-switch banyan networks.",
            "A modified Melzak procedure for computing node-weighted Steiner trees.",
            "Package routing in transportation networks with fixed vehicle schedules.",
            "An optimal algorithm for the mixed Chinese postman problem.",
            "Network synthesis with few edges.",
            "Disconnecting sets in single and two-terminal-pair networks.",
            "Uniformly least reliable graphs.",
            "Stochastic shortest path problems with recourse.",
            "Transmitting on various network topologies.",
            "Circuit-switched row-column broadcasting in torus and mesh networks.",
            "A linear time algorithm to recognize circular permutation graphs.",
            "Complexity of spanning tree problems with leaf-dependent objectives.",
            "Broadcasting with universal lists.",
            "Star-factors and k-bounded total domination.",
            "Optimally edge fault-tolerant trees.",
            "A simple O(n2) algorithm for the all-pairs shortest path problem on an interval graph.",
            "A single facility location problem on a tree with unreliable edges.",
            "Minimum gossip bus networks.",
            "An addendum to the most vital edges of matching in a bipartite graph.",
            "A response to Volgenant's Addendum on the most vital edges.",
            "Minimum covering criterion for obnoxious facility location on a network.",
            "2-diameter of de Bruijn graphs.",
            "Maximum independent sets of circular-arc graphs: Simplified algorithm and proofs.",
            "Routing algorithms for switching networks with probabilistic traffic.",
            "A new method for efficient symbolic propagation in discrete Bayesian networks.",
            "Minimal rankings.",
            "Topological network design of state-dependent queueing networks.",
            "Divide-and-conquer algorithms for graph-layout problems.",
            "Minimizing message complexity of partially replicated data on hypercubes.",
            "On the connectivity and the conditional diameter of graphs and digraphs.",
            "Network decomposition of general financial equilibria with transaction costs.",
            "Solving the dynamic facility location problem.",
            "Vulnerability of scheduled networks and a generalization of Menger's Theorem.",
            "Cyclic gossiping times for some classes of graphs.",
            "Fault-tolerant broadcasting and gossiping in communication networks.",
            "MLH: A hierarchical hypercube network.",
            "On the location of a tree-shaped facility.",
            "Optimal routings in communication networks with linearly bounded forwarding index.",
            "On eccentric vertices in graphs.",
            "An approximation scheme for some Steiner tree problems in the plane.",
            "Routing in quasi torus networks.",
            "Magic labeling in graphs: Bounds, complexity, and an application to a variant of TSP.",
            "The bottleneck graph partition problem."
        ]
    },
    {
        "name": "Networks",
        "year": "1995",
        "info": "1995: Volumes\n25, 26",
        "count": 45,
        "papers": [
            "Sequences of graphical invariants.",
            "Edge-tenacious networks.",
            "Multicommodity flows in simple multistage networks.",
            "Lower bounds for the length of test sequences using UIOs.",
            "Vertex domination-critical graphs.",
            "Sales-delivery man problems on treelike networks.",
            "Simple heuristics for unit disk graphs.",
            "Thirty-five-point rectilinear steiner minimal trees in a day.",
            "A capacity scaling algorithm for the constrained maximum flow problem.",
            "Preface.",
            "Threshold reliability of networks with small failure sets.",
            "Monte Carlo and Markov Chain techniques for network reliability and sampling.",
            "On reliability evaluation of a capacitated-flow network in terms of minimal pathsets.",
            "A forbidden minor characterization and reliability of a class of partial 4-trees.",
            "A survey of efficient reliability computation using disjoint products approach.",
            "Consecutive cuts and paths, and bounds on k-terminal reliability.",
            "On truncated-newton methods for solving the spatial price equilibrium problem.",
            "Recognizing small subgraphs.",
            "Graphs with not too many spanning trees.",
            "The prize collecting traveling salesman problem: II. Polyhedral results.",
            "An adaptive discretization algorithm for a class of continuous network programs.",
            "Repeated uncoordinated information dissemination by flooding.",
            "An improved heuristic for the period vehicle routing problem.",
            "Network upgrading problems.",
            "An exponential-function reduction method for block-angular convex programs.",
            "Projected dynamical systems modeling and computation of spatial network equilibria.",
            "The helical cube network.",
            "Feedback vertex set on cocomparability graphs.",
            "The symmetric generalized traveling salesman polytope.",
            "Antepenultimate broadcasting.",
            "Bipartite regular graphs with fixed diameter.",
            "Hamilton cycles and paths in butterfly graphs.",
            "An approach to a problem in network design using genetic algorithms.",
            "The intractability of the reliable assignment problem in split networks.",
            "Computing near-optimal solutions to the steiner problem in a graph using a genetic algorithm.",
            "Reductions for the rectilinear steiner tree problem.",
            "Restricted simplicial decomposition with side constraints.",
            "Reliability analysis of tree-based networks and its application to fault-tolerant VLSI systems.",
            "On the generalized minimum spanning tree problem.",
            "The pickup delivery location problem on networks.",
            "Multiple message broadcasting in communication networks.",
            "The shortest path with at most / nodes in each of the series/parallel clusters.",
            "An O(N2) heuristic for steiner minimal trees in E3.",
            "Encoding shortest paths in spatial networks.",
            "Computing the 2-median on tree networks in O(n lg n) time."
        ]
    },
    {
        "name": "Networks",
        "year": "1994",
        "info": "1994: Volume 24",
        "count": 52,
        "papers": [
            "Locating an obnoxious facility on a euclidean network to minimize neighborhood damage.",
            "Weighted k-cardinality trees: Complexity and polyhedral structure.",
            "A new characterization of tree medians with applications to distributed sorting.",
            "Improving the location of minimax facilities through network modification.",
            "Use of continuous approximations within discrete algorithms for routing vehicles: Experimental results and interpretation.",
            "A fast algorithm for bounded generalized processing networks.",
            "An efficient graph planarization two-phase heuristic.",
            "Forwarding indices of consistent routings and their complexity.",
            "Universal minimal total dominating functions in graphs.",
            "Sharper analysis of packet routing on a butterfly.",
            "Minimal-distance routing for KYKLOS II.",
            "Edge-maximal triangulated subgraphs and heuristics for the maximum clique problem.",
            "Operations management: Strategy and analysis, by Lee J. Krajewski and L. P. Ritzman, Addison-Wesley, Reading, MA, 1987, 916 pp., Price: $43.95.",
            "Computer models for management science, 3rd ed., by Warren Erikson and Owen Hall, Addison-Wesley, Reading, MA, 1989, 263 pp.",
            "Queueing networks with blocking, edited by H. G. Perros and T. Altiok, North-Holland, Amsterdam, 1989, 358 pp.",
            "Discrete location theory, edited by P. B. Mirchandani and R. L. Francis, John Wiley & Sons, New York, 1990, 555 pp.",
            "Graphical models in applied multivariate statistics, by J. Whittaker, John Wiley & Sons, New York, 1990, 448 pp. Price: $59.95.",
            "Foundations of applied combinatorics, by Edward A. Bender and S. Gil Williamson, Addison-Wesley, Reading, MA, 1991, 425 pp.",
            "Communications networks: A first course, by Jean Walrand, Irwin Inc. and Aksen Associates, Homewood, IL, 1991, 460 pp. Price: $52.95.",
            "The art of computer systems performance analysis, by R. Jain, John Wiley & Sons. New York, 1991, 685 pp.",
            "Gradient estimation via perturbation analysis, by Paul Glasserman, Kluwer, Boston. MA, 1991, 221 pp.",
            "Numerical linear algebra and optimization-volume 1, by Philip E. Gill. Walter Murray, and Margaret H. Wright, Addison-Wesley, Redwood City, CA, 1991, 448 pp. Price: $46.25.",
            "The stable marriage problem: Structure and algorithms, by Dan Gusfield and Robert Irving, The MIT Press, Cambridge, MA, 1989, 240 pp., $27.50.",
            "Local bipartite turán graphs and graph partitioning.",
            "Probabilistic analysis of an enhanced partitioning algorithm for the steiner tree problem in Rd.",
            "Stochastic programs over trees with random arc capacities.",
            "Mengerian properties, hamiltonicity, and claw-free graphs.",
            "A separation decomposition for orders.",
            "A degree sequence problem related to network design.",
            "Measures of vulnerability-the integrity family.",
            "A delaunay triangulation-based heuristic for the euclidean steiner problem.",
            "On super i-connected graphs.",
            "Spanners in graphs of bounded degree.",
            "On reliability of graphs with node failures.",
            "Note: The diameter of edge domination critical graphs.",
            "Note: Small integral flows need only sparse networks.",
            "A bad submatrix is easy to find.",
            "Computation of the forwarding index via flows: A note.",
            "A proof of Boesch's conjecture.",
            "Ripples, complements, and substitutes in singly constrained monotropic parametric network flow problems.",
            "Maximum likelihood genetic sequence reconstruction from oligo content.",
            "Topological properties, communication, and computation on WK-recursive networks.",
            "Applications of matching and edge-coloring algorithms to routing in clos networks.",
            "Compressing grids into small hypercubes.",
            "New results for the degree/diameter problem.",
            "A network recourse decomposition method for dynamic networks with random arc capacities.",
            "Personnel shift assignment: Existence conditions and network models.",
            "Efficient algorithms for minimum range cut problems.",
            "Experimental evaluation of a partitioning algorithm for the steiner tree problem in R2 and R3.",
            "Reliable distributed diagnosis for multiprocessor systems with random faults.",
            "An exact lower bound on the number of cut-sets in multigraphs.",
            "An algorithm for generating minimum cost network flow problems with specific structure and known optimal solutions."
        ]
    },
    {
        "name": "Networks",
        "year": "1993",
        "info": "1993: Volume 23",
        "count": 68,
        "papers": [
            "Network transformations and bounding network reliability.",
            "A catalog of steiner tree formulations.",
            "Efficient parallel algorithms for bipartite permutation graphs.",
            "Canceling most helpful total cuts for minimum cost network flow.",
            "A two-stage network with dual partial concentrators.",
            "Doubly chordal graphs, steiner trees, and connected domination.",
            "Local broadcasting in a tree under minisum criterion.",
            "The traveling salesman problem with cumulative costs.",
            "Graph endpoint coloring and distributed processing.",
            "Sharp bounds on the order, size, and stability number of graphs.",
            "Shortest paths, single origin-destination network design, and associated polyhedra.",
            "Grid spanners.",
            "Edge fault tolerance in graphs.",
            "A polynomial time solvable concave network flow problem.",
            "On the star - delta transformation in network reliability.",
            "Decomposition of bipartite graphs under degree constraints.",
            "Bounds for the general capacitated routing problem.",
            "Shortest paths in stochastic networks with ARC lengths having discrete distributions.",
            "On uniformly optimally reliable graphs for pair-connected reliability with vertex failures.",
            "Linear-time algorithms for the 2-connected steiner subgraph problem on special classes of graphs.",
            "An upper bound on the number of cliques in a graph.",
            "Introduction.",
            "Fundamental algorithms for the star and pancake interconnection networks with applications to computational geometry.",
            "On the adjacency properties of paley graphs.",
            "Uniform d-emulations of rings, with an application to distributed virtual ring construction.",
            "On the edge forwarding index problem for small graphs.",
            "Undirected loop networks.",
            "μ-star: An indirect star network.",
            "Fault - tolerant hypercube broadcasting via information dispersal.",
            "The minimum order of a cayley graph with given degree and diameter.",
            "Renormalization of two - terminal reliability.",
            "A unidirectional ring partition problem.",
            "The most vital edges of matching in a bipartite graph.",
            "A new class of interconnection networks based on the alternating group.",
            "Optimization of the reliability polynomial in presence of mediocre elements.",
            "Some minimum gossip graphs.",
            "Additive graph spanners.",
            "Fast fault-tolerant parallel communication for de bruijn and digit-exchange networks using information dispersal.",
            "Communication structures in fault-tolerant distributed systems.",
            "Routing permutations on a graph.",
            "Construction of large-size interconnection networks with high performance.",
            "Reliability evaluation and decision problems in extra stage shuffle-exchange MINs.",
            "Asymmetrical multiconnection three-stage clos networks.",
            "Off-line permutation routing on circuit-switched fixed-routing networks.",
            "A very short proof of a conjecture concerning set-to-set broadcasting.",
            "Most reliable double loop networks in survival reliability.",
            "Maintaining bipartite matchings in the presence of failures.",
            "Applications of E-graphs in network design.",
            "A new method for constructing minimal broadcast networks.",
            "A Bayesian analysis of simulation algorithms for inference in belief networks.",
            "Optimal multifacility defensive location on planes with rectilinear distances.",
            "A branch and bound algorithm for the capacitated minimum spanning tree problem.",
            "Finding all minimum-size separating vertex sets in a graph.",
            "On locating path- or tree-shaped facilities on networks.",
            "A differential game model of Nash equilibrium on a congested traffic network.",
            "Finding minimum cost to time ratio cycles with small integral transit times.",
            "Bounding procedures for multistage stochastic dynamic networks.",
            "Determining efficient facility locations on a tree network operating as a FIFO M/G/1 queue.",
            "Sensitivity analysis in stochastic flow networks using the Monte Carlo method.",
            "Backordering in a multiperiod transshipment network.",
            "A two-commodity flow formulation for the traveling salesman and the makespan problems with time windows.",
            "Cycle prefix digraphs for symmetric interconnection networks.",
            "Some graph-theoretical models for scheduling in automated production systems.",
            "Parallel iterative search methods for vehicle routing problems.",
            "On stochastic spanning tree problem.",
            "The dynamic predicate stashing copy problem.",
            "Optimal communication in networks with randomly distributed byzantine faults.",
            "A simple and fast label correcting algorithm for shortest paths."
        ]
    },
    {
        "name": "Networks",
        "year": "1992",
        "info": "1992: Volume 22",
        "count": 42,
        "papers": [
            "The steiner problem in the hypercube.",
            "An optimal algorithm to solve the all-pair shortest path problem on interval graphs.",
            "Distance-constrained multifacility minimax location problems on tree networks.",
            "Steiner tree problems.",
            "The n-line traveling salesman problem.",
            "On the optimal strongly connected orientations of city street graphs. III. Three east-west avenues or north-south streets.",
            "Financial flow of funds networks.",
            "Optimal routing and process scheduling for a mobile service facility.",
            "A routing algorithm for virtual circuit data networks with multiple sessions per O - D pair.",
            "A reliability-improving graph transformation with applications to network reliability.",
            "The generalized P-forest problem on a tree network.",
            "Location of facilities on a network subject to a single-edge failure.",
            "Complexity results for well-covered graphs.",
            "Special cases of traveling salesman and repairman problems with time windows.",
            "On a parametric shortest path problem from primal - dual multicommodity network optimization.",
            "The optimal partitioning of networks.",
            "Sequential information dissemination by packets.",
            "Degenerate Gilbert - Steiner trees.",
            "Paths through a maze of rectangles.",
            "Algorithms for K-terminal reliability problems with node failures.",
            "Two algorithms for the subset interconnection design problem.",
            "Cell suppression: Disclosure protection for sensitive tabular data.",
            "The swapping problem.",
            "On a leverage problem in the hypercube.",
            "Reliable communication in networks with Byzantine link failures.",
            "Finding all minimum-cost perfect matchings in Bipartite graphs.",
            "Tighter time bounds on fault-tolerant broadcasting and gossiping.",
            "Reliabilities of chordal rings.",
            "A pseudopolynomial network flow formulation for exact knapsack separation.",
            "On a tree-shaped facility location problem of Minieka.",
            "An explicit construction of Euler circuits in shuffle nets and related networks.",
            "Degree-five Steiner points cannot reduce network costs for planar sets.",
            "Parallel contractions of grids for task assignment to processor networks.",
            "Scheduling file transfers in fully connected networks.",
            "Shortest path problems with node failures.",
            "Series-parallel subgraphs of planar graphs.",
            "Networks communicating for each pairing of terminals.",
            "A message-routing strategy for multicomputer systems.",
            "Counting k-component forests of a graph.",
            "Finding disjoint paths with different path-costs: Complexity and algorithms.",
            "The Capacitated Arc Routing Problem: Lower bounds.",
            "Level graphs and approximate shortest path algorithms."
        ]
    },
    {
        "name": "Networks",
        "year": "1991",
        "info": "1991: Volume 21",
        "count": 44,
        "papers": [
            "Minimal diameter double-loop networks: Dense optimal families.",
            "Centroids to centers in trees.",
            "Efficient algorithms for inferring evolutionary trees.",
            "Shortest path algorithms using dynamic breadth-first search.",
            "On the multiway cut polyhedron.",
            "Consistency and satisfiability of waveform timing specifications.",
            "A network equilibrium formulation of market disequilibrium and variational inequalities.",
            "Unbalanced, capacitated p-median problems on a chain graph with a continuum of link demands.",
            "Maximum matchings in bipartite graphs via strong spanning trees.",
            "On the existence of uniformly optimally reliable networks.",
            "Polynomial time algorithms on circular-arc overlap graphs.",
            "Faster parametric shortest path and minimum-balance algorithms.",
            "Parametric analysis of optimal facility locations.",
            "Conditional graph connectivity relative to hereditary properties.",
            "Euclidean shortest path in the presence of obstacles.",
            "The generalized folding-cube network.",
            "Minimum weight paths in time-dependent networks.",
            "Resilience of partial k-tree networks with edge and node failures.",
            "Reliability covering problems.",
            "On the nonexistence of uniformly optimal graphs for pair-connected reliability.",
            "Simulation methodology for statisticians, operations analysts and engineers, Vol. I, by P. A. W. Lewis and E. J. Orav, Wadsworth, Belmont, CA, 1989, 416 pp.",
            "Stochastic modeling and the theory of queues, by R. W. WOE, Rentice Hall, Engle- wood Cliffs, NJ, 1989, 556 pp.",
            "Fault-tolerant extensions of star networks.",
            "Minimal diameter double-loop networks. I. Large infinite optimal families.",
            "Uniformly-most reliable networks do not always exist.",
            "A compilation of relations between graph invariants - supplement I.",
            "Maximum independent number for series-parallel networks.",
            "Computational development of a lagrangian dual approach for quadratic networks.",
            "Average properties of two-dimensional partial orders.",
            "Efficient algorithms for generalized cut-trees.",
            "On dependence and reliability computations.",
            "A two-commodity sharing problem on networks.",
            "Solution properties of oligopolistic network equilibria.",
            "Computing rooted communication reliability in an almost acyclic digraph.",
            "The cut cone, L1 embeddability, complexity, and multicommodity flows.",
            "Solving multistage stochastic networks: An application of scenario aggregation.",
            "Maximum flows in probabilistic networks.",
            "Balanced spanning forests and trees.",
            "Approximate solutions of capacitated fixed-charge minimum cost network flow problems.",
            "A primal-dual algorithm for the minimum average weighted length circuit problem.",
            "Sensitivity analysis of 0-1 multiterminal network flows.",
            "A multiphase approach to the period routing problem.",
            "Minimum flows in (s, t) planar networks.",
            "Characterizing stochastic flow networks using the monte carlo method."
        ]
    },
    {
        "name": "Networks",
        "year": "1990",
        "info": "1990: Volume 20",
        "count": 49,
        "papers": [
            "Exact and heuristic algorithms for the weighted feedback arc set problem: A special case of the skew-symmetric quadratic assignment problem.",
            "A network model for the rotating workforce scheduling problem.",
            "An algorithmic note on the gallai-milgram theorem.",
            "An airline tail routing algorithm for periodic schedules.",
            "Approximation algorithms for covering a graph by vertex-disjoint paths of maximum total weight.",
            "Directed network reliability: Domination and computing coefficients of the success-marginal expansion.",
            "Anti-stalling pivot rules for the network simplex algorithm.",
            "Interconnecting networks in the plane: The steiner case.",
            "Faster exact algorithms for steiner trees in planar networks.",
            "The stochastic multicommodity flow problem.",
            "Efficient algorithms for finding maximum cliques of an overlap graph.",
            "A combinatorial problem related to distributed loop networks.",
            "A class of bounded approximation algorithms for graph partitioning.",
            "Location of an obnoxious facility on a network: A voting approach.",
            "On cost allocation in communication networks.",
            "Computing the probability distribution of project duration in a PERT network.",
            "The probabilistic minimum spanning tree problem.",
            "Combining monte carlo estimates and bounds for network reliability.",
            "A characterization of partial 3-trees.",
            "Fair dissections of spiders, worms, and caterpillars.",
            "An application of lagrangean decomposition to the resource-constrained minimum weighted arborescence problem.",
            "Disjoint (s, t)-cuts in a network.",
            "A heuristic algorithm for a network problem with variable upper bounds.",
            "Optimal location of a path or tree on a network with cycles.",
            "Relaxation methods for the strictly convex multicommodity flow problem with capacity constraints on individual commodities.",
            "A graph-theoretic approach to investigate structural and qualitative properties of systems: A survey.",
            "Algorithms for special cases of rectilinear steiner trees: I. Points on the boundary of a rectilinear rectangle.",
            "Introduction.",
            "Independence properties of directed markov fields.",
            "Identifying independence in bayesian networks.",
            "An ordered examination of influence diagrams.",
            "Medical diagnosis using influence diagrams.",
            "Sequential updating of conditional probabilities on directed graphical structures.",
            "Probabilistic similarity networks.",
            "An algebra of bayesian belief universes for knowledge-based systems.",
            "A randomized approximation algorithm for probabilistic inference on bayesian belief networks.",
            "Graphical inference in qualitative probabilistic networks.",
            "Matching problems with generalized upper bound side constraints.",
            "On the construction of optimally reliable graphs.",
            "Hierarchical solution of network flow problems.",
            "Time-dependent traveling salesman problem-the deliveryman case.",
            "A lower bound for the steiner tree problem in directed graphs.",
            "Worst-case greedy matchings in the unit d-cube.",
            "Theory of linear and integer programming, by Alexander Schrijver, Wiley, New York, 1986, 471 pp. Price $71.95.",
            "Optimal locations and districts of two traveling salesmen on a tree.",
            "The search game on a network with immobile hider.",
            "The network simplex method on a multiprocessor.",
            "Predicting deadlock in store-and-forward networks.",
            "Efficient algorithms for computing the reliability of permutation and interval graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "1989",
        "info": "1989: Volume 19",
        "count": 56,
        "papers": [
            "An SST-based algorithm for the steiner problem in graphs.",
            "Some properties of 2-threshold graphs.",
            "Minimum order graphs with specified diameter, connectivity, and regularity.",
            "Transitively reduced and transitively closed event networks.",
            "Extremal connectivity and vulnerability in graphs.",
            "Optimal enclosing regions in planar graphs.",
            "Implementing an \"exact\" Newton method for separable convex transportation problems.",
            "Paths, chains, and antipaths.",
            "Solving nonlinear multiple-facility network location problems.",
            "Domination theory and the crapo β-invariant.",
            "The minimum augmentation of any graph to a K-edge-connected graph.",
            "Linear programming and network modesl, by S. K. Gupta, affiliated East-West Press Pvt. Ltd. New Delhi, 1985, 230 pp.",
            "A composite algorithm for a concave-cost network flow problem.",
            "Triconnected decomposition for computing K-terminal network reliability.",
            "On the optimal strongly connected orientations of city street graphs. II: Two east-west avenues or North - South Streets.",
            "Connected reorientations of mixed multigraphs.",
            "On graphs with polynomially solvable maximum-weight clique problem.",
            "A tree-network has the fixed point property.",
            "A functional equation for finding the largest expected capacity of a graph.",
            "Growth and Development, Ecosystems Phenomenology by Robert E. Ulanowicz, springer-Verlag, New York, 1986, 178 pp.",
            "On optimal cycle bases of graphs for mesh analysis of networks.",
            "Exact cuts in networks.",
            "Analysis of a flow problem with fixed charges.",
            "Networks synthesis and optimum network design problems: Models, solution methods and applications.",
            "How to find a battleship.",
            "The maximum independent set problem for cubic planar graphs.",
            "An algorithm for the resource constrained shortest path problem.",
            "A continuous-time network simplex algorithm.",
            "Designing satellite communication networks by zero - one quadratic programming.",
            "On mean distance in certain classes of graphs.",
            "A new algorithm for general matching problems using network flow subproblems.",
            "Statistical procedures for estimating branch flows and total network flow.",
            "Edge-vulnerability and mean distance.",
            "Message complexity versus space complexity in fault tolerant broadcast protocols.",
            "Multiplicative improvements in network reliability bounds.",
            "A branch and bound algorithm for the multiple depot vehicle scheduling problem.",
            "Reduction tests for the steiner problem in grapsh.",
            "Balancing large social accounting matrices with nonlinear network programming.",
            "A solvable routing problem.",
            "The continuous p-median of a network.",
            "The path set polytope of an acyclic, directed graph with an application to machine sequencing.",
            "The traveling salesman problem, edited by E. L. Lawler, J. K. Lenstra, A.H.G. Rinnooy Kan, and D.B. Shmoys, John Wiley & sons, chichester, 1985, 463 pp.",
            "Operations research: Applications and algorithms, by Wayne L. Winston, duxbury Press, Boston, 1987, 1025 pages.",
            "The prize collecting traveling salesman problem.",
            "Tracing the characteristic curve of a quadratic black box.",
            "On the separation number of a graph.",
            "On the edge-connectivity vector of a graph.",
            "On the construction of minimal broadcast networks.",
            "A comparison of phase and nonphase network flow algorithms.",
            "Designing optimal fault-tolerant star networks.",
            "A location model for a facility operating as an M/G/k queue.",
            "A set-partitioning-based exact algorithm for the vehicle routing problem.",
            "A general dynamic spatial price network equilibrium model with gains and losses.",
            "On designing a network to defend against random attacks of radius two.",
            "Probabilistic analysis of an lp relaxation bound for the steiner problem in networks.",
            "Time bounds on fault-tolerant broadcasting."
        ]
    },
    {
        "name": "Networks",
        "year": "1988",
        "info": "1988: Volume 18",
        "count": 29,
        "papers": [
            "Bounding all-terminal reliability in computer networks.",
            "Probabilistic analysis of the longest hamiltonian tour problem.",
            "Minimum augmentation of a tree to a K-edge-connected graph.",
            "Generalized de Bruijn digraphs.",
            "The minimax multistop location problem on a tree.",
            "On a property of cyclic covers of p-graphs.",
            "Convexity and the Steiner tree problem.",
            "On a function for the vulnerability of a directed flow network.",
            "A single-server priority queueing-location model.",
            "A network flow algorithm to find an elementary I/O matching.",
            "Minimal spanning trees in undirected networks with exponentially distributed arc weights.",
            "Generalizations of broadcasting and gossiping.",
            "Computational complexity of PERT problems.",
            "On graphs with signed inverses.",
            "The tolerance approach to sensitivity analysis in network linear programming.",
            "Vertex domination-critical graphs.",
            "New lower bounds for the Capacitated Arc Routing Problem.",
            "Stochastic shortest paths with recourse.",
            "Planarity testing of doubly periodic infinite graphs.",
            "Data transfers in networks with transceivers.",
            "The traveling salesman problem, edited by E.L. Lawler, J.K. Lenstra, A.H.G. Rinnooy Kan, and D.B Shmoys, John Wiley & Sons, Chichester, 1985, 463 pp.",
            "Operations research: Applications and algorithms, by Wayne L. Winston, Duxbury press, Boston, 1987, 1025 pages.",
            "Linked local area networks, second edition by Alan J. Mayne, Wiley, 1986, 628 pp., price: $44.95.",
            "Combinatorics for computer science, by S. gill williamson, computer science press, Rockville, MD. 1985, 479 pp. price: $39.95.",
            "Efficient storage of nonadaptive routing tables.",
            "Computing equilibria on large multicommodity networks: An application of truncated quadratic programming algorithms.",
            "Polymatroidal flow network models with multiple sinks.",
            "Minimum-delay routing in continuous-time dynamic networks with Piecewise-constant capacities.",
            "A survey of gossiping and broadcasting in communication networks."
        ]
    },
    {
        "name": "Networks",
        "year": "1987",
        "info": "1987: Volume 17",
        "count": 28,
        "papers": [
            "The node-weighted steiner tree problem.",
            "Graph folding and programmable logic array.",
            "Linear arboricity of digraphs.",
            "Domination and location in acyclic graphs.",
            "Problem reduction methods and a tree generation algorithm for the steiner network problem.",
            "Investing in arcs in a network to maximize the expected max flow.",
            "Forbidden subgraphs and graph decomposition.",
            "New lower planes for the network design problem.",
            "Steiner problem in networks: A survey.",
            "A monte carlo sampling plan for estimating reliability parameters and related functions.",
            "Minimal deadlock-free store-and-forward communication networks.",
            "On the properties of directed switching networks.",
            "Node partition formula for directed graph reliability.",
            "Neighbor-connected graphs and projective planes.",
            "A quasi-assignment algorithm for bus scheduling.",
            "On some matching problems arising in vehicle scheduling models.",
            "Postman tour on a graph with precedence relation on arcs.",
            "Digraphs with maximum number of paths and cycles.",
            "A linear time algorithm to check for the existence of a rectangular dual of a planar triangulated graph.",
            "An efficient implementation of the \"partan\" variant of the linear approximation method for the network equilibrium problem.",
            "Computing k-shortest path lengths in euclidean networks.",
            "Some generalizations of the steiner problem in graphs.",
            "An algorithmic framework for the matching problem in some hypergraphs.",
            "The complexity of minimum cut and maximum flow problems in an acyclic network.",
            "Data transfers in networks with transceivers.",
            "Accelerated branch exchange heuristics for symmetric traveling salesman problems.",
            "Linear placement algorithms and applications to VLSI design.",
            "Algorithms for maximum k-colorings and k-coverings of transitive graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "1986",
        "info": "1986: Volume 16",
        "count": 37,
        "papers": [
            "Solving large-scale matching problems efficiently: A new primal matching approach.",
            "Integer flows in network with fuzzy capacity constraints.",
            "An exact algorithm for the asymmetrical capacitated vehicle routing problem.",
            "On a conjecture of trietsch and handler on the flow-dependent steiner ratio.",
            "Incorporating dependent node damage in deterministic connectivity analysis and synthesis of networks.",
            "The average height of the d-th highest leaf of a planted plane tree.",
            "Shout echo selection in distributed files.",
            "The structure of distances in networks.",
            "Graph theory, by W. T. Tutte, Encyclopedia of Mathematics and its Applications, Volume 21, Addison-Wesley Publishing Company, Menlo Park, CA., 1984, 333 pp. Price: 45.00.",
            "Configuration of physical distribution networks.",
            "Iterative algorithms for generating minimal cutsets in directed graphs.",
            "Implementation of algorithms for K shortest loopless paths.",
            "On the worst-case performance of some heuristics for the vehicle routing and scheduling problem with time window constraints.",
            "Underlying properties of oriented graphs.",
            "The minimum augmentation of a directed tree to a k-edge-connected directed graph.",
            "Optimally reliable graphs for both edge and vertex failures.",
            "Network decomposition for the optimization of connection structures.",
            "Introductory combinatorics, by K. P. Bogart, Pitman, Boston, 1983, 388 pp. Price: $26.95.",
            "Minisum location of a traveling salesman.",
            "Shortest paths in networks with exponentially distributed arc lengths.",
            "On the number of active nodes in a multicomputer system.",
            "On finding steiner vertices.",
            "Solving stochastic programs with network recourse.",
            "First-and second-order bounds on terminal reliability.",
            "The minimum dummy task problem.",
            "An approximation algorithm for the maximum independent set problem in cubic planar graphs.",
            "Efficient points on a network.",
            "Improving reliability bounds in computer networks.",
            "Reliable broadcast protocols in unreliable networks.",
            "A random network model of message transmission.",
            "An algorithm for reliability analysis of planar graphs.",
            "On multiple steiner subgraph problems.",
            "Decision making, models and algorithms: A first course, by Saul I. Gass, John Wiley & Sons, New York, 1985, 412 pp.",
            "Or on the micro, by David Whitaker, John Wiley and Sons, New York, 1984, 197 pp. Price $19.95.",
            "Network flows and monotropic optimization, by R. T. Rockafellar, John Wiley & Sons, New York, 616 pp. Price $44.95.",
            "Optimization models for planning and allocation: Text and cases in mathematical programming, by Roy D. Shapiro, John Wiley & Sons, New York, 1984, 650 pp. Price $40.95.",
            "Discrete computational structures, second edition, By Robert R. Korfhage, Academic Press, Inc., Orlando, FI, 1984, 360 pp. Price $35.00."
        ]
    },
    {
        "name": "Networks",
        "year": "1985",
        "info": "1985: Volume 15",
        "count": 40,
        "papers": [
            "Lagrangian relaxation for the star-star concentrator location problem: Approximation algorithm and bounds.",
            "Properties of the k-centra in a tree network.",
            "The most reliable series-parallel networks.",
            "A routing procedure for an IC module with many pins - a solution to a circular permutation layout problem.",
            "On digraphs with a rooted tree structure.",
            "A minimum concave-cost dynamic network flow problem with an application to lot-sizing.",
            "A compilation of relations between graph invariants.",
            "Steiner trees, connected domination and strongly chordal graphs.",
            "On the multiplication of divisions: The use of graphs for sports scheduling.",
            "Data structures and algorithms, by A. Aho, J. Hopcroft, and J. Ullman, Addison-Wesley, Reading, Mass., 1983, 427 pp. Price: $28.85.",
            "Constrained optimization and Lagrange multiplier methods, by D. P. Bertsekas, Academic Press, New York, 1982, 395 pp. Price: $65.00.",
            "Methods of the allocation of limited resources, by K. M. Mjelde, John Wiley and Sons, Chichester, 1983, 88 pp. Price: $24.95.",
            "Introduction to dynamic programming, by Leon Cooper and Mary W. Cooper, Pergamon Press, Elmsford, NY, 1981, 289 pp. Price: $19.50 softcover, $32.50 hardcover.",
            "Rectangular duals of planar graphs.",
            "Fault-tolerant broadcast graphs.",
            "A factoring algorithm using polygon-to-chain reductions for computing K-terminal network reliability.",
            "The continuous m-center problem on a network.",
            "Minimum cuts, modular functions, and matroid polyhedra.",
            "An efficiently solvable case of the minimum weight equivalent subgraph problem.",
            "The search value of a network.",
            "Network reliability analysis using 2-connected digraph reductions.",
            "Combinatorial optimization problems in the analysis and design of probabilistic networks.",
            "Linear programming, by Katta G. Murty, John Wiley & Sons, New York, 1983, 482 pp.",
            "Locating a facility on a congested network with random lengths.",
            "On the relationship between Nash - Cournot and Wardrop equilibria.",
            "The optimal location of a path or tree in a tree network.",
            "An algorithm for the steiner problem in the euclidean plane.",
            "Probabilistic analysis of a network design problem heuristic.",
            "The Gilbert and Pollak conjecture - a generalization.",
            "Algorithms for finding P-centers on a weighted tree (for relatively small P).",
            "Nonlinear programming: Theory, algorithms, and applications by G. P. McCormick, Wiley, New York, 1983, 444 pp. Price: $48.50.",
            "Linear programming, by Vasek Chvatal, W. H. Freeman and Company, New York, 1983, 478 pp., Price: $24.95.",
            "Block-vertex duality and the one-median problem.",
            "Probabilistic partitioning algorithms for the rectilinear steiner problem.",
            "Reducing complexities of the distributed max-flow and breadth-first-search algorithms by means of network synchronization.",
            "Optimal consecutive-2 systems of lines and cycles.",
            "Component-level redundancy is better than system-level redundancy for channel graphs.",
            "A heuristic circulation-network approach to solve the multi-traveling salesman problem.",
            "On node constraint networks.",
            "Strongly connected orientations of mixed multigraphs."
        ]
    },
    {
        "name": "Networks",
        "year": "1984",
        "info": "1984: Volume 14",
        "count": 44,
        "papers": [
            "On the np-completeness of certain network testing problems.",
            "Computational study of an improved shortest path algorithm.",
            "On the computational complexity of the minimum-dummy-activities problem in a pert network.",
            "Graphs with the smallest number of minimum cut sets.",
            "An algorithm for construction of a k-connected graph with minimum number of edges and quasiminimal diameter.",
            "A special spatial equilibrium problem.",
            "On-line connectivity algorithms.",
            "Algorithms for finding paths with multiple constraints.",
            "a generalized network flow model with application to power supply-demand problems.",
            "Vulnerability of communication networks.",
            "An algorithm for the steiner problem in graphs.",
            "Two exact algorithms for the distance-constrained vehicle routing problem.",
            "Reviews in graph theory, edited by William G. Brown, American Mathematical Society, 1980. Volumes I, II, III, IV (paperback).",
            "Dynamic programming: Models and applications, by Eric V. Denardo, Prentice-Hall, Englewood Cliffs, NJ, 1932, 227 pp. Price: $26.95.",
            "Bond graphs for modeling engineering systems, by A. J. Blundell, Halstead, Ellis Horwood Limited, London, 1982, 151 pp. Price: $44.95.",
            "Mathematical aspects of scheduling and applications, by R. Bellman, A. O. Esogbue, and I. Nabeshima, Pergamon, London, 1982, 329 pp. Price: $19.50.",
            "Introduction to mathematical programming: Quantitative tools for decision-making, by Benjamin Lev and Howard J. Weiss, North-Holland, New York, 1982, 287 pp. Price: $39.50.",
            "On minimal-node-cost planar embeddings.",
            "Synthesis of directed multicommodity flow networks.",
            "On multicommodity flows in planar graphs.",
            "The period routing problem.",
            "Shortest-path methods: Complexity, interrelations and new propositions.",
            "Sorting algorithms for the implementation of a generalized vector product.",
            "Shortest-path algorithms: Taxonomy and annotation.",
            "A quick method for finding shortest pairs of disjoint paths.",
            "An extremal problem on the connectivity of graphs.",
            "On computing the connectivities of graphs and digraphs.",
            "Independent sets in random sparse graphs.",
            "Updating routing tables after resource failure in a distributed computer network.",
            "Euclidean shortest paths in the presence of rectilinear barriers.",
            "The amount of overtaking in a network of queues.",
            "Linearized simplicial decomposition methods for computing traffic equilibria on networks.",
            "Bounds on expected performance of networks with links subject to failure.",
            "Optimal dynamic routing in communication networks with continuous traffic.",
            "Network reliability and acyclic orientations.",
            "The even-path problem for graphs and digraphs.",
            "Lagrangian dual coordinatewise maximization algorithm for network transportation problems with quadratic costs.",
            "Heuristics for finding a maximum number of disjoint bounded paths.",
            "Routing with time windows by column generation.",
            "Note on independence of arcs in antiparallel for network flow problems.",
            "Hierarchical vehicle routing problems.",
            "On the practical importance of asymptotic optimality in certain heuristic algorithms.",
            "Graph theory and applications, by H. Neville V. Temperley, Halsted Press, New York, 1981, 130 pp. Price: $44.95.",
            "Network optimization practice: A Computational Guide, by D. K. Smith, John Wiley, New York, 1982, 237 pp. Price: $59.95."
        ]
    },
    {
        "name": "Networks",
        "year": "1983",
        "info": "1983: Volume 13",
        "count": 52,
        "papers": [
            "Preselective strategies for the optimization of stochastic project networks under resource constraints.",
            "Algorithmic approaches to preselective strategies for stochastic scheduling problems.",
            "Probabilistic analysis of divide-and-conquer heuristics for minimum weighted euclidean matching.",
            "Heuristics for planar minimum-weight perfect metchings.",
            "Activity selection games and the minimum-cut problem.",
            "Network reliability and the factoring theorem.",
            "A procedure for dispatching moving mobile servers.",
            "Ranking the vertices of a weighted digraph using the length of forward arcs.",
            "Reversibility and stochastic networks, by Frank P. Kelly, Wiley, New York, 1979, 230 pp. Price: $50.95.",
            "Computer networks and distributed processing, by James Martin, Prentice-Hall, Englewood Cliffs, NJ, 1981, 562 pp. Price: $34.00.",
            "Introduction to queueing theory, 2nd ed., by Robert B. Cooper, Elsevier North Holland, New York, 1981, 347 pp. Price: $24.95.",
            "Traffic flows on transportation networks, by G. F. Newell, MIT Press, 1980, 276 pp. Price: $30.00.",
            "Steiner trees, partial 2-trees, and minimum IFI networks.",
            "Constructing a minimal-cost spanning tree subject to resource constraints and flow requirements.",
            "A note on Arc tolerances in sparse shortest-path and network flow problems.",
            "A network decomposition/aggregation procedure for a class of multicommodity transportation problems.",
            "Construction of centered shortest-path trees in networks.",
            "Radial location theory.",
            "A recursive algorithm for directed-graph reliability.",
            "An algorithm for finding a large independent set in planar graphs.",
            "Calculating bounds on reachability and connectedness in stochastic networks.",
            "Centralized teleprocessing network design.",
            "Shortest chain subject to side constraints.",
            "Capacity expansion - analysis of simple models with applications, by John Freidenfels, North Holland, 1981, 291 pp. Price: $39.50.",
            "Algorithmic graph theory and perfect graphs, by Martin C. Golumbic, Academic, New York, 284 pp. Price: $34.00.",
            "Communication control in computer networks, by Josef Puzman and Radoslav Porizek, Wiley, New York, 1980, 296 pp. Price: $39.50.",
            "Computer networks, by Andrew S. Tanenbaum, Prentice-Hall, Englewood Cliffs, New Jersey, 1981, 517 pp. Price: $28.00.",
            "Advanced linear programming: Computation and practice, by Bruce A. Murtagh, McGraw-Hill, New York, 1981, 202 pp. Price: $39.50.",
            "Sequencing and scheduling-an introduction to the mathematics of the job-shop, by Simon French, Wiley, 1982, 245 pp. Price: $49.95.",
            "Matrix-geometric solutions in stochastic models: An algorithmic approach, by Marcel R. Neuts, The Johns Hopkins University Press, Baltimore, 1981, 352 pp. Price: $32.50.",
            "Computational algorithms for closed queueing networks, by Steven C. Bruell and Gianfranco Balbo, North Holland, 1980, 190 pp. Price: $22.95.",
            "Computer systems performance modeling, by Charles H. Sauer and K. Mani Chandy, Prentice-Hall, 1981, 352pp. Price: $18.95.",
            "Linear programming, by Ronald I. Rothenberg, Elsevier North Holland, New York, 1979, 359pp. Price: $24.95.",
            "Optimal I-Intersection assignments for graphs: A linear programming approach.",
            "I-Colorings, I-Phasings, and I-Intersection assignments for graphs, and their applications.",
            "Conditional connectivity.",
            "Anticenters and antimedians of a network.",
            "Circuit partitioning with size and connection constraints.",
            "An algorithm for constructing edge-trees from hypergraphs.",
            "Routing past unions of disjoint linear barriers.",
            "Finding a manhattan path and related problems.",
            "Lower planes for the network design problem.",
            "A Newton method for convex separable network flow problems.",
            "Stochastic bottleneck spanning tree problem.",
            "Linear and Combinatorial Optimization in Ordered Algebraic Structures, by U. Zimmermann, North-Holland, Amsterdam, 1981, 380 pp. Price: $61.00.",
            "Preface.",
            "Reductions to 1-matching polyhedra.",
            "A survey of heuristics for the weighted matching problem.",
            "The perfectly matchable subgraph polytope of a bipartite graph.",
            "An analysis of alternative strategies for implementing matching algorithms.",
            "Dynamic matchings and quasidynamic fractional matchings. I.",
            "Dynamic matchings and quasidynamic fractional matchings. II."
        ]
    },
    {
        "name": "Networks",
        "year": "1982",
        "info": "1982: Volume 12",
        "count": 42,
        "papers": [
            "Minimum cost flow with set-constraints.",
            "On the worst-case performance of some algorithms for the asymmetric traveling salesman problem.",
            "Counting formulas for tree growth plans.",
            "The general multimodal network equilibrium problem with elastic demand.",
            "Locating mobile servers on a network with markovian properties.",
            "Algorithms for Network Programming, by J. L. Kennington and R. V. Helgason, Wiley, New York, 1980, 291 pp. Price: $25.00.",
            "Finding a minimum equivalent graph of a digraph.",
            "Aggregation and disaggregation in convex network problems.",
            "On reliability in stochastic graphs.",
            "Generalizations of planar graphs.",
            "A network flow solution to some nonlinear 0-1 programming problems, with applications to graph theory.",
            "A decomposition algorithm for locating a shortest path between two nodes in a network.",
            "Minimum width 2-layer layout of a multichanneled system.",
            "An algorithm for the equilibrium assignment problem with random link times.",
            "Decentralized maximum-flow protocols.",
            "An optimal 2-FT realization of binary symmetric hierarchical tree systems.",
            "Maximum flow in networks with a small number of random arc capacities.",
            "Modular decomposition and reliability computation in stochastic transportation networks having cutnodes.",
            "The complexity of finding maximum disjoint paths with length constraints.",
            "Double-row planar routing and permutation layout.",
            "On balance in group graphs.",
            "An algorithm for the steiner problem in graphs.",
            "The generalized diameter of a graph.",
            "Realizability of p-point, q-line graphs with prescribed point connectivity, line connectivity, or minimum degree.",
            "Network flow programming, by P. A. Jensen and J. W. Barnes, John Wiley and Sons, Inc., New York, 1980, 408 pp. Price: $28.95.",
            "Optimization: Theory and applications, by S . S . Rao, Wiley Eastern Limited, New Delhi, 1979, 711 pp. Price: $21.95.",
            "Topological design of centralized computer networks - formulations and algorithms.",
            "A 1-matching blossom-type algorithm for edge covering problems.",
            "Networks immune to isolated line failures.",
            "On a measure of communication network vulnerability.",
            "An efficient algorithm for K shortest simple paths.",
            "Circular permutation graphs.",
            "Polynomial algorithms for estimating network reliability.",
            "A matroid related to finitely chainlike, countably infinite networks.",
            "Efficient algorithms for interval graphs and circular-arc graphs.",
            "A property regarding degenerate pivots for linear assignment networks.",
            "An advanced dual incremental network algorithm.",
            "Determining minimal cuts with a minimal number of arcs.",
            "Communications network analysis, by Howard Cravis, Lexington Books, Lexington, MA, 1981, 144pp. Price not given.",
            "Optimality in nonlinear programming: A feasible directions approach, by A. Ben-Israel, A. Ben-Td, and S. Zlobec, Wiley, New York, 1981, 144 pp. Price: $21.95.",
            "Applied combinatorics, by Alan Tucker, Wiley, New York, 1980, 385 pp. Price: $23.95.",
            "Practical methods of optimization volume 1 : Unconstrained optimization, by R. Flet-cher, Wiley, New York, 1980, 120 pp. Price: $24.50."
        ]
    },
    {
        "name": "Networks",
        "year": "1981",
        "info": "1981: Volume 11",
        "count": 40,
        "papers": [
            "A comparison of three algorithms for finding fundamental cycles in a directed graph.",
            "On testing isomorphism of permutation graphs.",
            "An O(n log n) heuristic for steiner minimal tree problems on the euclidean metric.",
            "Sensitivity analysis of optimal matchings.",
            "Graphs as models of communication network vulnerability: Connectivity and persistence.",
            "The cohesiveness of a point of a graph.",
            "Covering and packing in graphs IV: Linear arboricity.",
            "A more compact formulation of the symmetric multiple traveling salesman problem with fixed charges.",
            "The complexity of designing a network with minimum diameter.",
            "Mean flow scheduling and optimal construction of a treelike communication network.",
            "Editorial.",
            "Preface.",
            "Classification in vehicle routing and scheduling.",
            "A generalized assignment heuristic for vehicle routing.",
            "Set partitioning based heuristics for interactive routing.",
            "State-space relaxation procedures for the computation of bounds to routing problems.",
            "Exact solution of crew scheduling problems using the set partitioning model: Recent successful applications.",
            "Combinatorial optimization and vehicle fleet planning: Perspectives and prospects.",
            "The design and analysis of heuristics.",
            "Complexity of vehicle routing and scheduling problems.",
            "Formulation and structure of more complex/realistic routing and scheduling problems.",
            "The k-nucleus of a graph.",
            "Generalizations of Hoffman's existence theorem for circulations.",
            "Networks immune to isolated failures.",
            "Finding maximum cliques in circle graphs.",
            "A new concept of primeness in graphs.",
            "Finding minimum rectilinear distance paths in the presence of barriers.",
            "Capacitated arc routing problems.",
            "A note on the problem of updating shortest paths.",
            "Operations Research Support Methodology, Albert G. Holzman, Ed., Marcel Dekker, New York, 1979, 648 pp. Price $39.75.",
            "Series-parallel reduction for difficult measures of network reliability.",
            "A new approach to near-optimal path assignment through electric-circuit modeling.",
            "A polynomial time algorithm for finding the absolute center of a network.",
            "Combinatorial properties of directed graphs useful in computing network reliability.",
            "A dual simplex algorithm for finding all shortest paths.",
            "A shortest augmenting path method for solving minimal perfect matching problems.",
            "On the elimination of negative cost arcs in flow problems.",
            "Mazes: Search games on unknown networks.",
            "A note on finding shortest path trees.",
            "Some theoretical results in multiple path definition in networks."
        ]
    },
    {
        "name": "Networks",
        "year": "1980",
        "info": "1980: Volume 10",
        "count": 29,
        "papers": [
            "Network methods in models of production.",
            "The cyclic method of solving the transshipment problem with an additional linear constraint.",
            "A cut-flow procedure for transportation network optimization.",
            "Maximal expected flow in a network subject to arc failures.",
            "Minimum-time line broadcast networks.",
            "A theorem concerning cyclic directed graphs with applications to network reliability.",
            "Four-terminus flows.",
            "Maximum degree in graphs of diameter 2.",
            "The k best spanning arborescences of a network.",
            "A probabilistic model for the analysis of the routing process for circuits.",
            "Realization of a symmetric terminal capacity matrix by a tree with the minimum diameter.",
            "An algorithm to solve the m × n assignment problem in expected time O(mn log n).",
            "Complexity of network reliability computations.",
            "An integer linear programming approach to the steiner problem in graphs.",
            "Some comments on permutation layout.",
            "Efficient special case algorithms for the n-line planar traveling salesman problem.",
            "An algorithm for the traffic assignment problem.",
            "Total domination in graphs.",
            "Optimal clustering structures for hierarchical topological design of large computer networks.",
            "An algorithm for finding a short closed spanning walk in a graph.",
            "Conditional centers and medians of a graph.",
            "Monotone sequences of graphical invariants.",
            "Arc tolerances in shortest path and network flow problems.",
            "A dual algorithm for the constrained shortest path problem.",
            "A recursive algorithm for finding reliability measures related to the connection of nodes in a graph.",
            "Localizing 2-medians on probabilistic and deterministic tree networks.",
            "Investment in stochastic minimum cost generalized multicommodity networks with application to coal transport.",
            "A cut approach to a class of quadratic integer programming problems.",
            "Location on networks: Theory and algorithms, Gabriel Handler and Pitu Mirchandani, MIT Press, Cambridge, 1979, 233 pp. Price: $20.00."
        ]
    },
    {
        "name": "Networks",
        "year": "1979",
        "info": "1979: Volume 9",
        "count": 21,
        "papers": [
            "An assignment routing problem.",
            "The largest minimal rectilinear steiner trees for a set of n points enclosed in a rectangle with given perimeter.",
            "Exact and approximate algorithms for optimal network design.",
            "Deferral strategies for a dynamic communications network.",
            "Topics in Combinatorial Optimization. Edited By S. Rinaldi, Springer-Verlag New York, New York, 1975, $15.20, 186 Pages.",
            "Optimization Algorithms for Networks and Graphs. By Edward Minieka, Marcel Dekker, Inc. New York, New York, 1978, $19.75, 356 Pages.",
            "Adjacent extreme flows and application to min concave cost flow problems.",
            "On cycle bases of a graph.",
            "A generalized dynamic flows problem.",
            "Generalized transportation networks with stochastic demands: An operator theoretic approach.",
            "Linear and combinatorial programming. By Katta G. Murty, John Wiley &Sons, Inc., New York, N.Y. 1976, $21.00, 567 pages.",
            "Complexity of the minimum-dummy-activities problem in a pert network.",
            "On algorithms for finding the k shortest paths in a network.",
            "A computational analysis of alternative algorithms and labeling techniques for finding shortest path trees.",
            "A boolean theory of network flows and metrics and its applications to particle transmission and clustering.",
            "On the construction of balanced switching networks.",
            "A note on finding optimum branchings.",
            "Minimal broadcast networks.",
            "Minimizing maximum flows in linear graphs.",
            "The greedy travelling salesman's problem.",
            "A stochastic petri net with applications to modelling occupancy times for concurrent task systems."
        ]
    },
    {
        "name": "Networks",
        "year": "1978",
        "info": "1978: Volume 8",
        "count": 25,
        "papers": [
            "Editorial.",
            "Editorial.",
            "Cost allocation for steiner trees.",
            "Color-feasible sequences of a multigraph.",
            "Optimal flows in nonlinear gain networks.",
            "Multicommodity network flows - A survey.",
            "Unicyclic realizability of a degree list.",
            "A mean-time comparison of algorithms for the all-pairs shortest-path problem with arbitrary arc lengths.",
            "Network topology and integral multicommodity flow problems.",
            "A recognition algorithm for the total graphs.",
            "A generalized measure of independence and the strong product of graphs.",
            "On the numerical evaluation of some basic traffic formulae.",
            "A note on bisecting minimum spanning trees.",
            "Systematic searches for hypohamiltonian graphs.",
            "A good algorithm for smallest spanning trees with a degree constraint.",
            "Generalized ramsey theory for graphs VII: Ramsey numbers for multigraphs and networks.",
            "The complexity of the capacitated tree problem.",
            "A decomposition algorithm for network reliability analysis.",
            "Permutation layout.",
            "The complexity of the network design problem.",
            "Link designs and probability analyses for a class of connecting networks.",
            "Shortest paths with euclidean distances: An explanatory model.",
            "Primal simplex network codes: State-of-the-art implementation technology.",
            "A new shortest path updating algorithm.",
            "Graphs as mathematical models by Gary Chartrand, Prindle, Weber & Schmidt, Inc. Boston, Massachusetts 1977, $15.50, 294 pages."
        ]
    },
    {
        "name": "Networks",
        "year": "1977",
        "info": "1977: Volume 7",
        "count": 25,
        "papers": [
            "A generalized upper bounding approach to a communications network planning problem.",
            "Finding optimum branchings.",
            "Rectilinear steiner trees: Efficient special-case algorithms.",
            "A primal algorithm for solving a capacitated network flow problem with additional linear constraints.",
            "A note on the primal-dual and out-of-kilter algorithms for network optimization problems.",
            "An improvement of Orloff's general routing problem.",
            "The mythical man-month. By Frederick P. Brooks, Jr. Addison-Wesley Publishing Company Reading, Massachusetts 1975, $6.50, 195 pages.",
            "Transformations for simplifying network reliability calculations.",
            "Implementing vehicle routing algorithms.",
            "Deterministic network optimization: A bibliography.",
            "A problem on blocking probabilities in connecting networks.",
            "Measures of the restrictiveness of project networks.",
            "A statistical approach to the tsp.",
            "A fast algorithm for reliability calculations in sparse networks.",
            "Towards a theory of domination in graphs.",
            "On kernels in strongly connected graphs.",
            "Graph substitution and set packing polytopes.",
            "Queueing Systems, Volume 2: Computer applications. by Leonard Kleinrock John Wiley & Sons, Inc., New York 1976, 549 Pages, $24.95.",
            "Probabilistic methods in combinatorics. By Paul Erdös and Joel Spencer Academic Press, Inc., New York 1974, 106 Pages, $11.75.",
            "Tree decomposition algorithm for large networks.",
            "A product form representation of the inverse of a multicommodity cycle matrix.",
            "A shortest path algorithm for grid graphs.",
            "Minimal ratio spanning trees.",
            "Unimodular matrices of flow problems with additional constraints.",
            "Bounding distributions for a stochastic pert network."
        ]
    },
    {
        "name": "Networks",
        "year": "1976",
        "info": "1976: Volume 6",
        "count": 23,
        "papers": [
            "A generating function approach to queueing network analysis of multiprogrammed computers.",
            "Coding graphs by contractions.",
            "On the optional hamiltonian completion problem.",
            "Generalized networks: Networks embedded on a matroid, part I.",
            "On edge-disjoint branchings.",
            "Hydraulic network analysis using (generalized) geometric programming.",
            "A necessary condition for the existence of a circuit of any specified length.",
            "An algorithm for the longest cycle problem.",
            "An efficient scaling procedure for gain networks.",
            "Maximum flow in probabilistic graphs-the discrete case.",
            "An Algorithm for r-Bases of a Directed Graph.",
            "QUEUEING SYSTEMS, VOLUME 1: THEORY by Leonard Kleinrock John Wiley & Sons, Inc., New York, 1975, $19.95, 417 pages.",
            "A new deterministic network reliability measure.",
            "Iterative methods for determining the k shortest paths in a network.",
            "Generalized networks: Networks embedded on a matroid, part II.",
            "On general routing problems.",
            "On general routing problems: Comments.",
            "\"Travels in Computerland, or Incompatibilities and Interfaces\" by Ben Ross Schneider, Jr. Addison-Wesley Publishing Company Reading, Massachusetts 1974, $5.95, 256 pages.",
            "On optimum path problems.",
            "An algebra for determining all path-values in a network with application to K-shortest-paths problems.",
            "On cost allocation for a spanning tree: A game theoretic approach.",
            "Low cost drainage networks.",
            "On totally unimodular matrices."
        ]
    },
    {
        "name": "Networks",
        "year": "1975",
        "info": "1975: Volume 5",
        "count": 26,
        "papers": [
            "A bit-pushing shortest distance algorithm.",
            "Optimal-aim regulation and tracking in large-order nonlinear networks.",
            "A minimum-cost multicommodity network flow problem concerning imports and exports.",
            "Minimum cuts and related problems.",
            "Minimal complete matchings and negative cycles.",
            "The Program, Conclusions and Recommendations.",
            "Computer Networks: Art to Science to Art.",
            "Heuristic Programming as an Aid to Network Design.",
            "On the Computational Complexity of Combinatorial Problems.",
            "Computer Networks.",
            "Transportation Networks.",
            "Energy Networks.",
            "Layout, Interconnection, and Placement.",
            "Algorithms, Graphs, and Complexity.",
            "Partitions, Decomposition, Sparsity.",
            "Stochastic Aspects of Networks.",
            "Heuristics.",
            "On the Traffic Handling Capability of Communication Networks Homogeneously Loaded.",
            "Bibliography on Algorithms for Shortest Path, Shortest Spanning Tree, and Related Circuit Routing Problems (1956-1974).",
            "A Vertex Elimination Algorithm for Enumerating all Simple Paths in a Graph.",
            "Duality in Networks: Roses, Bouquets, and Cut-Sets; Trees, Forests and Polygons.",
            "TRAFFIC SCIENCE.",
            "Multiterminal Path Flows for Packet-Switching Communication Networks.",
            "Bounds on Backtrack Algorithms for Listing Cycles, Paths, and Spanning Trees.",
            "The Minimum Number of Edges and Vertices in a Graph with Edge Connectivity n and m n-Bonds.",
            "Graph Theory with Applications to Engineering and Computer Science."
        ]
    },
    {
        "name": "Networks",
        "year": "1974",
        "info": "1974: Volume 4",
        "count": 24,
        "papers": [
            "Cost allocation in networks: The bulk supplier problem.",
            "On building minimum cost communication networks over time.",
            "A fundamental problem in vehicle routing.",
            "Networks and vehicle routing for municipal waste collection.",
            "Exact calculation of computer network reliability.",
            "Modeling and optimal control of congested transportation systems.",
            "Disjoint paths in a network.",
            "Routing a fleet of M vehicles to/from a central facility.",
            "Generalized Ramsey theory for graphs IV, the Ramsey multiplicity of a graph.",
            "Matchings in polytopal graphs.",
            "Implementation and computational comparisons of primal, dual and primal-dual computer codes for minimum cost network flow problems.",
            "Network properties of the ARPA computer network.",
            "Shortest path with time constraints on movement and parking.",
            "Dynamic network flows with arc changes.",
            "A multicommodity flow problem.",
            "How to colour the lines of a bigraph.",
            "Network analysis and synthesis. by B. D. O. Anderson and S. Vongpanitlerd Prentice-Hall, Inc., Englewood Cliffs, N. J. 1973, 548 pages, $17.95.",
            "Control of an expanding network - \"An operational nightmare\".",
            "Computing capacitated minimal spanning trees efficiently.",
            "Shortest alternating path algorithms.",
            "A lower bound on the average shortest path length in regular graphs.",
            "An algorithm for nonlinear multicommodity flow problems.",
            "Algorithms on circular-arc graphs.",
            "On clique-extremal (p, q)-graphs."
        ]
    },
    {
        "name": "Networks",
        "year": "1973",
        "info": "1973: Volume 3",
        "count": 26,
        "papers": [
            "Construction of efficient tree networks: The pipeline problem.",
            "Synthesis of modulation insensitive N-path filters.",
            "The network equilibrium problem in integers.",
            "The shortest and the K-shortest routes as assignment problems.",
            "A probabilistic model of learning by means of problems.",
            "Recursive analysis of network reliability.",
            "Changing careers in science and engineering edited by Sanborn C. Brown, MIT Press, 1972, 349 pages.",
            "The flow deviation method: An approach to store-and-forward communication network design.",
            "KWIC Index for Computer Networks.",
            "The Capacitated Minimum Spanning Tree.",
            "Conference Report.",
            "APPLIED GRAPH THEORY by Clifford W. Marshall, Wiley-Interscience, 1971.",
            "Minimum cost routing for dynamic network models.",
            "On the existence of N-connected graphs with prescribed degrees (n ≧ 2).",
            "On the design of reliable networks.",
            "Algorithms for a maximum clique and a maximum independent set of a circle graph.",
            "Cutsets and partitions of hypergraphs.",
            "Historical note on optimum spanning arborescences.",
            "Cost allocation for a spanning tree.",
            "On operating a shuttle service.",
            "On building minimum cost communication networks.",
            "An optimal schedule time of a job shop-like disjunctive graph.",
            "A sufficient condition for a matrix to be totally unimodular.",
            "The chromatic reduction problem.",
            "Seventh annual ieee computer society international conference.",
            "Graphs and networks - an introduction by W. L. Price, Auerbach Publishers Inc., 1971."
        ]
    },
    {
        "name": "Networks",
        "year": "1972",
        "info": "1972: Volume 2",
        "count": 19,
        "papers": [
            "Hamiltonian factorization of the product of a complete graph with itself.",
            "Partial orders of dimension 2.",
            "Bounded color functions on graphs.",
            "Stability of networks with distributed and nonlinear elements. I.",
            "Traffic control and highway networks.",
            "Problems in the design of large power networks.",
            "Computer communication network design: Experience with theory and practice.",
            "Computer-aided interconnection routing: General survey of the state-of-the-art.",
            "The status of cable television network design.",
            "Generalized multi-stage connection networks.",
            "Dynamic transshipment networks: An algorithm and its application to the distribution of empty containers.",
            "Topological formulations and the order of complexity of active networks: A unified survey.",
            "A general class of invulnerable graphs.",
            "Network models for maximization of heat transfer under weight constraints.",
            "Rearrangeability of multi-connection three-stage clos networks.",
            "A graph theoretic approach to the grouping of ordering data.",
            "Multi-commodities transportation schedules over time.",
            "Lower bounds on the vulnerability of a graph.",
            "Stability of networks with distributed and nonlinear elements, part II."
        ]
    },
    {
        "name": "Networks",
        "year": "1971",
        "info": "1971: Volume 1",
        "count": 23,
        "papers": [
            "The processor-sharing queueing model for time-shared systems with bulk arrivals.",
            "A study of the analysis and control of the flow of air traffic: Part I.",
            "Optimal design of centralized computer networks.",
            "A decomposition approach to nonlinear programs as applied to reservoir systems.",
            "An algorithm for certain multi-commodity flow problems.",
            "Minimal k-arc connected graphs.",
            "Routing in computer networks.",
            "Steiner's problem in graphs and its implications.",
            "Optimal ranking of tournaments.",
            "Minimum cost routing for static network models.",
            "On some techniques useful for solution of transportation network problems.",
            "The steiner problem in graphs.",
            "A study of the analysis and control of the flow of air traffic: Part II.",
            "Multicommodity networks with resource constraints: The generalized multicommodity flow problem.",
            "A simple derivation of Edmonds' algorithm for optimum branchings.",
            "A lower bound on the chromatic number of a graph.",
            "Network reliability analysis: Part I.",
            "Two-way traffic in loop service systems.",
            "A study of the analysis and control of the flow of air traffic: Part III.",
            "A generalized upper bounding algorithm for multicommodity network flow problems.",
            "Optimal flow in networks with gains and costs.",
            "On non-blocking switching networks.",
            "Imbalances in k-colorations."
        ]
    }
]