[
    {
        "year": "2021",
        "name": "18th NSDI 2021",
        "info": "",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2021",
                "sub_name": "18th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2021, April 12-14, 2021.",
                "count": 59,
                "papers": [
                    "Accessing Cloud with Disaggregated Software-Defined Router.",
                    "CodedBulk: Inter-Datacenter Bulk Transfers using Network Coding.",
                    "Twenty Years After: Hierarchical Core-Stateless Fair Queueing.",
                    "Breaking the Transience-Equilibrium Nexus: A New Approach to Datacenter Packet Transport.",
                    "Running BGP in Data Centers at Scale.",
                    "Orion: Google's Software-Defined Networking Control Plane.",
                    "Metha: Network Verifiers Need To Be Correct Too!",
                    "Finding Invariants of Distributed Systems: It's a Small (Enough) World After All.",
                    "Avenir: Managing Data Plane Diversity with Control Plane Synthesis.",
                    "Don't Yank My Chain: Auditable NF Service Chaining.",
                    "Contracting Wide-area Network Topologies to Solve Flow Problems Quickly.",
                    "Cost-effective Cloud Edge Traffic Engineering with Cascara.",
                    "A Social Network Under Social Distancing: Risk-Driven Backbone Management During COVID-19 and Beyond.",
                    "Staying Alive: Connection Path Reselection at the Edge.",
                    "Debugging Transient Faults in Data Centers using Synchronized Network-wide Packet Histories.",
                    "Alohamora: Reviving HTTP/2 Push and Preload by Adapting Policies On the Fly.",
                    "Oblique: Accelerating Page Loads Using Symbolic Execution.",
                    "SENSEI: Aligning Video Streaming Quality with Dynamic User Sensitivity.",
                    "GAIA: A System for Interactive Analysis on Distributed Graphs Using a High-Level Language.",
                    "TEGRA: Efficient Ad-Hoc Analytics on Evolving Graphs.",
                    "Unifying Timestamp with Transaction Ordering for MVCC with Decentralized Scalar Timestamp.",
                    "When to Hedge in Interactive Services.",
                    "Move Fast and Meet Deadlines: Fine-grained Real-time Stream Processing with Cameo.",
                    "Whiz: Data-Driven Analytics Execution.",
                    "Pushing the Physical Limits of IoT Devices with Programmable Metasurfaces.",
                    "Bootstrapping Battery-free Wireless Networks: Efficient Neighbor Discovery and Synchronization in the Face of Intermittency.",
                    "AIRCODE: Hidden Screen-Camera Communication on an Invisible and Inaudible Dual Channel.",
                    "Device-Based LTE Latency Reduction at the Application Layer.",
                    "BMC: Accelerating Memcached using Safe In-kernel Caching and Pre-stack Processing.",
                    "Segcache: a memory-efficient and scalable in-memory key-value cache for small objects.",
                    "When Cloud Storage Meets RDMA.",
                    "Prism: Proxies without the Pain.",
                    "Programming Network Stack for Middleboxes with Rubik.",
                    "Flightplan: Dataplane Disaggregation and Placement for P4 Programs.",
                    "MilliSort and MilliQuery: Large-Scale Data-Intensive Computing in Milliseconds.",
                    "EPaxos Revisited.",
                    "Ship Compute or Ship Data? Why Not Both?",
                    "Caerus: NIMBLE Task Scheduling for Serverless Analytics.",
                    "Ownership: A Distributed Futures System for Fine-Grained Tasks.",
                    "Fault-Tolerant Replication with Pull-Based Consensus in MongoDB.",
                    "Mistify: Automating DNN Model Porting for On-Device Inference at the Edge.",
                    "Elastic Resource Sharing for Distributed Deep Learning.",
                    "ATP: In-network Aggregation for Multi-tenant Learning.",
                    "On the Use of ML for Blackbox System Performance Prediction.",
                    "Scaling Distributed Machine Learning with In-Network Aggregation.",
                    "Efficient Wideband Spectrum Sensing Using MEMS Acoustic Resonators.",
                    "WiForce: Wireless Sensing and Localization of Contact Forces on a Space Continuum.",
                    "MAVL: Multiresolution Analysis of Voice Localization.",
                    "From Conception to Retirement: a Lifetime Story of a 3-Year-Old Wireless Beacon System in the Wild.",
                    "EarFisher: Detecting Wireless Eavesdroppers by Stimulating and Sensing Memory EMR.",
                    "Adapting Wireless Mesh Network Configuration from Simulation to Reality via Deep Learning based Domain Adaptation.",
                    "Practical Null Steering in Millimeter Wave Networks.",
                    "SyncScatter: Enabling WiFi like synchronization and range for WiFi backscatter Communication.",
                    "Verification and Redesign of OFDM Backscatter.",
                    "Simplifying Backscatter Deployment: Full-Duplex LoRa Backscatter.",
                    "One Protocol to Rule Them All: Wireless Network-on-Chip using Deep Reinforcement Learning.",
                    "LightGuardian: A Full-Visibility, Lightweight, In-band Telemetry System Using Sketchlets.",
                    "Fast and Light Bandwidth Testing for Internet Users.",
                    "Toward Nearly-Zero-Error Sketching via Compressive Sensing."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th NSDI 2020",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2020",
                "sub_name": "17th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2020, Santa Clara, CA, USA, February 25-27, 2020.",
                "count": 65,
                "papers": [
                    "Expanding across time to deliver bandwidth efficiency and low latency.",
                    "Re-architecting Congestion Management in Lossless Ethernet.",
                    "Measuring Congestion in High-Performance Datacenter Interconnects.",
                    "SP-PIFO: Approximating Push-In First-Out Behaviors using Strict-Priority Queues.",
                    "AccelTCP: Accelerating Network Applications with Stateful TCP Offloading.",
                    "Enabling Programmable Transport Protocols in High-Speed NICs.",
                    "FileMR: Rethinking RDMA Networking for Scalable Persistent Memory.",
                    "TCP ≈ RDMA: CPU-efficient Remote Storage Access with i10.",
                    "NetTLP: A Development Platform for PCIe devices in Software Interacting with Hardware.",
                    "Near-Optimal Latency Versus Cost Tradeoffs in Geo-Distributed Storage.",
                    "NetSMC: A Custom Symbolic Model Checker for Stateful Network Verification.",
                    "Tiramisu: Fast Multilayer Network Verification.",
                    "Automated Verification of Customizable Middlebox Properties with Gravel.",
                    "APKeep: Realtime Verification for Real Networks.",
                    "Liveness Verification of Stateful Network Functions.",
                    "Sol: Fast Distributed Computation Over Slow Networks.",
                    "Themis: Fair and Efficient GPU Cluster Scheduling.",
                    "Fine-Grained Replicated State Machines for a Cluster Storage System.",
                    "Scalog: Seamless Reconfiguration and Total Order in a Scalable Shared Log.",
                    "Frequency Configuration for Low-Power Wide-Area Networks in a Heartbeat.",
                    "ABC: A Simple Explicit Congestion Controller for Wireless Networks.",
                    "AmphiLight: Direct Air-Water Communication with Laser Light.",
                    "Gandalf: An Intelligent, End-To-End Analytics Service for Safe Deployment in Large-Scale Cloud Infrastructure.",
                    "Experiences with Modeling Network Topologies at Multiple Levels of Abstraction.",
                    "Firecracker: Lightweight Virtualization for Serverless Applications.",
                    "Rex: Preventing Bugs and Misconfiguration in Large Services Using Correlated Change Analysis.",
                    "Building An Elastic Query Engine on Disaggregated Storage.",
                    "Millions of Tiny Databases.",
                    "Diamond-Miner: Comprehensive Discovery of the Internet's Topology Diamonds.",
                    "Learning in situ: a randomized experiment in video streaming.",
                    "Is Big Data Performance Reproducible in Modern Cloud Networks?",
                    "Learning Relaxed Belady for Content Distribution Network Caching.",
                    "Meaningful Availability.",
                    "Understanding, Detecting and Localizing Partial Failures in Large System Software.",
                    "Check before You Change: Preventing Correlated Failures in Service Updates.",
                    "Gryff: Unifying Consensus and Shared Registers.",
                    "CableMon: Improving the Reliability of Cable Broadband Networks via Proactive Network Maintenance.",
                    "Batchy: Batch-scheduling Data Flow Graphs with Service-level Objectives.",
                    "Adapting TCP for Reconfigurable Datacenter Networks.",
                    "A High-Speed Load-Balancer Design with Guaranteed Per-Connection-Consistency.",
                    "Programmable Calendar Queues for High-speed Packet Scheduling.",
                    "Contra: A Programmable System for Performance-aware Routing.",
                    "FLAIR: Accelerating Reads with Consistency-Aware Network Routing.",
                    "Towards Logically Centralized Interdomain Routing.",
                    "XRD: Scalable Messaging System with Cryptographic Privacy.",
                    "High Throughput Cryptocurrency Routing in Payment Channel Networks.",
                    "PrivateEye: Scalable and Privacy-Preserving Compromise Detection in the Cloud.",
                    "Telekine: Secure Computing with Cloud GPUs.",
                    "TimeCrypt: Encrypted Data Stream Processing at Scale with Cryptographic Access Control.",
                    "Ghostor: Toward a Secure Data-Sharing System from Decentralized Trust.",
                    "Fawkes: Faster Mobile Page Loads via App-Inspired Static Templating.",
                    "VMscatter: A Versatile MIMO Backscatter.",
                    "Performant TCP for Low-Power Wireless Networks.",
                    "Comb Decoding towards Collision-Free WiFi.",
                    "Plankton: Scalable network configuration verification through model checking.",
                    "Config2Spec: Mining Network Specifications from Network Configurations.",
                    "Network Error Logging: Client-side measurement of end-to-end web service reliability.",
                    "Finding Network Misconfigurations by Automatic Template Inference.",
                    "tpprof: A Network Traffic Pattern Profiler.",
                    "TinySDR: Low-Power SDR Platform for Over-the-Air Programmable IoT Testbeds.",
                    "RFocus: Beamforming Using Thousands of Passive Antennas.",
                    "CarMap: Fast 3D Feature Map Updates for Automobiles.",
                    "Food and Liquid Sensing in Practical Environments using RFIDs.",
                    "Eingerprint: Robust Energy-related Fingerprinting for Passive RFID Tags.",
                    "LocAP: Autonomous Millimeter Accurate Mapping of WiFi Infrastructure."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th NSDI 2019",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2019",
                "sub_name": "16th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2019, Boston, MA, February 26-28, 2019.",
                "count": 49,
                "papers": [
                    "Datacenter RPCs can be General and Fast.",
                    "Eiffel: Efficient and Flexible Software Packet Scheduling.",
                    "Loom: Flexible and Efficient NIC Packet Scheduling.",
                    "Exploiting Commutativity For Practical Fast Replication.",
                    "Flashield: a Hybrid Key-value Cache that Controls Flash Write Amplification.",
                    "Size-aware Sharding For Improving Tail Latencies in In-memory Key-value Stores.",
                    "Monoxide: Scale out Blockchains with Asynchronous Consensus Zones.",
                    "FreeFlow: Software-based Virtual RDMA Networking for Containerized Clouds.",
                    "Direct Universal Access: Making Data Center Resources Available to FPGA.",
                    "Stardust: Divide and Conquer in the Data Center Network.",
                    "Blink: Fast Connectivity Recovery Entirely in the Data Plane.",
                    "Hydra: a federated resource manager for data-center scale analytics.",
                    "Shuffling, Fast and Slow: Scalable Analytics on Serverless Infrastructure.",
                    "dShark: A General, Easy to Program and Scalable Framework for Analyzing In-network Packet Traces.",
                    "Minimal Rewiring: Efficient Live Expansion for Clos Data Center Networks.",
                    "Understanding Lifecycle Management Complexity of Datacenter Topologies.",
                    "Shoal: A Network Architecture for Disaggregated Racks.",
                    "NetScatter: Enabling Large-Scale Backscatter Networks.",
                    "Towards Programming the Radio Environment with Large Arrays of Inexpensive Antennas.",
                    "Pushing the Range Limits of Commercial Passive RFIDs.",
                    "SweepSense: Sensing 5 GHz in 5 Milliseconds with Low-cost Radios.",
                    "Slim: OS Kernel Support for a Low-Overhead Container Overlay Network.",
                    "Shinjuku: Preemptive Scheduling for μsecond-scale Tail Latency.",
                    "Shenango: Achieving High CPU Efficiency for Latency-sensitive Datacenter Workloads.",
                    "End-to-end I/O Monitoring on a Leading Supercomputer.",
                    "Zeno: Diagnosing Performance Problems with Temporal Provenance.",
                    "Confluo: Distributed Monitoring and Diagnosis Stack for High-speed Networks.",
                    "DETER: Deterministic TCP Replay for Performance Diagnosis.",
                    "JANUS: Fast and Flexible Deep Learning via Symbolic Graph Execution of Imperative Programs.",
                    "BLAS-on-flash: An Efficient Alternative for Large Scale ML Training and Inference?",
                    "Tiresias: A GPU Cluster Manager for Distributed Deep Learning.",
                    "Correctness and Performance for Stateful Chained Network Functions.",
                    "Performance Contracts for Software Network Functions.",
                    "FlowBlaze: Stateful Packet Processing in Hardware.",
                    "SIMON: A Simple and Scalable Method for Sensing, Inference and Measurement in Data Center Networks.",
                    "Is advance knowledge of flow sizes a plausible assumption?",
                    "Stable and Practical AS Relationship Inference with ProbLink.",
                    "NetBouncer: Active Device and Link Failure Localization in Data Center Networks.",
                    "Riverbed: Enforcing User-defined Privacy Constraints in Distributed Web Services.",
                    "Hyperscan: A Fast Multi-pattern Regex Matcher for Modern CPUs.",
                    "Deniable Upload and Download via Passive Participation.",
                    "CAUDIT: Continuous Auditing of SSH Servers To Mitigate Brute-Force Attacks.",
                    "Dataplane equivalence and its applications.",
                    "Alembic: Automated Model Inference for Stateful Network Functions.",
                    "Model-Agnostic and Efficient Exploration of Numerical State Space of Real-World TCP Congestion Control Implementations.",
                    "Scaling Community Cellular Networks with CommunityCellularManager.",
                    "TrackIO: Tracking First Responders Inside-Out.",
                    "3D Backscatter Localization for Fine-Grained Robotics.",
                    "Many-to-Many Beam Alignment in Millimeter Wave Networks."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th NSDI 2018",
        "info": "Renton, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2018",
                "sub_name": "15th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2018, Renton, WA, USA, April 9-11, 2018.",
                "count": 40,
                "papers": [
                    "Approximating Fair Queueing on Reconfigurable Switches.",
                    "PASTE: A Network Programming Interface for Non-Volatile Main Memory.",
                    "NetChain: Scale-Free Sub-RTT Coordination.",
                    "Azure Accelerated Networking: SmartNICs in the Public Cloud.",
                    "zkLedger: Privacy-Preserving Auditing for Distributed Ledgers.",
                    "Exploiting a Natural Network Effect for Scalable, Fine-grained Clock Synchronization.",
                    "SnailTrail: Generalizing Critical Paths for Online Analysis of Distributed Dataflows.",
                    "Balancing on the Edge: Transport Affinity without Network State.",
                    "Stateless Datacenter Load-balancing with Beamer.",
                    "Larry: Practical Network Reconfigurability in the Data Center.",
                    "Semi-Oblivious Traffic Engineering: The Road Not Taken.",
                    "Metron: NFV Service Chains at the True Speed of the Underlying Hardware.",
                    "G-NET: Effective GPU Sharing in NFV Systems.",
                    "SafeBricks: Shielding Network Functions in the Cloud.",
                    "Vesper: Measuring Time-to-Interactivity for Web Pages.",
                    "Towards Battery-Free HD Video Streaming.",
                    "Prophecy: Accelerating Mobile Page Loads Using Final-state Write Logs.",
                    "Salsify: Low-Latency Network Video through Tighter Integration between a Video Codec and a Transport Protocol.",
                    "ResQ: Enabling SLOs in Network Function Virtualization.",
                    "Elastic Scaling of Stateful Network Functions.",
                    "Iron: Isolating Network-based CPU in Container Environments.",
                    "Copa: Practical Delay-Based Congestion Control for the Internet.",
                    "PCC Vivace: Online-Learning Congestion Control.",
                    "Multi-Path Transport for RDMA in Datacenters.",
                    "Andromeda: Performance, Isolation, and Velocity at Scale in Cloud Network Virtualization.",
                    "LHD: Improving Cache Hit Rate by Maximizing Hit Density.",
                    "Performance Analysis of Cloud Applications.",
                    "007: Democratically Finding the Cause of Packet Drops.",
                    "Efficient and Correct Test Scheduling for Ensembles of Network Policies.",
                    "Distributed Network Monitoring and Debugging with SwitchPointer.",
                    "Stroboscope: Declarative Network Monitoring on a Budget.",
                    "PLOVER: Fast, Multi-core Scalable Virtual Machine Fault-tolerance.",
                    "Odin: Microsoft's Scalable Fault-Tolerant CDN Measurement System.",
                    "Deepview: Virtual Disk Failure Diagnosis and Pattern Detection for Azure.",
                    "LiveTag: Sensing Human-Object Interaction through Passive Chipless WiFi Tags.",
                    "Inaudible Voice Commands: The Long-Range Attack and Defense.",
                    "PowerMan: An Out-of-Band Management Network for Datacenters Using Power Line Communication.",
                    "NetComplete: Practical Network-Wide Configuration Synthesis with Autocompletion.",
                    "Automatically Correcting Networks with NEAt.",
                    "Net2Text: Query-Guided Summarization of Network Forwarding Behaviors."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th NSDI 2017",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2017",
                "sub_name": "14th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2017, Boston, MA, USA, March 27-29, 2017.",
                "count": 46,
                "papers": [
                    "The Design, Implementation, and Deployment of a System to Transparently Compress Hundreds of Petabytes of Image Files for a File-Storage Service.",
                    "Decibel: Isolation and Sharing in Disaggregated Rack-Scale Storage.",
                    "vCorfu: A Cloud-Scale Object Store on a Shared Log.",
                    "Curator: Self-Managing Storage for Enterprise Clusters.",
                    "Evaluating the Power of Flexible Packet Processing for Network Resource Allocation.",
                    "APUNet: Revitalizing GPU as Packet Processing Accelerator.",
                    "Stateless Network Functions: Breaking the Tight Coupling of State and Processing.",
                    "mOS: A Reusable Networking Stack for Flow Monitoring Middleboxes.",
                    "One Key to Sign Them All Considered Vulnerable: Evaluation of DNSSEC in the Internet.",
                    "Enhancing Security and Privacy of Tor's Ecosystem by Using Trusted Execution Environments.",
                    "ViewMap: Sharing Private In-Vehicle Dashcam Videos.",
                    "A System to Verify Network Behavior of Known Cryptographic Clients.",
                    "FlexCore: Massively Parallel and Flexible Processing for Large MIMO Access Points.",
                    "Facilitating Robust 60 GHz Network Deployment By Sensing Ambient Reflectors.",
                    "Skip-Correlation for Multi-Power Wireless Carrier Sensing.",
                    "FM Backscatter: Enabling Connected Cities and Smart Fabrics.",
                    "Prio: Private, Robust, and Scalable Computation of Aggregate Statistics.",
                    "Opaque: An Oblivious and Encrypted Distributed Analytics Platform.",
                    "Splinter: Practical Private Queries on Public Data.",
                    "VFP: A Virtual Switch Platform for Host SDN in the Public Cloud.",
                    "SCL: Simplifying Distributed SDN Control Planes.",
                    "Robust Validation of Network Designs under Uncertain Demands and Failures.",
                    "Encoding, Fast and Slow: Low-Latency Video Processing Using Thousands of Tiny Threads.",
                    "Live Video Analytics at Scale with Approximation and Delay-Tolerance.",
                    "Pytheas: Enabling Data-Driven Quality of Experience Optimization Using Group-Based Exploration-Exploitation.",
                    "Let It Flow: Resilient Asymmetric Load Balancing with Flowlet Switching.",
                    "Flowtune: Flowlet Control for Datacenter Networks.",
                    "Flexplane: An Experimentation Platform for Resource Management in Datacenters.",
                    "I Can't Believe It's Not Causal! Scalable Causal Consistency with No Slowdown Cascades.",
                    "CherryPick: Adaptively Unearthing the Best Cloud Configurations for Big Data Analytics.",
                    "AdaptSize: Orchestrating the Hot Object Memory Cache in a Content Delivery Network.",
                    "Bringing IoT to Sports Analytics.",
                    "FarmBeats: An IoT Platform for Data-Driven Agriculture.",
                    "Enabling High-Quality Untethered Virtual Reality.",
                    "Improving User Perceived Page Load Times Using Gaze.",
                    "RAIL: A Case for Redundant Arrays of Inexpensive Links in Data Center Networks.",
                    "Enabling Wide-Spread Communications on Optical Fabric with MegaSwitch.",
                    "Passive Realtime Datacenter Fault Detection and Localization.",
                    "Clipper: A Low-Latency Online Prediction Serving System.",
                    "Gaia: Geo-Distributed Machine Learning Approaching LAN Speeds.",
                    "Efficient Memory Disaggregation with Infiniswap.",
                    "Tux2: Distributed Graph Computation for Machine Learning.",
                    "Correct by Construction Networks Using Stepwise Refinement.",
                    "Verifying Reachability in Networks with Mutable Datapaths.",
                    "Automated Bug Removal for Software-Defined Networks.",
                    "Delta-net: Real-time Network Verification Using Atoms."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th NSDI 2016",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2016",
                "sub_name": "13th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2016, Santa Clara, CA, USA, March 16-18, 2016.",
                "count": 44,
                "papers": [
                    "An Industrial-Scale Software Defined Internet Exchange Point.",
                    "XFabric: A Reconfigurable In-Rack Network for Rack-Scale Computers.",
                    "Be Fast, Cheap and in Control with SwitchKV.",
                    "Bitcoin-NG: A Scalable Blockchain Protocol.",
                    "Exploring Cross-Application Cellular Traffic Optimization with Baidu TrafficGuard.",
                    "Efficiently Delivering Online Services over Integrated Infrastructure.",
                    "Scalable and Private Media Consumption with Popcorn.",
                    "Speeding up Web Page Loads with Shandian.",
                    "Polaris: Faster Page Loads Using Fine-grained Dependency Tracking.",
                    "CFA: A Practical Prediction System for Video QoE Optimization.",
                    "Passive Wi-Fi: Bringing Low Power to Wi-Fi Transmissions.",
                    "Decimeter-Level Localization with a Single WiFi Access Point.",
                    "A Scalable Multi-User Uplink for Wi-Fi.",
                    "BeamSpy: Enabling Robust 60 GHz Links Under Blockage.",
                    "Compiling Path Queries.",
                    "Simplifying Software-Defined Network Optimization Using SOL.",
                    "Paving the Way for NFV: Simplifying Middlebox Modifications Using StateAlyzr.",
                    "Embark: Securely Outsourcing Middleboxes to the Cloud.",
                    "BUZZ: Testing Context-Dependent Policies in Stateful Networks.",
                    "Minimizing Faulty Executions of Distributed Systems.",
                    "FlowRadar: A Better NetFlow for Data Centers.",
                    "Sibyl: A Practical Internet Route Oracle.",
                    "VAST: A Unified Platform for Interactive Network Forensics.",
                    "Ernest: Efficient Performance Prediction for Large-Scale Advanced Analytics.",
                    "Cliffhanger: Scaling Performance Cliffs in Web Memory Caches.",
                    "FairRide: Near-Optimal, Fair Cache Sharing.",
                    "HUG: Multi-Resource Fairness for Correlated and Elastic Demands.",
                    "Consensus in a Box: Inexpensive Coordination in Hardware.",
                    "StreamScope: Continuous Reliable Distributed Processing of Big Data Streams.",
                    "Social Hash: An Assignment Framework for Optimizing Distributed Systems Operations on Social Networks.",
                    "BlowFish: Dynamic Storage-Performance Tradeoff in Data Stores.",
                    "Universal Packet Scheduling.",
                    "Maglev: A Fast and Reliable Software Network Load Balancer.",
                    "Enabling ECN in Multi-Service Multi-Queue Data Centers.",
                    "DFC: Accelerating String Pattern Matching for Network Applications.",
                    "Diplomat: Using Delegations to Protect Community Repositories.",
                    "AnonRep: Towards Tracking-Resistant Anonymous Reputation.",
                    "Mind the Gap: Towards a Backpressure-Based Transport Protocol for the Tor Network.",
                    "Sieve: Cryptographically Enforced Access Control for User Data in Untrusted Clouds.",
                    "Earp: Principled Storage, Sharing, and Protection for Mobile Apps.",
                    "iCellular: Device-Customized Cellular Network Access on Commodity Smartphones.",
                    "Diamond: Nesting the Data Center Network with Wireless Rings in 3D Space.",
                    "Ripple II: Faster Communication through Physical Vibration.",
                    "PhyCloak: Obfuscating Sensing from Communication Signals."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th NSDI 2015",
        "info": "Oakland, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2015",
                "sub_name": "12th USENIX Symposium on Networked Systems Design and Implementation, NSDI 15, Oakland, CA, USA, May 4-6, 2015.",
                "count": 42,
                "papers": [
                    "Queues Don't Matter When You Can JUMP Them!",
                    "Explicit Path Control in Commodity Data Centers: Design and Applications.",
                    "Increasing Datacenter Network Utilisation with GRIN.",
                    "Designing Distributed Systems Using Approximate Synchrony in Data Center Networks.",
                    "Kinetic: Verifiable Dynamic Network Control.",
                    "Enforcing Customizable Consistency Properties in Software-Defined Networks.",
                    "CoVisor: A Compositional Hypervisor for Software-Defined Networks.",
                    "Compiling Packet Programs to Reconfigurable Switches.",
                    "The Design and Implementation of Open vSwitch.",
                    "C3: Internet-Scale Control Plane for Video Quality Optimization.",
                    "Attaining the Promise and Avoiding the Pitfalls of TCP in the Datacenter.",
                    "Beyond Sensing: Multi-GHz Realtime Spectrum Analytics.",
                    "Atomix: A Framework for Deploying Signal Processing Applications on Wireless Infrastructure.",
                    "WiDeo: Fine-grained Device-free Motion Tracing using RF Backscatter.",
                    "FlexRadio: Fully Flexible Radios and Networks.",
                    "Towards Wifi Mobility without Fast Handover.",
                    "Securing RFIDs by Randomizing the Modulation and Channel.",
                    "Relative Localization of RFID Tags using Spatial-Temporal Phase Profiling.",
                    "Ripple: Communicating through Physical Vibration.",
                    "Multi-Person Localization via RF Body Reflections.",
                    "Making Sense of Performance in Data Analytics Frameworks.",
                    "CellIQ : Real-Time Cellular Network Analytics at Scale.",
                    "Global Analytics in the Face of Bandwidth and Regulatory Constraints.",
                    "Succinct: Enabling Queries on Compressed Data.",
                    "Wormhole: Reliable Pub-Sub to Support Geo-replicated Internet Services.",
                    "Flywheel: Google's Data Compression Proxy for the Mobile Web.",
                    "FastRoute: A Scalable Load-Aware Anycast Routing Architecture for Modern CDNs.",
                    "PCC: Re-architecting Congestion Control for Consistent High Performance.",
                    "Raising the Bar for Using GPUs in Software Packet Processing.",
                    "ModNet: A Modular Approach to Network Stack Extension.",
                    "Klotski: Reprioritizing Web Content to Improve User Experience on Mobile Devices.",
                    "Information-Agnostic Flow Scheduling for Commodity Data Centers.",
                    "A General Approach to Network Configuration Analysis.",
                    "Analyzing Protocol Implementations for Interoperability.",
                    "Checking Beliefs in Dynamic Networks.",
                    "C3: Cutting Tail Latency in Cloud Data Stores via Adaptive Replica Selection.",
                    "CubicRing: Enabling One-Hop Failure Detection and Recovery for Distributed In-Memory Storage Systems.",
                    "CosTLO: Cost-Effective Redundancy for Lower Latency Variance on Cloud Storage Services.",
                    "Jitsu: Just-In-Time Summoning of Unikernels.",
                    "Tardigrade: Leveraging Lightweight Virtual Machines to Easily and Efficiently Construct Fault-Tolerant Services.",
                    "Retro: Targeted Resource Management in Multi-tenant Distributed Systems.",
                    "Scalable Error Isolation for Distributed Systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th NSDI 2014",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2014",
                "sub_name": "Proceedings of the 11th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2014, Seattle, WA, USA, April 2-4, 2014.",
                "count": 38,
                "papers": [
                    "Circuit Switching Under the Radar with REACToR.",
                    "Catch the Whole Lot in an Action: Rapid Precise Packet Loss Notification in Data Center.",
                    "High Throughput Data Center Topology Design.",
                    "Adtributor: Revenue Debugging in Advertising Systems.",
                    "DECAF: Detecting and Characterizing Ad Fraud in Mobile Apps.",
                    "I Know What Your Packet Did Last Hop: Using Packet Histories to Troubleshoot Networks.",
                    "Libra: Divide and Conquer to Verify Forwarding Tables in Huge Networks.",
                    "Software Dataplane Verification.",
                    "NetCheck: Network Diagnoses from Blackbox Traces.",
                    "Exalt: Empowering Researchers to Evaluate Large-Scale Storage Systems.",
                    "ipShield: A Framework For Enforcing Context-Aware Privacy.",
                    "Building Web Applications on Top of Encrypted Data Using Mylar.",
                    "PHY Covert Channels: Can you see the Idles?",
                    "cTPM: A Cloud TPM for Cross-Device Trusted Applications.",
                    "Network Virtualization in Multi-tenant Datacenters.",
                    "Operational Experiences with Disk Imaging in a Multi-Tenant Datacenter.",
                    "VPN Gate: A Volunteer-Organized Public VPN Relay System with Blocking Resistance for Bypassing Government Censorship Firewalls.",
                    "Bolt: Data Management for Connected Homes.",
                    "Blizzard: Fast, Cloud-scale Block Storage for Cloud-oblivious Applications.",
                    "Aggregation and Degradation in JetStream: Streaming Analytics in the Wide Area.",
                    "GRASS: Trimming Stragglers in Approximation Analytics.",
                    "Bringing Gesture Recognition to All Devices.",
                    "3D Tracking via Body Radio Reflections.",
                    "Epsilon: A Visible Light Based Positioning System.",
                    "Enabling Bit-by-Bit Backscatter Communication in Severe Energy Harvesting Environments.",
                    "Full Duplex MIMO Radios.",
                    "Recursively Cautious Congestion Control.",
                    "How Speedy is SPDY?",
                    "FaRM: Fast Remote Memory.",
                    "Easy Freshness with Pequod Cache Joins.",
                    "MICA: A Holistic Approach to Fast In-Memory Key-Value Storage.",
                    "NetVM: High Performance and Flexible Networking Using Virtualization on Commodity Platforms.",
                    "ClickOS and the Art of Network Function Virtualization.",
                    "SENIC: Scalable NIC for End-Host Rate Limiting.",
                    "mTCP: a Highly Scalable User-level TCP Stack for Multicore Systems.",
                    "Warranties for Faster Strong Consistency.",
                    "Tierless Programming and Reasoning for Software-Defined Networks.",
                    "Enforcing Network-Wide Policies in the Presence of Dynamic Middlebox Actions using FlowTags."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th NSDI 2013",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2013",
                "sub_name": "Proceedings of the 10th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2013, Lombard, IL, USA, April 2-5, 2013.",
                "count": 38,
                "papers": [
                    "Composing Software Defined Networks.",
                    "VeriFlow: Verifying Network-Wide Invariants in Real Time.",
                    "Software Defined Traffic Measurement with OpenSketch.",
                    "V-edge: Fast Self-constructive Power Modeling of Smartphones Based on Battery Voltage Dynamics.",
                    "eDoctor: Automatically Diagnosing Abnormal Battery Drain Issues on Smartphones.",
                    "ArrayTrack: A Fine-Grained Indoor Location System.",
                    "Walkie-Markie: Indoor Pathway Mapping Made Easy.",
                    "Real Time Network Policy Checking Using Header Space Analysis.",
                    "Ensuring Connectivity via Data Plane Mechanisms.",
                    "Juggling the Jigsaw: Towards Automated Problem Inference from Network Trouble Tickets.",
                    "Yank: Enabling Green Data Centers to Pull the Plug.",
                    "Scalable Rule Management for Data Centers.",
                    "Chatty Tenants and the Cloud Network Sharing Problem.",
                    "Effective Straggler Mitigation: Attack of the Clones.",
                    "Wire Speed Name Lookup: A GPU-based Approach.",
                    "SoNIC: Precise Realtime Software Access and Control of Wired Networks.",
                    "Split/Merge: System Support for Elastic Execution in Virtual Middleboxes.",
                    "PinPoint: Localizing Interfering Radios.",
                    "SloMo: Downclocking WiFi Communication.",
                    "Splash: Fast Data Dissemination with Constructive Interference in Wireless Sensor Networks.",
                    "Expanding Rural Cellular Networks with Virtual Coverage.",
                    "EyeQ: Practical Network Performance Isolation at the Edge.",
                    "Stronger Semantics for Low-Latency Geo-Replicated Storage.",
                    "Bobtail: Avoiding Long Tails in the Cloud.",
                    "Rhea: Automatic Filtering for Unstructured Cloud Storage.",
                    "Robustness in the Salus Scalable Block Store.",
                    "MemC3: Compact and Concurrent MemCache with Dumber Caching and Smarter Hashing.",
                    "Scaling Memcache at Facebook.",
                    "F10: A Fault-Tolerant Engineered Network.",
                    "LOUP: The Principles and Practice of Intra-Domain Route Dissemination.",
                    "Improving Availability in Distributed Systems with Failure Informers.",
                    "BOSS: Building Operating System Services.",
                    "Stochastic Forecasts Achieve High Throughput and Low Delay over Cellular Networks.",
                    "Demystifying Page Load Performance with WProf.",
                    "Dasu: Pushing Experiments to the Internet's Edge.",
                    "πBox: A Platform for Privacy-Preserving Apps.",
                    "P3: Toward Privacy-Preserving Photo Sharing.",
                    "Embassies: Radically Refactoring the Web."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th NSDI 2012",
        "info": "San Jose, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2012",
                "sub_name": "Proceedings of the 9th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2012, San Jose, CA, USA, April 25-27, 2012.",
                "count": 30,
                "papers": [
                    "CORFU: A Shared Log Design for Flash Clusters.",
                    "Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing.",
                    "Camdoop: Exploiting In-network Aggregation for Big Data Applications.",
                    "WiFi-NC : WiFi Over Narrow Channels.",
                    "Catching Whales and Minnows Using WiFiNet: Deconstructing Non-WiFi Interference Using WiFi Hardware.",
                    "RPT: Re-architecting Loss Protection for Content-Aware Networks.",
                    "Serval: An End-Host Stack for Service-Centric Networking.",
                    "Reliable Client Accounting for P2P-Infrastructure Hybrids.",
                    "Header Space Analysis: Static Checking for Networks.",
                    "A NICE Way to Test OpenFlow Applications.",
                    "Toward Predictable Performance in Software Packet-Processing Platforms.",
                    "Detecting and Defending Against Third-Party Tracking on the Web.",
                    "Towards Statistical Queries over Distributed Private User Data.",
                    "Koi: A Location-Privacy Platform for Smartphone Apps.",
                    "Aiding the Detection of Fake Accounts in Large Scale Social Online Services.",
                    "Don't Lose Sleep Over Availability: The GreenUp Decentralized Wakeup Service.",
                    "Jellyfish: Networking Data Centers Randomly.",
                    "OSA: An Optical Switching Architecture for Data Center Networks with Unprecedented Flexibility.",
                    "Less Is More: Trading a Little Bandwidth for Ultra-Low Latency in the Data Center.",
                    "PACMan: Coordinated Memory Caching for Parallel Jobs.",
                    "Reoptimizing Data Parallel Computing.",
                    "Optimizing Data Shuffling in Data-Parallel Computation by Understanding User-Defined Functions.",
                    "XIA: Efficient Support for Evolvable Internetworking.",
                    "Design and Implementation of a Consolidated Middlebox Architecture.",
                    "An Operating System for the Home.",
                    "Structured Comparative Analysis of Systems Logs to Diagnose Performance Problems.",
                    "Orchestrating the Deployment of Computations in the Cloud with Conductor.",
                    "Fitting Square Pegs Through Round Pipes: Unordered Delivery Wire-Compatible with TCP and TLS.",
                    "How Hard Can It Be? Designing and Implementing a Deployable Multipath TCP.",
                    "The TCP Outcast Problem: Exposing Unfairness in Data Center Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2012hotice",
                "sub_name": "2nd USENIX Workshop on Hot Topics in Management of Internet, Cloud, and Enterprise Networks and Services, Hot-ICE'12, San Jose, CA, USA, April 24, 2012.",
                "count": 10,
                "papers": [
                    "NaaS: Network-as-a-Service in the Cloud.",
                    "Participatory Networking.",
                    "The Personal Cloud - Design, Architecture and Matchmaking Algorithms for Resource Management.",
                    "ECOS: Practical Mobile Application Offloading for Enterprises.",
                    "Building Access Oblivious Storage Cloud for Enterprise.",
                    "Synergy2Cloud: Introducing Cross-Sharing of Application Experiences Into the Cloud Management Cycle.",
                    "Towards an Understanding of Oversubscription in Cloud.",
                    "DAPA: Diagnosing Application Performance Anomalies for Virtualized Infrastructures.",
                    "Virtual Switching Without a Hypervisor for a More Secure Cloud.",
                    "On Controller Performance in Software-Defined Networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th NSDI 2011",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2011",
                "sub_name": "Proceedings of the 8th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2011, Boston, MA, USA, March 30 - April 1, 2011.",
                "count": 27,
                "papers": [
                    "PIE in the Sky: Online Passive Interference Estimation for Enterprise WLANs.",
                    "SpecNet: Spectrum Sensing Sans Frontières.",
                    "Towards Street-Level Client-Independent IP Geolocation.",
                    "Mesos: A Platform for Fine-Grained Resource Sharing in the Data Center.",
                    "Sharing the Data Center Network.",
                    "Dominant Resource Fairness: Fair Allocation of Multiple Resource Types.",
                    "Accurate, Low-Energy Trajectory Mapping for Mobile Devices.",
                    "Improving Wireless Network Performance Using Sensor Hints.",
                    "Model Checking a Networked System Without the Network.",
                    "FATE and DESTINI: A Framework for Cloud Recovery Testing.",
                    "SliceTime: A Platform for Scalable and Accurate Network Emulation.",
                    "Dewdrop: An Energy-Aware Runtime for Computational RFID.",
                    "SSDAlloc: Hybrid SSD/RAM Memory Management Made Easy.",
                    "Bootstrapping Accountability in the Internet We Have.",
                    "Privad: Practical Privacy in Online Advertising.",
                    "Bazaar: Strengthening User Reputations in Online Marketplaces.",
                    "CIEL: A Universal Execution Engine for Distributed Data-Flow Computing.",
                    "A Semantic Framework for Data Analysis in Networked Systems.",
                    "Paxos Replicated State Machines as the Basis of a High-Performance Data Store.",
                    "Efficiently Measuring Bandwidth at All Time Scales.",
                    "ETTM: A Scalable Fault Tolerant Network Manager.",
                    "Design, Implementation and Evaluation of Congestion Control for Multipath TCP.",
                    "Diagnosing Performance Changes by Comparing Request Flows.",
                    "Profiling Network Performance for Multi-tier Data Center Applications.",
                    "SSLShader: Cheap SSL Acceleration with Commodity Processors.",
                    "ServerSwitch: A Programmable and High Performance Platform for Data Center Networks.",
                    "TritonSort: A Balanced Large-Scale Sorting System."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2011hotice",
                "sub_name": "USENIX Workshop on Hot Topics in Management of Internet, Cloud, and Enterprise Networks and Services, Hot-ICE'11, Boston, MA, USA, March 29, 2011.",
                "count": 14,
                "papers": [
                    "Enabling Flow-level Latency Measurements across Routers in Data Centers.",
                    "OpenFlow-Based Server Load Balancing Gone Wild.",
                    "Online Measurement of Large Traffic Aggregates on Commodity Switches.",
                    "Topology Switching for Data Center Networks.",
                    "Using Hierarchical Change Mining to Manage Network Security Policy Evolution.",
                    "Towards Automated Identification of Security Zone Classification in Enterprise Networks.",
                    "Simplifying Manageability, Scalability and Host Mobility in Large-Scale Enterprise Networks using VEIL-click.",
                    "Automated Incident Management for a Platform-as-a-Service Cloud.",
                    "QoSaaS: Quality of Service as a Service.",
                    "KnowOps: Towards an Embedded Knowledge Base for Network Management and Operations.",
                    "Dynamic Resource Allocation for Spot Markets in Clouds.",
                    "On the Benefit of Virtualization: Strategies for Flexible Server Allocation.",
                    "Cost-Aware Live Migration of Services in the Cloud.",
                    "Server Operational Cost Optimization for Cloud Computing Service Providers over a Time Horizon."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th NSDI 2010",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2010",
                "sub_name": "Proceedings of the 7th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2010, April 28-30, 2010, San Jose, CA, USA.",
                "count": 29,
                "papers": [
                    "Centrifuge: Integrated Lease Management and Partitioning for Cloud Services.",
                    "Volley: Automated Data Placement for Geo-Distributed Cloud Services.",
                    "Optimizing Cost and Performance in Online Service Provider Networks.",
                    "Exploring Link Correlation for Efficient Flooding in Wireless Sensor Networks.",
                    "Supporting Demanding Wireless Applications with Frequency-agile Radios.",
                    "Contracts: Practical Contribution Incentives for P2P Live Streaming.",
                    "Experiences with CoralCDN: A Five-Year Operational View.",
                    "Whanau: A Sybil-proof Distributed Hash Table.",
                    "Crom: Faster Web Browsing Using Speculative Execution.",
                    "WebProphet: Automating Performance Prediction for Web Services.",
                    "Mugshot: Deterministic Capture and Replay for JavaScript Applications.",
                    "AccuRate: Constellation Based Rate Estimation in Wireless Networks.",
                    "Scalable WiFi Media Delivery through Adaptive Broadcasts.",
                    "Maranello: Practical Partial Packet Recovery for 802.11.",
                    "Reverse traceroute.",
                    "Seamless BGP Migration with Router Grafting.",
                    "ElasticTree: Saving Energy in Data Center Networks.",
                    "SPAIN: COTS Data-Center Ethernet for Multipathing over Arbitrary Topologies.",
                    "Hedera: Dynamic Flow Scheduling for Data Center Networks.",
                    "Airavat: Security and Privacy for MapReduce.",
                    "MapReduce Online.",
                    "The Architecture and Implementation of an Extensible Web Crawler.",
                    "Prophecy: Using History for High-Throughput Fault Tolerance.",
                    "Carousel: Scalable Logging for Intrusion Prevention Systems.",
                    "SplitScreen: Enabling Efficient, Distributed Malware Detection.",
                    "Behavioral Clustering of HTTP-Based Malware and Signature Generation Using Malicious Network Traces.",
                    "Glasnost: Enabling End Users to Detect Traffic Differentiation.",
                    "EndRE: An End-System Redundancy Elimination Service for Enterprises.",
                    "Cheap and Large CAMs for High Performance Data-Intensive Networked Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/iptps/2010",
                "sub_name": "Proceedings of the 9th international conference on Peer-to-peer systems, IPTPS'10, San Jose, CA, USA, April 27, 2010.",
                "count": 13,
                "papers": [
                    "Blindfold: a system to \"See no evil\" in content discovery.",
                    "AmazingStore: available, low-cost online storage service using cloudlets.",
                    "Peer-to-peer bargaining in container-based datacenters.",
                    "Estimating peer similarity using distance of shared files.",
                    "Don't love thy nearest neighbor.",
                    "SplitQuest: controlled and exhaustive search in peer-to-peer networks.",
                    "Balancing gossip exchanges in networks with firewalls.",
                    "A middleware for gossip protocols.",
                    "StAN: exploiting shared interests without disclosing them in gossip-based publish/subscribe.",
                    "Public and private BitTorrent communities: a measurement study.",
                    "Comparing BitTorrent clients in the wild: the case of download speed.",
                    "Power-law revisited: large scale measurement study of P2P content popularity.",
                    "Strange bedfellows: community identification in bittorrent."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2010inm-wren",
                "sub_name": "2010 Internet Network Management Workshop / Workshop on Research on Enterprise Networking, San Jose, CA, USA, April, 2010.",
                "count": 11,
                "papers": [
                    "Experiences with Tracing Causality in Networked Services.",
                    "Proactive Network Management of IPTV Networks.",
                    "A Preliminary Analysis of TCP Performance in an Enterprise Network.",
                    "Extensible and Scalable Network Monitoring Using OpenSAFE.",
                    "Beyond the Best: Real-Time Non-Invasive Collection of BGP Messages.",
                    "The \"Platform as a Service\" Model for Networking.",
                    "vDC: Virtual Data Center Powered with AS Alliance for Enabling Cost-Effective Business Continuity and Coverage.",
                    "Europa: Efficient User Mode Packet Forwarding in Network Virtualization.",
                    "Automated and Scalable QoS Control for Network Convergence.",
                    "The Case for Fine-Grained Traffic Engineering in Data Centers.",
                    "HyperFlow: A Distributed Control Plane for OpenFlow."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th NSDI 2009",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2009",
                "sub_name": "Proceedings of the 6th USENIX Symposium on Networked Systems Design and Implementation, NSDI 2009, April 22-24, 2009, Boston, MA, USA.",
                "count": 32,
                "papers": [
                    "TrInc: Small Trusted Hardware for Large Distributed Systems.",
                    "Sybil-Resilient Online Content Voting.",
                    "Bunker: A Privacy-Oriented Platform for Network Tracing.",
                    "Flexible, Wide-Area Storage for Distributed Systems with WheelFS.",
                    "PADS: A Policy Architecture for Distributed Storage Systems.",
                    "Sora: High Performance Software Radio Using General Purpose Multi-core Processors.",
                    "Enabling MAC Protocol Implementations on Software-Defined Radios.",
                    "AntFarm: Efficient Content Distribution with Managed Swarms.",
                    "HashCache: Cache Storage for the Next Billion.",
                    "iPlane Nano: Path Prediction for Peer-to-Peer Applications.",
                    "Making Byzantine Fault Tolerant Systems Tolerate Byzantine Faults.",
                    "Zeno: Eventually Consistent Byzantine-Fault Tolerance.",
                    "SPLAY: Distributed Systems Evaluation Made Simple (or How to Turn Ideas into Live Systems in a Breeze).",
                    "Modeling and Emulation of Internet Paths.",
                    "MODIST: Transparent Model Checking of Unmodified Distributed Systems.",
                    "CrystalBall: Predicting and Preventing Inconsistencies in Deployed Distributed Systems.",
                    "Tolerating Latency in Replicated State Machines Through Client Speculation.",
                    "A Platform for Content-based Partial Replication.",
                    "RPC Chains: Efficient Client-Server Communication in Geodistributed Systems.",
                    "Studying Spamming Botnets Using Botlab.",
                    "Not-a-Bot: Improving Service Availability in the Face of Botnet Attacks.",
                    "BotGraph: Large Scale Spamming Botnet Detection.",
                    "Unraveling the Complexity of Network Management.",
                    "NetPrints: Diagnosing Home Network Misconfigurations Using Shared Knowledge.",
                    "Somniloquy: Augmenting Network Interfaces to Reduce PC Energy Usage.",
                    "Skilled in the Art of Being Idle: Reducing Energy Waste in Networked Systems.",
                    "Wishbone: Profile-based Partitioning for Sensornet Applications.",
                    "Softspeak: Making VoIP Play Well in Existing 802.11 Deployments.",
                    "Block-switched Networks: A New Paradigm for Wireless Transport.",
                    "NetReview: Detecting When Interdomain Routing Goes Wrong.",
                    "Making Routers Last Longer with ViAggre.",
                    "Symbiotic Relationships in Internet Routing Overlays."
                ]
            },
            {
                "sub_name_abbr": "conf/iptps/2009",
                "sub_name": "Proceedings of the 8th international conference on Peer-to-peer systems, IPTPS'09, Boston, MA, USA, April 21, 2009.",
                "count": 12,
                "papers": [
                    "Birds of a FETHR: open, decentralized micropublishing.",
                    "A Walkable Kademlia network for virtual worlds.",
                    "Offloading AI for peer-to-peer games with dead reckoning.",
                    "Queuing models for peer-to-peer systems.",
                    "How P2P streaming systems scale over time under a flash crowd?",
                    "Kangaroo: video seeking in P2P systems.",
                    "Bringing P2P to the web: security and privacy in the firecoral network.",
                    "Deconstructing internet paths: an approach for AS-level detour route discovery.",
                    "EigenSpeed: secure peer-to-peer bandwidth evaluation.",
                    "Dynamic swarm management for improved BitTorrent performance.",
                    "Large-scale monitoring of DHT traffic.",
                    "On the locality of BitTorrent-based video file swarming."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th NSDI 2008",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2008",
                "sub_name": "5th USENIX Symposium on Networked Systems Design & Implementation, NSDI 2008, April 16-18, 2008, San Francisco, CA, USA, Proceedings.",
                "count": 30,
                "papers": [
                    "One Hop Reputations for Peer to Peer File Sharing Workloads.",
                    "Ostra: Leveraging Trust to Thwart Unwanted Communication.",
                    "Detecting In-Flight Page Changes with Web Tripwires.",
                    "Phalanx: Withstanding Multimillion-Node Botnets.",
                    "Harnessing Exposed Terminals in Wireless Networks.",
                    "Designing High Performance Enterprise Wi-Fi Networks.",
                    "FatVAP: Aggregating AP Backhaul Capacity to Maximize Throughput.",
                    "Efficiency Through Eavesdropping: Link-layer Packet Caching.",
                    "Beyond Pilots: Keeping Rural Wireless Networks Alive.",
                    "UsenetDHT: A Low-Overhead Design for Usenet.",
                    "San Fermín: Aggregating Large Data Sets Using a Binomial Swap Forest.",
                    "Remus: High Availability via Asynchronous Virtual Machine Replication. (Best Paper).",
                    "Nysiad: Practical Protocol Transformation to Tolerate Byzantine Failures.",
                    "BFT Protocols Under Fire.",
                    "Uncovering Performance Differences Among Backbone ISPs with Netdiff .",
                    "Effective Diagnosis of Routing Disruptions from End Systems.",
                    "cSamp: A System for Network-Wide Flow Monitoring.",
                    "Studying Black Holes in the Internet with Hubble.",
                    "Maelstrom: Transparent Error Correction for Lambda Networks.",
                    "Swift: A Fast Dynamic Packet Filter.",
                    "Securing Distributed Systems with Information Flow Control.",
                    "Wedge: Splitting Applications into Reduced-Privilege Compartments.",
                    "Reducing Network Energy Consumption via Sleeping and Rate-Adaptation.",
                    "Energy-Aware Server Provisioning and Load Dispatching for Connection-Intensive Internet Services.",
                    "Consensus Routing: The Internet as a Distributed System. (Best Paper).",
                    "Passport: Secure and Adoptable Source Authentication.",
                    "Context-based Routing: Technique, Applications, and Experience.",
                    "NetComplex: A Complexity Metric for Networked System Designs.",
                    "DieCast: Testing Distributed Systems with an Accurate Scale Model.",
                    "D3S: Debugging Deployed Distributed Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2008upsec",
                "sub_name": "Usability, Psychology, and Security, UPSEC'08, San Francisco, CA, USA, April 14, 2008, Proceedings.",
                "count": 13,
                "papers": [
                    "A Framework for Reasoning About the Human in the Loop.",
                    "Understanding Privacy Settings in Facebook with an Audience View.",
                    "Centered Discretization with Application to Graphical Passwords.",
                    "iPhish: Phishing Vulnerabilities on Consumer Electronics.",
                    "Where's The Beep? Security, Privacy, and User Misunderstandings of RFID.",
                    "Biometric Daemons: Authentication via Electronic Pets.",
                    "Freezing More Than Bits: Chilling Effects of the OLPC XO Security Model.",
                    "Using Salience Differentials to Making Visual Cues Noticeable.",
                    "Predicted and Observed User Behavior in the Weakest-link Security Game.",
                    "Ad-hoc Guesting: When Exceptions Are the Rule.",
                    "RUST: A Retargetable Usability Testbed for Web Site Authentication Technologies.",
                    "A User Study Design for Comparing the Security of Registration Protocols.",
                    "IRBs and Security Research: Myths, Facts and Mission Creep."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2008leet",
                "sub_name": "First USENIX Workshop on Large-Scale Exploits and Emergent Threats, LEET '08, San Francisco, CA, USA, April 15, 2008, Proceedings.",
                "count": 11,
                "papers": [
                    "On the Spam Campaign Trail.",
                    "Characterizing Botnets from Email Spam Records.",
                    "Peeking into Spammer Behavior from a Unique Vantage Point.",
                    "Behind Phishing: An Examination of Phisher Modi Operandi.",
                    "Designing and Implementing Malicious Hardware.",
                    "Catching Instant Messaging Worms with Change-Point Detection Techniques.",
                    "Exploiting Machine Learning to Subvert Your Spam Filter.",
                    "Conducting Cybersecurity Research Legally and Ethically.",
                    "Measurements and Mitigation of Peer-to-Peer-based Botnets: A Case Study on Storm Worm.",
                    "The Heisenbot Uncertainty Problem: Challenges in Separating Bots from Chaff.",
                    "Ghost Turns Zombie: Exploring the Life Cycle of Web-based Malware."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2008wowcs",
                "sub_name": "Workshop on Organizing Workshops, Conferences, and Symposia for Computer Systems, WOWCS'08, San Francisco, CA, USA, April 15, 2008, Proceedings.",
                "count": 11,
                "papers": [
                    "Best Practices for the Care and Feeding of a Program Committee, and Other Thoughts on Conference Organization.",
                    "What Ought a Program Committee to Do?",
                    "Program Committee Meetings Considered Harmful.",
                    "Paper Rating vs. Paper Ranking.",
                    "Overcoming Challenges of Maturity.",
                    "Thoughts on Improving Review Quality.",
                    "Scaling Internet Research Publication Processes to Internet Scale.",
                    "Towards a Model of Computer Systems Research.",
                    "Banal: Because Format Checking Is So Trite.",
                    "Hot Crap!",
                    "Before and After WOWCS: A literature survey, A list of papers we wish had been submitted."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th NSDI 2007",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2007",
                "sub_name": "4th Symposium on Networked Systems Design and Implementation (NSDI 2007), April 11-13, 2007, Cambridge, Massachusetts, USA, Proceedings.",
                "count": 28,
                "papers": [
                    "Security of Voting Systems.",
                    "Do Incentives Build Robustness in BitTorrent? (Awarded Best Student Paper).",
                    "Exploiting Similarity for Multi-Source Downloads Using File Handprints.",
                    "Cobra: Content-based Filtering and Aggregation of Blogs and RSS Feeds.",
                    "Information Slicing: Anonymity Using Unreliable Overlays.",
                    "SAAR: A Shared Control Plane for Overlay Multicast.",
                    "Ricochet: Lateral Error Correction for Time-Critical Multicast.",
                    "WiLDNet: Design and Implementation of High Performance WiFi Based Long Distance Networks.",
                    "S4: Small State and Small Stretch Routing Protocol for Large Wireless Sensor Networks.",
                    "A Location-Based Management System for Enterprise Wireless LANs.",
                    "Beyond One-Third Faulty Replicas in Byzantine Fault Tolerant Systems.",
                    "Ensuring Content Integrity for Untrusted Peer-to-Peer Content Distribution Networks.",
                    "TightLip: Keeping Applications from Spilling the Beans.",
                    "Peering Through the Shroud: The Effect of Edge Opacity on IP-Based Client Identification.",
                    "A Systematic Framework for Unearthing the Missing Links: Measurements and Impact.",
                    "The Flexlab Approach to Realistic Evaluation of Networked Systems.",
                    "An Experimentation Workbench for Replayable Networking Research.",
                    "Black-box and Gray-box Strategies for Virtual Machine Migration.",
                    "Life, Death, and the Critical Transition: Finding Liveness Bugs in Systems Code (Awarded Best Paper).",
                    "WiDS Checker: Combating Bugs in Distributed Systems.",
                    "X-Trace: A Pervasive Network Tracing Framework.",
                    "Friday: Global Comprehension for Distributed Replay.",
                    "Network Coordinates in the Wild.",
                    "Octant: A Comprehensive Framework for the Geolocalization of Internet Hosts.",
                    "dFence: Transparent Network-based Denial of Service Mitigation.",
                    "R-BGP: Staying Connected in a Connected World.",
                    "Mutually Controlled Routing with Independent ISPs.",
                    "Tesseract: A 4D Network Control Plane."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2007netdb",
                "sub_name": "Third International Workshop on Networking Meets Databases, NetDB'07, Cambridge, MA, USA, April 10, 2007.",
                "count": 5,
                "papers": [
                    "On-Demand View Materialization and Indexing for Network Forensic Analysis.",
                    "Throughput-Optimized, Global-Scale Join Processing in Scientific Federations.",
                    "Networked PIM Using PDMS.",
                    "Towards a Declarative Language and System for Secure Networking.",
                    "Net-X: Unified Data-Centric Internet Services."
                ]
            },
            {
                "sub_name_abbr": "conf/nsdi/2007hotbots",
                "sub_name": "First Workshop on Hot Topics in Understanding Botnets, HotBots'07, Cambridge, MA, USA, April 10, 2007.",
                "count": 11,
                "papers": [
                    "A Case Study of the Rustock Rootkit and Spam Bot.",
                    "The Anatomy of Clickbot.A.",
                    "Wide-Scale Botnet Detection and Characterization.",
                    "Rishi: Identify Bot Contaminated Hosts by IRC Nickname Evaluation.",
                    "AS-Based Accountability as a Cost-Effective DDoS Defense.",
                    "The Ghost in the Browser: Analysis of Web-based Malware.",
                    "My Botnet Is Bigger Than Yours (Maybe, Better Than Yours): Why Size Estimates Remain Challenging.",
                    "Toward Botnet Mesocosms.",
                    "Peer-to-Peer Botnets: Overview and Case Study.",
                    "An Advanced Hybrid Peer-to-Peer Botnet.",
                    "A Distributed Content Independent Method for Spam Detection."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd NSDI 2006",
        "info": "San Jose, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2006",
                "sub_name": "3rd Symposium on Networked Systems Design and Implementation (NSDI 2006), May 8-10, 2007, San Jose, California, USA, Proceedings.",
                "count": 29,
                "papers": [
                    "Keynote.",
                    "Experience with an Object Reputation System for Peer-to-Peer Filesharing.",
                    "Corona: A High Performance Publish-Subscribe System for the World Wide Web.",
                    "Scale and Performance in the CoBlitz Large-File Distribution Service.",
                    "Efficient Replica Maintenance for Distributed Storage Systems.",
                    "PRACTI Replication.",
                    "Exploiting Availability Prediction in Distributed Systems.",
                    "To Infinity and Beyond: Time-Warped Network Emulation.",
                    "The Dark Oracle: Perspective-Aware Unused and Unreachable Address Discovery.",
                    "Pip: Detecting the Unexpected in Distributed Systems.",
                    "OASIS: Anycast for Any Service.",
                    "OverCite: A Distributed, Cooperative CiteSeer.",
                    "Colyseus: A Distributed Architecture for Online Multiplayer Games.",
                    "Na Kika: Secure Service Execution and Composition in an Open Edge-Side Computing Network.",
                    "Connection Conditioning: Architecture-Independent Support for Simple, Robust Servers.",
                    "PCP: Efficient Endpoint Congestion Control.",
                    "Availability of Multi-Object Operations (Awarded Best Paper).",
                    "Subtleties in Tolerating Correlated Failures in Wide-area Storage Systems.",
                    "Open Versus Closed: A Cautionary Tale.",
                    "An Architecture for Internet Data Transfer.",
                    "OCALA: An Architecture for Supporting Legacy Applications over Overlays.",
                    "Distributed Quota Enforcement for Spam Control.",
                    "RE: Reliable Email.",
                    "PRESTO: Feedback-driven Data Management in Sensor Networks.",
                    "Practical Data-Centric Storage.",
                    "Geographic Routing Without Planarization.",
                    "Virtualization Aware File Systems: Getting Beyond the Limitations of Virtual Disks.",
                    "Olive: Distributed Point-in-Time Branching Storage for Real Systems.",
                    "Pastwatch: A Distributed Version Control System."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd NSDI 2005",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2005",
                "sub_name": "2nd Symposium on Networked Systems Design and Implementation (NSDI 2005), May 2-4, 2005, Boston, Massachusetts, USA, Proceedings.",
                "count": 26,
                "papers": [
                    "The Challenges of Delivering Content and Applications on the Internet.",
                    "Finding a Needle in a Haystack: Pinpointing Significant BGP Routing Changes in an IP Network.",
                    "Design and Implementation of a Routing Control Platform.",
                    "Negotiation-Based Routing Between Neighboring ISPs.",
                    "Detecting BGP Configuration Faults with Static Analysis (Awarded Best Paper).",
                    "IP Fault Localization Via Risk Modeling.",
                    "Performance Modeling and System Management for Multi-component Online Services.",
                    "Debunking Some Myths About Structured and Unstructured Overlays.",
                    "Bandwidth-efficient Management of DHT Routing Tables.",
                    "Improving Web Availability for Clients with MONET.",
                    "Shark: Scaling File Servers via Cooperative Caching.",
                    "Glacier: Highly Durable, Decentralized Storage Despite Massive Correlated Failures.",
                    "Quorum: Flexible Quality of Service for Internet Services.",
                    "Trickles: A Stateless Network Stack for Improved Scalability, Resilience, and Flexibility.",
                    "Designing Extensible IP Router Software.",
                    "Using Emulation to Understand and Improve Wireless Networks and Applications.",
                    "Geographic Routing Made Practical.",
                    "Sustaining Cooperation in Multi-hop Wireless Networks.",
                    "ACMS: The Akamai Configuration Management System.",
                    "The Collective: A Cache-Based System Management Architecture.",
                    "Live Migration of Virtual Machines.",
                    "Botz-4-Sale: Surviving Organized DDoS Attacks That Mimic Flash Crowds (Awarded Best Student Paper).",
                    "Cashmere: Resilient Anonymous Routing.",
                    "Decentralized, Adaptive Resource Allocation for Sensor Networks.",
                    "Beacon Vector Routing: Scalable Point-to-Point Routing in Wireless Sensornets.",
                    "Active Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st NSDI 2004",
        "info": "San Francisco, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/nsdi/2004",
                "sub_name": "1st Symposium on Networked Systems Design and Implementation (NSDI 2004), March 29-31, 2004, San Francisco, California, USA, Proceedings.",
                "count": 28,
                "papers": [
                    "Running Massively Multiplayer Games as a Business.",
                    "The Emergence of Networking Abstractions and Techniques in TinyOS.",
                    "Trickle: A Self-Regulating Algorithm for Code Propagation and Maintenance in Wireless Sensor Networks (Awarded Best Paper!).",
                    "Programming Sensor Networks Using Abstract Regions.",
                    "Design, Implementation, and Evaluation of Duplicate Transfer Detection in HTTP.",
                    "OSPF Monitoring: Architecture, Design, and Deployment Experience.",
                    "OverQoS: An Overlay Based Architecture for Enhancing Internet QoS.",
                    "Designing a DHT for Low Latency and High Throughput.",
                    "Beehive: O(1) Lookup Performance for Power-Law Query Distributions in Peer-to-Peer Overlays.",
                    "Efficient Routing for Peer-to-Peer Overlays.",
                    "Listen and Whisper: Security Mechanisms for BGP (Awarded Best Student Paper!).",
                    "Measurement and Analysis of Spyware in a University Environment.",
                    "Model Checking Large Network Protocol Implementations.",
                    "Constructing Services with Interposable Virtual Hardware.",
                    "SWAP: A Scheduler with Automatic Process Dependency Detection.",
                    "Contract-Based Load Management in Federated Distributed Systems.",
                    "Hybrid Global-Local Indexing for Efficient Peer-to-Peer Information Retrieval.",
                    "Untangling the Web from DNS.",
                    "Democratizing Content Publication with Coral.",
                    "Operating Systems Support for Planetary-Scale Network Services.",
                    "MACEDON: Methodology for Automatically Creating, Evaluating, and Designing Overlay Networks.",
                    "Structure Management for Scalable Overlay Service Construction.",
                    "Session State: Beyond Soft State.",
                    "Path-Based Failure and Evolution Management.",
                    "Consistent and Automatic Replica Regeneration.",
                    "Total Recall: System Support for Automated Availability Management.",
                    "TimeLine: A High Performance Archive for a Distributed Object Store.",
                    "Explicit Control in the Batch-Aware Distributed File System."
                ]
            }
        ]
    }
]