[
    {
        "year": "2015",
        "name": "15. P2P 2015",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2015",
                "sub_name": "2015 IEEE International Conference on Peer-to-Peer Computing, P2P 2015, Boston, MA, USA, September 21-25, 2015.",
                "count": 14,
                "papers": [
                    "Coping with bad-mouthing in peer-to-peer file sharing networks.",
                    "Deadline guaranteed service for multi-tenant cloud storage.",
                    "iASK: a distributed Q&A system incorporating social community and global collective intelligence.",
                    "Peer-to-peer between browsers: cyclon protocol over WebRTC.",
                    "goProbe: a scalable distributed network monitoring solution.",
                    "Distilling the ingredients of P2P live streaming systems.",
                    "Protected chords in the web: secure P2P framework for decentralized online social networks.",
                    "Constructing distributed doubly linked lists without distributed locking.",
                    "Decentralized intersection management through peer-to-peer technology.",
                    "Design and analysis of an improved bitmessage anti-spam mechanism.",
                    "Socially-aware distributed hash tables for decentralized online social networks.",
                    "QTrade: a quality of experience based peercasting trading scheme.",
                    "Autotune: game-based adaptive bitrate streaming in P2P-assisted cloud-based vod systems.",
                    "Sociallink: utilizing social network and transaction links for effective trust management in P2P file sharing systems."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "14. P2P 2014",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2014",
                "sub_name": "14th IEEE International Conference on Peer-to-Peer Computing, P2P 2014, London, United Kingdom, September 9-11, 2014, Proceedings.",
                "count": 24,
                "papers": [
                    "Clubbing with the peers: A measurement study of BitTorrent live.",
                    "Bypassing the cloud: Peer-assisted event dissemination for augmented reality games.",
                    "LAYSTREAM: Composing standard gossip protocols for live video streaming.",
                    "Dataset on usage of a live & VoD P2P IPTV service.",
                    "Fully distributed robust singular value decomposition.",
                    "HSkip+: A self-stabilizing overlay network for nodes with heterogeneous bandwidths.",
                    "Automatic transport selection and resource allocation for resilient communication in decentralised networks.",
                    "Reducing costs in the personal cloud: Is bittorrent a better bet?",
                    "Decentralizing the cloud: How can small data centers cooperate?",
                    "Diversity entails improvement: A new neighbour selection scheme for Kademlia-type systems.",
                    "RankSlicing: A decentralized protocol for supernode selection.",
                    "On the tradeoff between resilience and degree overload in dynamic P2P graphs.",
                    "User freedom: To be or not to be a 'supernode'.",
                    "Routing table construction method solely based on query flows for structured overlays.",
                    "Stochastic models of pull-based data replication in P2P systems.",
                    "Replicated erasure codes for storage and repair-traffic efficiency.",
                    "4P: Performant private peer-to-peer file sharing.",
                    "Censorship-resistant and privacy-preserving distributed web search.",
                    "Cloudy knapsack problems: An optimization model for distributed cloud-assisted systems.",
                    "The power of indirect ties in friend-to-friend storage systems.",
                    "A peer-to-peer service architecture for the Smart Grid.",
                    "An empirical study of the global behavior of a structured overlay network.",
                    "Defining and understanding smartphone churn over the internet: A measurement study.",
                    "100 Million DHT replies."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "13. P2P 2013",
        "info": "Trento, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2013",
                "sub_name": "13th IEEE International Conference on Peer-to-Peer Computing, IEEE P2P 2013, Trento, Italy, September 9-11, 2013, Proceedings.",
                "count": 43,
                "papers": [
                    "Message from the chairs.",
                    "Leveraging node properties in random walks for robust reputations in decentralized networks.",
                    "RECODE: Reconfigurable, consistent and decentralized data services.",
                    "Experimental analyses of data distribution on data center networks.",
                    "RASP: Using OpenFlow to push overlay streams into the Underlay.",
                    "The hidden locality in swarms.",
                    "Capacity analysis of peer-to-peer adaptive streaming.",
                    "Temporal correlation of Gossiping-based peer sampling methods.",
                    "Cloud-assisted dissemination in social overlays.",
                    "Data plane throughput vs control plane delay: Experimental study of BitTorrent performance.",
                    "On a balanced neighbor selection strategy for tracker-based peer-to-peer networks.",
                    "Abandonment and its impact on P2P VoD streaming.",
                    "Have a snack, pay with Bitcoins.",
                    "Long-term behavior pattern prediction for peer-to-peer systems.",
                    "Measuring large-scale distributed systems: case of BitTorrent Mainline DHT.",
                    "Increasing ranked accuracy for unstructured distributed search with dynamic replication.",
                    "Boosting content delivery with BitTorrent in online cloud storage services.",
                    "Trending topics in a peer-to-peer micro-blogging social network.",
                    "Kaleidoscope: Adding colors to Kademlia.",
                    "OBST: A self-adjusting peer-to-peer overlay based on multiple BSTs.",
                    "Investigating the reaction of BitTorrent content publishers to antipiracy actions.",
                    "Information propagation in the Bitcoin network.",
                    "nSense: Interest Management in higher dimensions.",
                    "PROB: A lightweight approach for fast content propagation in P2P networks.",
                    "I Tube, YouTube, P2PTube: Assessing ISP benefits of peer-assisted caching of YouTube content.",
                    "On unstructured distributed search over BitTorrent.",
                    "Bootstrapping skynet: Calibration and autonomic self-control of structured peer-to-peer networks.",
                    "An advertising mechanism for P2P networks.",
                    "Mechanism design for dynamic P2P streaming.",
                    "Geodemlia: Persistent storage and reliable search for peer-to-peer location-based services.",
                    "Towards GROUP protocol formalization.",
                    "Community home gateways for P2P clouds.",
                    "Exploring and improving BitTorrent topologies.",
                    "Monitoring anonymous P2P file-sharing systems.",
                    "Can Peer-to-Peer live streaming systems coexist with free riders?",
                    "Box2Box - A P2P-based file-sharing and synchronization application.",
                    "GeoSwarm: A multi-source download scheme for peer-to-peer location-based services.",
                    "Through the wormhole: Low cost, fresh peer sampling for the Internet.",
                    "Privacy-by-design cloud computing through decentralization and real life trust.",
                    "Information dissemination performance of a disaster-tolerant NDN-based distributed application in disrupted cellular networks.",
                    "Resilient tree-based live streaming in reality.",
                    "Exploring your neighborhood: Comparing connection strategies in swarming networks through evolving graphs.",
                    "DirectDemocracyP2P - Decentralized deliberative petition drives -."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "12. P2P 2012",
        "info": "Tarragona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2012",
                "sub_name": "12th IEEE International Conference on Peer-to-Peer Computing, P2P 2012, Tarragona, Spain, September 3-5, 2012.",
                "count": 32,
                "papers": [
                    "GoDel: Delaunay overlays in P2P networks via Gossip.",
                    "Experimental comparison of neighborhood filtering strategies in unstructured P2P-TV systems.",
                    "Geodemlia: A robust peer-to-peer overlay supporting location-based search.",
                    "Revisiting why Kad lookup fails.",
                    "A new caching policy for cloud assisted Peer-to-Peer video-on-demand services.",
                    "CloudShield: Efficient anti-malware smartphone patching with a P2P network on the cloud.",
                    "Profiting from filesharing: A measurement study of economic incentives in cyberlockers.",
                    "Energy-efficient mobile P2P video streaming.",
                    "Peer2View: A peer-to-peer HTTP-live streaming platform.",
                    "Peer-to-peer live streaming for Massively Multiplayer Online Games.",
                    "Demonstrating BooSTER: The broadcast stream transmission epidemic repair.",
                    "Community-Lab: Overview and invitation to the research community.",
                    "Radiommender: P2P on-line radio with a distributed recommender system.",
                    "FRIENDBOX: A cloudified F2F storage application.",
                    "Inferring the buffering delay of remote BitTorrent peers under LEDBAT vs TCP.",
                    "CLive: Cloud-assisted P2P live streaming.",
                    "BooSTER: Broadcast stream transmission epidemic repair.",
                    "Performance analysis of the Libswift P2P streaming protocol.",
                    "AntiLiar: Defending against cheating attacks in mesh based streaming.",
                    "BitTorrent traffic obfuscation: A chase towards semantic traffic identification.",
                    "Disconnecting to connect: Understanding optimistic disconnection in BitTorrent.",
                    "Disconnection punishment in trust bootstrapping: Benefits of activity stereotypes.",
                    "Boosting market liquidity of peer-to-peer systems through cyclic trading.",
                    "Passwords in peer-to-peer.",
                    "An approach to manage semantic heterogeneity in unstructured P2P information retrieval systems.",
                    "SocialCDN: Caching techniques for distributed social networks.",
                    "An efficient and trustworthy P2P and social network integrated file sharing system.",
                    "On churn and communication delays in social overlays.",
                    "Analysis of data availability in F2F storage systems: When correlations matter.",
                    "A measurement study of the Wuala on-line storage service.",
                    "Tradeoffs in cloud and peer-assisted content delivery systems.",
                    "Peer-assisted distribution of User Generated Content."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "11. P2P 2011",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2011",
                "sub_name": "2011 IEEE International Conference on Peer-to-Peer Computing, P2P 2011, Kyoto, Japan, August 31 - September 2, 2011.",
                "count": 49,
                "papers": [
                    "Passive characterization of sopcast usage in residential ISPs.",
                    "Efficient bandwidth estimation for peer-to-peer systems.",
                    "Exploring peer heterogeneity: Towards understanding and application.",
                    "Content pollution quantification in large P2P networks : A measurement study on KAD.",
                    "Towards a comparative performance evaluation of overlays for Networked Virtual Environments.",
                    "Autonomous detection of connectivity.",
                    "Network aware P2P multimedia streaming: Capacity or locality?",
                    "Here is your peer! - Locating peers on a regional level with network coordinates.",
                    "Flexible routing tables: Designing routing algorithms for overlays based on a total order on a routing table set.",
                    "Sub-second lookups on a large-scale Kademlia-based overlay.",
                    "Adaptive load balancing in KAD.",
                    "Towards optimal keyword-based content dissemination in DHT-based P2P networks.",
                    "Byzantine fault tolerance of regenerating codes.",
                    "Enforcing fairness in P2P storage systems using asymmetric reciprocal exchanges.",
                    "Data transfer scheduling for P2P storage.",
                    "Efficient peer-to-peer backup services through buffering at the edge.",
                    "Large scale P2P discovery middleware demonstration.",
                    "PeerfactSim.KOM: A P2P system simulator - Experiences and lessons learned.",
                    "Cooperative session control over core and overlay networks for a new generation network.",
                    "MONAC: SNS message dissemination over smartphone-based DTN and cloud.",
                    "PPVA: A universal and transparent P2SP accelerator for online video sharing.",
                    "In-network P2P packet cache processing using scalable P2P network test platform.",
                    "Tribler: Search and stream.",
                    "My3: A highly-available P2P-based online social network.",
                    "A 3D visualization system for structured overlays.",
                    "An optimal topology for a static P2P live streaming network: Analysis and real-world results.",
                    "Live seeding: Performance bounds of seeders for P2P live streaming.",
                    "Efficient stereo segment scheduling in peer-to-peer 3D/multi-view video streaming.",
                    "Bandwidth allocation in BitTorrent-like VoD systems under flashcrowds.",
                    "Hose rate control for P2P-TV streaming systems.",
                    "Measurements on the spotify peer-assisted music-on-demand streaming system.",
                    "PcubeCast: A novel peer-assisted live streaming system.",
                    "P2P live streams of 2010 NHK National School Chorus Contest.",
                    "Measuring BitTorrent swarms beyond reach.",
                    "Unrevealing the structure of live BitTorrent swarms: Methodology and analysis.",
                    "Identifying, analyzing, and modeling flashcrowds in BitTorrent.",
                    "Cloudy weather for P2P, with a chance of gossip.",
                    "Nemor: A congestion-aware protocol for anonymous peer-based content distribution.",
                    "Persistent naming for P2P Web hosting.",
                    "Fast download but eternal seeding: The reward and punishment of Sharing Ratio Enforcement.",
                    "Efficient and highly available peer discovery: A case for independent trackers and gossiping.",
                    "Inter-swarm resource allocation in BitTorrent communities.",
                    "B-Tracker: Improving load balancing and efficiency in distributed P2P trackers.",
                    "On the impact of uTP on BitTorrent completion time.",
                    "Inferring peer centrality in socially-informed peer-to-peer systems.",
                    "SocialHelpers: Introducing social trust to ameliorate churn in P2P reputation systems.",
                    "Efficient dissemination in decentralized social networks.",
                    "An empirical study of availability in friend-to-friend storage systems.",
                    "Pitfalls of re-sharing BitTorrent contents: The failure of daily pattern."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "10. P2P 2010",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2010",
                "sub_name": "IEEE Tenth International Conference on Peer-to-Peer Computing, P2P 2010, Delft, The Netherlands, 25-27 August 2010.",
                "count": 45,
                "papers": [
                    "Online Data Backup: A Peer-Assisted Approach.",
                    "PeerDedupe: Insights into the Peer-Assisted Sampling Deduplication.",
                    "Optimizing Near Duplicate Detection for P2P Networks.",
                    "Availability and Redundancy in Harmony: Measuring Retrieval Times in P2P Storage Systems.",
                    "Analyzing the DC File Sharing Network.",
                    "Spring for Vivaldi -- Orchestrating Hierarchical Network Coordinates.",
                    "Measurement and Analysis of BitTorrent Traffic in Mobile WiMAX Networks.",
                    "Do BitTorrent-Like VoD Systems Scale under Flash-Crowds?",
                    "Waiting for Anonymity: Understanding Delays in the Tor Overlay.",
                    "Autonomous NAT Traversal.",
                    "Verifiable Encryption for P2P Block Exchange.",
                    "The Impact of Caching on BitTorrent-Like Peer-to-Peer Systems.",
                    "Unraveling BitTorrent's File Unavailability: Measurements and Analysis.",
                    "Can P2P-Users Benefit from Locality-Awareness?",
                    "On Tracker Selection for Peer-to-Peer Traffic Locality.",
                    "Cryptographically Enforced Permissions for Fully Decentralized File Systems.",
                    "Distributed Access Enforcement in P2P Networks: When Privacy Comes into Play.",
                    "On the Privacy of Peer-Assisted Distribution of Security Patches.",
                    "SPADS: Publisher Anonymization for DHT Storage.",
                    "A QoE-Aware P2P Streaming System Using Scalable Video Coding.",
                    "Network Friendly P2P-TV: The Napa-Wine Approach.",
                    "Online Video Using BitTorrent and HTML5 Applied to Wikipedia.",
                    "WhatsUp: News, From, For, Through, Everyone.",
                    "Integrated Measurement and Analysis of P2P Streaming Traffic by the Java Tool Atheris.",
                    "radioActive WiFi Sharing for Autonomous Peers.",
                    "Affluenza: Towards Universal Churn Generation.",
                    "LifeSocial.KOM: A P2P-Based Platform for Secure Online Social Networks.",
                    "BitMON: A Tool for Automated Monitoring of the BitTorrent DHT.",
                    "Performance Evaluation of Peer-to-Peer Gaming Overlays.",
                    "Towards Plugging Privacy Leaks in the Domain Name System.",
                    "Hivory: Range Queries on Hierarchical Voronoi Overlays.",
                    "ASAP Top-k Query Processing in Unstructured P2P Systems.",
                    "Local Access to Sparse and Large Global Information in P2P Networks: A Case for Compressive Sensing.",
                    "Technical Assessment and Deployment Considerations of Economic Traffic Management Mechanisms.",
                    "Can Realistic BitTorrent Experiments Be Performed on Clusters?",
                    "Understanding Peer Exchange in BitTorrent Systems.",
                    "Measurements, Analysis and Modeling of Private Trackers.",
                    "Improving Accuracy and Coverage in an Internet-Deployed Reputation Mechanism.",
                    "QoE in Pull Based P2P-TV Systems: Overlay Topology Design Tradeoffs.",
                    "Spotify -- Large Scale, Low Latency, P2P Music-on-Demand Streaming.",
                    "Multi-Source Scheduling in Streaming Erasure-Coded Video over P2P Networks.",
                    "NAP: An Agent-Based Scheme on Reducing Churn-Induced Delays for P2P Live Streaming.",
                    "Boosting Gossip for Live Streaming.",
                    "IMP: ISP-Managed P2P.",
                    "Addressing the P2P Bootstrap Problem for Small Overlay Networks."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "9. P2P 2009",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2009",
                "sub_name": "Proceedings P2P 2009, Ninth International Conference on Peer-to-Peer Computing, 9-11 September 2009, Seattle, Washington, USA.",
                "count": 47,
                "papers": [
                    "An Efficient Distributed PKI for Structured P2P Networks.",
                    "Sorcery: Could We Make P2P Content Sharing Systems Robust to Deceivers?.",
                    "SyMon: Defending large structured P2P systems against Sybil Attack.",
                    "On Routing in Distributed Hash Tables: Is Reputation a Shelter from Malicious Behavior and Churn?.",
                    "Optimizing Capacity-Heterogeneous Unstructured P2P Networks for Random-Walk Traffic.",
                    "Imbuing Unstructured P2P Systems with Non-Intrusive Topology Awareness.",
                    "Virtual Direction Routing for Overlay Networks.",
                    "An Approximation Algorithm for Minimum-Delay Peer-to-Peer Streaming.",
                    "ModelNet: Towards a DataCenter Emulation Environment.",
                    "PlanetLab - P2P Testing in the Wild.",
                    "PlanetSim: An Extensible Simulation Tool for Peer-to-Peer Networks and Services.",
                    "OverSim: A Scalable and Flexible Overlay Framework for Simulation and Real Network Applications.",
                    "Application Management and Visualization with Plush.",
                    "Building Distributed Systems Using Mace.",
                    "Building and Evaluating P2P Systems using the Kompics Component Framework.",
                    "SimGrid: a Generic Framework for Large-Scale Distributed Experiments.",
                    "ProtoPeer: Distributed Systems Prototyping Toolkit.",
                    "PeerSim: A Scalable P2P Simulator.",
                    "Robust Lifetime Measurement in Large-Scale P2P Systems with Non-Stationary Arrivals.",
                    "ID Repetition in Kad.",
                    "Why Kad Lookup Fails.",
                    "QPM: Phonetic Aware P2P Searching.",
                    "Measuring the Cost of Online Load-Balancing in Distributed Range-Queriable Systems.",
                    "On Tracking Freeriders in Gossip Protocols.",
                    "Towards Robust Peer Counting.",
                    "Gossip-based Topology Inference for Efficient Overlay Mapping on Data Centers.",
                    "A Trusted Infrastructure for P2P-based Marketplaces.",
                    "Embedding Network Coordinates into the Heart of Distributed Hash Tables.",
                    "Efficient and Effective File Replication in Structured P2P File Sharing Systems.",
                    "SODA: Towards a Framework for Self Optimization via Demand Adaptation in Peer-to-Peer Networks.",
                    "Traffic Localization for P2P-Applications: The ALTO Approach.",
                    "Badumna Network Suite: A Decentralized Network Engine for Massively Multiplayer Online Applications.",
                    "Analysis of Failure Correlation Impact on Peer-to-Peer Storage Systems.",
                    "Long-term Digital Archiving Based on Selection of Repositories Over P2P Networks.",
                    "A Scalable Interest-oriented Peer-to-Peer Pub/Sub Network.",
                    "A Local Distributed Peer-to-Peer Algorithm Using Multi-Party Optimization Based Privacy Preservation for Data Mining Primitive Computation.",
                    "Modeling and Analysis of Bandwidth-Inhomogeneous Swarms in BitTorrent.",
                    "The Impact of NAT on BitTorrent-like P2P Systems.",
                    "prTorrent: On Establishment of Piece Rarity in the BitTorrent Unchoking Algorithm.",
                    "Connectivity Properties of Mainline BitTorrent DHT Nodes.",
                    "Exploring the Optimal Chunk Selection Policy for Data-Driven P2P Streaming Systems.",
                    "Phosphite: Guaranteeing Out of Order Download in P2P Video-on-Demand.",
                    "A Flexible Divide-And-Conquer Protocol for Multi-View Peer-to-Peer Live Streaming.",
                    "Pushing the Performance of Biased Neighbor Selection through Biased Unchoking.",
                    "Monitoring and Management of Structured Peer-to-Peer Systems.",
                    "Sherlock: A Framework for P2P Traffic Analysis.",
                    "GO: Platform Support For Gossip Applications."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "8. P2P 2008",
        "info": "Aachen, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2008",
                "sub_name": "Proceedings P2P'08, Eighth International Conference on Peer-to-Peer Computing, 8-11 September 2008, Aachen, Germany.",
                "count": 45,
                "papers": [
                    "Transaction Rate Limiters for Peer-to-Peer Systems.",
                    "Incentives Against Hidden Action in QoS Overlays.",
                    "Securing Peer-to-Peer Content Sharing Service from Poisoning Attacks.",
                    "Tempering Kademlia with a Robust Identity Based System.",
                    "AREX: An Adaptive System for Secure Resource Access in Mobile P2P Systems.",
                    "Popularity-Aware Prefetch in P2P Range Caching.",
                    "Query Workload Driven Summarization for P2P Query Routing.",
                    "Chordella - A Hierarchical Peer-to-Peer Overlay Implementation for Heterogeneous, Mobile Environments.",
                    "IgorFs: A Distributed P2P File System.",
                    "Visualizing Transactional Algorithms for DHTs.",
                    "A NAT Traversal Mechanism for Peer-To-Peer Networks.",
                    "P2P Information Retrieval and Filtering with MAPS.",
                    "Hierarchical Codes: How to Make Erasure Codes Attractive for Peer-to-Peer Storage Systems.",
                    "EAD: An Efficient and Adaptive Decentralized File Replication Algorithm in P2P File Sharing Systems.",
                    "Flexible Routing in Grouped DHTs.",
                    "Support for Concept Hierarchies in DHTs.",
                    "Towards an Incentive Mechanism for Peer-to-Peer Multimedia Live Streaming Systems.",
                    "A P2P-Based Architecture for Secure Software Delivery Using Volunteer Assistance.",
                    "Playing with the Bandwidth Conservation Law.",
                    "Proactive Role Discovery in Mediator-Free Environments.",
                    "Ad Hoc Limited Scale-Free Models for Unstructured Peer-to-Peer Networks.",
                    "Cross-Layer Aspects of Peer-to-Peer Overlays on IP Platforms of Network Providers.",
                    "Peer-to-Peer Traffic in Operator Networks.",
                    "Towards P2P Technologies for the Control of Electrical Power Systems.",
                    "Piki - A Peer-to-Peer based Wiki Engine.",
                    "LiveShift: Peer-to-Peer Live Streaming with Distributed Time-Shifting.",
                    "P2P Experimentations with Splay: From Idea to Deployment Results in 30 min.",
                    "ProtoPeer: From Simulation to Live Deployment in One Step.",
                    "Faster Content Access in KAD.",
                    "Multidimensional Range Query and Load Balancing in Wireless Ad Hoc and Sensor Networks.",
                    "CYBER: A CommunitY-Based sEaRch engine.",
                    "Designs and Evaluation of a Tracker in P2P Networks.",
                    "Scalable Resource Annotation in Peer-to-Peer Grids.",
                    "On the Trade-Off between Efficiency and Congestion in Location-Aware Overlay Networks - Example of a Vertical Handover Support System.",
                    "pSense - Maintaining a Dynamic Localized Peer-to-Peer Structure for Position Based Multicast in Games.",
                    "Peer-to-Peer Secure Multi-party Numerical Computation.",
                    "CliqueStream: An Efficient and Fault-Resilient Live Streaming Network on a Clustered Peer-to-Peer Overlay.",
                    "A Bandwidth-Aware Scheduling Strategy for P2P-TV Systems.",
                    "Is There a Future for Mesh-Based live Video Streaming?",
                    "Free-Riding, Fairness, and Firewalls in P2P File-Sharing.",
                    "On the Impact of Greedy Strategies in BitTorrent Networks: The Case of BitTyrant.",
                    "On Server Dimensioning for Hybrid P2P Content Distribution Networks.",
                    "On the Feasibility of Dynamic Superpeer Ratio Maintenance.",
                    "Embracing the Peer Next Door: Proximity in Kademlia.",
                    "Failure-Tolerant Overlay Trees for Large-Scale Dynamic Networks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "7. P2P 2007",
        "info": "Galway, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2007",
                "sub_name": "Seventh IEEE International Conference on Peer-to-Peer Computing (P2P 2007), September 2-5, 2007, Galway, Ireland.",
                "count": 37,
                "papers": [
                    "Rescuing Tit-for-Tat with Source Coding.",
                    "Bounds on the Performance of P2P Networks Using Tit-for-Tat Strategies.",
                    "Modelling Real P2P Networks: The Effect of Altruism.",
                    "An Information-Theoretic Framework for Analyzing Leak of Privacy in Distributed Hash Tables.",
                    "Attacking a Swarm with a Band of Liars: evaluating the impact of attacks on BitTorrent.",
                    "A Trust-Based Exchange Framework for Multiple Services in P2P Systems.",
                    "Reputation Systems for Fighting Pollution in Peer-to-Peer File Sharing Systems.",
                    "A Feasibility Study on Defending Against Ultra-Fast TopologicalWorms.",
                    "Completeness Estimation of Range Queries in Structured Overlays.",
                    "Predicting Query Duplication with Box-Jenkins Models and Its Applications.",
                    "Globase.KOM - A P2P Overlay for Fully Retrievable Location-based Search.",
                    "Price of Structured Routing and Its Mitigation in P2P Systems under Churn.",
                    "An Efficient Eigenvalue-based P2P XML Routing Framework.",
                    "On Routing in Distributed Hash Tables.",
                    "An End-to-End Solution to Scalable Unstructured P2P Networking.",
                    "Handling Network Partitions and Mergers in Structured Overlay Networks.",
                    "Cooperative Keep-Alives: An Efficient Outage Detection Algorithm for P2P Overlay Networks.",
                    "A Data Placement Scheme with Time-Related Model for P2P Storages.",
                    "W*-Grid: A Robust Decentralized Cross-layer Infrastructure for Routing and Multi-Dimensional Data Management in Wireless Ad-Hoc Sensor Networks.",
                    "Distributed, Automatic File Description Tuning in Peer-to-Peer File-Sharing Systems.",
                    "Impact of Vertical Handovers on Cooperative Content Distribution Systems.",
                    "A DHT-based Infrastructure for Content-based Publish/Subscribe Services.",
                    "Grid Resource Scheduling with Gossiping Protocols.",
                    "Self-Stabilization in Preference-Based Networks.",
                    "Peer-to-Peer Rating.",
                    "Mapping Small Worlds.",
                    "Fabric: Synergistic Proximity Neighbour Selection Method.",
                    "The BitCod Client: A BitTorrent Clone using Network Coding.",
                    "P2P-IM: A P2P Presence System for the Internet.",
                    "Private Peer-to-Peer Overlay for Real-Time Monitoring of a Deployed Internet-Scale Peer-to-Peer Overlay.",
                    "The Design and Evaluation of Techniques for Route Diversity in Distributed Hash Tables.",
                    "How stable are large superpeer networks against attack?",
                    "A P2PSIP Demonstrator Powered by OverSim.",
                    "Running the Windows P2P Infrastructure on Mobile Phones.",
                    "PEPINO: PEer-to-Peer network INspectOr.",
                    "The Effect of Viral Media on Business Usage of P2P.",
                    "PISA: P2P Wi-Fi Internet Sharing Architecture."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "6. P2P 2006",
        "info": "Cambridge, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2006",
                "sub_name": "Sixth IEEE International Conference on Peer-to-Peer Computing (P2P 2006), 2-4 October 2006, Cambridge, United Kingdom.",
                "count": 39,
                "papers": [
                    "eQuus: A Provably Robust and Locality-Aware Peer-to-Peer System.",
                    "GosSkip, an Efficient, Fault-Tolerant and Self Organizing Overlay Using Gossip-based Construction and Skip-Lists Principles.",
                    "2Fast : Collaborative Downloads in P2P Networks.",
                    "Comparison of Robust Cooperation Strategies for P2P Content Distribution Networks with Multiple Source Download.",
                    "Bandwidth Trading in Unstructured P2P Content Distribution Networks.",
                    "Cuckoo Ring: BalancingWorkload for Locality Sensitive Hash.",
                    "The Effect of Replica Placement on Routing Robustness in Distributed Hash Tables.",
                    "Multi-Dimensional Prefix Search in P2P Networks.",
                    "Route Fingerprinting in Anonymous Communications.",
                    "Schema Caching for Improved XML Query Processing in P2P Systems.",
                    "Solving Overlay Mismatching of Unstructured P2P Networks using Physical Locality Information.",
                    "Tag Indexed DHT for Scalable Search Infrastructure in Social NetworkApplications.",
                    "Cost-Aware Processing of Similarity Queries in Structured Overlays.",
                    "Conjunction Dysfunction: The Weakness of Conjunctive Queries in Peer-to-Peer File-sharing Systems.",
                    "Comparison of Image Similarity Queries in P2P Systems.",
                    "Dynamic Prefix Tree for Service Discovery within Large Scale Grids.",
                    "Ordered Slicing of Very Large-Scale Overlay Networks.",
                    "Implicit Group Messaging over Peer-to-Peer Networks.",
                    "Internet-Scale Storage Systems under Churn -- A Study of the Steady-State using Markov Models.",
                    "State Aware Data Dissemination over Structured Overlays.",
                    "Peer-to-Peer Error Recovery for Hybrid Satellite-Terrestrial Networks.",
                    "Risk Driven Semantic P2P Service Retrieval.",
                    "Computational Puzzles as Sybil Defenses.",
                    "Certificate-based Access Control in Pure P2P Networks.",
                    "Defense against Intrusion in a Live Streaming Multicast System.",
                    "A Reciprocation-Based Economy for Multiple Services in Peer-to-Peer Grids.",
                    "Towards Scalable Mobility in Distributed Hash Tables.",
                    "W-Grid: a Cross-Layer Infrastructure for Multi-Dimensional Indexing, Querying and Routing in Wireless Ad-Hoc and Sensor Networks.",
                    "Video Streaming on the Internet Using Split and Merge Multicast.",
                    "P^22P - Prepaid Peer-to-Peer Services.",
                    "A Middleware-based Telecom Service Architecture for Peer-to-peer Networks.",
                    "Internet Scale Testing of PNRP Using WiDS Network Simulator.",
                    "Experiences Developing Mobile P2P Applications with LightPeers.",
                    "Cost-Based Analysis of Hierarchical DHT Design.",
                    "Self-Organizing Content Distribution in a Data Indexed DHT Network.",
                    "Analytical Study on Improving DHT Lookup Performance under Churn.",
                    "Scalable Blind Search and Broadcasting in Peer-to-Peer Networks.",
                    "Reinforcement Learning for Query-Oriented Routing Indices in Unstructured Peer-to-Peer Networks.",
                    "The Orchard Algorithm: P2P Multicasting without Free-Riding."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "5. P2P 2005",
        "info": "Konstanz, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2005",
                "sub_name": "Fifth IEEE International Conference on Peer-to-Peer Computing (P2P 2005), 31 August - 2 September 2005, Konstanz, Germany.",
                "count": 36,
                "papers": [
                    "Message from the Conference Chairs.",
                    "Organization Committee.",
                    "Proximity Neighbor Selection for a DHT in Wireless Multi-Hop Networks.",
                    "The Essence of P2P: A Reference Architecture for Overlay Networks.",
                    "On Overlay Schemes to Support Point-in-Range Queries for Scalable Grid Resource Discovery.",
                    "Result Verification and Trust-Based Scheduling in Peer-to-Peer Grids.",
                    "Self-Stabilizing Structured Ring Topology P2P Systems.",
                    "Cyclone: A Novel Design Schema for Hierarchical DHTs.",
                    "Range Queries in Trie-Structured Overlays.",
                    "Techniques for Efficient Routing and Load Balancing in Content-Addressable Networks.",
                    "Elders Know Best - Handling Churn in Less Structured P2P Systems.",
                    "Chord on Demand.",
                    "Quantifying Agent Strategies under Reputation.",
                    "Peer-to-Peer Direct Sales.",
                    "Trusted Computing: Providing Security for Peer-to-Peer Networks.",
                    "ARA: A Robust Audit to Prevent Free-Riding in P2P Networks.",
                    "Evaluation of Mutual Trust during Matchmaking.",
                    "T-DHT: Topology-based Distributed Hash Tables.",
                    "On the Challenge of Assessing Overlay Topology Adaptation Mechanisms.",
                    "P2P-Based Grid Architecture for Homology Searching.",
                    "Keyword Searching in Hypercubic Manifolds.",
                    "Heterogeneity-Aware Distributed Access Structure.",
                    "Toward Overlay Network Symbiosis.",
                    "Load Balancing Issues in Super-Peer-based Publish/Subscribe Digital Libraries.",
                    "Peer-to-Peer Networks Based on Hierarchies of Trust.",
                    "Search with Probabilistic Guarantees in Unstructured Peer-to-Peer Networks.",
                    "Supporting Multi-Dimensional Range Queries in Peer-to-Peer Systems.",
                    "Finding Rare Data Objects in P2P File-Sharing Systems.",
                    "An Effective Resource Description Based Approach to Find Similar Peers.",
                    "Randomized Protocols for Duplicate Elimination in Peer-to-Peer Storage Systems.",
                    "Presence-Based Availability and P2P Systems.",
                    "Video Management in Peer-to-Peer Systems.",
                    "Efficient Query Evaluation on Large Textual Collections in a Peer-to-Peer Environment.",
                    "Dynamic and Fault-tolerant Cluster Management.",
                    "Improving Service Performance through Object Replication in Middleware: A Peer-to-Peer Approach.",
                    "Incentives for P2P Fair Resource Sharing."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "4. P2P 2004",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2004",
                "sub_name": "4th International Conference on Peer-to-Peer Computing (P2P 2004), 15-17 August 2004, Zurich, Switzerland.",
                "count": 42,
                "papers": [
                    "Percolation Search in Power Law Networks: Making Unstructured Peer-to-Peer Networks Scalable.",
                    "Cache Updates in a Peer-to-Peer Network of Mobile Agents.",
                    "On the Correctness of Query Results in XML P2P Databases.",
                    "Information Leak in the Chord Lookup Protocol.",
                    "On the Security of Polling Protocols in Peer-to-Peer Systems.",
                    "PKI-Based Security for Peer-to-Peer Information Sharing.",
                    "Adaptive Peer-to-Peer Topologies.",
                    "Update Propagation through Replica Chain in Decentralized and Unstructured P2P Systems.",
                    "PeerStore: Better Performance by Relaxing in Peer-to-Peer Backup.",
                    "Improving Bandwidth Efficiency of Peer-to-Peer Storage.",
                    "Erasure Code Replication Revisited.",
                    "P2P Scrabble. Can P2P Games Commence?",
                    "Collaborative Automated Trust Negotiation in Peer-to-Peer Systems.",
                    "SeAl: Managing Accesses and Data in Peer-to-Peer Sharing Networks.",
                    "Reputation Management Framework and Its Use as Currency in Large-Scale Peer-to-Peer Networks.",
                    "A Placement Scheme for Peer-to-Peer Networks Based on Principles from Geometry.",
                    "Analysis and Application of Passive Peer Influence on Peer-to-Peer Inter-Domain Traffic.",
                    "From Selfish Nodes to Cooperative Networks -- Emergent Link-Based Incentives in Peer-to-Peer Networks.",
                    "On de Bruijn Routing in Distributed Hash Tables: There and Back Again.",
                    "Broose: A Practical Distributed Hashtable Based on the De-Bruijn Topology.",
                    "P2P-Based Collaborative Spam Detection and Filtering.",
                    "Semantic-Laden Peer-to-Peer Service Directory.",
                    "Cooperative Pull-Push Cycle for Searching a Hybrid P2P Network.",
                    "A Robust Protocol for Building Superpeer Overlay Topologies.",
                    "Constructing a Balanced, (log(N)/loglog(N))-Diameter Super-Peer Topology for Scalable P2P Systems.",
                    "ICN: Interest-Based Clustering Network.",
                    "Aggregating Information in Peer-to-Peer Systems for Improved Join and Leave.",
                    "Reliable Peer-to-Peer End System Multicasting through Replication.",
                    "The Different Dimensions of Dynamicity.",
                    "Peer-to-Peer Security in Mobile Devices: A User Perspective.",
                    "Distributed Search in P2P Networks through Secure-Authenticated Content Management Systems (CMSs).",
                    "A Framework for Testing Distributed Systems.",
                    "P2P-4-DL: Digital Library over Peer-to-Peer.",
                    "Highways: Proximity Clustering for Scalable Peer-to-Peer Network.",
                    "Building Adaptive Peer-To-Peer Systems.",
                    "Semantic Driven Hashing (SDH): An Ontology-Based Search Scheme for the Semantic Aware Network (SA Net).",
                    "P2P Applications Using the Semantic Information Oriented Network.",
                    "Latency Model of a Distributed Hash Table with Big Routing Table.",
                    "A Distributed and Measurement-Based Framework against Free Riding in Peer-to-Peer Networks.",
                    "Performance of Pastry in a Heterogeneous System.",
                    "PROST: A Programmable Structured Peer-to-Peer Overlay Network.",
                    "A Framework for Developing Reflective and Dynamic P2P Networks (RaDP2P)."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "3. P2P 2003",
        "info": "Linköping, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2003",
                "sub_name": "3rd International Conference on Peer-to-Peer Computing (P2P 2003), 1-3 September 2003, Linköping, Sweden.",
                "count": 39,
                "papers": [
                    "Grid Security: Lessons for Peer-to-Peer Systems.",
                    "Enterprise Strength Security on a JXTA P2P Network.",
                    "Dynamic Distributed Overlay Networking of IP Multicast.",
                    "Role of P2P in Complex Disconnected Networks: Applications to Mobile e-Business and Enterprise Computing.",
                    "Range Addressable Network: A P2P Cache Architecture for Data Ranges.",
                    "The Deployment of Cache Servers in P2P Networks for Improved Performance in Content-Delivery.",
                    "Peer-to-Peer Spatial Queries in Sensor Networks.",
                    "NanoPeer Networks and P2P Worlds.",
                    "A Game Theoretic Framework for Incentives in P2P Systems.",
                    "The Effectiveness of Realistic Replication Strategies on Quality of Availability for Peer-to-Peer Systems.",
                    "Connectivity Based Node Clustering in Decentralized Peer-to-Peer Networks.",
                    "Dynamic Networking Refinement in Distributed Systems.",
                    "A Transpositional Redundant Data Update Algorithm for Growing Server-Less Video Streaming Systems.",
                    "Scalable and Continuous Media Streaming on Peer-to-Peer Networks.",
                    "Adaptive Probabilistic Search for Peer-to-Peer Networks.",
                    "Analysis on Greedy-Search Based Service Location in P2P Service Grid.",
                    "Integrating Semantics-Based Access Mechanisms with P2P File Systems.",
                    "Establishing Trust in Distributed Storage Providers.",
                    "Identity Crisis: Anonymity vs. Reputation in P2P Systems.",
                    "TrustMe: Anonymous Management of Trust Relationships in Decentralized P2P Systems.",
                    "Trust and Reputation Model in Peer-to-Peer Networks.",
                    "The Costs of Using JXTA.",
                    "A Lightweight Personal Grid Using a Supernode Network.",
                    "A Distributed Rendering Environment for Massive Data on Computational Grids.",
                    "Secure and Resilient Peer-to-Peer E-Mail: Design and Implementation.",
                    "Structuring Peer-2-Peer Communities.",
                    "Multicast in DKS(N, k, f) Overlay Networks.",
                    "Peer-to-Peer Wireless LAN Consortia: Economic Modeling and Architecture.",
                    "Token-Based Accounting and Distributed Pricing to Introduce Market Mechanisms in a Peer-to-Peer File Sharing Scenario.",
                    "AGnuS: The Altruistic Gnutella Server.",
                    "Search Performance Analysis in Peer-to-Peer Networks.",
                    "Share It! by Bringing P2P into the TV-Domain.",
                    "An Architecture for Peer-to-Peer Economies.",
                    "Applications of an Advanced Peer-to-Peer Platform.",
                    "3LS - A Peer-to-Peer Network Simulator.",
                    "Expeerience: A Jxta Middleware for Mobile Ad-Hoc Networks.",
                    "Efa: An Efficient Content Routing Algorithm in Large Peer-to-Peer Overlay Networks.",
                    "Reducing Maintenance Overhead in DHT Based Peer-to-Peer Algorithms.",
                    "Efficient, Proximity-Aware Load Balancing for Structured P2P Systems."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "2. P2P 2002",
        "info": "Linköping, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2002",
                "sub_name": "2nd International Conference on Peer-to-Peer Computing (P2P 2002), 5-7 September 2002, Linköping, Sweden.",
                "count": 29,
                "papers": [
                    "Internet Distributed Computing: The Intersection of Web Services, P2P, and Grid Computing.",
                    "Grid Computing in the Enterprise with the UD MetaProcessor.",
                    "Transforming the Reliability, Security and Scalability of IT Communications through the Pervasive Deployment of Serverless Software Infrastructur.",
                    "Grid Economy Comes of Age: Emerging Gridbus Tools for Service-Oriented Cluster and Grid Computing.",
                    "A Tribute to Gene Ka.",
                    "The Ubiquitous Service-Oriented Network (USON) - An Approach for a Ubiquitous World Based on P2P Technology.",
                    "NetProber: A Component for Enhancing Efficiency of Overlay Networks in P2P Systems.",
                    "Scalable, Efficient Range Queries for Grid Information Services.",
                    "Building a P2P Forum System with JXTA.",
                    "The Multi-Ring Topology - High-Performance Group Communication in Peer-to-Peer Networks.",
                    "eComP: An Architecture that Supports P2P Networking Among Ubiquitous Computing Devices.",
                    "GISP: Global Information Sharing Protocol - A Distributed Index for Peer-to-Peer.",
                    "A Distributed Search Service for Peer-to-Peer File Sharing in Mobile Applications.",
                    "Coordinated Learning to Support Resource Management in Computational Grids.",
                    "Request Algorithms in Freenet-Style Peer-to-Peer Systems.",
                    "Integrating Peer-to-Peer Networking and Computing in the AgentScape Framework.",
                    "A Scalable and Ontology-Based P2P Infrastructure for Semantic Web Services.",
                    "Why Peer-to-Peer (P2P) Does Scale: An Analysis of P2P Traffic Patterns.",
                    "Multishelf: An Experiment in Peer-to-Peer Infomediation.",
                    "Market Structures in Peer Computation Sharing.",
                    "Intelligent Software Delivery Using P2P.",
                    "Rhubarb: A Tool for Developing Scalable and Secure Peer-to-Peer Applications.",
                    "Evolving the ASP Business Model: Web Service Provision in the Grid Era.",
                    "Adaptability in Component-Based Peer-to-Peer Applications.",
                    "A Semantical and Implementative Comparison of File Sharing Peer-to-Peer Applications.",
                    "Towards a Hierarchical, Semantic Peer-to-Peer Topology.",
                    "Advanced Peer-to-Peer Network Platform for Various Services - SIONet (Semantic Information Oriented Network).",
                    "Using P2P Techniques for Content Distribution Internetworking: A Research Proposal.",
                    "Dependability Properties of P2P Architectures."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "1. P2P 2001",
        "info": "Linköping, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/p2p/2001",
                "sub_name": "1st International Conference on Peer-to-Peer Computing (P2P 2001), 27-29 August 2001, Linköping, Sweden.",
                "count": 17,
                "papers": [
                    "Peer-to-Peer Implementations.",
                    "Introduction to Gnougat.",
                    "Technologies for Sharing and Collaborating on the Net.",
                    "Firewalls in a P2P World.",
                    "Search in JXTA and Other Distributed Networks.",
                    "Breaking the Server and Data Communications Barrier With Serverless Guaranteed Quality of Service(GQoS)Compliant Communications.",
                    "Scalable and Secure Peer-to-Peer Systems with Support for QoS.",
                    "Peer to peer streaming media delivery.",
                    "Peer-to-Peer Mobile Network Architecture.",
                    "Towards a Content-based Aggregation Network.",
                    "An XML-based Middleware for Peer-to-Peer computing.",
                    "When Peer-to-Peer comes Face-to-Face: Collaborative Peer-to-Peer Computing in Mobile Ad hoc Networks.",
                    "Getting the Most from Accountability in P2P.",
                    "An Initial Approach of a Scalable Multicast-Based Pure Peer-to-Peer System.",
                    "Peer-to-Peer Architecture Case Study: Gnutella Network.",
                    "A Definition of Peer-to-Peer Networking for the Classification of Peer-to-Peer Architectures and Applications.",
                    "Peering the Smart Homes."
                ]
            }
        ]
    }
]