[
    {
        "name": "PPNA",
        "year": "2022",
        "info": "Volume 15: 2022",
        "count": 78,
        "papers": [
            "Determination of energy efficient optimal sojourn location of mobile sinks in clustered corona-based wireless sensor networks.",
            "Decentralized access control technique with multi-tier authentication of user for cloud storage.",
            "An improved k-angle coverage algorithm for multimedia wireless sensor networks based on two-layer tabu search.",
            "A novel hierarchical fault management framework for wireless sensor networks: HFMF.",
            "Double agents-DQL based D2D computing-offloading for SHVC.",
            "Enabling rank-based distribution of microservices among containers for green cloud computing environment.",
            "Robustness against fraudulent activities of a blockchain-based online review system.",
            "A two-phase fuzzy based access network selection scheme for vehicular ad hoc networks.",
            "The reliable routing for software-defined vehicular networks towards beyond 5G.",
            "Machine-learning-based cache partition method in cloud environment.",
            "MINAD: Multi-inputs Neural Network based on Application Structure for Android Malware Detection.",
            "Distributed Address Table (DAT): A Decentralized Model for End-to-End Communication in IoT.",
            "Joint computation offloading and deployment optimization in multi-UAV-enabled MEC systems.",
            "Cryptographically secure privacy-preserving authenticated key agreement protocol for an IoT network: A step towards critical infrastructure protection.",
            "Analytical modelling of false blocking problem in wireless ad hoc networks.",
            "An OLSR-based Geocast Routing Protocol for Vehicular Ad Hoc Networks.",
            "Efficient topology control of blockchain peer to peer network based on SDN paradigm.",
            "Clover: An anonymous transaction relay protocol for the bitcoin P2P network.",
            "Continuous improvement of script-driven verifiable random functions for reducing computing power in blockchain consensus protocols.",
            "Deep action: A mobile action recognition framework using edge offloading.",
            "SCMP-V: A secure multiple relays cooperative downloading scheme with privacy preservation in VANETs.",
            "LocTrust: A local and global consensus-combined trust model in MANETs.",
            "MPLDS: An integration of CP-ABE and local differential privacy for achieving multiple privacy levels data sharing.",
            "A new fog-based routing strategy (FBRS) for vehicular ad-hoc networks.",
            "AToM: Active topology monitoring for the bitcoin peer-to-peer network.",
            "Energy aware MAC protocol with mobility management in wireless body area network.",
            "Trusted resource allocation based on proof-of-reputation consensus mechanism for edge computing.",
            "Obfuscation-based location privacy-preserving scheme in cloud-enabled internet of vehicles.",
            "A hybrid approach towards reduced checkpointing overhead in cloud-based applications.",
            "An autonomous intrusion detection system for the RPL protocol.",
            "An improved secure certificateless public-key searchable encryption scheme with multi-trapdoor privacy.",
            "An efficient and privacy-preserving mutual authentication with key agreement scheme for telecare medicine information system.",
            "Application-aware QoS routing in SDNs using machine learning techniques.",
            "Privacy-preserving comparison based data aggregation protocols for mobile sensing.",
            "An uneven annulus sector grid-based energy-efficient multi-hop routing protocol for wireless sensor networks.",
            "A trust based energy and mobility aware routing protocol to improve infotainment services in VANETs.",
            "Fuzzy routing for in-network aggregation in wireless sensor networks.",
            "Clustered NOMA-based downlink adaptive relay coordinated transmission scheme for future 6G cell-free edge network.",
            "Big data analytics for critical information classification in online social networks using classifier chains.",
            "EMBOF-RPL: Improved RPL for early detection and isolation of rank attack in RPL-based internet of things.",
            "An optimal load balancing strategy for P2P network using chicken swarm optimization.",
            "Joint resource allocation for QoE optimization in large-scale NOMA-enabled multi-cell networks.",
            "Optimal hybrid heat transfer search and grey wolf optimization-based homomorphic encryption model to assure security in cloud-based IoT environment.",
            "BCPPT: A blockchain-based privacy-preserving and traceability identity management scheme for intellectual property.",
            "Cloudlet deployment for workflow applications in a mobile edge computing-wireless metropolitan area network.",
            "An intelligent traffic prediction framework for 5G network using SDN and fusion learning.",
            "Reducing the number of transaction messages in bitcoin.",
            "Joint pricing and task allocation for blockchain empowered crowd spectrum sensing.",
            "Developing a novel methodology for virtual machine introspection to classify unknown malware functions.",
            "Efficient path-sense transmission based on IoT system in opportunistic social networks.",
            "Towards intelligent P2P IPTV overlay management through classification of peers.",
            "Cryptocurrencies activity as a complex network: Analysis of transactions graphs.",
            "Joint optimization of task caching and computation offloading in vehicular edge computing.",
            "O2D: An uncooperative taxi-passenger's destination predication system via deep neural networks.",
            "SynergyGrids: blockchain-supported distributed microgrid energy trading.",
            "Reputation management in vehicular network using blockchain.",
            "A privacy-preserving multi-agent updating framework for self-adaptive tree model.",
            "EICache: A learning-based intelligent caching strategy in mobile edge computing.",
            "100+ FPS detector of personal protective equipment for worker safety: A deep learning approach for green edge computing.",
            "EM_WOA: A budget-constrained energy consumption optimization approach for workflow scheduling in clouds.",
            "TontineCoin: Survivor-based Proof-of-Stake.",
            "A survey on security in consensus and smart contracts.",
            "Energy-effective artificial internet-of-things application deployment in edge-cloud systems.",
            "Robust multi-agent reinforcement learning for noisy environments.",
            "Adaptive SSO based node selection for partial charging in wireless sensor network.",
            "Updatable privacy-preserving itK-nearest neighbor query in location-based s-ervice.",
            "Understanding MEC empowered vehicle task offloading performance in 6G networks.",
            "An efficient data collection using wireless sensor networks and internet of things to monitor the wild animals in the reserved area.",
            "Performance analysis of PoUW consensus mechanism: Fork probability and throughput.",
            "Energy-efficient client selection in federated learning with heterogeneous data on edge.",
            "Blockchain-based trust management for verifiable time synchronization service in IoT.",
            "A secure IoT-based micro-payment protocol for wearable devices.",
            "A resource allocation scheme for D2D communications with unknown channel state information.",
            "Making resource adaptive to federated learning with COTS mobile devices.",
            "EEOMA: End-to-end oriented management architecture for 6G-enabled drone communications.",
            "An energy balanced and nodes aware routing protocol for energy harvesting wireless sensor networks.",
            "Relay selection and power allocation for energy-load efficient network-coded cooperative unicast D2D communications.",
            "An optimized architecture and algorithm for resource allocation in D2D aided fog computing."
        ]
    },
    {
        "name": "PPNA",
        "year": "2021",
        "info": "Volume 14: 2021",
        "count": 277,
        "papers": [
            "Performance evaluation of rate adaptation algorithms for seamless heterogeneous vehicular communications.",
            "An integrated service model to support user specific QoS routing in cognitive radio ad hoc network.",
            "Enhanced petri nets for traceability of food management using internet of things.",
            "A differential moth flame optimization algorithm for mobile sink trajectory.",
            "Markov transition and smart cache congestion control for IoT enabled wireless mesh networks.",
            "Location privacy-preserving in online taxi-hailing services.",
            "LKM-AMI: A Lightweight Key Management Scheme for Secure two Way Communications between Smart Meters and HAN Devices of AMI System in Smart Grid.",
            "Correction to: LKM-AMI: A Lightweight Key Management Scheme for Secure two Way Communications between Smart Meters and HAN Devices of AMI System in Smart Grid.",
            "Enhanced attribute based access control with secure deduplication for big data storage in cloud.",
            "Privacy preserving in indoor fingerprint localization and radio map expansion.",
            "On the issues of selective jamming in IEEE 802.15.4-based wireless body area networks.",
            "Performance analysis of heterogeneous cloud-edge services: A modeling approach.",
            "Energy-efficiency maximization in D2D-enabled vehicular communications with consideration of dynamic channel information and fairness.",
            "Distributed bandwidth selection approach for cooperative peer to peer multi-cloud platform.",
            "A scalable unsignalized intersection system for automated vehicles and semi-physical implementation.",
            "Optimal task partitioning, Bit allocation and trajectory for D2D-assisted UAV-MEC systems.",
            "Themis: An accountable blockchain-based P2P cloud storage scheme.",
            "Guest editorials: P2P computing for 5G, beyond 5G (B5G) networks and internet-of-everything (IoE).",
            "A review on resource allocation techniques in D2D communication for 5G and B5G technology.",
            "Peer to peer communication framework for 5G networks using Ambient Service.",
            "The efficacy of handoff strategy based spectrum allocation using TSB-MFO for D2D and CU communications.",
            "Dynamic Sectorization and parallel processing for device-to-device (D2D) resource allocation in 5G and B5G cellular network.",
            "Dual-branch SC wireless systems with HQAM for beyond 5G over η-μ fading channels.",
            "Deep learning based modulation classification for 5G and beyond wireless systems.",
            "Joint power optimization and scaled beamforming approach in B5G network based massive MIMO enabled HetNet with full-duplex small cells.",
            "Tracing of online assaults in 5G networks using dominance based rough set and formal concept analysis.",
            "Improved self-healing technique for 5G networks using predictive analysis.",
            "Security improvement in block chain technique enabled peer to peer network for beyond 5G and internet of things.",
            "BIDAPSCA5G: Blockchain based Internet of Things (IoT) device to device authentication protocol for smart city applications using 5G technology.",
            "A secure authentication scheme for IoT application in smart home.",
            "Efficient caching method in fog computing for internet of everything.",
            "An efficient distributed algorithm for target-coverage preservation in wireless sensor networks.",
            "A novel reputation incentive mechanism and game theory analysis for service caching in software-defined vehicle edge computing.",
            "Design and implementation of blockchain-based digital advertising media promotion system.",
            "Charging path optimization for wireless rechargeable sensor network.",
            "Simulation models for mobile-to-mobile channels with isotropic and nonisotropic scattering.",
            "SAES: A self-checking authentication scheme with higher efficiency and security for VANET.",
            "Multipath routing through the firefly algorithm and fuzzy logic in wireless sensor networks.",
            "A reliable peer-to-peer streaming protocol in low-capacity networks.",
            "Construction of multi-level data aggregation trees for energy efficiency and delivery delay in machine-to-machine communications.",
            "Integrating the device-to-device communication technology into edge computing: A case study.",
            "Developing new connectivity architectures for local sensing and control IoT systems.",
            "AC-RDV: a novel ant colony system for roadside units deployment in vehicular ad hoc networks.",
            "Bitcoin miners: Exploring a covert community in the Bitcoin ecosystem.",
            "A precision adjustable trajectory planning scheme for UAV-based data collection in IoTs.",
            "A secure vehicle theft detection framework using Blockchain and smart contract.",
            "Revisiting the coupon collector's problem to unveil users' online sessions in networked systems.",
            "A lightweight multi-party authentication in insecure reader-server channel in RFID-based IoT.",
            "Non-interactive secure multi-party arithmetic computations with confidentiality for P2P networks.",
            "Resource discovery mechanisms in pure unstructured peer-to-peer systems: a comprehensive survey.",
            "Cancelable Iris template for secure authentication based on random projection and double random phase encoding.",
            "Task allocation through fuzzy logic based participant density analysis in mobile crowd sensing.",
            "A consensus-based cooperative Spectrum sensing technique for CR-VANET.",
            "Light forwarding based optimal CCN content delivery: a case study in metropolitan area network.",
            "A novel energy-efficient balanced multi-hop routing scheme (EBMRS) for wireless sensor networks.",
            "Privacy preserving using multi-hop dynamic clustering routing protocol and elliptic curve cryptosystem for WSN in IoT environment.",
            "Spectrum sharing protocol in two-way cognitive radio networks with energy accumulation in relay node.",
            "A certificateless linearly homomorphic signature scheme for network coding and its application in the IoT.",
            "A reliable tree-based data aggregation method in wireless sensor networks.",
            "Trust estimation in peer-to-peer network using BLUE.",
            "A secure three-factor anonymous roaming authentication protocol using ECC for space information networks.",
            "Blind signcryption scheme based on hyper elliptic curves cryptosystem.",
            "Cross-domain trust management mechanism for internet of things systems.",
            "Low energy consumption routing algorithm based on message importance in opportunistic social networks.",
            "Task scheduling in cloud-fog computing systems.",
            "Accessible review of internet of vehicle models for intelligent transportation and research gaps for potential future directions.",
            "Behavior prediction based on interest characteristic and user communication in opportunistic social networks.",
            "Correction to: Joint power optimization and scaled beamforming approach in B5G network based massive MIMO enabled HetNet with full-duplex small cells.",
            "A mathematical model to describe resource discovery failure in distributed exascale computing systems.",
            "An efficient latency aware resource provisioning in cloud assisted mobile edge framework.",
            "A message transmission scheduling algorithm based on time-domain interference alignment in UWANs.",
            "Non-cryptography countermeasure against controllable event triggering attack in WSNs.",
            "Cellular traffic prediction on blockchain-based mobile networks using LSTM model in 4G LTE network.",
            "A secure peer to peer multiparty transaction scheme based on blockchain.",
            "A novel trust management method to preserve privacy in vehicular ad-hoc networks.",
            "Packet classification based aerial intelligent relay-road side unit (air-rsu) framework for vehicular ad-hoc networks.",
            "All-in-one: Toward hybrid data collection and energy saving mechanism in sensing-based IoT applications.",
            "Modeling & analysis of software defined networks under non-stationary conditions.",
            "Computing tasks assignment optimization among edge computing servers via SDN.",
            "Cost-effective migration-based dynamic platform defense technique: a CTMDP approach.",
            "New incentive mechanism to enhance cooperation in wireless P2P networks.",
            "High energy efficient lifetime management system and trust management framework for manet using self-configurable cluster mechanism.",
            "Towards software defined low maintenance structured peer-to-peer overlays.",
            "SDN-based offloading policy to reduce the delay in fog-vehicular networks.",
            "Correction to: SDN-based offloading policy to reduce the delay in fog-vehicular networks.",
            "A provably secure RFID authentication protocol based on ECQV for the medical internet of things.",
            "CP-ABSEL: Ciphertext-policy attribute-based searchable encryption from lattice in cloud storage.",
            "Hybrid meta-heuristic techniques based efficient charging scheduling scheme for multiple Mobile wireless chargers based wireless rechargeable sensor networks.",
            "Correction to: Hybrid meta-heuristic techniques based efficient charging scheduling scheme for multiple Mobile wireless chargers based wireless rechargeable sensor networks.",
            "Joint resource allocation and routing optimization for spectrum aggregation based CRAHNs.",
            "An energy-efficient cluster-based routing protocol using unequal clustering and improved ACO techniques for WSNs.",
            "Advances in privacy-preserving computing.",
            "Privacy-aware smart card based biometric authentication scheme for e-health.",
            "Efficient privacy-preserving authentication for V2G networks.",
            "Privacy-preserving two-parties logistic regression on vertically partitioned data using asynchronous gradient sharing.",
            "A location privacy protection scheme for convoy driving in autonomous driving era.",
            "A novel spread estimation based abnormal flow detection in high-speed networks.",
            "High-throughput secure multiparty multiplication protocol via bipartite graph partitioning.",
            "Three-stage Stackelberg game based edge computing resource management for mobile blockchain.",
            "An improved steganography without embedding based on attention GAN.",
            "Backdoors hidden in facial features: a novel invisible backdoor attack against face recognition systems.",
            "Exploiting peer-to-peer communications for query privacy preservation in voice assistant systems.",
            "A robust and secure multi-authority access control system for cloud storage.",
            "A uniformization-based approach to preserve individuals' privacy during process mining analyses.",
            "Copyright protection method of big data based on nash equilibrium and constraint optimization.",
            "A reputation-based cooperative content delivery with parking vehicles in vehicular ad-hoc networks.",
            "A robust provable-secure privacy-preserving authentication protocol for Industrial Internet of Things.",
            "Blockchain based Privacy Preserving User Authentication Protocol for Distributed Mobile Cloud Environment.",
            "A machine learning based approach for user privacy preservation in social networks.",
            "Anonymized noise addition in subspaces for privacy preserved data mining in high dimensional continuous data.",
            "An efficient clustering-based anonymization scheme for privacy-preserving data collection in IoT based healthcare services.",
            "Impact of data correlation on privacy budget allocation in continuous publication of location statistics.",
            "Privacy-preserving neural networks with Homomorphic encryption: Challenges and opportunities.",
            "ASFGNN: Automated separated-federated graph neural network.",
            "Obfuscation of images via differential privacy: From facial images to general images.",
            "Guest editorial special issue on \"P2P computing for deep learning\".",
            "Group task allocation approach for heterogeneous software crowdsourcing tasks.",
            "The throughput optimization for wireless sensor networks adopting interference alignment and successive interference cancellation.",
            "Surface and high-altitude combined rainfall forecasting using convolutional neural network.",
            "Machine learning models and techniques for VANET based traffic management: Implementation issues and challenges.",
            "Improved differentiable neural architecture search for single image super-resolution.",
            "Influencing factors analysis in pear disease recognition using deep learning.",
            "AENEA: A novel autoencoder-based network embedding algorithm.",
            "Enabling privacy-preserving multi-level attribute based medical service recommendation in eHealthcare systems.",
            "Tree-searching based trust assessment through communities in vehicular networks.",
            "Correction to: A digital rights management system based on a scalable blockchain.",
            "Energy efficient and link reliable routing (E2LR) scheme for underwater sensor networks.",
            "iForest: An informed resource search strategy in mobile P2P networks.",
            "Reliable scheduling and load balancing for requests in cloud-fog computing.",
            "A hierarchical secure data aggregation method using the dragonfly algorithm in wireless sensor networks.",
            "A Grey-Wolf based Optimized Clustering approach to improve QoS in wireless sensor networks for IoT applications.",
            "Energy efficient data correlation aware opportunistic routing protocol for wireless sensor networks.",
            "A probability based energy competent cluster based secured ch selection routing EC2SR protocol for smart dust.",
            "P2P mobility management for seamless handover using D2D communication in B5G wireless technology.",
            "Radial kernelized regressive merkle-damgård cryptographic hash blockchain for secure data transmission with IoT sensor node.",
            "A trust-based privacy-preserving friend matching scheme in social Internet of Vehicles.",
            "Traffic sign detection and recognition using RGSM and a novel feature extraction method.",
            "Delay - aware bandwidth estimation and intelligent video transcoder in mobile cloud.",
            "A self-localization range free protocol for wireless sensor networks.",
            "Hybrid fuzzy logic and artificial Flora optimization algorithm-based two tier cluster head selection for improving energy efficiency in WSNs.",
            "An energy aware modified PAM clustering with cluster head modulation in Mobile cloud sensor environment.",
            "Anonymous and Traceable Authentication for Securing Data Sharing in Parking Edge Computing.",
            "Joint optimization for throughput maximization in underwater acoustic networks with energy harvesting.",
            "Analysis of minimum distribution time of tit-for-tat-based P2P file distribution: Linear programming based approach.",
            "Energy and delay-ware massive task scheduling in fog-cloud computing system.",
            "Efficient and privacy-preserving range-max query in fog-based agricultural IoT.",
            "MASK: Efficient and privacy-preserving m-tree based biometric identification over cloud.",
            "A critical analysis of RPL objective functions in internet of things paradigm.",
            "Adaptive cost and energy aware secure peer-to-peer computational offloading in the edge-cloud enabled healthcare system.",
            "A deep learning-based constrained intelligent routing method.",
            "Identity based two-party authenticated key agreement scheme for vehicular ad hoc networks.",
            "Joint offloading and energy optimization for wireless powered mobile edge computing under nonlinear EH Model.",
            "One radish, One hole: Specific adversarial training for enhancing neural network's robustness.",
            "SPAHN novel approach for PL-AG gateway discovery for internet connectivity.",
            "MDRP: Message dissemination with re-route planning method for emergency vehicle information exchange.",
            "Scalable aggregation plan (SAP) for portable network in a box (NIB) architecture.",
            "CAN bus network design of bifurcated power electric tractor.",
            "Transmission adaptive mode selection (TAMS) method for internet of things device energy management.",
            "Analyzing and eliminating phishing threats in IoT, network and other Web applications using iterative intersection.",
            "SRAF: Scalable Resource Allocation Framework using Machine Learning in user-Centric Internet of Things.",
            "Effective power allocation and distribution for 6 g - network in a box enabled peer to peer wireless communication networks.",
            "A novel clustering technique to stop congestion occur vehicular ad-hoc networks using node density based on received signal strength.",
            "A novel predicate based access control scheme for cloud environment using open stack swift storage.",
            "A framework for the identification of suspicious packets to detect anti-forensic attacks in the cloud environment.",
            "Privacy preserving E-voting cloud system based on ID based encryption.",
            "High utility itemset mining using path encoding and constrained subset generation.",
            "Sparse auto encoder driven support vector regression based deep learning model for predicting network intrusions.",
            "FAST: Fast Accessing Scheme for data Transmission in cloud computing.",
            "An efficient secure data deduplication method using radix trie with bloom filter (SDD-RT-BF) in cloud environment.",
            "A novel energy-efficient data aggregation protocol for cognitive radio based wireless multimedia networks.",
            "PriPresent: an embedded prime LightWeight block cipher for smart devices.",
            "An optimistic technique to detect Cache based Side Channel attacks in Cloud.",
            "Dynamic intelligent resource allocation for emergency situations.",
            "Research on wireless sensor location technology for biologic signal measuring based on intelligent bionic algorithm.",
            "Intelligent physical systems for strategic planning and management of enterprise information.",
            "Application of big data optimized clustering algorithm in cloud computing environment in traffic accident forecast.",
            "Epidemic and transmission priority based data dissemination model in vehichular adhoc networks (VANETs).",
            "A trust infrastructure based authentication method for clustered vehicular ad hoc networks.",
            "A machine learning-assisted data aggregation and offloading system for cloud-IoT communication.",
            "Analysis of intrusion detection in cyber attacks using DEEP learning neural networks.",
            "BacS: A blockchain-based access control scheme in distributed internet of things.",
            "Data analytics and the P2P cloud: an integrated model for strategy formulation based on customer behaviour.",
            "Issues of crowdsourcing and mobile app development through the intellectual property protection of third parties.",
            "Analysis and mathematical modeling of big data processing.",
            "Penetration testing framework for smart contract Blockchain.",
            "An efficient secure data compression technique based on chaos and adaptive Huffman coding.",
            "A digital rights management system based on a scalable blockchain.",
            "Secure and efficient mutual authentication protocol for smart grid under blockchain.",
            "Achieving IoT data security based blockchain.",
            "A decision support system for the uses of lightweight blockchain designs for P2P computing.",
            "Detecting and mitigating cyberattacks using software defined networks for integrated clinical environments.",
            "The impact of propagation delay to different selfish miners in proof-of-work blockchains.",
            "A two-level traffic smoothing method for efficient cloud-IoT communications.",
            "Blockchain-based Secure and Intelligent Sensing Scheme for Autonomous Vehicles Activity Tracking Beyond 5G Networks.",
            "A decentralized vehicle anti-theft system using Blockchain and smart contracts.",
            "A donation tracing blockchain model using improved DPoS consensus algorithm.",
            "AMVchain: authority management mechanism on blockchain-based voting systems.",
            "Privacy-preserving hierarchical deterministic key generation based on a lattice of rings in public blockchain.",
            "An Optimized Byzantine Fault Tolerance Algorithm for Consortium Blockchain.",
            "An integrative approach for secure data sharing in vehicular edge computing using Blockchain.",
            "Optimized dynamic storage of data (ODSD) in IoT based on blockchain for wireless sensor networks.",
            "EdgeTC - a PBFT blockchain-based ETC scheme for smart cities.",
            "Data-driven peer-to-peer blockchain framework for water consumption management.",
            "Blockchain smart contracts: Applications, challenges, and future trends.",
            "Blockchain-a promising solution to internet of things: A comprehensive analysis, opportunities, challenges and future research issues.",
            "A certificateless encryption scheme based on blockchain.",
            "User authentication using Blockchain based smart contract in role-based access control.",
            "Verifiable dynamic ranked search with forward privacy over encrypted cloud data.",
            "A blockchain-based quantum-secure reporting protocol.",
            "HonestChain: Consortium blockchain for protected data sharing in health information systems.",
            "A double steganography model combining blockchain and interplanetary file system.",
            "A robust and lightweight secure access scheme for cloud based E-healthcare services.",
            "Secure access control for manufacturing sector with application of ethereum blockchain.",
            "An experimental study on performance of private blockchain in IoT applications.",
            "Trust and scalable blockchain-based message exchanging scheme on VANET.",
            "An effective blockchain evaluation system based on entropy-CRITIC weight method and MCDM techniques.",
            "Combinatorial auction based multi-task resource allocation in fog environment using blockchain and smart contracts.",
            "A survey for the application of blockchain technology in the media.",
            "Guest editorial: Cognitive models for peer to peer networking in 5G and beyond networks and systems.",
            "Cognitive IoT relaying NOMA networks with user clustering and imperfect SIC.",
            "Path loss modelling at 60 GHz mmWave based on cognitive 3D ray tracing algorithm in 5G.",
            "A Blockchain enabled location-privacy preserving scheme for vehicular ad-hoc networks.",
            "Optimal cooperative spectrum sensing for 5G cognitive networks using evolutionary algorithms.",
            "Effective peer-to-peer routing in heterogeneous half-duplex and full-duplex multi-hop cognitive radio networks.",
            "Deep learning application for sensing available spectrum for cognitive radio: An ECRNN approach.",
            "Energy efficiency maximization for beyond 5G NOMA-enabled heterogeneous networks.",
            "Space-air-ground integrated networks for future IoT: Architecture, management, service and performance.",
            "Trust based task offloading scheme in UAV-enhanced edge computing network.",
            "Downlink aware data scheduling with delay guarantees in resource-limited leo satellite networks.",
            "Joint association and power optimization for multi-UAV assisted cooperative transmission in marine IoT networks.",
            "An efficient three-factor remote user authentication protocol based on BPV-FourQ for internet of drones.",
            "Resource management of GEO relays for real-time remote sensing.",
            "A double-layer collaborative apportionment method for personalized and balanced routing.",
            "A distributed matching game for exploring resource allocation in satellite networks.",
            "An ACO-based cross-layer routing algorithm in space-air-ground integrated networks.",
            "Cooperative content offloading scheme in air-ocean integrated networks.",
            "Cloud-connected flying edge computing for smart agriculture.",
            "Optimal route maintenance based on adaptive equilibrium optimization and GTA based route discovery model in MANET.",
            "NTSC: a novel trust-based service computing scheme in social internet of things.",
            "Multi-target localization algorithm for wireless sensor network.",
            "Hybrid data transmission scheme based on source node centrality and community reconstruction in opportunistic social networks.",
            "A lightweight continuous authentication scheme for medical wireless body area networks.",
            "An efficient outsourcing attribute-based encryption scheme in 5G mobile network environments.",
            "Real-time reliable clustering and secure transmission scheme for QoS development in MANET.",
            "Neural-Fuzzy based effective clustering for large-scale wireless sensor networks with mobile sink.",
            "Blockchain-based digitization of land record through trust value-based consensus algorithm.",
            "Stable zone-based 5G clustered MANET using interest-region-based routing and gateway selection.",
            "Building a blockchain-based decentralized ecosystem for cloud and edge computing: an ALLSTAR approach and empirical study.",
            "On the robustness of three classes of rateless codes against pollution attacks in P2P networks.",
            "Topology control routing strategy based on message forwarding in apron opportunistic networks.",
            "Desynchronization resistant privacy preserving user authentication protocol for location based services.",
            "Proof of humanity: A tax-aware society-centric consensus algorithm for Blockchains.",
            "A blockchain-based dynamic searchable symmetric encryption scheme under multiple clouds.",
            "Enforcing Fairness in Blockchain Transaction Ordering.",
            "SFIM: Identify user behavior based on stable features.",
            "BESDDFFS: Blockchain and EdgeDrone based secured data delivery for forest fire surveillance.",
            "DeepNav: A scalable and plug-and-play indoor navigation system based on visual CNN.",
            "URASP: An ultralightweight RFID authentication scheme using permutation operation.",
            "An Application of blockchain to securely acquire, diagnose and share clinical data through smartphone.",
            "Optimize the placement of edge server between workload balancing and system delay in smart city.",
            "SDN-based cross-domain cooperative method for trusted nodes recommendation in Mobile crowd sensing.",
            "Low interruption ratio link fault recovery scheme for data plane in software-defined networks.",
            "Extending the coverage of evolved Node-B by relaying data using device-to-device offloading in next generation cellular network.",
            "Blockchain-based solution for Secure and Transparent Food Supply Chain Network.",
            "Secure data sharing using Merkle hash digest based blockchain identity management.",
            "Privacy-preserving for the internet of things in multi-objective task scheduling in cloud-fog computing using goal programming approach.",
            "Convergence of Edge Computing and Next Generation Networking.",
            "Towards efficient and energy-aware query processing for industrial internet of things.",
            "An efficient moving object tracking framework for WSNs using sequence-to-sequence learning model.",
            "An incentive mechanism based on endowment effect facing social welfare in Crowdsensing.",
            "Deep reinforcement learning-based incentive mechanism design for short video sharing through D2D communication.",
            "Energy-efficient sensory data gathering in IoT networks with mobile edge computing.",
            "Joint computation offloading and resource allocation in vehicular edge computing based on an economic theory: walrasian equilibrium.",
            "From edge data to recommendation: A double attention-based deformable convolutional network.",
            "Video placement and delivery in edge caching networks: Analytical model and optimization scheme.",
            "Comparative analysis of probabilistic forwarding strategies in ICN for edge computing.",
            "A DNN inference acceleration algorithm combining model partition and task allocation in heterogeneous edge computing system."
        ]
    },
    {
        "name": "PPNA",
        "year": "2020",
        "info": "Volume 13: 2020",
        "count": 174,
        "papers": [
            "Resource allocation in two-tier small-cell networks with energy consumption constraints.",
            "Emergency-level-based healthcare information offloading over fog network.",
            "RELOAD/CoAP architecture for the federation of wireless sensor networks.",
            "FDFA: A fog computing assisted distributed analytics and detecting system for family activities.",
            "A provably secure aggregate authentication scheme for unmanned aerial vehicle cluster networks.",
            "A software defined caching framework based on user access behavior analysis for transparent computing server.",
            "Mobile user authentication protocol with privacy preserving for roaming service in GLOMONET.",
            "Task offloading in mobile fog computing by classification and regression tree.",
            "Efficient combination policies for diffusion adaptive networks.",
            "P2P matchmaking solution for online games.",
            "Performance Modeling of Linux Network System with Open vSwitch.",
            "Fog-assisted secure healthcare data aggregation scheme in IoT-enabled WSN.",
            "TrueTrust: a feedback-based trust management model without filtering feedbacks in P2P networks.",
            "An overlay management strategy to improve QoS in CDN-P2P live streaming systems.",
            "Multi-keyword ranked searchable encryption scheme with access control for cloud storage.",
            "Energy efficient technique for P2P multisource video streaming in mobile ad hoc networks to improve QoE.",
            "Topological influence on optimality of Tit-for-Tat based P2P content distribution.",
            "An energy efficient data transmission approach for low-duty-cycle wireless sensor networks.",
            "An effective positive transmission routing algorithm based on social relationships in opportunistic social networks.",
            "A parallel optimization for energy and robustness of file distribution services.",
            "An approach by adopting multi-objective clustering and data collection along with node sleep scheduling for energy efficient and delay aware WSN.",
            "Assessment of coverage quality of sensor networks for IoT applications.",
            "Resilient against spoofing in 6LoWPAN networks by temporary-private IPv6 addresses.",
            "A hierarchical identity-based security for delay tolerant networks using lattice-based cryptography.",
            "A balanced strategy to improve data invulnerability in structured P2P system.",
            "EASPSC: Efficient authentication of SignRecryption protocol using shareable clouds in VANET groups.",
            "Achieve privacy-preserving simplicial depth query over collaborative cloud servers.",
            "Editor's note: Special issue on internet of things system technologies based on quality of experience.",
            "A scheme of flexible and reversible information-hiding in SMVQ mechanism.",
            "New efficient M2C and M2M mutual authentication protocols for IoT-based healthcare applications.",
            "Internet of things system technologies based on quality of experience.",
            "Weaknesses of some lightweight blockciphers suitable for IoT systems and their applications in hash modes.",
            "DWT-based reversible information hiding scheme using prediction-error-expansion in multimedia images.",
            "Interactive job sequencing system for small make-to-order manufacturers under smart manufacturing environment.",
            "Optimized clustering in vehicular ad hoc networks based on honey bee and genetic algorithm for internet of things.",
            "Energy and time efficient task offloading and resource allocation on the generic IoT-fog-cloud architecture.",
            "Forensic analysis for IoT fitness trackers and its application.",
            "Editor's Note: Special issue on P2P Computing for Intelligence of Things.",
            "P2P computing for intelligence of things.",
            "P2P networking based internet of things (IoT) sensor node authentication by Blockchain.",
            "Volunteer nodes of ant colony optimization routing for minimizing delay in peer to peer MANETs.",
            "P2P computing for trusted networking of personalized IoT services.",
            "P2P-based open health cloud for medicine management.",
            "Selective switching dual-transmission scheme in multi-LED Hybrid VLC-P2P networking system.",
            "Arm movement activity based user authentication in P2P systems.",
            "Repetitive node categorization technique based reliable clustering and energy efficient communication in P2P wireless sensor network.",
            "Implementation of hybrid P2P networking distributed web crawler using AWS for smart work news big data.",
            "Blockchain-based reputation management for custom manufacturing service in the peer-to-peer networking environment.",
            "Mobile IoT device summarizer using P2P web search engine and inherent characteristic of contents.",
            "Edge computing health model using P2P-based deep neural networks.",
            "Performance evaluation on the accuracy of the semantic map of an autonomous robot equipped with P2P communication module.",
            "To optimize load of hybrid P2P cloud data-center using efficient load optimization and resource minimization algorithm.",
            "Development of Cloud of Things Based on Proxy Using OCF IoTivity and MQTT for P2P Internetworking.",
            "Reliable and secure data communication in wireless sensor networks using optimal locally recoverable codes.",
            "Intrusion detection system using hybrid tissue growing algorithm for wireless sensor network.",
            "Secure & efficient intra-MME handovers via mobile relays within the LTE-A and future 5G high-speed train networks.",
            "An energy-efficient data prediction and processing approach for the internet of things and sensing based applications.",
            "Effective TDMA scheduling for tree-based data collection using genetic algorithm in wireless sensor networks.",
            "Tracking and impersonating tags in a CRC-based ultralightweight RFID authentication protocol.",
            "DPAS: A dynamic popularity-aware search mechanism for unstructured P2P systems.",
            "Performance of low level protocols in high traffic wireless body sensor networks.",
            "Novel Distributed Dynamic Backbone-based Flooding in Unstructured Networks.",
            "An improved congestion-aware routing mechanism in sensor networks using fuzzy rule sets.",
            "Next level peer-to-peer overlay networks under high churns: a survey.",
            "Path optimization of box-covering based routing to minimize average packet delay in software defined network.",
            "Community recombination and duplication node traverse algorithm in opportunistic social networks.",
            "SDN- and fog computing-based switchable routing using path stability estimation for vehicular ad hoc networks.",
            "An aerial intelligent relay-road side unit (AIR-RSU) framework for modern intelligent transportation system.",
            "AVRM: adaptive void recovery mechanism to reduce void nodes in wireless sensor networks.",
            "A secure and lightweight privacy-preserving data aggregation scheme for internet of vehicles.",
            "Performance analysis of Hyperledger Fabric platform: A hierarchical model approach.",
            "A P2P network based edge computing smart grid model for efficient resources coordination.",
            "Enhanced intrusion detection system via agent clustering and classification based on outlier detection.",
            "Human immune-based model for intrusion detection in mobile ad hoc networks.",
            "Correction to: Incentive mechanisms for mobile crowd sensing based on supply-demand relationship.",
            "Correction to: Hierarchical resource scheduling method using improved cuckoo search algorithm for internet of things.",
            "Improved artificial bee colony optimization based clustering algorithm for SMART sensor environments.",
            "Delay sensitive aware distributed data fault recognition algorithm for distributed sensor networks.",
            "Improved multi objective data transmission using conventional route selection algorithm in mobile ad hoc network.",
            "Improved energy efficient WSN using ACO based HSA for optimal cluster head selection.",
            "Interference mitigation and optimal hop distance measurement in distributed homogenous nodes over wireless sensor network.",
            "Data transmission and real-time information acquisition based on fine-grained algorithm and wireless network.",
            "A local decision making technique for reliable service discovery using D2D communications in disaster recovery networks.",
            "Data dependability based bimodal encryption scheme for distributed routing in wireless sensor networks.",
            "An efficient incremental clustering based improved K-Medoids for IoT multivariate data cluster analysis.",
            "AFSndn: A novel adaptive forwarding strategy in named data networking based on Q-learning.",
            "An efficient mobility aware stable and secure clustering protocol for mobile ADHOC networks.",
            "Social reputation loss model and application to lost-linking borrowers in a internet financial platform.",
            "Mimicking attack by botnet and detection at gateway.",
            "Research on the influence mechanism of resettlers participation in migrant work in the context of relationship network.",
            "Research on secure transmission and storage of energy IoT information based on Blockchain.",
            "Study on falling backward of humanoid robot based on dynamic multi objective optimization.",
            "QoS optimization through PBMR algorithm in multipath wireless multimedia sensor networks.",
            "Improved Deep Distance Learning for Visual Loop Closure Detection in Smart City.",
            "Opportunistic TPSR cooperative spectrum sharing protocol with secondary user selection for 5G wireless network.",
            "Research on detector signal receiving network layout optimization model.",
            "Automatic ICA detection in online social networks with PageRank.",
            "A prediction model of cloud security situation based on evolutionary functional network.",
            "Power control of D2D communication based on quality of service assurance under imperfect channel information.",
            "A lightweight three-factor authentication protocol for digital rights management system.",
            "An energy aware clustering and data gathering technique based on nature inspired optimization in WSNs.",
            "An adaptive intersection selection mechanism using ant Colony optimization for efficient data dissemination in urban VANET.",
            "Integration of ZigBee based GPS receiver to CAN network for precision farming applications.",
            "RPRTD: Routing protocol based on remaining time to encounter nodes with destination node in delay tolerant network using artificial neural network.",
            "A post-quantum end-to-end encryption over smart contract-based blockchain for defeating man-in-the-middle and interception attacks.",
            "A realized on-demand cross-layer connection strategy for wireless self-organization link based on WLAN.",
            "Device-to-device streaming video caching for cellular download cost reduction.",
            "Resource scheduling for delay-sensitive application in three-layer fog-to-cloud architecture.",
            "A blockchain-based data storage framework: A rotating multiple random masters and error-correcting approach.",
            "PSTRM: Privacy-aware sociopsychological trust and reputation model for wireless sensor networks.",
            "Social Reliable D2D Relay for Trustworthy Paradigm in 5G Wireless Networks.",
            "A novel geographically distributed architecture based on fog technology for improving Vehicular Ad hoc Network (VANET) performance.",
            "Toward efficient and effective bullying detection in online social network.",
            "RAIAP: renewable authentication on isolated anonymous profiles.",
            "Hybrid conditional privacy-preserving authentication scheme for VANETs.",
            "Lightweight and secure PUF-based authenticated key agreement scheme for smart grid.",
            "Structuring communities for sharing human digital memories in a social P2P network.",
            "Attribute-based encryption with outsourced decryption in blockchain.",
            "Link reliability-based multi-hop directional location routing in vehicular ad hoc network.",
            "AyoPeer: The adapted ayo-game for minimizing free riding in peer-assisted network.",
            "Optimality analysis of locality-aware tit-for-tat-based P2P file distribution.",
            "Editorial: Emerging Trends on Data Analytics at the Network Edge.",
            "A system for real-time intervention in negative emotional contagion in a smart classroom deployed under edge computing service infrastructure.",
            "Vehicles joint UAVs to acquire and analyze data for topology discovery in large-scale IoT systems.",
            "A trust evaluation system based on reputation data in Mobile edge computing network.",
            "Efficient caching strategy in wireless networks with mobile edge computing.",
            "Polynomial regressors based data-driven control for autonomous underwater vehicles.",
            "Revenue-optimal task scheduling and resource management for IoT batch jobs in mobile edge computing.",
            "Data driven hybrid edge computing-based hierarchical task guidance for efficient maritime escorting with multiple unmanned surface vehicles.",
            "A near-optimal content placement in D2D underlaid cellular networks.",
            "Energy Efficient Mode Selection, Base Station Selection and Resource Allocation Algorithm in D2D Heterogeneous Networks.",
            "Performance analysis of edge-PLCs enabled industrial Internet of things.",
            "Content caching based on mobility prediction and joint user Prefetch in Mobile edge networks.",
            "A novel heuristic based energy efficient routing strategy in wireless sensor network.",
            "Multicriteria dragonfly graph theory based resource optimized virtual network mapping technique for home medical care service provisioning in cloud.",
            "Reliable data dissemination for the Internet of Things using Harris hawks optimization.",
            "Correction to: Reliable data dissemination for the internet of things using Harris hawks optimization.",
            "A novel multi-objective optimization strategy for enhancing quality of service in IoT-enabled WSN applications.",
            "SINR based association algorithm for indoor device-to-device communication networks.",
            "An analytical model for churn process in Bitcoin network with ordinary and relay nodes.",
            "A Robust user authentication protocol with privacy-preserving for roaming service in mobility environments.",
            "An integrated P2P framework for E-learning.",
            "Multi-keyword score threshold and B+ tree indexing based top-K query retrieval in cloud.",
            "Dynamic alternate buffer switching and congestion control in wireless multimedia sensor networks.",
            "An intelligent approach for energy efficient trajectory design for mobile sink based IoT supported wireless sensor networks.",
            "Machine learning based multi scale parallel K-means++ clustering for cloud assisted internet of things.",
            "A distributed intelligent mobile application for analyzing travel big data analytics.",
            "RFDCAR: Robust failure node detection and dynamic congestion aware routing with network coding technique for wireless sensor network.",
            "Cognitive radio technology with reduced PAPR and complexity for IoT-based OFDM networks.",
            "Fuzzy logic hybridized artificial intelligence for computing and networking on internet of things platform.",
            "Enhanced data accuracy based PATH discovery using backing route selection algorithm in MANET.",
            "An efficient fuzziness based contiguous node refining scheme with cross-layer routing path in WSN.",
            "A reward based connectivity-aware IoV neighbor selection for improving reliability in healthcare information exchange.",
            "IOT based wearable sensor for diseases prediction and symptom analysis in healthcare sector.",
            "Channel aware optimized proportional fair scheduler for LTE downlink.",
            "Reliability refinement in VANET with hybrid jamming attacks using novel index based voting algorithm.",
            "Defense model for preserving the wind turbine Records in Cloud Using fog Computing with coupling based cryptography.",
            "Advanced delay assured numerical heuristic modelling for peer to peer project management in cloud assisted internet of things platform.",
            "MANFIS based SMART home energy management system to support SMART grid.",
            "Improved network lifetime to identify unexploited PATH using series cornerstone PATH algorithm in wireless sensor networks.",
            "Dynamic allocation strategy of VM resources with fuzzy transfer learning method.",
            "A high-performance scheduling algorithm using greedy strategy toward quality of service in the cloud environments.",
            "Improved community structure discovery algorithm based on combined clique percolation method and K-means algorithm.",
            "Security and privacy of machine learning assisted P2P networks.",
            "CSNN: Password guessing method based on Chinese syllables and neural network.",
            "Achieving reliable timestamp in the bitcoin platform.",
            "Efficient distributed privacy-preserving collaborative outlier detection.",
            "Privacy-preserving k-means clustering with local synchronization in peer-to-peer networks.",
            "An optimal uplink traffic offloading algorithm via opportunistic communications based on machine learning.",
            "A trust-based minimum cost and quality aware data collection scheme in P2P network.",
            "Efficient and secure k-nearest neighbor query on outsourced data.",
            "Functional encryption with application to machine learning: simple conversions from generic functions to quadratic functions.",
            "A dynamic and verifiable multi-keyword ranked search scheme in the P2P networking environment.",
            "Adaptive privacy-preserving federated learning."
        ]
    },
    {
        "name": "PPNA",
        "year": "2019",
        "info": "Volume 12: 2019",
        "count": 136,
        "papers": [
            "Cooperative channel allocation and scheduling in multi-interface wireless mesh networks.",
            "GTTracker: Location-aware hierarchical model for identifying M-commerce business opportunities.",
            "Secure and efficient encrypted keyword search for multi-user setting in cloud computing.",
            "Lightweight and anonymous three-factor authentication and access control scheme for real-time applications in wireless sensor networks.",
            "Ad-hoc messaging infrastructure for peer-to-peer communication.",
            "Resource allocation algorithm with worst case delay guarantees in energy harvesting body area networks.",
            "A hybrid geographic-DTN routing protocol based on fuzzy logic in vehicular ad hoc networks.",
            "Energy efficient routing formation algorithm for hybrid ad-hoc network: A geometric programming approach.",
            "Resource discovery in the peer to peer networks using an inverted ant colony optimization algorithm.",
            "XTRA - eXtended bit-Torrent pRotocol for Authenticated covert peer communication - Authenticated covert P2P communication.",
            "Weight distribution and community reconstitution based on communities communications in social opportunistic networks.",
            "An energy-aware trust-based routing algorithm using gravitational search approach in wireless sensor networks.",
            "PCLNC: A low-cost intra-generation network coding strategy for P2P content distribution.",
            "Localized topology control and on-demand power-efficient routing for wireless ad hoc and sensor networks.",
            "A lightweight signcryption scheme for defense against fragment duplication attack in the 6LoWPAN networks.",
            "Correction to: A lightweight signcryption scheme for defense against fragment duplication attack in the 6LoWPAN networks.",
            "Sidelobe interference reduced scheduling algorithm for mmWave device-to-device communication networks.",
            "A budget constrained scheduling algorithm for executing workflow application in infrastructure as a service clouds.",
            "MiFo: A novel edge network integration framework for fog computing.",
            "An approach of robust power control for cognitive radio networks based on chance constraints.",
            "Guest editorial: Special issue on software defined networking: Trends, challenges, and prospective smart solutions.",
            "An improved network security situation assessment approach in software defined networks.",
            "A hierarchical mobility management scheme based on software defined networking.",
            "An optimized protocol for QoS and energy efficiency on wireless body area networks.",
            "Identification and predication of network attack patterns in software-defined networking.",
            "Energy efficient topology management scheme based on clustering technique for software defined wireless sensor network.",
            "DSCB: Dual sink approach using clustering in body area network.",
            "Water rippling shaped clustering strategy for efficient performance of software define wireless sensor networks.",
            "Enhancing application performance via DAG-driven scheduling in task parallelism for cloud center.",
            "Enhancing SDN performance by enabling reasoning abilities in data traffic control.",
            "SDN and NFV enabled service function multicast mechanisms over hybrid infrastructure.",
            "Joint routing and scheduling for transmission service in software-defined full-duplex wireless networks.",
            "The strategy of path determination and traffic scheduling in private campus networks based on SDN.",
            "SCPLBS: a smart cooperative platform for load balancing and security on SDN distributed controllers.",
            "EASM: Efficiency-aware switch migration for balancing controller loads in software-defined networking.",
            "Estimating SDN traffic matrix based on online adaptive information gain maximization method.",
            "Virtual network embedding based on modified genetic algorithm.",
            "Survey on SDN based network intrusion detection system using machine learning approaches.",
            "Behavior Reconstruction Models for Large-scale Network Service Systems.",
            "Resource allocation in SDN based 5G cellular networks.",
            "Editorial: Network coverage: From theory to practice.",
            "An efficient coverage hole-healing algorithm for area-coverage improvements in mobile sensor networks.",
            "Multi working sets alternate covering scheme for continuous partial coverage in WSNs.",
            "An algorithm for calculating coverage rate of WSNs based on geometry decomposition approach.",
            "Incentive mechanisms for mobile crowd sensing based on supply-demand relationship.",
            "Two-tiered relay node placement for WSN-based home health monitoring system.",
            "Sensing and monitoring of information diffusion in complex online social networks.",
            "Energy-efficient scheduling strategies for minimizing big data collection in cluster-based sensor networks.",
            "Asynchronous neighbor discovery with unreliable link in wireless mobile networks.",
            "Connectivity preserving obstacle avoidance localized motion planning algorithms for mobile wireless sensor networks.",
            "Hybrid-triggered state feedback H ∞ control for networked control systems with stochastic nonlinearity and quantization.",
            "Set-valued Kalman filtering: Event triggered communication with quantized measurements.",
            "DEHCIC: A distributed energy-aware hexagon based clustering algorithm to improve coverage in wireless sensor networks.",
            "Intention aware misbehavior detection for post-disaster opportunistic communication over peer-to-peer DTN.",
            "Hierarchical P2P architecture for efficient content distribution.",
            "Service-differentiated QoS routing based on ant colony optimisation for named data networking.",
            "Performance analysis of a locality-aware BitTorrent protocol in enterprise networks.",
            "Using self-regulation to increase resilience in overlay networks for interactive multimedia communications.",
            "An analytical study of the main characteristics of Cluster-based Energy-aware Virtual Ring Routing (CLEVER): Number of clusters, number of hops and cluster diameter.",
            "FDCP: cache placement model for information-centric networking using fluid dynamics theory.",
            "An adaptable and ISP-friendly multicast overlay network.",
            "A multi-dimensional routing based approach for efficient communication inside partitioned social networks.",
            "Secure deduplication with reliable and revocable key management in fog computing.",
            "Pareto set as a model for dispatching resources in emergency Centres.",
            "Novel energy-efficient secure routing protocol for wireless sensor networks with Mobile sink.",
            "Secure, flexible and high-efficient similarity search over encrypted data in multiple clouds.",
            "FINDER: A D2D based critical communications framework for disaster management in 5G.",
            "Lightweight authentication and matrix-based key agreement scheme for healthcare in fog computing.",
            "Pruneable sharding-based blockchain protocol.",
            "Reputation based approach for improved fairness and robustness in P2P protocols.",
            "An online target tracking protocol for vehicular Ad Hoc networks.",
            "PSEH: A provably secure and efficient handover AKA protocol in LTE/LTE-A network.",
            "A time-aware resource search strategy with the ant colony optimization in MANETs.",
            "Information spread link prediction through multi-layer of social network based on trusted central nodes.",
            "A type of energy-efficient target tracking approach based on grids in sensor networks.",
            "Probability-based cluster head selection and fuzzy multipath routing for prolonging lifetime of wireless sensor networks.",
            "A trusted fuzzy based stable and secure routing algorithm for effective communication in mobile adhoc networks.",
            "Location protection method for mobile crowd sensing based on local differential privacy preference.",
            "A novelistic approach for energy efficient routing using single and multiple data sinks in heterogeneous wireless sensor network.",
            "Secure and reliable certification management scheme for large-scale MANETs based on a distributed anonymous authority.",
            "PSE-AKA: Performance and security enhanced authentication key agreement protocol for IoT enabled LTE/LTE-A networks.",
            "Blockchain Meets VANET: An Architecture for Identity and Location Privacy Protection in VANET.",
            "Dolphin partner optimization based secure and qualified virtual machine for resource allocation with streamline security analysis.",
            "Editorial on \"Special issue on fog computing for healthcare\".",
            "Vulnerability assessment as a service for fog-centric ICT ecosystems: A healthcare use case.",
            "Fog computing for assisting and tracking elder patients with neurodegenerative diseases.",
            "Fog computing in internet of things: Practical applications and future directions.",
            "An IoT based efficient hybrid recommender system for cardiovascular disease.",
            "Joint radio resource allocation in fog radio access network for healthcare.",
            "Secure and efficient data delivery for fog-assisted wireless body area networks.",
            "Big data and smart computing in network systems.",
            "DSESP: Dual sparsity estimation subspace pursuit for the compressive sensing based close-loop ecg monitoring structure.",
            "A hamming distance and fuzzy logic-based algorithm for P2P content distribution in enterprise networks.",
            "Toward citation recommender systems considering the article impact in the extended nearby citation network.",
            "Smart contract for secure billing in ride-hailing service via blockchain.",
            "Naive semi-supervised deep learning using pseudo-label.",
            "A three dimensional tracking scheme for underwater non-cooperative objects in mixed LOS and NLOS environment.",
            "QuickSquad: A new single-machine graph computing framework for detecting fake accounts in large-scale social networks.",
            "Dynamic topic modeling via self-aggregation for short text streams.",
            "Load scheduling for distributed edge computing: A communication-computation tradeoff.",
            "PPQAR: Parallel PSO for quantitative association rule mining.",
            "A data-driven and the deep learning based CDN recommendation framework for ICPs.",
            "A near-optimal cloud offloading under multi-user multi-radio environments.",
            "An efficient model for vehicular cloud computing with prioritizing computing resources.",
            "Guest editorials: Special issue on fog/edge networking for multimedia applications.",
            "Fog computing support scheme based on fusion of location service and privacy preservation for QoS enhancement.",
            "Heterogeneous mobile network access control technology based on mutual trust mechanism.",
            "Multimedia intelligent fog computing scheme based on robust perception for complex networks.",
            "Green communication mobile convergence mechanism for computing self-offloading in 5G networks.",
            "Time delay estimation algorithm based on virtual Array and MUSIC for single sensor system.",
            "Identifying influential nodes in complex networks based on Neighbours and edges.",
            "Correction to: Identifying influential nodes in complex networks based on Neighbours and edges.",
            "Queue models for wireless sensor networks based on random early detection.",
            "UAVs joint vehicles as data mules for fast codes dissemination for edge networking in Smart City.",
            "A data fusion privacy protection strategy with low energy consumption based on time slot allocation and relay in WBAN.",
            "A multipath routing protocol using congestion control in wireless multimedia sensor networks.",
            "Complex application identification and private network mining algorithm based on traffic-aware model in large-scale networks.",
            "Hierarchical resource scheduling method using improved cuckoo search algorithm for internet of things.",
            "Communication modulation recognition algorithm based on STFT mechanism in combination with unsupervised feature-learning network.",
            "Guest editorial: Networked cyber-physical systems: Optimization theory and applications.",
            "Cascading failure model of scale-free networks for avoiding edge failure.",
            "A deep learning based data forwarding algorithm in mobile social networks.",
            "A robust controller design for networked hydraulic pressure control system based on CPR.",
            "Centrality prediction based on K-order Markov chain in Mobile Social Networks.",
            "Pipeline slot based fast rerouting scheme for delay optimization in duty cycle based M2M communications.",
            "Distributed adaptive consensus control for networked robotic manipulators with time-varying delays under directed switching topologies.",
            "The express decay effect of time delays for globally exponentially stable nonlinear stochastic systems.",
            "Mapping imprecise computation tasks on cyber-physical systems.",
            "Cooperative attitude control for a wheel-legged robot.",
            "Distributed consensus of networked markov jump multi-agent systems with mode-dependent event-triggered communications and switching topologies.",
            "Quantized control for nonhomogeneous Markovian jump T-S fuzzy systems with missing measurements.",
            "Predictive control for visual servoing control of cyber physical systems with packet loss.",
            "Cyber-physical battlefield perception systems based on machine learning technology for data delivery.",
            "A code protection method against function call analysis in P2P network.",
            "Guaranteed performance control of switched linear systems: A differential-Riccati-equation-based approach.",
            "UAV-assisted wireless relay networks for mobile offloading and trajectory optimization."
        ]
    },
    {
        "name": "PPNA",
        "year": "2018",
        "info": "Volume 11: 2018",
        "count": 103,
        "papers": [
            "An improved and provably secure three-factor user authentication scheme for wireless sensor networks.",
            "A robust power control scheme for femtocell networks with probability constraint of channel gains.",
            "An efficient privacy-preserving P2P protocol for computing maximum value in the presence of active adversaries.",
            "Peer-to-peer live video streaming with rateless codes for massively multiplayer online games.",
            "An efficient and secure three-factor based authenticated key exchange scheme using elliptic curve cryptosystems.",
            "An adaptive algorithm for super-peer selection considering peer's capacity in mobile peer-to-peer networks based on learning automata.",
            "Sensor communication area and node extend routing algorithm in opportunistic networks.",
            "Editor's note: From M2M to IoT: Platform, Network and Service.",
            "OPPO: An optimal copy allocation scheme in mobile opportunistic networks.",
            "Resource allocation for M2M-enabled cellular network using Nash bargaining game theory.",
            "A traffic congestion aware vehicle-to-vehicle communication framework based on Voronoi diagram and information granularity.",
            "Towards the oneM2M standards for building IoT ecosystem: Analysis, implementation and lessons.",
            "Distributed scheduling using belief propagation for internet-of-things (IoT) networks.",
            "CTMR-collaborative time-stamp based multicast routing for delay tolerant networks in post disaster scenario.",
            "Delay-tolerant sensing data delivery for IoT network by using signal strength information.",
            "Towards secure authenticating of cache in the reader for RFID-based IoT systems.",
            "Editor's note: Special Issue on Security and Privacy for Big Data Storage in the Cloud.",
            "General Theory of security and a study of hacker's behavior in big data era.",
            "Identity based secure authentication scheme based on quantum key distribution for cloud computing.",
            "Ownership-hidden group-oriented proofs of storage from pre-homomorphic signatures.",
            "Protecting lightweight block cipher implementation in mobile big data computing - A GPU-based approach.",
            "Resource allocation in cooperative cognitive radio networks towards secure communications for maritime big data systems.",
            "Whispers in the cloud storage: A novel cross-user deduplication-based covert channel design.",
            "VMKDO: Verifiable multi-keyword search over encrypted cloud data for dynamic data-owner.",
            "A new randomized message-locked encryption in the standard model.",
            "Privacy-aware electricity scheduling for home energy management system.",
            "DFA-VMP: An efficient and secure virtual machine placement strategy under cloud environment.",
            "Efficient privacy-preserving online medical primary diagnosis scheme on naive bayesian classification.",
            "DOAS: Efficient data owner authorized search over encrypted cloud data.",
            "A type of energy-efficient data gathering method based on single sink moving along fixed points.",
            "Multi-class routing protocol using virtualization and SDN-enabled architecture for smart grid.",
            "The impact of hesitation on passive worm spreading in P2P networks.",
            "A dynamic web service registry framework for mobile environments.",
            "Scalability-aware mechanism based on workload prediction in ultra-peer networks.",
            "Social fairness and channel loading effects in peer-to-peer connected networks.",
            "Joint optimization of wireless bandwidth and computing resource in cloudlet-based mobile cloud computing environment.",
            "AGENT: an adaptive geo-indistinguishable mechanism for continuous location-based service.",
            "Modelling and evaluation of QCN using coloured petri nets.",
            "Cross-layer cooperative multichannel medium access for internet of things.",
            "P2P-PL: A pattern language to design efficient and robust peer-to-peer systems.",
            "A trigger-based pseudonym exchange scheme for location privacy preserving in VANETs.",
            "An Adaptive hybrid routing strategy (AHRS) for mobile ad hoc networks.",
            "O-Torrent: A fair, robust, and free riding resistant P2P content distribution mechanism.",
            "Tor anonymous traffic identification based on gravitational clustering.",
            "An optimized intrusion response system for MANET: - An attack-severity aware approach.",
            "sureTrust: a super peer-aware trust model for 2-level P2P networks.",
            "Cyclic ranking in single-resource peer-to-peer exchange.",
            "Untraceable biometric-based three-party authenticated key exchange for dynamic systems.",
            "Guest editorial: special issue on transparent computing.",
            "A case for software-defined code scheduling based on transparent computing.",
            "A resource allocation model based on double-sided combinational auctions for transparent computing.",
            "An evolvable and transparent data as a service framework for multisource data integration and fusion.",
            "A block-level caching optimization method for mobile transparent computing.",
            "Secure ultra-lightweight RFID mutual authentication protocol based on transparent computing for IoV.",
            "Guest editorial: fog computing on wheels.",
            "Neighboring vehicle-assisted fast handoff for vehicular fog communications.",
            "Fog computing enabling geographic routing for urban area vehicular network.",
            "Connection is power: Near optimal advertisement infrastructure placement for vehicular fogs.",
            "Secure, efficient and revocable data sharing scheme for vehicular fogs.",
            "Towards fast and lightweight spam account detection in mobile social networks through fog computing.",
            "Efficient multi-tasks scheduling algorithm in mobile cloud computing with time constraints.",
            "A multi-vessels cooperation scheduling for networked maritime fog-ran architecture leveraging SDN.",
            "SEIP: Secure and seamless IP communications for group-oriented machine to machine communications.",
            "A provably secure anonymous mutual authentication scheme with key agreement for SIP using ECC.",
            "Analysis of P2P, IRC and HTTP traffic for botnets detection.",
            "Trust-based service composition and selection in service oriented architecture.",
            "Adaptive Flow Rate Control for Network Utility Maximization Subject to QoS Constraints in Wireless Multi-hop Networks.",
            "A robust mutual authentication scheme for session initiation protocol with key establishment.",
            "NWBBMP: a novel weight-based buffer management policy for DTN routing protocols.",
            "Efficient steganographer detection over social networks with sampling reconstruction.",
            "Dynamic power allocation based on second-order control system in two-tier femtocell networks.",
            "Rumor spreading in interdependent social networks.",
            "FGDA: Fine-grained data analysis in privacy-preserving smart grid communications.",
            "EOABS: expressive outsourced attribute-based signature.",
            "Guest editorial: Special issue on big data networking.",
            "Secure and private key management scheme in big data networking.",
            "Distributed correlation model mining from remote sensing big data based on gene expression programming.",
            "Training deep neural network on multiple GPUs with a model averaging method.",
            "Data aggregation with end-to-end confidentiality and integrity for large-scale wireless sensor networks.",
            "Big program code dissemination scheme for emergency software-define wireless sensor networks.",
            "Migrating big video data to cloud: a peer-assisted approach for VoD.",
            "Distribution-aware cache replication for cooperative road side units in VANETs.",
            "Energy balancing RPL protocol with multipath for wireless sensor networks.",
            "Optimizing power consumption of mobile devices for video streaming over 4G LTE networks.",
            "Self-adaptive bat algorithm for large scale cloud manufacturing service composition.",
            "FTLLS: A fault tolerant, low latency, distributed scheduling approach based on sparrow.",
            "Key frame extraction scheme based on sliding window and features.",
            "Convergence P2P cloud computing.",
            "Optimized peer to peer QSPR prediction of enthalpy of formation using outlier detection and subset selection.",
            "Writer identification using intra-stroke and inter-stroke information for security enhancements in P2P systems.",
            "Efficient data-forwarding method in delay-tolerant P2P networking for IoT services.",
            "Fast Fourier transform based efficient data processing technique for big data processing speed enhancement in P2P computing environment.",
            "RFID-based sensing system for context information management using P2P network architecture.",
            "Evaluation of P2P and cloud computing as platform for exhaustive key search on block ciphers.",
            "Development and application of internet of things educational tool based on peer to peer network.",
            "Enhanced secure device authentication algorithm in P2P-based smart farm system.",
            "Development of local area alert system against particulate matters and ultraviolet rays based on open IoT platform with P2P.",
            "Implementation of young children English education system by AR type based on P2P network service model.",
            "Development of disaster prevention solution in extremely dangerous industrial environment based on P2P sensor network.",
            "Mining health-risk factors using PHR similarity in a hybrid P2P network.",
            "Implementation of convergence P2P information retrieval system from captured video frames.",
            "De-identification of metering data for smart grid personal security in intelligent CCTV-based P2P cloud computing environment.",
            "Mining-based lifecare recommendation using peer-to-peer dataset and adaptive decision feedback."
        ]
    },
    {
        "name": "PPNA",
        "year": "2017",
        "info": "Volume 10: 2017",
        "count": 99,
        "papers": [
            "An improved and provably secure privacy preserving authentication protocol for SIP.",
            "A new and secure authentication scheme for wireless sensor networks with formal proof.",
            "Simultaneous mobility of data sources and content requesters in content-centric networking.",
            "Achieving maximum utilization of peer's upload capacity in p2p networks using SVC.",
            "Coverage hole detection and restoration algorithm for wireless sensor networks.",
            "Efficient anonymous authentication with key agreement protocol for wireless medical sensor networks.",
            "An improved smart card based authentication scheme for session initiation protocol.",
            "A lightweight data aggregation scheme achieving privacy preservation and data integrity with differential privacy and fault tolerance.",
            "Characterisation, design and simulation of an efficient peer-to-peer content distribution system for enterprise networks.",
            "Design and evaluation of a peer-to-peer MANET crosslayer approach: OneHopOverlay4MANET.",
            "Popularity-based caching for IPTV services over P2P networks.",
            "Darkcube: A k-Hypercube based P2P VoIP protocol.",
            "Outage performance improvement with cooperative relaying in cognitive radio networks.",
            "Robust QoS-aware communication in the smart distribution grid.",
            "Recommend top-k most downloaded files in the chord-based P2P file-sharing system.",
            "Energy-aware and secure routing with trust for disaster response wireless sensor network.",
            "Opportunistic cooperation in wireless ad hoc networks with interference correlation.",
            "Attribute-based signcryption with hybrid access policy.",
            "TPSQ: Trust-based platoon service query via vehicular communications.",
            "MultiProTru: A kalman filtering based trust architecture for two-hop wireless sensor networks.",
            "Guest editorial: Special issue on algorithms, systems and applications in mobile social networks.",
            "Delivering mobile social content with selective agent and relay nodes in content centric networks.",
            "A method for defensing against multi-source Sybil attacks in VANET.",
            "An adaptive resource allocation model in anti-money laundering system.",
            "Serial number based encryption and its application for mobile social networks.",
            "Privacy-preserving design for emergency response scheduling system in medical social networks.",
            "Characterizing user behaviors in location-based find-and-flirt services: Anonymity and demographics - A WeChat Case Study.",
            "An ultra-lightweight RFID authentication scheme for mobile commerce.",
            "A novel approach for inhibiting misinformation propagation in human mobile opportunistic networks.",
            "SOS: Real-time and accurate physical assault detection using smartphone.",
            "Finding overlapping communities based on Markov chain and link clustering.",
            "Guest editorial: Distributed control and optimization of wireless networks.",
            "Distributed rate control, routing, and energy management in dynamic rechargeable sensor networks.",
            "Goodput optimization via dynamic frame length and charging time adaptation for backscatter communication.",
            "CRWO: Clustering and routing in wireless sensor networks using optics inspired optimization.",
            "Energy-efficient routing for mobile data collectors in wireless sensor networks with obstacles.",
            "A honeycomb structure based data gathering scheme with a mobile sink for wireless sensor networks.",
            "Maximum data delivery probability-oriented routing protocol in opportunistic mobile networks.",
            "An energy-efficient data transmission protocol for mobile crowd sensing.",
            "A novel energy-efficient clustering protocol with area coverage awareness for wireless sensor networks.",
            "VD-PSO: An efficient mobile sink routing algorithm in wireless sensor networks.",
            "A novel knowledge-guided evolutionary scheduling strategy for energy-efficient connected coverage optimization in WSNs.",
            "Distributed duty cycle control for delay improvement in wireless sensor networks.",
            "Infrastructure deployment and optimization of fog network based on MicroDC and LRPON integration.",
            "Green computing for wireless sensor networks: Optimization and Huffman coding approach.",
            "Optimizing bandwidth allocation for heterogeneous traffic in IoT.",
            "Robust beamforming and artificial noise design in interference networks with wireless information and power transfer.",
            "Adaptive congestion control scheme in mobile ad-hoc networks.",
            "A tree-based topology construction algorithm with probability distribution and competition in the same layer for wireless sensor network.",
            "IE2M: Design of intellectual energy efficient multicast routing protocol for ad-hoc network.",
            "Nash-optimization distributed model predictive control for multi mobile robots formation.",
            "Prediction based indoor fire escaping routing with wireless sensor network.",
            "Multi-event Detection with Rechargeable Sensors.",
            "Optimal fault-tolerant control for UAV systems with time delay and uncertainties over wireless network.",
            "ORACE-Net: A novel multi-hop body-to-body routing protocol for public safety networks.",
            "Energy-efficient content distribution via mobile users cooperations in cellular networks.",
            "Optimizing broadcast duration for layered video streams in cellular networks.",
            "Treasures status monitoring based on dynamic link-sensing.",
            "Node localization algorithm of wireless sensor networks with mobile beacon node.",
            "A novel mobile target localization algorithm via HMM-based channel sight condition identification.",
            "A noncontact positioning measuring system based on distributed wireless networks.",
            "Novel authentication procedures for preventing unauthorized access in social networks.",
            "Concurrently deniable ring authentication and its application to LBS in VANETs.",
            "An authenticated group key transfer protocol using elliptic curve cryptography.",
            "Computational data privacy in wireless networks.",
            "A fault tolerant peer-to-peer spatial data structure.",
            "Low-complexity time synchronization for energy-constrained wireless sensor networks: Dual-Clock delayed-message approach.",
            "QMRPRNS: Design of QoS multicast routing protocol using reliable node selection scheme for MANETs.",
            "MobiStore: A system for efficient mobile P2P data sharing.",
            "Energy-optimal collaborative file distribution in wired networks.",
            "Joint TAS and power allocation for D2D cooperative networks.",
            "HyCube: A distributed hash table based on a variable metric.",
            "The IoT electric business model: Using blockchain technology for the internet of things.",
            "VCSE: Verifiable conjunctive keywords search over encrypted data without secure-channel.",
            "TAPCS: Traffic-aware pseudonym changing strategy for VANETs.",
            "Improving the reliability of wireless data communication in Smart Grid NAN.",
            "Applying location estimation for reliable routing in tactical unmanned ground vehicle networks.",
            "Quality enhancement of video on demand implementation in peer-to-peer networks by optimum chunk length in the BitTorrent.",
            "Minimizing mobile sensor movements to form a line K-coverage.",
            "Protecting against malicious and selective forwarding attacks for P2P search & retrieval system.",
            "Uncertainty analysis framework for trust based routing in MANET.",
            "An overview of medium access control strategies for opportunistic spectrum access in cognitive radio networks.",
            "Adaptive flow scheduling for modular datacenter networks.",
            "Towards an efficient distributed cloud computing architecture.",
            "Modeling altruism agents: Incentive mechanism in autonomous networks with other-regarding preference.",
            "Identifying P2P traffic: A survey.",
            "PTRS: A privacy-preserving trust-based relay selection scheme in VANETs.",
            "Research on bottleneck-delay in internet based on IP united mapping.",
            "A comprehensive study of RPL and P2P-RPL routing protocols: Implementation, challenges and opportunities.",
            "Research on the implicit feedback mechanism in peer-to-peer trust models.",
            "Editor's note: Special Issue on Mobile Ad-hoc and Sensor Networks.",
            "Events detection and community partition based on probabilistic snapshot for evolutionary social network.",
            "Fault diagnosis of body sensor networks using hidden Markov model.",
            "Connected sensor cover and related problems.",
            "Two-layer hybrid peer-to-peer networks.",
            "Using multi-features to recommend friends on location-based social networks.",
            "A novel broadcast authentication protocol for internet of vehicles.",
            "Analysis to reveal evolution and topological features of a real mobile social network.",
            "Interference-constrained routing over P2P-share enabled multi-hop D2D networks."
        ]
    },
    {
        "name": "PPNA",
        "year": "2016",
        "info": "Volume 9: 2016",
        "count": 99,
        "papers": [
            "Characterizing peers communities and dynamics in a P2P live streaming system.",
            "A channel-hopping scheme for continuous rendezvous and data delivery in cognitive radio network.",
            "A scalable and automatic mechanism for resource allocation in self-organizing cloud.",
            "A novel fairness-aware parallel download scheme.",
            "Immersive voice communication for massively multiplayer online games.",
            "NetSecCC: A scalable and fault-tolerant architecture for cloud computing security.",
            "Security analysis and enhancements of an improved authentication for session initiation protocol with provable security.",
            "Tree-based data retrieval algorithm for multi-item request with deadline in wireless networks.",
            "A lightweight privacy preserving authenticated key agreement protocol for SIP-based VoIP.",
            "A free rider aware topological construction strategy for search in unstructured P2P networks.",
            "Towards bandwidth-efficient keyword continuous query processing over DHTs.",
            "TEA-CBRP: Distributed cluster head election in MANET by using AHP.",
            "A secure and efficient ECC-based user anonymity-preserving session initiation authentication protocol using smart card.",
            "CAPS: A cloud-assisted approach to handle spikes in peer-to-peer web search.",
            "An IP-TV P2P streaming system that improves the viewing quality and confines the startup delay of regular audience.",
            "A secure and robust temporal credential-based three-factor user authentication scheme for wireless sensor networks.",
            "Chance-constraint optimization of power control in cognitive radio networks.",
            "Erratum to: A comprehensive study of the resource discovery techniques in Peer-to-Peer networks.",
            "A traffic-efficient message forwarding approach in unstructured P2P networks.",
            "Maintaining censorship resistance in the iTrust network for publication, search and retrieval.",
            "Modeling and forecasting of daily online-user movement in instant messaging based on the elliptic-orbit model: A case study for China.",
            "A novel hybrid P2P and cloud storage system for retrievability and privacy enhancement.",
            "Evaluation of alternatives for the broadcast operation in Kademlia under churn.",
            "Peer to peer trade in HTM5 meta model for agent oriented cloud robotic systems.",
            "A novel replication technique to attenuate churn effects.",
            "A cross-layer approach for partition detection at overlay layer for structured P2P in MANETs.",
            "A description logic-based policy compliance checker for trust negotiation.",
            "Energy-efficient routing over coordinated sleep scheduling in wireless ad hoc networks.",
            "Difficulty control for blockchain-based consensus systems.",
            "OPNET-based modeling and simulation of mobile Zigbee sensor networks.",
            "CUFTI: Methods for core users finding and traffic identification in P2P systems.",
            "Adaptive content-and-deadline aware chunk scheduling in mesh-based P2P video streaming.",
            "A secure and efficient mutual authentication scheme for session initiation protocol.",
            "Convergence P2P context awareness.",
            "Mining students activities from a computer supported collaborative learning system based on peer to peer network.",
            "Efficient peer-to-peer context awareness data forwarding scheme in emergency situations.",
            "Effects of social media usage on country image and purchase intention from social P2P network perspective.",
            "A security monitoring method for malicious P2P event detection.",
            "A privacy data leakage prevention method in P2P networks.",
            "The internet of everything based on energy efficient P2P transmission technology with Bluetooth low energy.",
            "mVoIP for P2P service based authentication system using AA authentication server.",
            "Designing and verifying a P2P service security protocol in M2M environment.",
            "P2P context awareness based sensibility design recommendation using color and bio-signal analysis.",
            "A node management scheme for stable P2P service in mobile ad-hoc networks.",
            "P2P cloud network services for IoT based disaster situations information.",
            "A study on hybrid trust evaluation model for identifying malicious behavior in mobile P2P.",
            "P2P-based u-health cluster service model for silver generation in PBR platform.",
            "An Eigentrust dynamic evolutionary model in P2P file-sharing systems.",
            "Guest editorial: Special issue on crowd sensing networks.",
            "A reliable QoS-aware routing scheme for neighbor area network in smart grid.",
            "Multi-hop data forwarding method for crowd sensing networks.",
            "CLEVER: Cluster-based Energy-aware Virtual Ring Routing in randomly deployed wireless sensor networks.",
            "Perceiving who and when to leverage data delivery for maritime networks: An optimal stopping view.",
            "Performance improvement for source mobility in named data networking based on global-local FIB updates.",
            "Congestion control in social-based sensor networks: A social network perspective.",
            "An incentive game based evolutionary model for crowd sensing networks.",
            "Analytical model with a novel selfishness division of mobile nodes to participate cooperation.",
            "Duration of stay based weighted scheduling framework for mobile phone sensor data collection in opportunistic crowd sensing.",
            "Top-k query processing in mobile-P2P networks using economic incentive schemes.",
            "An optimal query strategy for protecting location privacy in location-based services.",
            "Practical blacklist-based anonymous authentication scheme for mobile crowd sensing.",
            "Secure and efficient fine-grained multiple file sharing in cloud-assisted crowd sensing networks.",
            "The implementation of indoor localization based on an experimental study of RSSI using a wireless sensor network.",
            "Guest editorial: Secure cloud computing for mobile health services.",
            "Data damage assessment and recovery algorithm from malicious attacks in healthcare data sharing systems.",
            "An intelligent RFID-enabled authentication scheme for healthcare applications in vehicular mobile cloud.",
            "Cryptanalysis and improvement of 'a secure authentication scheme for telecare medical information system' with nonce verification.",
            "Efficient data integrity auditing for storage security in mobile health cloud.",
            "A semi-supervised privacy-preserving clustering algorithm for healthcare.",
            "Providing security and fault tolerance in P2P connections between clouds for mHealth services.",
            "Privacy preserving secure data exchange in mobile P2P cloud healthcare environment.",
            "Guest editorial: Special issue on device-to-device service and network management for beyond 4G mobile networks.",
            "Novel power control and collision resolution schemes for device-to-device discovery.",
            "Underlaid-D2D-assisted cooperative multicast based on social networks.",
            "Utility-aware data transmission scheme for delay tolerant networks.",
            "Device-to-device resource allocation in LTE-advanced networks by hybrid particle swarm optimization and genetic algorithm.",
            "Cooperative device discovery for multi-interface self-organizing networks.",
            "Optimization of resource allocation for underlay device-to-device communications in cellular networks.",
            "Reliable multistage interconnection network design.",
            "Adaptive RSSI-based localization scheme for wireless sensor networks.",
            "An adaptive secure communication framework for mobile peer-to-peer environments using Bayesian games.",
            "Self-nominating trust model based on hierarchical fuzzy systems for peer-to-peer networks.",
            "Measuring the complexity of adaptive peer-to-peer systems.",
            "Taking a free ride for routing topology inference in peer-to-peer networks.",
            "Overlay construction for mobile peer-to-peer video broadcasting - Approaches and comparisons.",
            "Adaptive, incentive and scalable dynamic tree overlay for P2P live video streaming.",
            "Adaptive resource scheduling mechanism in P2P file sharing system.",
            "Reputation based probabilistic resource allocation for avoiding free riding and formation of common interest groups in unstructured P2P networks.",
            "UR-aware: Streaming videos over BitTorrent with balanced playback urgency and rareness distribution.",
            "Large scale distributed cooperative environments on clouds and P2P.",
            "C-trust: A trust management system to improve fairness on circular P2P networks.",
            "Operation analysis of massively multiplayer online games on unreliable resources.",
            "Scalable playback rate control in P2P live streaming systems.",
            "DiDuSoNet: A P2P architecture for distributed Dunbar-based social networks.",
            "Information diffusion in distributed OSN: The impact of trusted relationships.",
            "Scalable P2P bot detection system based on network data stream.",
            "An autonomic approach for P2P/cloud collaborative environments.",
            "MiCa: Lightweight and mobile collaboration across a collaborative editing service in the cloud.",
            "Self-healing protocols for connectivity maintenance in unstructured overlays."
        ]
    },
    {
        "name": "PPNA",
        "year": "2015",
        "info": "Volume 8: 2015",
        "count": 90,
        "papers": [
            "Optimizing cluster formation in super-peer networks via local incentive design.",
            "P2P-based mobile navigation system with location service.",
            "A multi-faced measurement study on a large private BitTorrent community.",
            "Towards an immunity based distributed algorithm to detect harmful files shared in P2P networks.",
            "Distributed deterministic 1-2 skip list for peer-to-peer system.",
            "A P2P tuple space implementation for disconnected MANETs.",
            "A verifiable hierarchical circular shift cipher scheme for P2P chunk exchanges.",
            "Energy management for event capture in rechargeable sensor network with limited capacitor size.",
            "An efficient and distributed file search in unstructured peer-to-peer networks.",
            "Peer startup process and initial offset placement in peer-to-peer (P2P) live streaming systems.",
            "Improving lookup reliability in Kad.",
            "Modeling the propagation of topology-aware P2P worms considering temporal parameters.",
            "Stereo-based region of interest generation for real-time pedestrian detection.",
            "Peer-to-peer aggregation for dynamic adjustments in power demand.",
            "On the collaborations of multiple selfish overlays using multi-path resources.",
            "EAPSG: Efficient authentication protocol for secure group communications in maritime wideband communication networks.",
            "Large scale arbitrary search with rendezvous search systems.",
            "Guest Editorial: Special Issue on P2P Cloud Systems.",
            "Cost and profit driven cloud-P2P interaction.",
            "Liquidstream II - Scalable P2P overlay optimization with adaptive minimal server assistance for stable and efficient video on demand.",
            "A survey of peer-to-peer overlay approaches for networked virtual environments.",
            "Integrating peer-to-peer and cloud computing for massively multiuser online games.",
            "Locality-aware streaming in hybrid P2P-cloud CDN systems.",
            "A hierarchical HRRP(k) network and its application.",
            "Rendezvous tunnel for anonymous publishing.",
            "A taxonomy of decentralized online social networks.",
            "Efficient model sharing for scalable collaborative classification.",
            "Resource allocation in underprovisioned multioverlay peer-to-peer live video sharing services.",
            "Advanced bootstrap and adjusted bandwidth for content distribution in peer-to-peer live streaming.",
            "Analysis of user's behavior and resource characteristics for private trackers.",
            "On probabilistic flooding search over unstructured peer-to-peer networks.",
            "Exploring the policy selection of the P2P VoD system: A simulation-based research.",
            "A comprehensive study of the resource discovery techniques in Peer-to-Peer networks.",
            "Pre-allocation based flash crowd mitigation algorithm for large-scale content delivery system.",
            "SBDP: Bandwidth prediction mechanism towards server demands in P2P-VoD system.",
            "A flexible DHT-based directory service for information management.",
            "A trust-based P2P resource search method integrating with Q-learning for future Internet.",
            "Towards a location and mobility-aware routing protocol for improving multimedia streaming performance in MANETs.",
            "Distributed hybrid P2P networking systems.",
            "QoS-aware data forwarding architecture for multimedia streaming services in hybrid peer-to-peer networks.",
            "A hybrid Wi-Fi P2P with bluetooth low energy for optimizing smart device's communication property.",
            "Annotation alignment method on P2P-TV system.",
            "Key exchange process of PIM-SM-based for Multiple Group Communication in P2P.",
            "Information retrieval system using the keyword concept net of the P2P service-based in the mobile cloud environment.",
            "Estimating unreliable objects and system reliability in P2P networks.",
            "Extracting real IP address used to connect to P2P messenger using ARIT agent.",
            "The biometric signature delegation scheme to balance the load of digital signing in hybrid P2P networks.",
            "Editor's Note: Special issue on advanced P2P security and privacy.",
            "Securing network coding against pollution attacks in P2P converged ubiquitous networks.",
            "LSC2: An extended link state protocol with centralized control.",
            "Merging sub-networks in VANETs by using the IEEE 802.11xx protocols.",
            "An efficient secure authentication scheme with user anonymity for roaming user in ubiquitous networks.",
            "An approach to mitigate DoS attack based on routing misbehavior in wireless ad hoc networks.",
            "A study on memory dump analysis based on digital forensic tools.",
            "Network processor architecture with flow-based dynamic bandwidth control for efficient QoS provisioning.",
            "Weakness of lightweight block ciphers mCrypton and LED against biclique cryptanalysis.",
            "Active learning for P2P traffic identification.",
            "Learning model for efficient query routing in P2P information retrieval systems.",
            "A P2P streaming architecture supporting scalable media.",
            "MuDA: Multifunctional data aggregation in privacy-preserving smart grid communications.",
            "Analyzing the exhaustiveness of the Synapse protocol.",
            "A performance comparison of Chord and Kademlia DHTs in high churn scenarios.",
            "Peer-to-peer error recovery for wireless video broadcasting.",
            "Cloud, grid, P2P and internet computing: Recent trends and future directions.",
            "Dependability and reliability analysis of intra cluster routing technique.",
            "Peer-to-peer usage analysis in dynamic databases.",
            "An efficient peer-to-peer and distributed scheduling for cloud and grid computing.",
            "VoIP-aware network attack detection based on statistics and behavior of SIP traffic.",
            "On the security of a certificateless online/offline signcryption for Internet of Things.",
            "Performance evaluation for delay time estimation in IEEE 802.16m sleep mode.",
            "Cost and performance effective data center selection system for scientific federated cloud.",
            "An improved authentication protocol for session initiation protocol using smart card.",
            "A granular approach for user-centric network analysis to identify digital evidence.",
            "Relay selection for peer-to-peer cooperative OFDMA with channel distribution uncertainty.",
            "Task allocation in volunteer computing networks under monetary budget constraints.",
            "On storage partitioning of internet routing tables: A P2P-based enhancement for scalable routers.",
            "VITAL: Structured and clustered super-peer network for similarity search.",
            "Understanding the performance of offline download in real p2p networks.",
            "A stochastic epidemiological model for the propagation of active worms considering the dynamicity of network topology.",
            "Guest editorial: Security and privacy of P2P networks in emerging smart city.",
            "A full lifecycle privacy protection scheme for sensitive data in cloud computing.",
            "A lightweight identity authentication method by exploiting network covert channel.",
            "A topological potential weighted community-based recommendation trust model for P2P networks.",
            "An efficient privacy-preserving authentication scheme with adaptive key evolution in remote health monitoring system.",
            "An efficient two-factor user authentication scheme with unlinkability for wireless sensor networks.",
            "EAPA: An efficient authentication protocol against pollution attack for smart grid.",
            "Fault-aware flow control and multi-path routing in VANETs.",
            "Mix-zones optimal deployment for protecting location privacy in VANET.",
            "PDAFT: A privacy-preserving data aggregation scheme with fault tolerance for smart grid communications.",
            "Securing distributed storage for Social Internet of Things using regenerating code and Blom key agreement."
        ]
    },
    {
        "name": "PPNA",
        "year": "2014",
        "info": "Volume 7: 2014",
        "count": 59,
        "papers": [
            "Dynamic peer buffer adjustment to improve service availability on peer-to-peer on-demand streaming networks.",
            "Backup routing firewall mechanism in P2P environment.",
            "A design of IPTV conditional access mechanism based on P2P network.",
            "Copyright infringement and users of P2P networks in multimedia applications: The case of the U.S. Copyright regime.",
            "GMaker: A video recommendation module for peer-assisted VoD.",
            "A novel method for delivering multimedia e-advertisement data base on use multi-path and multi-seed peer-to-peer-like approach.",
            "The impact of mobility models on the performance of P2P content discovery protocols over mobile ad hoc networks.",
            "A dynamic coalition formation game for search efficient adaptive overlay construction in unstructured peer-to-peer networks.",
            "An efficient playout smoothing mechanism for layered streaming in P2P networks.",
            "A dynamic overlay approach for mobility maintenance in personal communication networks.",
            "Applicability of sub graph centrality to improve data accessibility among peers in MANETs.",
            "On the expected file download time of the random time-based switching algorithm in P2P networks.",
            "Semi-Fluid content distribution model for fast data dissemination in heterogeneous overlay networks.",
            "An efficient server bandwidth costs decreased mechanism towards mobile devices in cloud-assisted P2P-VoD system.",
            "General packet induced queueing schemes for reducing packet delays in ADSL routers with peer-to-peer file sharing applications.",
            "L-overlay: A layered data management scheme for peer-to-peer computing.",
            "PPNA special issue on \"the green, reliability and security of machine-to-machine communications\".",
            "An attack-and-defence game for security assessment in vehicular ad hoc networks.",
            "A social network approach to trust management in VANETs.",
            "PaderMAC: Energy-efficient machine to machine communication for cyber-physical systems.",
            "On mitigating hotspots to maximize network lifetime in multi-hop wireless sensor network with guaranteed transport delay and reliability.",
            "Uncoordinated coexisting IEEE 802.15.4 networks for machine to machine communications.",
            "Identity privacy-based reliable routing method in VANETs.",
            "Group formation with neighbor similarity trust in P2P E-commerce.",
            "Modeling the initial stage of a file sharing process on a BitTorrent network.",
            "Detecting P2P botnets by discovering flow dependency in C&C traffic.",
            "A D-S evidence theory based fuzzy trust model in file-sharing P2P networks.",
            "Distributed Denial of Service (DDoS) detection by traffic pattern analysis.",
            "Hierarchical architectures in structured peer-to-peer overlay networks.",
            "An ISP-friendly inter-overlay coordination framework for multiple coexisting P2P systems.",
            "Hybrid fluid modeling approach for performance analysis of P2P live video streaming systems.",
            "P2P storage systems: Study of different placement policies.",
            "Tsunami: A parasitic, indestructible botnet on Kad.",
            "Peer-to-peer as an infrastructure service.",
            "On the collaboration of different peer-to-peer traffic management schemas.",
            "The performance and locality tradeoff in bittorrent-like file sharing systems.",
            "BufferBank: A distributed cache infrastructure for peer-to-peer application.",
            "A scalable P2P overlay based on arrangement graph with minimized overhead.",
            "A research on dynamic allocation of network resources based on P2P traffic planning.",
            "SocialTrust: Enabling long-term social cooperation in peer-to-peer services.",
            "Improving sustainability of BitTorrent darknets.",
            "A comprehensive study of the use of advertisements as incentives in P2P streaming systems.",
            "An efficient ECC-based mechanism for securing network coding-based P2P content distribution.",
            "Modelling and performance analysis of content sharing and distribution in community networks with infrastructure support.",
            "Editor's Note: Special issue on Technologies and Theories in P2P Converged Ubiquitous Networks.",
            "An effective authentication mechanism for ubiquitous collaboration in heterogeneous computing environment.",
            "Anonymous proximity mobile payment (APMP).",
            "Router architecture evaluation for security network.",
            "Security analysis of block cipher Piccolo suitable for wireless sensor networks.",
            "A novel method of mining network flow to detect P2P botnets.",
            "The optimal split method of large integer multiplication for smart low-end devices on P2P ubiquitous networks.",
            "A real-time responsiveness measurement method of linux-based mobile systems for P2P cloud systems.",
            "VQ-based algorithms extended to non-embedded watermarking for multimedia ownership prevention systems.",
            "Exposing mobile malware from the inside (or what is your mobile app really doing?).",
            "Key distribution scheme for peer-to-peer communication in mobile underwater wireless sensor networks.",
            "Algorithms for promoting anonymity of BS and for prolonging network lifetime of WSN.",
            "Image reversibility in data embedding on the basis of blocking-predictions.",
            "Securing one-way hash chain based incentive mechanism for vehicular ad hoc networks.",
            "Low-priced and efficient replica detection framework for wireless sensor networks."
        ]
    },
    {
        "name": "PPNA",
        "year": "2013",
        "info": "Volume 6: 2013",
        "count": 30,
        "papers": [
            "Stochastic analysis of a churn-tolerant structured peer-to-peer scheme.",
            "Secure verifier-based three-party password-authenticated key exchange.",
            "Performance evaluation of P2P-TV diffusion algorithms under realistic settings.",
            "iDispatcher: A unified platform for secure planet-scale information dissemination.",
            "Practical authentication scheme for SIP.",
            "A popularity-based query scheme in P2P networks using adaptive gossip sampling.",
            "Securing BitTorrent using a new reputation-based trust management system.",
            "On enhancing reputation management using Peer-to-Peer interaction history.",
            "Experimental evaluation of peer-to-peer applications.",
            "Characterization of community based-P2P systems and implications for traffic localization.",
            "Experiences with large-scale operational trials of ALTO-enhanced P2P filesharing in an intra-ISP scenario.",
            "Detection and mitigation of localized attacks in a widely deployed P2P network.",
            "Validation of H-P2PSIP, a scalable solution for interoperability among different overlay networks.",
            "ModelNet-TE: An emulation tool for the study of P2P and traffic engineering interaction dynamics.",
            "p2poem: Function optimization in P2P networks.",
            "Classifying peer-to-peer applications using imbalanced concept-adapting very fast decision tree on IP data stream.",
            "Cost-effective capacity migration of Peer-to-Peer social media to clouds.",
            "Collaborative applications over peer-to-peer systems-challenges and solutions.",
            "Peer-assisted adaptation in periodic broadcasting of videos for heterogeneous clients.",
            "Kademlia based routing on locator-ID separated networks for new generation networks.",
            "Cognitive vertical handover engine for vehicular communication.",
            "File-aware P2P traffic classification: An aid to network management.",
            "Optimizing content placement in a peer-assisted VoD architecture.",
            "Peer-to-peer in big data management.",
            "Probabilistic nearest neighbor queries of uncertain data via wireless data broadcast.",
            "DS2: A DHT-based substrate for distributed services.",
            "An SSD-based accelerator for directory parsing in storage systems containing massive files.",
            "Handling partitioning skew in MapReduce using LEEN.",
            "A novel cooperative caching algorithm for massive P2P caches.",
            "Tag-based personalized image ranking in event browsing."
        ]
    },
    {
        "name": "PPNA",
        "year": "2012",
        "info": "Volume 5: 2012",
        "count": 30,
        "papers": [
            "Shortcoming, problems and analytical comparison for flooding-based search techniques in unstructured P2P networks.",
            "Implications of the file names and user requested queries on Gnutella performance.",
            "I-Swifter: Improving chunked network coding for peer-to-peer content distribution.",
            "Reward only is not enough: Evaluating and improving the fairness policy of the P2P file sharing network eMule/eDonkey.",
            "A peer-to-peer system for on-demand sharing of capacity across network applications.",
            "Pulp: An adaptive gossip-based dissemination protocol for multi-source message streams.",
            "Peer profile based trust model for P2P systems using genetic algorithm.",
            "Decentralized certification scheme for secure admission in on-the-fly peer-to-peer systems.",
            "PLATON: Peer-to-Peer load adjusting tree overlay networks.",
            "MANET adaptive structured P2P overlay.",
            "Special issue on protocols and applications for wireless and mobile peer-to-peer networks.",
            "Modeling resource constrained BitTorrent proxies for energy efficient mobile content sharing.",
            "Towards an effective integration of cellular users to the structured Peer-to-Peer network.",
            "A distributed trust management model for mobile P2P networks.",
            "Enabling broadcast of user-generated live video without servers.",
            "Simulating peer-to-peer cloud resource scheduling.",
            "Verifying remote data integrity in peer-to-peer data storage: A comprehensive survey of protocols.",
            "Effect of node churn on frame interval for peer-to-peer video streaming with data-block synchronization mechanism.",
            "An incentive scheduling mechanism for peer-to-peer video streaming.",
            "File size models for shared content over the BitTorrent Peer-to-Peer network.",
            "Organisation and management of shared documents in super-peer networks based semantic hierarchical cluster trees.",
            "Multimedia P2P networking: Protocols, solutions and future directions.",
            "EUE principle of resource scheduling for live streaming systems underlying CDN-P2P hybrid architecture.",
            "Distributed WiFi detection and integration in dense urban mobile Peer-to-Peer networks.",
            "An efficient search mechanism for supporting partial filename queries in structured peer-to-peer overlay.",
            "Distributed context aware collaborative filtering approach for P2P service selection and recovery in wireless mesh networks.",
            "P2P IP Telephony over wireless ad-hoc networks - A smart approach on super node admission.",
            "Downloading trace study for BitTorrent P2P performance measurement and analysis.",
            "Investigation of a large-scale P2P VoD overlay network by measurements.",
            "Chams: Churn-aware overlay construction for media streaming."
        ]
    },
    {
        "name": "PPNA",
        "year": "2011",
        "info": "Volume 4: 2011",
        "count": 29,
        "papers": [
            "Special issue on information dissemination and new services in P2P systems.",
            "PSON: A scalable P2P file sharing system with efficient complex query support.",
            "Diverse community: Demand differentiation in P2P live streaming.",
            "Evaluation framework for adaptive context-aware routing in large scale mobile peer-to-peer systems.",
            "LiquidStream - network dependent dynamic P2P live streaming.",
            "Integrated buffering schemes for P2P VoD services.",
            "Security and privacy issues in P2P streaming systems: A survey.",
            "Ad-hoc limited scale-free models for unstructured peer-to-peer networks.",
            "Exploiting community feedback for information retrieval in DHT networks.",
            "Trust-based exchange of services to motivate cooperation in P2P networks.",
            "Black-box analysis of Internet P2P applications.",
            "A scalable interest-oriented peer-to-peer pub/sub network.",
            "Sorcery: Overcoming deceptive votes in P2P content sharing systems.",
            "Multi-objective optimization based privacy preserving distributed data mining in Peer-to-Peer networks.",
            "Survey of search and optimization of P2P networks.",
            "Sparse structures for searching and broadcasting algorithms over internet graphs and peer-to-peer computing systems.",
            "Incorporating contribution-awareness into mesh-based Peer-to-Peer streaming systems.",
            "Avoidance of churn rate through temporal centralization in Chord.",
            "Fuzzynet: Ringless routing in a ring-like structured overlay.",
            "Optimizing BitTorrent-like peer-to-peer systems in the presence of network address translation devices.",
            "SyMon: A practical approach to defend large structured P2P systems against Sybil Attack.",
            "Attack resilient P2P dissemination of RSS feed.",
            "mSSL: A framework for trusted and incentivized peer-to-peer data sharing between distrusted and selfish clients.",
            "Survey on hierarchical routing schemes in \"flat\" distributed hash tables.",
            "Multifactor hierarchical fuzzy trust evaluation on peer-to-peer networks.",
            "Dynamic storage and access load balancing for answering range queries in peer-to-peer networks.",
            "A study on key strategies in P2P file sharing systems and ISPs' P2P traffic management.",
            "An identity-based approach to secure P2P applications with Likir.",
            "Probabilistic and reactive fault diagnosis for dynamic overlay networks."
        ]
    },
    {
        "name": "PPNA",
        "year": "2010",
        "info": "Volume 3: 2010",
        "count": 28,
        "papers": [
            "Editorial: Special issue on dependable peer-to-peer systems.",
            "Performance-driven calibration of ERGO.",
            "User selfishness vs. file availability in P2P file-sharing systems: Evolutionary game theoretic approach.",
            "Enhancing tit-for-tat for incentive in BitTorrent networks.",
            "On the feasibility of exploiting P2P systems to launch DDoS attacks.",
            "Hierarchical codes: A flexible trade-off for erasure codes in peer-to-peer storage systems.",
            "Efficient search based on content similarity over self-organizing P2P networks.",
            "Editorial: Peer-to-peer networking and applications, volume 3, issue 2.",
            "SPACE: A lightweight collaborative caching for clusters.",
            "CliqueStream: Creating an efficient and resilient transport overlay for peer-to-peer live streaming using a clustered DHT.",
            "Evaluating and improving the content access in KAD.",
            "Peer-to-peer secure multi-party numerical computation facing malicious adversaries.",
            "Popularity-aware prefetch in P2P range caching.",
            "Gender differences in digital music distribution methods.",
            "Peer-to-peer systems for video delivery.",
            "iGridMedia: The system to provide low delay peer-to-peer live streaming service over internet.",
            "Adaptive topology formation for peer-to-peer video streaming.",
            "Delay and playout probability trade-off in mesh-based peer-to-peer streaming with delayed buffer map updates.",
            "A decentralised service composition approach for peer-to-peer video delivery.",
            "Measurement and enhancement of BitTorrent-based video file swarming.",
            "Editorial: Peer-to-Peer networking and applications, Volume 3, Issue 4.",
            "A survey on peer-to-peer SIP based communication systems.",
            "Stealth modification versus nuisance attacks in the LOCKSS peer-to-peer digital preservation system.",
            "On-demand waypoints for live P2P video broadcasting.",
            "A conceptual model for data management and distribution in peer-to-peer systems.",
            "Decentralising a service-oriented architecture.",
            "An experimental analysis of Joost peer-to-peer VoD service.",
            "From P2P to reliable semantic P2P systems."
        ]
    },
    {
        "name": "PPNA",
        "year": "2009",
        "info": "Volume 2: 2009",
        "count": 28,
        "papers": [
            "Editorial: Special issue on modelling and applications of computational Peer-to-Peer networks: Volume 2, Issue 1.",
            "A grouped P2P network for scalable grid information services.",
            "Reputation based friend-to-friend networks.",
            "Peer sampling with improved accuracy.",
            "Adaptive neighborhood selection in peer-to-peer networks based on content similarity and reputation.",
            "Adaptive component composition and load balancing for distributed stream processing applications.",
            "Characterization of signaling and traffic in Joost.",
            "Editorial: Peer-to-peer networking and applications, volume 2, issue 2.",
            "Exploiting unlabeled data to improve peer-to-peer traffic classification using incremental tri-training method.",
            "Efficient and scalable search on scale-free P2P networks.",
            "An analysis of peer-to-peer networks with altruistic peers.",
            "XCube: Processing XPath queries in a hypercube overlay network.",
            "A contribution-based service differentiation scheme for peer-to-peer systems.",
            "Context-aware trust negotiation in peer-to-peer service collaborations.",
            "Editorial: Special issue on mobile P2P networking and computing.",
            "PatchPeer: A scalable video-on-demand streaming system in hybrid wireless mobile peer-to-peer networks.",
            "DAg-stream: Distributed video adaptation for overlay streaming to heterogeneous devices.",
            "Improving robustness of P2P applications in mobile environments.",
            "An economic incentive model for encouraging peer collaboration in mobile-P2P networks with support for constraint queries.",
            "Mastering selfishness and heterogeneity in mobile P2P content distribution networks with multiple source download in cellular networks.",
            "Subscriber mobility management for a P2P publish/subscribe overlay in mobile tactical networks.",
            "Editorial: Peer-to-peer networking and applications, volume 2, issue 4.",
            "Facilitating resource discovery in grid environments with peer-to-peer structured tuple spaces.",
            "Gossiping protocols for hybrid grid resource scheduling.",
            "Structured P2P technologies for distributed command and control.",
            "Dealing with network partitions in structured overlay networks.",
            "NodeWiz: Fault-tolerant grid information service.",
            "An open digital environment to support business ecosystems."
        ]
    },
    {
        "name": "PPNA",
        "year": "2008",
        "info": "Volume 1: 2008",
        "count": 14,
        "papers": [
            "Editorial: Peer-to-Peer Networking and Applications, Volume 1, Issue 1.",
            "An efficient and scalable framework for content-based publish/subscribe systems.",
            "A survey on peer-to-peer video streaming systems.",
            "Incentive mechanism for the CoopNet network.",
            "On peer-to-peer (P2P) content delivery.",
            "DHT routing analysis in a logarithmically transformed space.",
            "An inexpensive unstructured platform for wireless mobile peer-to-peer networks.",
            "Editorial: Peer-to-Peer Networking and Applications Volume 1, Issue 2.",
            "A unifying framework of rating users and data items in peer-to-peer and social networks.",
            "Self-stabilization in preference-based systems.",
            "SUPNET: An end-to-end solution to scalable unstructured P2P networking.",
            "Automatically wrapping legacy software into services: A grid case study.",
            "Distributed, automatic file descriptor tuning in P2P file-sharing systems.",
            "Revisiting free riding and the Tit-for-Tat in BitTorrent: A measurement study."
        ]
    }
]