[
    {
        "year": "2021",
        "name": "18th SECON 2021",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2021",
                "sub_name": "18th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2021, Rome, Italy, July 6-9, 2021.",
                "count": 44,
                "papers": [
                    "An RL Approach for Radio Resource Management in the O-RAN Architecture.",
                    "Vehicle In-Cabin Contactless WiFi Human Sensing.",
                    "WiBle: Physical-Layer Cross-Technology Communication with Symbol Transition Mapping.",
                    "COFlood: Concurrent Opportunistic Flooding in Asynchronous Duty Cycle Networks.",
                    "Software-Defined Visible Light Networking for Bi-Directional Wireless Communication Across the Air-Water Interface.",
                    "A Context-aware Black-box Adversarial Attack for Deep Driving Maneuver Classification Models.",
                    "Bandwidth-Efficient Precoding in Cell-Free Massive MIMO Networks with Rician Fading Channels.",
                    "Compensating Altered Sensitivity of Duty-Cycled MOX Gas Sensors with Machine Learning.",
                    "A Reinforcement Learning based Decision-making System with Aggressive Driving Behavior Consideration for Autonomous Vehicles.",
                    "DAVE: Dynamic Adaptive Video Encoding for Real-time Video Streaming Applications.",
                    "Secure Coded Computation for Efficient Distributed Learning in Mobile IoT.",
                    "SoundFence: Securing Ultrasonic Sensors in Vehicles Using Physical-Layer Defense.",
                    "Collecting High-Dimensional and Correlation-Constrained Data with Local Differential Privacy.",
                    "Improving Quality Control with Industrial AIoT at HP Factories: Experiences and Learned Lessons.",
                    "Incentivizing Opportunistic Data Collection for Time-Sensitive IoT Applications.",
                    "VarLenMARL: A Framework of Variable-Length Time-Step Multi-Agent Reinforcement Learning for Cooperative Charging in Sensor Networks.",
                    "Asynchronous Online Service Placement and Task Offloading for Mobile Edge Computing.",
                    "Authentication through Sensing of Tongue and Lip Motion via Smartphone.",
                    "CORE: Connectivity Optimization via REinforcement Learning in WANETs.",
                    "Joint Space-Frequency Rendezvous for Multi-UAV Relaying Systems.",
                    "A Practical Secret Key Management for Multihop Drone Relay Systems based on Bluetooth Low Energy.",
                    "Cut, Distil and Encode (CDE): Split Cloud-Edge Deep Inference.",
                    "MagThief: Stealing Private App Usage Data on Mobile Devices via Built-in Magnetometer.",
                    "SwarmShare: Mobility-Resilient Spectrum Sharing for Swarm UAV Networking in the 6 GHz Band.",
                    "JammingBird: Jamming-Resilient Communications for Vehicular Ad Hoc Networks.",
                    "Joint Communication-Motion Planning for UAV Relaying in Urban Areas.",
                    "Wi-attack: Cross-technology Impersonation Attack against iBeacon Services.",
                    "Log Management in NFV Service Orchestration.",
                    "A Diverse Noise-Resilient DNN Ensemble Model on Edge Devices for Time-Series Data.",
                    "VibranSee: Enabling Simultaneous Visible Light Communication and Sensing.",
                    "EFCam: Configuration-Adaptive Fog-Assisted Wireless Cameras with Reinforcement Learning.",
                    "Articulation Motion Sensing for Pronunciation Training.",
                    "Traffic-Driven Sounding Reference Signal Resource Allocation in (Beyond) 5G Networks.",
                    "Robust RFID-Based Multi-Object Identification and Tracking with Visual Aids.",
                    "Deep Learning Video Analytics on Edge Computing Devices.",
                    "VibWriter: Handwriting Recognition System based on Vibration Signal.",
                    "mmFlow: Facilitating At-Home Spirometry with 5G Smart Devices.",
                    "MODELESS: MODulation rEcognition with LimitEd SuperviSion.",
                    "SeReMAS: Self-Resilient Mobile Autonomous Systems Through Predictive Edge Computing.",
                    "Deploying Hybrid Network Services: Mixing VNFs and CNFs in Multi-site Infrastructures.",
                    "BIoTA: Control-Aware Attack Analytics for Building Internet of Things.",
                    "UD-MIMO: Uplink Distributed MIMO for Wireless LANs.",
                    "Better off This Way!: Ubiquitous Accessibility Digital Maps via Smartphone-based Crowdsourcing.",
                    "CALM: Contactless Accurate Load Monitoring via Modality Distillation."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "17th SECON 2020",
        "info": "Virtual Event, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2020",
                "sub_name": "17th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2020, Virtual Event, Italy, June 22-25, 2020.",
                "count": 36,
                "papers": [
                    "FlagLoc: Localization Using a Flag for Mobile Wireless Sensor Networks with Measurement Errors.",
                    "TransRes: A Deep Transfer Learning Approach to Migratable Image Super-Resolution in Remote Urban Sensing.",
                    "c-Chirp: Towards Symmetric Cross-technology Communication over Asymmetric Channels.",
                    "CHASTE: Incentive Mechanism in Edge-Assisted Mobile Crowdsensing.",
                    "Filtering Visible Light Reflections with a Single-Pixel Photodetector.",
                    "FlyTera: Echo State Learning for Joint Access and Flight Control in THz-enabled Drone Networks.",
                    "MagStroke: A Magnetic Based Virtual Keyboard for Off-the-Shelf Smart Devices.",
                    "Optimal Resource Allocation for Crowdsourced Image Processing.",
                    "Link Stability Analysis of Wireless Sensor Networks Over the Ocean Surface.",
                    "Robust RFID-based Respiration Monitoring in Dynamic Environments.",
                    "Privacy-Preserving Reputation Management for Blockchain-Based Mobile Crowdsensing.",
                    "Hybrid Intrusion Detection Mechanisms for Integrated Electronic Systems.",
                    "Dynamic Distributed Edge Resource Provisioning via Online Learning across Timescales.",
                    "mmMuxing: Pushing the Limit of Spatial Reuse in Directional Millimeter-wave Wireless Networks.",
                    "Provisioning Edge Inference as a Service via Online Learning.",
                    "Learn to Optimize: Adaptive VNF Provisioning in Mobile Edge Clouds.",
                    "DeepNar: Robust Time-based Sub-meter Indoor Localization using Deep Learning.",
                    "Latency-aware Hybrid Edge Cloud Framework for Mobile Augmented Reality Applications.",
                    "RFCamera: Identifying RFIDs in Pixel Dimensions.",
                    "XHAR: Deep Domain Adaptation for Human Activity Recognition with Smart Devices.",
                    "FlipLoRa: Resolving Collisions with Up-Down Quasi-Orthogonality.",
                    "AirSync: Time Synchronization for Large-scale IoT Networks Using Aircraft Signals.",
                    "Characterization of Multi-User Augmented Reality over Cellular Networks.",
                    "CoHop: Quantitative Correlation based Channel Hopping for Low-power Wireless Networks.",
                    "Cellular Network Traffic Prediction Incorporating Handover: A Graph Convolutional Approach.",
                    "Exploiting Color Sensors to Provide Optimal Lighting and Anonymous Tracking in Stores.",
                    "Millidegree-Level Direction-of-Arrival (DoA) Estimation and Tracking for Terahertz Wireless Communications.",
                    "CaraoKey : Car States Sensing via the Ultra-Wideband Keyless Infrastructure.",
                    "Expressive ASL Recognition using Millimeter-wave Wireless Signals.",
                    "HF RFID-based Book Localization via Mobile Scanning.",
                    "RF-Mirror: Mitigating Mutual Coupling Interference in Two-Tag Array Labeled RFID Systems.",
                    "TrustServing: A Quality Inspection Sampling Approach for Remote DNN Services.",
                    "Instant AoI Optimization in IoT Networks with Packet Combination.",
                    "BLE2LoRa: Cross-Technology Communication from Bluetooth to LoRa via Chirp Emulation.",
                    "A Multi-modal Graph Neural Network Approach to Traffic Risk Forecasting in Smart Urban Sensing.",
                    "Combinatorial Multi-Armed Bandit Based User Recruitment in Mobile Crowdsensing."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2020w",
                "sub_name": "2020 IEEE International Conference on Sensing, Communication and Networking (SECON Workshops), Como, Italy, June 22-26, 2020.",
                "count": 9,
                "papers": [
                    "Velocity Obstacle Based Strategy for Multi-agent Collision Avoidance of Unmanned Aerial Vehicles.",
                    "A Benchmark of Security Metrics in Cyber-Physical Systems.",
                    "Design, Implementation, and Deployment of TempMesh: A Wireless Mesh Network to Aggregate River-Temperature Data.",
                    "Optimizing the energy envelope in the Internet of Things using predictive cubic splines.",
                    "UAVs Path Deviation Attacks: Survey and Research Challenges.",
                    "Implementation of a low-cost weather station developed in design-based learning framework.",
                    "Forecasting Crowd Distribution in Smart Cities.",
                    "Secure IoT Device Architecture Using TrustZone.",
                    "Optimizing the trajectory of drones: trade-off between distance and energy."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "16th SECON 2019",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2019",
                "sub_name": "16th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2019, Boston, MA, USA, June 10-13, 2019.",
                "count": 83,
                "papers": [
                    "Implementation of Password Management System Using Ternary Addressable PUF Generator.",
                    "NB-IoT Network Monitoring and Diagnosing.",
                    "TF2AN: A Temporal-Frequency Fusion Attention Network for Spectrum Energy Level Prediction.",
                    "Long-Range Short-Burst Mobile Mesh Networking: Architecture and Evaluation.",
                    "FoVR: Attention-based VR Streaming through Bandwidth-limited Wireless Networks.",
                    "Trans-Sense: Real Time Transportation Schedule Estimation Using Smart Phones.",
                    "Real Time Attack Detection with Deep Learning.",
                    "Wide-Area GPS Time Monitoring Against Spoofing Using Belief Propagation.",
                    "Quality of Control Assessment for Tactile Cyber-Physical Systems.",
                    "When Wireless Charging Meets Fresnel Zones: Even Obstacles Can Enhance Charging Efficiency.",
                    "Nearly-Optimal Resource Allocation for Coexisting Industrial Wireless Networks with Line Topologies.",
                    "A New Paradigm for Non-contact Vitals Monitoring using Visible Light Sensing.",
                    "Pharos: A Rapid Neighbor Discovery Algorithm for Power-Restricted Wireless Sensor Networks.",
                    "Privacy-Preserving Sketching for Online Social Network Data Publication.",
                    "Compress or Interfere?",
                    "G-Fall: Device-free and Training-free Fall Detection with Geophones.",
                    "FusionEye: Perception Sharing for Connected Vehicles and its Bandwidth-Accuracy Trade-offs.",
                    "Integrity Threat Identification for Distributed IoT in Precision Agriculture.",
                    "AdaComm: Tracing Channel Dynamics for Reliable Cross-Technology Communication.",
                    "An Improved Communications in Cyber Physical System Architecture, Protocols and Applications.",
                    "Algorithms for Provisioning Edge Computing Resources to Minimize Data Transport Costs.",
                    "Strategic Network Infrastructure Sharing through Backup Reservation in a Competitive Environment.",
                    "InDP: In-Network Data Processing for Wireless Sensor Networks.",
                    "Network Function Deployment with Balanced Server and Link Resources in Tree Topologies.",
                    "ReActor: Real-time and Accurate Contactless Gesture Recognition with RFID.",
                    "COSTA: Cost-aware Service Caching and Task Offloading Assignment in Mobile-Edge Computing.",
                    "A Convolutional Neural Network Approach for Classification of LPWAN Technologies: Sigfox, LoRA and IEEE 802.15.4g.",
                    "Machine Learning Based Dynamic Cooperative Transmission Framework for IoUT Networks.",
                    "WiZoom: Accurate Multipath Profiling using Commodity WiFi Devices with Limited Bandwidth.",
                    "Online Data Quality Learning for Quality-Aware Crowdsensing.",
                    "SparseTag: High-Precision Backscatter Indoor Localization with Sparse RFID Tag Arrays.",
                    "VISIT: Placement of Unmanned Aerial Vehicles for Anisotropic Monitoring Tasks.",
                    "DeepLap: A Deep Learning based Non-Specific Low Back Pain Symptomatic Muscles Recognition System.",
                    "Workload-Aware Task Placement in Edge-Assisted Human Re-identification.",
                    "Source Localization and Tracking for Dynamic Radio Cartography using Directional Antennas.",
                    "Towards Scalable Video Analytics at the Edge.",
                    "X-Burst: Enabling Multi-Platform Cross-Technology Communication between Constrained IoT Devices.",
                    "Parallel Feedback Communications for Magnetic MIMO Wireless Power Transfer System.",
                    "PEC: Synthetic Aperture RFID Localization with Aperture Position Error Compensation.",
                    "iTracker: Towards Sustained Self-Tracking in Dynamic Feature Environment with Smartphones.",
                    "A Proof of Concept SRAM-based Physically Unclonable Function (PUF) Key Generation Mechanism for IoT Devices.",
                    "Truthful Quality-Aware Data Crowdsensing for Machine Learning.",
                    "MSNET-Blockchain: A New Framework for Securing Mobile Satellite Communication Network.",
                    "Triangular Antenna Layout Facilitates Deployability of CSI Indoor Localization Systems.",
                    "Pushing the Limit of CSI-based Activity Recognition: An Enhanced Approach via Packet Reconstruction.",
                    "Decentralized Task Allocation in Lossy Networks: A Simulation Study.",
                    "Service Station Positioning for Mobile Charger in Wireless Rechargeable Sensor Networks.",
                    "Grid Software Defined Radio Network Testbed for Hybrid Measurement and Emulation.",
                    "HiPER-V: A High Precision Radio Frequency Vehicle for Aerial Measurements.",
                    "ECO-UW IoT: Eco-friendly Reliable and Persistent Data Transmission in Underwater Internet of Things.",
                    "An Adaptive Power level Allocation Model in LoRa for Internet of Things.",
                    "Occupancy Analytics in Retail Stores Using Wireless Signals.",
                    "A Solution for Dynamic Spectrum Management in Mission-Critical UAV Networks.",
                    "Maximizing Energy Efficiency of Period-Area Coverage with UAVs for Wireless Rechargeable Sensor Networks.",
                    "Millimeter Wave Remote UAV Control and Communications for Public Safety Scenarios.",
                    "MatchMaker: An Inter-operator Network Sharing Framework in Unlicensed Bands.",
                    "Non-Intrusive Deployment of Blockchain in Establishing Cyber-Infrastructure for Smart City.",
                    "Driving in the Fog: Latency Measurement, Modeling, and Optimization of LTE-based Fog Computing for Smart Vehicles.",
                    "Adaptive Resource Management for a Virtualized Computing Platform within Edge Computing.",
                    "ActiveTracker: Uncovering the Trajectory of App Activities over Encrypted Internet Traffic Streams.",
                    "Playing with Fire: Exploring Concurrent Transmissions in Ultra-wideband Radios.",
                    "Formation control of a mono-operated UAV fleet through ad-hoc communications: a Q-learning approach.",
                    "Privacy Invasion through Smarthome IoT Sensing.",
                    "Towards Fast and Reliable WiFi Authentication by Utilizing Visible Light Diversity.",
                    "MOSFET-based Ultra-low-power Realization of Analog Joint Source-Channel Coding for IoTs.",
                    "Dependency-Aware and Latency-Optimal Computation Offloading for Multi-User Edge Computing Networks.",
                    "MType: A Magnetic Field-based Typing System on the Hand for Around-Device Interaction.",
                    "A Machine Learning Approach Using Classifier Cascades for Optimal Routing in Opportunistic Internet of Things Networks.",
                    "IoT Network Security from the Perspective of Adversarial Deep Learning.",
                    "Speech Based Human Authentication on Smartphones.",
                    "Early Classification Approach for Multivariate Time Series using Sensors of Different Sampling Rate.",
                    "Implementing a Real-Time Image Captioning Service for Scene Identification Using Embedded System.",
                    "Ultralow Power Wireless-Fire-Alarm-System using a VO2-Based Metal-Insulator-Transition Device.",
                    "Underwater Datalogger for Accurate Position and Location Estmation and Tracking.",
                    "A Stackelberg Game based River Water Pollution Monitoring System using LoRa Technology.",
                    "DuoRelay: Parallel Interference Nulling using Full-duplex Relaying.",
                    "Joint Beamforming-Power-Bandwidth Allocation in Terahertz NOMA Networks.",
                    "Enabling Secure Voice Input on Augmented Reality Headsets using Internal Body Voice.",
                    "Urban Anomaly Detection by processing Mobile Traffic Traces with LSTM Neural Networks.",
                    "No Entry: Anti-Noise Energy Detector for Chirp-Based Acoustic Communication.",
                    "Learning-based Blockage Prediction for Robust Links in Dynamic Millimeter Wave Networks.",
                    "Commercial Wi-Fi Based Fall Detection with Environment Influence Mitigation.",
                    "FaceInput: A Hand-Free and Secure Text Entry System through Facial Vibration."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "15th SECON 2018",
        "info": "Hong Kong",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2018",
                "sub_name": "15th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2018, Hong Kong, China, June 11-13, 2018.",
                "count": 65,
                "papers": [
                    "Lotus: Evolutionary Blind Regression over Noisy Crowdsourced Data.",
                    "Efficiency and Detectability of Random Reactive Jamming in Wireless Networks.",
                    "ViType: A Cost Efficient On-Body Typing System through Vibration.",
                    "UltraGesture: Fine-Grained Gesture Sensing and Recognition.",
                    "Crowdlearning: Crowded Deep Learning with Data Privacy.",
                    "On Designing Quality-Aware Steering Algorithms for Large-Scale Mobile Crowdsensing.",
                    "Online Incentive Mechanism for Mobile Crowdsourcing Based on Two-Tiered Social Crowdsourcing Architecture.",
                    "Towards Reliable Hypothesis Validation in Social Sensing Applications.",
                    "COALA: Collision-Aware Link Adaptation for LTE in Unlicensed Band.",
                    "Energy Efficiency Maximization in Multi-User Miso Mixed RF/VLC Heterogeneous Cellular Networks.",
                    "AHT: Application-Based Handover Triggering for Saving Energy in Cellular Networks.",
                    "Optimizing Inter-Operator Network Slicing over Licensed and Unlicensed Bands.",
                    "WiAU: An Accurate Device-Free Authentication System with ResNet.",
                    "Maximizing Quality of Aggregation in WSNs under Deadline and Interference Constraints.",
                    "UABeam: UAV-Based Beamforming System Analysis with In-Field Air-to-Ground Channels.",
                    "Information-Driven Distributed Sensing for Efficient Bayesian Inference in Internet of Things Systems.",
                    "Scalability of Wireless Fingerprinting Based Indoor Localization Systems.",
                    "On-Street Parking Guidance with Real-Time Sensing Data for Smart Cities.",
                    "Passenger Demand Prediction with Cellular Footprints.",
                    "SteerTrack: Acoustic-Based Device-Free Steering Tracking Leveraging Smartphones.",
                    "Single-Sensor Motion and Orientation Tracking in a Moving Vehicle.",
                    "cDeepArch: A Compact Deep Neural Network Architecture for Mobile Sensing.",
                    "Context-Free Fine-Grained Motion Sensing Using WiFi.",
                    "Passive Crowd Speed Estimation and Head Counting Using WiFi.",
                    "WiTrace: Centimeter-Level Passive Gesture Tracking Using WiFi Signals.",
                    "Device-Free Localization Based on CSI Fingerprints and Deep Neural Networks.",
                    "Wi-Run: Multi-Runner Step Estimation Using Commodity Wi-Fi.",
                    "Fast and Infuriating: Performance and Pitfalls of 60 GHz WLANs Based on Consumer-Grade Hardware.",
                    "BLEND: BLE Beacon-Aided Fast WiFi Handoff for Smartphones.",
                    "BlueScan: Boosting Wi-Fi Scanning Efficiency Using Bluetooth Radio.",
                    "An Approach to Detect Anomalous Degradation in Signal Strength of IEEE 802.15.4 Links.",
                    "On the Throughput Limit of Multi-Hop Wireless Networks with Reconfigurable Antennas.",
                    "FastTrust: Fast and Anonymous Spatial-Temporal Trust for Connected Cars on Expressways.",
                    "Fog Following Me: Latency and Quality Balanced Task Allocation in Vehicular Fog Computing.",
                    "ABC: Adaptive Beacon Control for Rear-End Collision Avoidance in VANETs.",
                    "Wi-Eye: Tracking Urban Private Vehicles with Inter-Vehicle Communications and Sparse Video Surveillance Cameras.",
                    "CRH: A Contactless Respiration and Heartbeat Monitoring System with COTS RFID Tags.",
                    "Missing-Tag Detection with Presence of Unknown Tags.",
                    "Combating Tag Cloning with COTS RFID Devices.",
                    "How Local Information Improves Rendezvous in Cognitive Radio Networks.",
                    "Towards Optimal Operation State Scheduling in RF-Powered Internet of Things.",
                    "Rethinking Mobile Devices' Energy Efficiency in WLAN Management Services.",
                    "MPF: Prolonging Network Lifetime of Wireless Rechargeable Sensor Networks by Mixing Partial Charge and Full Charge.",
                    "Requirement-Driven Magnetic Beamforming for MIMO Wireless Power Transfer Optimization.",
                    "Stochastic Scheduling Towards Cost Efficient Network Function Virtualization in Edge Cloud.",
                    "Multiple Granularity Online Control of Cloudlet Networks for Edge Computing.",
                    "Deadline-Aware Peer-to-Peer Task Offloading in Stochastic Mobile Cloud Computing Systems.",
                    "Rethinking Virtual Network Embedding in Reconfigurable Networks.",
                    "Link Us if You Can: Enabling Unlinkable Communication on the Internet.",
                    "Frame-Selective Wireless Attack Using Deep-Learning-Based Length Prediction.",
                    "A Stackelberg Game Model for Dynamic Resource Scheduling in Edge Computing with Cooperative Cloudlets.",
                    "Performance Guaranteed Traffic Signal Control with Frame-Based Algorithm.",
                    "RFID Localization Based on Multiple Feature Fusion.",
                    "Spoofing Attack Detection Using Physical Layer Information in Cross-Technology Communication.",
                    "ThunderLoc: Smartphone-Based Crowdsensing for Thunder Localization.",
                    "Recipient-Oriented Transaction for Preventing Double Spending Attacks in Private Blockchain.",
                    "SDWDS: Fault Recovery Automation in IoTs.",
                    "IARA: An Intelligent Application-Aware VNF for Network Resource Allocation with Deep Learning.",
                    "Demonstration of Path-Based Packet Batcher for Accelerating Vectorized Packet Processing.",
                    "Towards Scalable Indoor Localization with Particle Filter and Wi-Fi Fingerprint.",
                    "Simulating Large-Scale Social Sensing Based Edge Computing Systems with Heterogeneous Network Configurations.",
                    "iPand: Accurate Gesture Input with Smart Acoustic Sensing on Hand.",
                    "Abstract: An Indoor Localization Simulation Platform for Localization Accuracy Evaluation.",
                    "FPGA Implementation of a Power-Efficient and Low-Memory Capacity Turbo Decoding Architecture.",
                    "An Online Trajectory Compression System Applied to Resource-Constrained GPS Devices in Vehicles."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2018w",
                "sub_name": "2018 IEEE International Conference on Sensing, Communication and Networking, SECON Workshops 2018, Hong Kong, Hong Kong, June 11, 2018.",
                "count": 18,
                "papers": [
                    "The Application of Machine Learning Techniques on Channel Frequency Response Based Indoor Positioning in Dynamic Environments.",
                    "Optimal Citizen-Centric Sensor Placement for Citywide Environmental Monitoring - A Submodular Approach.",
                    "A Real-Time Aware Routing Strategy in Smart City Environments.",
                    "Social Structure Analysis in Internet of Vehicles.",
                    "Model Predictive Compression for Drone Video Analytics.",
                    "Deductive Approach to Processing High-Level Video Activity Queries in UAV Networks.",
                    "Robust Multi-Path Communications for UAVs in the Urban IoT.",
                    "Building UAV-Based Testbeds for Autonomous Mobility and Beamforming Experimentation.",
                    "On Greedy Routing in Dynamic UAV Networks.",
                    "Unmanned Aerial Vehicle Detection Based on Channel State Information.",
                    "Ergonomic Quadcopter Control Using the Leap Motion Controller.",
                    "A New Simulation Algorithm for Absorbing Receiver in Molecular Communication.",
                    "An Effective Distance Measurement Method for Molecular Communication Systems.",
                    "Multi-Gateway Polling for Nanonetworks under Dynamic IoT Backhaul Bandwidth.",
                    "High-Efficiency Target Detection Scheme through Relay Nodes in Chemotactic-Based Molecular Communication.",
                    "Impacts of SW-ARQ on the Latency and Reliability of Diffusive, In-Sequence Molecular Communication.",
                    "Molecular Communication as a Biological System.",
                    "Communication-Inspired Model of Epidemics."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "14th SECON 2017",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2017",
                "sub_name": "14th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2017, San Diego, CA, USA, June 12-14, 2017.",
                "count": 52,
                "papers": [
                    "Towards Crowdsourced Signal Map Construction via Implicit Interaction of IoT Devices.",
                    "Radiation Constrained Fair Wireless Charging.",
                    "Performance Analysis and Tuning of Coexisting Duty Cycling WiFi and Wireless Sensor Networks.",
                    "Share Brings Benefits: Towards Maximizing Revenue for Crowdsourced Mobile Network Access.",
                    "A Novel Joint Routing and Channel Allocation Approach in Hybrid Data Center Network.",
                    "A Measurement Study of User-Induced Propagation Effects for UHF Frequency Bands.",
                    "VibSense: Sensing Touches on Ubiquitous Surfaces through Vibration.",
                    "Leveraging Frame Aggregation for Estimating WiFi Available Bandwidth.",
                    "InFRA: Interference-Aware PHY/FEC Rate Adaptation for Video Multicast over WLAN.",
                    "Clockwork: Scheduling Cloud Requests in Mobile Applications.",
                    "3-Dimensional Reconstruction on Tagged Packages via RFID Systems.",
                    "Coverage and Robustness of mm-Wave Urban Cellular Networks: Multi-Frequency HetNets Are the 5G Future.",
                    "RnR: Reverse & Replace Decoding for Collision Recovery in Wireless Sensor Networks.",
                    "Espresso: A Data Naming Service for Self-Summarizing Transport.",
                    "MagnoPark - Locating On-Street Parking Spaces Using Magnetometer-Based Pedestrians' Smartphones.",
                    "Minimizing Data Distortion of Periodically Reporting IoT Devices with Energy Harvesting.",
                    "Composite Task Selection with Heterogeneous Crowdsourcing.",
                    "Dynamic Grouping in RFID Systems.",
                    "Roadview: Live View of On-Road Vehicular Information.",
                    "Distributed Real-Time Multimodal Data Forwarding in Unmanned Aerial Systems.",
                    "Beyond K-Anonymity: Protect Your Trajectory from Semantic Attack.",
                    "STASH: Securing Transparent Authentication Schemes Using Prover-Side Proximity Verification.",
                    "Power Distribution Scheduling for Electric Vehicles in Wireless Power Transfer Systems.",
                    "Efficient Tag Identification in Blocker-Assisted RFID Systems.",
                    "Serendipity of Sharing: Large-Scale Measurement and Analytics for Device-to-Device (D2D) Content Sharing in Mobile Social Networks.",
                    "Dodge-Jam: Anti-Jamming Technique for Low-Power and Lossy Wireless Networks.",
                    "Reliable Stream Scheduling with Minimum Latency for Wireless Sensor Networks.",
                    "Motion-Prediction-Based Multicast for 360-Degree Video Transmissions.",
                    "CABLE: Connection Interval Adaptation for BLE in Dynamic Wireless Environments.",
                    "PreSight: Enabling Real-Time Detection of Accessibility Problems on Sidewalks.",
                    "Joint Upload-Download TCP Acceleration over Mobile Data Networks.",
                    "LiRa: A WLAN Architecture for Visible Light Communication with a Wi-Fi Uplink.",
                    "Incentivizing the Biased Requesters: Truthful Task Assignment Mechanisms in Crowdsourcing.",
                    "Distributed Privacy-Protecting Routing in DTN: Concealing the Information Indispensable in Routing.",
                    "Prediction Based User Selection in Time-Sensitive Mobile Crowdsensing.",
                    "Revisiting Sensor MAC for Periodic Monitoring: Why Should Transmitters Be Early Birds?",
                    "Gathering Information in Sensor Networks for Synchronized Freshness.",
                    "Bandwidth-Aware Data Filtering in Edge-Assisted Wireless Sensor Systems.",
                    "Resource and Execution Control for Mobile Offloadee Devices.",
                    "Adaptive Pilot Design for Massive MIMO HetNets with Wireless Backhaul.",
                    "PCASA: Proximity Based Continuous and Secure Authentication of Personal Devices.",
                    "Orchestrating the Data-Plane of Virtual LTE Core Networks.",
                    "Privacy-Preserving Fraud Detection via Cooperative Mobile Carriers with Improved Accuracy.",
                    "HMRL: Relative Localization of RFID Tags with Static Devices.",
                    "Auction Meets Queuing: Information-Driven Data Purchasing in Stochastic Mobile Crowd Sensing.",
                    "Spectral Efficient Cell Selection for LTE-Advanced's Network Densification.",
                    "A Measurement Study of User-Induced Propagation Effects for UHF Frequency Bands.",
                    "Analyzing Head-Mounted AR Device Energy Consumption on a Frame Rate Perspective.",
                    "Sonarbeat: Sonar Phase for Breathing Beat Monitoring with Smartphones.",
                    "iApollo: A Newsfeed Summary Service on NDN.",
                    "Implementing Prover-Side Proximity Verification for Strengthening Transparent Authentication.",
                    "A WSN Testbed for Z-Order Encoding Based Multi-Modal Sensor Data Compression."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2017w",
                "sub_name": "2017 IEEE International Conference on Sensing, Communication and Networking, SECON Workshops, San Diego, CA, USA, June 12, 2017.",
                "count": 3,
                "papers": [
                    "Utilizing Massive MIMO for the Tactile Internet: Advantages and Trade-Offs.",
                    "Distributed Cooperative Communication and Link Prediction in Cloud Robotics.",
                    "FreeDetector: Device-Free Occupancy Detection with Commodity WiFi."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "13th SECON 2016",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2016",
                "sub_name": "13th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2016, London, United Kingdom, June 27-30, 2016.",
                "count": 65,
                "papers": [
                    "A Demo of the PEACH IoT-Based Frost Event Prediction System for Precision Agriculture.",
                    "A Mobility Management Scheme to Reduce the Impact of Channel Heterogeneity in Cognitive Radio Femtocell Networks.",
                    "A Network Monitoring System for High Speed Network Traffic.",
                    "A Reliable and Scalable Broadcast Protocol for Wireless Multi-Hop Networks Using Subcarrier-Level Tone-Signals.",
                    "A Robust Zero-Calibration RF-Based Localization System for Realistic Environments.",
                    "A Synergistic Architecture for RPL over BLE.",
                    "An Empirical Study on Urban IEEE 802.11p Vehicle-to-Vehicle Communication.",
                    "Anti-Pollution Source Location Privacy Preserving Scheme in Wireless Sensor Networks.",
                    "Arpeggio: A Penetration Attack on Glossy Networks.",
                    "Bloom-Filter-Based Profile Matching for Proximity-Based Mobile Social Networking.",
                    "CAE: Collusion Attack Emulator for Privacy-Preserving Data Aggregation Schemes.",
                    "Channel State Information Compression for MIMO Systems Based on Curve Fitting.",
                    "Confining Wi-Fi Coverage: A Crowdsourced Method Using Physical Layer Information.",
                    "Connected Vehicles in Smart Cities: Interworking from Inside Vehicles to Outside.",
                    "Cooperative Coded Data Dissemination for Wireless Sensor Networks.",
                    "Counteracting Denial-of-Sleep Attacks in Wake-Up-Radio-Based Sensing Systems.",
                    "Data Ferry Trajectory Planning for Sweep Coverage Problem with Multiple Mobile Sensors.",
                    "Deadline-Sensitive Mobile Data Offloading via Opportunistic Communications.",
                    "Demo: PotatoScope - Scalable and Dependable Distributed Energy Measurement for WSNs.",
                    "Demonstration of MicroPnP: The Zero-Configuration Wireless Sensing and Actuation Platform.",
                    "Distributed Energy Measurement in WSNs for Outdoor Applications.",
                    "Distributed Learning for Multi-Channel Selection in Wireless Network Monitoring.",
                    "Efficient Scheduling Strategies for Mobile Sensors in Sweep Coverage Problem.",
                    "Energy Neutral Activity Monitoring: Wearables Powered by Smart Inductive Charging Surfaces.",
                    "Energy Synchronized Task Assignment in Rechargeable Sensor Networks.",
                    "Enhancing Smartphone Indoor Localization via Opportunistic Sensing.",
                    "EnLighting: An Indoor Visible Light Communication System Based on Networked Light Bulbs.",
                    "Exploiting Modulation Scheme Diversity in Multicarrier Wireless Networks.",
                    "Fast Collection of Data in Sensor-Augmented RFID Networks.",
                    "Feluda: Provenance-Enabled Diagnosis of Elusive Network Failures in Wireless Sensor Networks.",
                    "FlowIntent: Detecting Privacy Leakage from User Intention to Network Traffic Mapping.",
                    "Furion: Towards Energy-Efficient WiFi Offloading under Link Dynamics.",
                    "GeoPal: Friend Spam Detection in Social Networks Using Private Location Proofs.",
                    "Group Buying Based Incentive Mechanism for Mobile Crowd Sensing.",
                    "Impact of Guard Time Length on IEEE 802.15.4e TSCH Energy Consumption.",
                    "IntenCT: Efficient Multi-Target Counting and Tracking by Binary Proximity Sensors.",
                    "Lightweight Indoor Localization for 60-GHz Millimeter Wave Systems.",
                    "MagBoard: Magnetic-Based Ubiquitous Homomorphic Off-the-Shelf Keyboard.",
                    "Maximizing Sensor Lifetime in a Rechargeable Sensor Network via Partial Energy Charging on Sensors.",
                    "Message Dissemination for Throughput Optimization in Storage-Limited Opportunistic Underwater Sensor Networks.",
                    "On Jointly Constructing and Scheduling Multiple Forwarding Trees in Wireless Sensor Networks.",
                    "OpenWSN & OpenMote: Demo'ing a Complete Ecosystem for the Industrial Internet of Things.",
                    "Optimizing Graphical Model Structure for Distributed Inference in Wireless Sensor Networks.",
                    "Performance and Implications of RAN Caching in LTE Mobile Networks: A Real Traffic Analysis.",
                    "PLAT: A Physical-Layer Tag Searching Protocol in Large RFID Systems.",
                    "PrivacyCamera: Cooperative Privacy-Aware Photographing with Mobile Phones.",
                    "QoE-Aware Computation Offloading Scheduling to Capture Energy-Latency Tradeoff in Mobile Clouds.",
                    "QuaRo: A Queue-Aware Robust Coordinated Transmission Strategy for Downlink C-RANs.",
                    "RadarMAC: Mitigating Radar Interference in Self-Driving Cars.",
                    "RedFixHop: Efficient Ultra-Low-Latency Network Flooding.",
                    "Regret-Minimizing Exploration in HetNets with mmWave.",
                    "Scalable Multicast in Highly-Directional 60 GHz WLANs.",
                    "Shortest Path Routing in Unknown Environments: Is the Adaptive Optimal Strategy Available?",
                    "Signal Characteristics on Sensor Data Compression in IoT -An Investigation.",
                    "SMARP: A Stochastic MAC Protocol with Randomized Power Control for Underwater Sensor Networks.",
                    "Smart Congestion Control for Delay- and Disruption Tolerant Networks.",
                    "Social Welfare Maximization Auction for Secondary Spectrum Markets: A Long-Term Perspective.",
                    "Squeeze More from Fingerprints Reporting Strategy for Indoor Localization.",
                    "TBAS: Enhancing Wi-Fi Authentication by Actively Eliciting Channel State Information.",
                    "The Capability of Error Correction for Burst-Noise Channels Using Error Estimating Code.",
                    "TravelMiner: On the Benefit of Path-Based Mobility Prediction.",
                    "Urban Traffic Condition Estimation: Let WiFi Do It.",
                    "Verification of User-Reported Context Claims with Context Correlation Model.",
                    "WarpMap: Accurate and Efficient Indoor Location by Dynamic Warping in Sequence-Type Radio-Map.",
                    "WindCompass: Determine Wind Direction Using Smartphones."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2016w",
                "sub_name": "IEEE International Conference on Sensing, Communication and Networking, SECON 2016 Workshops, London, United Kingdom, June 27, 2016.",
                "count": 9,
                "papers": [
                    "A Connected Devices Testbed for Insight Generation in Support of UK Industry.",
                    "A Dynamic Context-Based Header Compression Algorithm for 6LoWPAN Networks.",
                    "Automating Analytics: How to Learn Metadata Such That Our Buildings Can Learn from Us.",
                    "Connecting Physical Things to a SmartCity-OS.",
                    "Drone Empowered Small Cellular Disaster Recovery Networks for Resilient Smart Cities.",
                    "Enabling Data Processing at the Network Edge through Lightweight Virtualization Technologies.",
                    "Image Analysis for Identifying Mosquito Breeding Grounds.",
                    "Real-Time Identification of Users under the New Structure of Skype.",
                    "Signal Characteristics on Sensor Data Compression in IoT - An Investigation."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "12th SECON 2015",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2015",
                "sub_name": "12th Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2015, Seattle, WA, USA, June 22-25, 2015.",
                "count": 71,
                "papers": [
                    "Cooperative sequential compressed spectrum sensing over wide spectrum band.",
                    "CORE: A combinatorial game-theoretic framework for coexistence rendezvous in DSA networks.",
                    "DASI: A truthful double auction mechanism for secure information transfer in cognitive radio networks.",
                    "RcUBe: Real-time reconfigurable radio framework with self-optimization capabilities.",
                    "CD-MAC: A contention detectable MAC for low duty-cycled wireless sensor networks.",
                    "Energy-efficient statistical delay guarantee for duty-cycled wireless sensor networks.",
                    "On the benefits of network coding to compressive data gathering in wireless sensor networks.",
                    "ResAll: Energy efficiency maximization for wireless energy harvesting sensor networks.",
                    "An altruistic compression-scheduling scheme for cluster-based wireless sensor networks.",
                    "Congestion-adaptive data collection with accuracy guarantee in cyber-physical systems.",
                    "MobileCopy: Resisting correlated node failures to enhance data availability in DTNs.",
                    "Property-based testing of sensor networks.",
                    "Dynamic switching with heterogeneous channels in multichannel 802.11 WLANs.",
                    "Learning Wi-Fi performance.",
                    "Robust CSMA: Adapting to channel and traffic asymmetry.",
                    "WiZizz: Energy efficient bandwidth management in IEEE 802.11ac wireless networks.",
                    "New service discovery algorithm based on DHT for mobile application.",
                    "Source authentication schemes for reprogramming with variable packet size in wireless sensor networks.",
                    "On spatial-temporal truth finding in social sensing.",
                    "RoMD: Robust device-free motion detection usin PHY layer information.",
                    "Distributed and scalable context reasoning in a home environment.",
                    "The smart service proxy - A middlebox for a semantic Web of things.",
                    "Optimized O-ACK: An adaptive wireless MAC protocol for multiple access points.",
                    "Frequency-selective signal sensing with sub-Nyquist uniform sampling scheme.",
                    "Improve your USB experience with Wi-Fi through dynamic QoS adaptation.",
                    "Greedy zone routing: Scalable routing in large scale wireless ad-hoc networks.",
                    "Improving reliability and performance of dense-AP network using DAPnet.",
                    "Dynamic traffic shaping technique for HTTP adaptive video streaming using software defined networks.",
                    "Demo abstract: Unobtrusive real-time shopping assistance in retail stores using smart glasses.",
                    "Demonstration of robotic repair for wireless networks.",
                    "Demo paper: A confidence-aware truth estimation tool for social sensing applications.",
                    "A demonstration of evolved user equipment for collaborative wireless backhauling in next generation cellular networks.",
                    "A semi-distributed mechanism for inter-cell interference coordination exploiting the ABSF paradigm.",
                    "Efficient area formation for LTE broadcasting.",
                    "Robust data rate estimation with stochastic SINR modeling in multi-interference OFDMA networks.",
                    "Power-controlled channel access protocol for wireless networks with full-duplex and OFDMA capabilities.",
                    "SAMU: Design and implementation of selectivity-aware MU-MIMO for wideband WiFi.",
                    "Scaling multi-user MIMO WLANs: The case for concurrent uplink control messages.",
                    "Connection-less communication of IoT devices over LTE mobile networks.",
                    "Enabling ubiquitous interaction with smart things.",
                    "QU-RPL: Queue utilization based RPL for load balancing in large scale industrial applications.",
                    "SMACK: Short message authentication check against battery exhaustion in the Internet of Things.",
                    "A multipath routing overlay for networks with blockage.",
                    "Characterizing data deliverability of greedy routing in wireless sensor networks.",
                    "Deadline-sensitive opportunistic utility-based routing in cyclic mobile social networks.",
                    "MuCAR: A greedy multi-flow-based coding-aware routing in wireless networks.",
                    "An information-driven incentive scheme with consumer demand awareness for participatory sensing.",
                    "Characterization of wireless multi-device users.",
                    "Confidence-aware truth estimation in social sensing applications.",
                    "Utility-maximizing data collection in crowd sensing: An optimal scheduling approach.",
                    "Data collection and event detection in the deep sea with delay minimization.",
                    "DEEL: Detecting elevation of urban roads with smartphones on wheels.",
                    "Evidence-based landscape rehabilitation through microclimate sensing.",
                    "ScorePlus: An integrated scalable cyber-physical experiment environment for Smart Grid.",
                    "A self-adaptive handoff decision algorithm for densely deployed closed-group femtocell networks.",
                    "Efficient, adaptive and scalable device activation for M2M communications.",
                    "Evolved user equipment for collaborative wireless backhauling in next generation cellular networks.",
                    "Primary social behavior aware routing and scheduling for Cognitive Radio Networks.",
                    "SUBSET: A joint design of channel selection and channel hopping for fast blind rendezvous in cognitive radio ad hoc networks.",
                    "Whitespace measurement and virtual backbone construction for Cognitive Radio Networks: From the social perspective.",
                    "Enabling privacy-preserving first-person cameras using low-power sensors.",
                    "JICE: Joint data compression and encryption for wireless energy auditing networks.",
                    "Make smartphones last a day: Pre-processing based computer vision application offloading.",
                    "Optimizing TCP loss recovery performance over mobile data networks.",
                    "QiLoc: A Qi wireless charging based system for robust user-initiated indoor location services.",
                    "iMap: Automatic inference of indoor semantics exploiting opportunistic smartphone sensing.",
                    "Is cooperative localization in wireless body area networks accurate enough for motion capture applications?",
                    "A tale of two cities - Characterizing social community structures of fleet vehicles for modeling V2V information dissemination.",
                    "Crowdsourcing undersampled vehicular sensor data for pothole detection.",
                    "D3: Abnormal driving behaviors detection and identification using smartphone sensors.",
                    "QA-share: Towards efficient QoS-aware dispatching approach for urban taxi-sharing."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2015w",
                "sub_name": "12th Annual IEEE International Conference on Sensing, Communication, and Networking Workshops, SECON Workshops 2015, Seattle, WA, USA, June 22-25, 2015.",
                "count": 9,
                "papers": [
                    "Monitoring urban traffic using semantic web services on smartphones - a case study.",
                    "Mediated aggregate signature schemes in wireless sensor networks.",
                    "Coopetition in M2M ecosystem - the case of smart cities.",
                    "A reliable and energy efficient IoT data transmission scheme for smart cities based on redundant residue based error correction coding.",
                    "Benchmarking renderscript: potential for energy efficient multi-core mobile devices.",
                    "A sun energy harvester model for the network simulator 3 (ns-3).",
                    "Components of fog computing in an industrial internet of things context.",
                    "The IoT hub: a fog node for seamless management of heterogeneous connected smart objects.",
                    "Help your mobile applications with fog computing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "11th SECON 2014",
        "info": "Singapore",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2014",
                "sub_name": "Eleventh Annual IEEE International Conference on Sensing, Communication, and Networking, SECON 2014, Singapore, June 30 - July 3, 2014.",
                "count": 84,
                "papers": [
                    "Location assisted handoffs in dense cellular networks.",
                    "Exploring the potential for full-duplex in legacy LTE systems.",
                    "On the estimation of available bandwidth in broadband cellular networks.",
                    "Utility-maximization framework for dynamic adaptive streaming over HTTP in multi-user MIMO LTE networks.",
                    "Delay-constrained single-copy multi-path data transmission in mobile opportunistic networks.",
                    "Scalable opportunistic forwarding algorithms in delay tolerant networks using similarity hashing.",
                    "Helper node allocation strategies for content dissemination in intermittently connected mobile networks.",
                    "Online learning for multi-channel opportunistic access over unknown Markovian channels.",
                    "SpyLoc: A light weight localization system for smartphones.",
                    "Time and energy efficient localization.",
                    "KARMA: Improving WiFi-based indoor localization with dynamic causality calibration.",
                    "Locating multiple ultrasound targets in chorus.",
                    "On the impact of 802.11n frame aggregation on end-to-end available bandwidth estimation.",
                    "Uncovering a Hidden wireless menace: Interference from 802.11x MAC acknowledgment frames.",
                    "From routine to network deployment for data offloading in metropolitan areas.",
                    "MUTE: Sounding inhibition for MU-MIMO WLANs.",
                    "SenseFleet: A smartphone-based driver profiling platform.",
                    "MUTAS: Multi-screen TV experience as a service through cloud centric media network.",
                    "Demonstration of a video-aware multicast opportunistic routing protocol over 802.11 two-hop mesh networks.",
                    "Demonstrating map++: A crowd-sensing system for automatic map semantics identification.",
                    "eDomus: User-home interactions through Facebook and Named Data Networking.",
                    "Wireless deployed and participatory sensing system for environmental monitoring.",
                    "Demo Abstract: Wind measurements for water quality studies in urban reservoirs.",
                    "Primary-secondary immune response adaptation for wireless sensor network.",
                    "On eliminating energy inefficiency of the packet overhearing problem in high traffic wireless LANs.",
                    "A visual feedback training method for unilateral neglect patient treatment.",
                    "Area coverage under low sensor density.",
                    "Robust data gathering method using controlled mobility in underwater sensor network.",
                    "Dynamic multi-rate parallel transmission for power saving of stations in wireless LAN multicast.",
                    "Dynamic time-shift scheduling of periodical traffic in wireless sensor network.",
                    "UserIntent: Detection of user intent for triggering smartphone sensing applications.",
                    "Compressed sensing based direct conversion receiver with interference reducing sampling strategy.",
                    "Development of smart LED lighting system using multi-sensor module and bluetooth low energy technology.",
                    "Local sequence based rendezvous algorithms for Cognitive Radio Networks.",
                    "A new communication framework for wide-band cognitive radio networks.",
                    "Compressive wireless data transmissions under channel perturbation.",
                    "Performance analysis of distributed raptor codes in wireless relay networks.",
                    "QueueSense: Collaborative recognition of queuing on mobile phones.",
                    "Sensing processes participation game of smartphones in participatory sensing systems.",
                    "QoI-aware energy-efficient participant selection.",
                    "REPC: Reliable and efficient participatory computing for mobile devices.",
                    "Securing underwater acoustic communications through analog network coding.",
                    "GlobalTrust: An attack-resilient reputation system for tactical networks.",
                    "Delegation-based authentication and authorization for the IP-based Internet of Things.",
                    "Secret key extraction using Bluetooth wireless signal strength measurements.",
                    "Seasonal wireless sensor network link performance in boreal forest phenology monitoring.",
                    "Exploiting error estimating codes for packet length adaptation in wireless sensor networks.",
                    "Fine-grained analysis of packet losses in wireless sensor networks.",
                    "High-speed enoding/decoding technique for reliable data transmission in wireless sensor networks.",
                    "Distributed load balancing by two-hop relaying in LTE-Advanced networks.",
                    "Increasing user throughput in cellular networks with interference alignment.",
                    "Power allocation with stackelberg game in femtocell networks: A self-learning approach.",
                    "Energy cost reduction in cellular networks through dynamic base station activation.",
                    "Exploiting link correlation for core-based dissemination in wireless sensor networks.",
                    "Dynamic logging with Dylog for networked embedded systems.",
                    "Agile sink selection in wireless sensor networks.",
                    "Low-power and topology-free data transfer protocol with synchronous packet transmissions.",
                    "Frequency and code modulations for underwater acoustic spread spectrum communication.",
                    "RISM: An efficient spectrum management system for underwater cognitive acoustic networks.",
                    "Vehicular networks on two Madrid highways.",
                    "Measurement-based modeling of packet inter-reception time in presence of radio channel congestion.",
                    "Minimizing communication delay in RFID-based wireless rechargeable sensor networks.",
                    "Schedulability decision of charging missions in wireless rechargeable sensor networks.",
                    "Joint charging and rate allocation for utility maximization in sustainable sensor networks.",
                    "Recharging schedules for wireless sensor networks with vehicle movement costs and capacity constraints.",
                    "Skeleton construction in mobile social networks: Algorithms and applications.",
                    "Video-aware multicast opportunistic routing over 802.11 two-hop mesh networks.",
                    "Improving mobile video telephony.",
                    "On the heavy tail properties of spatial node density for realistic mobility modeling.",
                    "Data aggregation scheduling in wireless networks with Cognitive Radio capability.",
                    "Towards near optimal network coding for secondary users in cognitive radio networks.",
                    "Entropy based compressive wideband spectrum sensing for small-scale primary users.",
                    "Smart meters with TV gray spaces connectivity: A feasibility study for two reference network topologies.",
                    "Map++: A crowd-sensing system for automatic map semantics identification.",
                    "BLISS: Budget LImited robuSt crowdSensing through online learning.",
                    "PhonePool: On energy-efficient mobile network collaboration with provider aggregation.",
                    "Optimizing multi-copy two-hop routing in mobile social networks.",
                    "Has green energy arrived? Delay analysis for energy harvesting communication systems.",
                    "Optimal transmission policies for energy harvesting node with non-ideal circuit power.",
                    "Dial it in: Rotating RF sensors to enhance radio tomography.",
                    "Energy efficient radio tomographic imaging.",
                    "Addressing biosignal data sharing security issues with robust watermarking.",
                    "Towards privacy-preserving and secure opportunistic routings in VANETs.",
                    "SEW-ing a Simple Endorsement Web to incentivize trustworthy participatory sensing."
                ]
            },
            {
                "sub_name_abbr": "conf/secon/2014w",
                "sub_name": "Eleventh Annual IEEE International Conference on Sensing, Communication, and Networking Workshops, SECON Workshops 2014, Singapore, June 30 - July 3, 2014.",
                "count": 13,
                "papers": [
                    "Self-organizing TCP with multiple wireless LAN.",
                    "Adaptive sink selection for WSNs using forwarder set based dynamic duty cycling.",
                    "NDN-Q: An NDN query mechanism for efficient V2X data collection.",
                    "Maximizing the route capacity in Cognitive Radio networks.",
                    "Integrating wireless sensor networks within a city cloud.",
                    "Simulating dynamic spectrum access using ns-3 for wireless networks in smart environments.",
                    "Database access strategy for TV White Space cognitive radio networks.",
                    "Surviving wireless energy interference in RF-harvesting sensor networks: An empirical study.",
                    "Constant subblock composition codes for simultaneous energy and information transfer.",
                    "Harvesting-aware control of wireless sensor nodes using fuzzy logic and differential evolution.",
                    "Large-system analysis of ergodic sum-rate in wireless-powered MIMO communication network.",
                    "QoS-based multicast beamforming for SWIPT.",
                    "Utility maximization for wirelessly powered multiple-antenna systems."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "10th SECON 2013",
        "info": "New Orleans, LA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2013",
                "sub_name": "10th Annual IEEE International Conference on Sensing, Communications and Networking, SECON 2013, New Orleans, LA, USA, 24-27 June, 2013.",
                "count": 76,
                "papers": [
                    "Energy efficient and scalable device-to-device discovery protocol with fast discovery.",
                    "Evaluation of DECT for low latency real-time industrial control networks.",
                    "Opening the loops - Towards semantic, information-centric networking in the Internet of Things.",
                    "Network self-organization in the Internet of Things.",
                    "Actuator quality in the Internet of Things.",
                    "EPIC: Efficient path-independent capabilities in mobile ad hoc networks.",
                    "Heuristic clustering with secured routing in Heterogeneous Sensor Networks.",
                    "Using encryption for authentication: Wireless sensor network case.",
                    "Modeling and analysis of LEAP, a key management protocol for wireless sensor networks.",
                    "Spectrum engineering and private frequency utilization in wireless communications education.",
                    "Design and deployment of a heart rate monitoring system in a senior center.",
                    "The smartphone as a medical device: Assessing enablers, benefits and challenges.",
                    "Quantitative assessment of tremor during deep brain stimulation using a wearable glove system.",
                    "Making 802.11 DCF near-optimal: Design, implementation, and evaluation.",
                    "iQueue-MAC: A traffic adaptive duty-cycled MAC protocol with dynamic slot allocation.",
                    "Distributed MAC and rate adaptation for ultrasonically networked implantable sensors.",
                    "TAS-MAC: A traffic-adaptive synchronous MAC protocol for wireless sensor networks.",
                    "Data preservation in intermittently connected sensor networks with data priority.",
                    "Zigzag: Partial mutual revocation based trust management in tactical ad hoc networks.",
                    "An adaptive privacy-preserving scheme for location tracking of a mobile user.",
                    "Smartphone based user verification leveraging gait recognition for mobile healthcare systems.",
                    "Characterization of 802.11n wireless LAN performance via testbed measurements and statistical analysis.",
                    "Joint rate and channel width adaptation for 802.11 MIMO wireless networks.",
                    "Electronically-switched directional antennas for wireless sensor networks: A full-stack evaluation.",
                    "Adaptive antenna adjustment for 3D urban wireless mesh networks.",
                    "Energy and bandwidth-efficient Wireless Sensor Networks for monitoring high-frequency events.",
                    "Toward optimal sniffer-channel assignment for reliable monitoring in multi-channel wireless networks.",
                    "On packet size and error correction optimisations in low-power wireless networks.",
                    "A long-term study of correlations between meteorological conditions and 802.15.4 link performance.",
                    "MobiTribe: Enabling device centric social networking on smart mobile devices.",
                    "StreamSmart: P2P video streaming for smartphones through the cloud.",
                    "A prototype of Virtual Traffic Lights on Android-based smartphones.",
                    "A virtual indoor localization testbed for Wireless Sensor Networks.",
                    "Exploring MAC parallelization on software defined radio platforms.",
                    "Telemedicine assessment of fall risk using wireless sensors.",
                    "Aggregator modeling with multiple active/sleep modes for wireless sensor networks.",
                    "Enabling sustainable sensing in adverse environments.",
                    "Design of a self-forming, self-healing small-medium infrastructure wireless mesh network.",
                    "Distributed fair-efficient power allocation in two-hop relay networks.",
                    "Expediting phase convergence of binary feedback based distributed beamforming.",
                    "Optimizing intersection traffic flow using VANET.",
                    "Joint sleep scheduling and routing for lifetime optimization in delay-sensitive sensor networks.",
                    "To scan or not to scan: The effect of channel heterogeneity on optimal scanning policies.",
                    "Data gathering optimization by dynamic sensing and routing in rechargeable sensor networks.",
                    "Recursive validation and clustering for distributed spectrum sensing in CR-MANET.",
                    "On-mote compressive sampling to reduce power consumption for wireless sensors.",
                    "SugarTrail: Indoor navigation in retail environments without surveys and maps.",
                    "Joint ultra-wideband and signal strength-based through-building tracking for tactical operations.",
                    "Bias adjustment of spatially-distributed wireless pollution sensors for environmental studies in India.",
                    "Imaging seismic tomography in sensor network.",
                    "Interference Aware Adaptive Clear Channel Assessment for improving ZigBee packet transmission under Wi-Fi interference.",
                    "X-WING: A high-speed wireless broadcasting framework for IEEE 802.11 networks.",
                    "Surviving the RF smog: Making Body Area Networks robust to cross-technology interference.",
                    "Distributed association control in shared wireless networks.",
                    "Nearly optimal asynchronous blind rendezvous algorithm for Cognitive Radio Networks.",
                    "Rate-percentile-optimal sequential channel sensing and probing in cognitive radio networks under spectrum uncertainty.",
                    "Minimum-Latency Broadcast Scheduling for Cognitive Radio Networks.",
                    "Beyond interference avoidance: On transparent coexistence for multi-hop secondary CR networks.",
                    "Mobile video delivery via human movement.",
                    "Design and implementation of a frequency-aware wireless video communication system.",
                    "Building blocks of physical-layer network coding.",
                    "A rapid prototyping framework for practical OFDMA systems using Software Defined Radios.",
                    "Sub-carrier Switch Off in OFDM-based wireless local area networks.",
                    "Ravine streams: Persistent data streams in disruptive sensor networks.",
                    "Capacity optimization of femtocell networks.",
                    "Joint carrier aggregation and packet scheduling in LTE-advanced networks.",
                    "Minimizing capacity requirements of cellular networks via delayed scheduling.",
                    "Enabling energy-aware collaborative mobile data offloading for smartphones.",
                    "How to jam without getting caught: Analysis and empirical study of stealthy periodic jamming.",
                    "Efficient wireless security through jamming, coding and routing.",
                    "ASIA: Accelerated secure in-network aggregation in vehicular sensing networks.",
                    "Combined secure storage and communication for the Internet of Things.",
                    "Multicent: A multifunctional incentive scheme adaptive to diverse performance objectives for DTN routing.",
                    "Delay analysis of bursty traffic in finite-buffer disruption-tolerant networks with two-hop routing.",
                    "Plankton: An efficient DTN routing algorithm.",
                    "Opportunistic walks on Random Geometric Networks and their application in scalability analysis."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "9th SECON 2012",
        "info": "Seoul, Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2012",
                "sub_name": "9th Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2012, Seoul, Korea (South), June 18-21, 2012.",
                "count": 93,
                "papers": [
                    "Harmonic quorum systems: Data management in 2D/3D wireless sensor networks with holes.",
                    "On renewable sensor networks with wireless energy transfer: The multi-node case.",
                    "QoI-aware energy management in Internet-of-Things sensory environments.",
                    "Online learning for combinatorial network optimization with restless Markovian rewards.",
                    "Towards introducing self-configurability in cognitive femtocell networks.",
                    "The user-centric mobility support scheme.",
                    "Enhancing MIH for optimum network performance and handovers in heterogeneous networks.",
                    "Error distribution in maximum likelihood estimation of radio propagation model parameters.",
                    "Contention mitigated EDCA algorithm for reliable smart grid mesh networks.",
                    "Link configuration and message forwarding for intermittently connected mobile networks.",
                    "Implications of route oscillation in partial interference.",
                    "Adaptive-reliable medium access control protocol for wireless body area networks.",
                    "Link correlation and network coding in broadcast protocols for wireless sensor networks.",
                    "Dynamic priority scheduling for heterogeneous cognitive radio networks.",
                    "Adaptive wireless mesh networks architecture based on IEEE 802.11s for public surveillance.",
                    "OPERETTA: Demonstrating an optimal energy efficient bandwidth aggregation system.",
                    "MOVi+: Improving the scalability of mobile opportunistic video-on-demand.",
                    "Bayesian navigation system with particle filtering and dead reckoning in urban canyon environments.",
                    "Using VIRMANEL and SILUMOD to study protocol for mobile multihop networks.",
                    "Connecting soil to the cloud: A wireless underground sensor network testbed.",
                    "Demonstrating on-demand listening and data forwarding in wireless body area networks.",
                    "How to reliably integrate medical devices over wireless.",
                    "Developing the IEEE 802.11s based reliable Smart Grid mesh networks.",
                    "Interference coordination scheme between WiFi and Zigbee networks.",
                    "Pragmatic low-power interoperability: ContikiMAC vs TinyOS LPL.",
                    "Integrated detection and mitigation of pollution attack in wireless network coding: Physical layer approach.",
                    "Measurement-based Call Admission Control algorithm for multi-rate VoWLANs.",
                    "CEEC: Centralized energy efficient clustering a new routing protocol for WSNs.",
                    "Biomimetic fish robot controlling system by using underwater acoustic signal.",
                    "MobiCon: Mobile context monitoring platform: Incorporating context-awareness to smartphone-centric personal sensor networks.",
                    "Simulating power/energy consumption of sensor nodes with flexible hardware in wireless networks.",
                    "OPERETTA: An optimal energy efficient bandwidth aggregation system.",
                    "An energy-efficient approach for provenance transmission in wireless sensor networks.",
                    "AutoSync: Automatic duty-cycle control for synchronous low-power listening.",
                    "Convergecast with aggregatable data classes.",
                    "Flexible beacon scheduling scheme for interference mitigation in body sensor networks.",
                    "Network stability of cognitive radio networks in the presence of heavy tailed traffic.",
                    "PION: Human mobility-based service provisioning framework for smartphone users.",
                    "DECA: Recovering fields of physical quantities from incomplete sensory data.",
                    "Online anomaly rate parameter tracking for anomaly detection in wireless sensor networks.",
                    "Online data recovery in wireless sensor networks.",
                    "Optimal solution for the index coding problem using network coding over GF(2).",
                    "MURAO: A multi-level routing protocol for acoustic-optical hybrid underwater wireless sensor networks.",
                    "Cross-layer routing on MIMO-OFDM underwater acoustic links.",
                    "MDR: A P2P-based market-guided distributed routing mechanism for high-throughput hybrid wireless networks.",
                    "Bubble routing: A scalable algorithm with guaranteed delivery in 3D sensor networks.",
                    "Maximizing timely content advertising in DTNs.",
                    "Offloading cellular networks through ITS content download.",
                    "DOVE: Data dissemination to a fixed number of receivers in VANET.",
                    "Identifying infection sources in large tree networks.",
                    "Improving crowd-sourced Wi-Fi localization systems using Bluetooth beacons.",
                    "Range-free selective multilateration for anisotropic wireless sensor networks.",
                    "Uncertainty-aware localization solution for under-ice autonomous underwater vehicles.",
                    "JSL: Joint time synchronization and localization design with stratification compensation in mobile underwater sensor networks.",
                    "On-demand data forwarding for automatic adaptation of data propagation in WBANs.",
                    "A metric for opportunistic routing in duty cycled wireless sensor networks.",
                    "Workload-aware opportunistic routing in multi-channel, multi-radio wireless mesh networks.",
                    "Universal opportunistic routing scheme using network coding.",
                    "Building an efficient overlay for publish/subscribe in wireless sensor networks.",
                    "No-reboot and zero-flash over-the-air programming for Wireless Sensor Networks.",
                    "The time-keeping anomaly of energy-saving sensors: Manifestation, solution, and a structural monitoring case study.",
                    "Active consensus over sensor networks via selective communication.",
                    "Elimination of exposed terminal problem using signature detection.",
                    "Robust joint congestion control and scheduling for time-varying multihop wireless networks with time delay.",
                    "Joint coding and scheduling optimization in wireless systems with varying delay sensitivities.",
                    "Fairness and social welfare in incentivizing participatory sensing.",
                    "Fast rendezvous for multiple clients for cognitive radios using coordinated channel hopping.",
                    "ASTRA: Application of sequential training to rate adaptation.",
                    "Packet aggregation in multi-rate wireless LANs.",
                    "On the performance of successive interference cancellation in random access networks.",
                    "Authentication of lossy data in body-sensor networks for healthcare monitoring.",
                    "Split Null Keys: A null space based defense for pollution attacks in wireless network coding.",
                    "A novel unbalanced tree structure for low-cost authentication of streaming content on mobile and sensor devices.",
                    "Watchdogs to the rescue: Securing wireless TCP.",
                    "On scalability and robustness limitations of real and asymptotic confidence bounds in social sensing.",
                    "ConDense: Managing data in community-driven mobile geosensor networks.",
                    "Transmit power estimation with a single monitor in multi-band networks.",
                    "Semi-Markov state estimation and policy optimization for energy efficient mobile sensing.",
                    "Group-based discovery in low-duty-cycle mobile sensor networks.",
                    "Toward distributed optimal movement strategy for data harvesting in wireless sensor networks.",
                    "Mobile data harvesting in wireless underground sensor networks.",
                    "Forecasting DTN performance under heterogeneous mobility: The case of limited replication.",
                    "BP-P2P: Belief propagation-based trust and reputation management for P2P networks.",
                    "Seed and Grow: An attack against anonymized social networks.",
                    "A privacy-preserving social-aware incentive system for word-of-mouth advertisement dissemination on smart mobile devices.",
                    "Privacy-preserving energy theft detection in smart grids.",
                    "Generalized geometry-based optimal power control in wireless networks.",
                    "Improving coverage prediction for primary multi-transmitter networks operating in the TV whitespaces.",
                    "Delta-graphs for wireless ad hoc networks.",
                    "ARCHoN: Adaptive range control of hotzone cells in heterogeneous cellular networks.",
                    "Congestion control in CSMA-based vehicular networks: Do not forget the carrier sensing.",
                    "Power control for fair dynamic channel reservation in VANETs.",
                    "Network-congestion-aware video streaming: A rest-and-download approach."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "8th SECON 2011",
        "info": "Salt Lake City, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2011",
                "sub_name": "Proceedings of the 8th Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2011, June 27-30, 2011, Salt Lake City, UT, USA.",
                "count": 74,
                "papers": [
                    "NOMAD: Deterministic collision-free channel access with channel reuse in wireless networks.",
                    "PowerNap: An energy efficient MAC layer for random routing in wireless sensor networks.",
                    "Any-MAC: Extending any asynchronous MAC with anycast to improve delay in WSN.",
                    "WiSP: A protocol for overcoming MAC overheads using packet size dependent channel widths.",
                    "A power-efficient wireless sensor network for continuously monitoring seismic vibrations.",
                    "Compressed data aggregation for energy efficient wireless sensor networks.",
                    "Energy-efficiency through micro-managing communication and optimizing sleep.",
                    "Energy efficient online routing in wireless ad hoc networks.",
                    "Linear decentralized estimation of correlated data for wireless sensor networks.",
                    "Information capacity of pulse-based Wireless Nanosensor Networks.",
                    "Optimal non-uniform deployment of sensors for detection in single-hop Wireless Sensor Networks.",
                    "Energy-delay optimization in an asynchronous sensor network with multiple gateways.",
                    "OppSense: Information sharing for mobile phones in sensing field with data repositories.",
                    "Efficient network management for context-aware participatory sensing.",
                    "RoadSoundSense: Acoustic sensing based road congestion monitoring in developing regions.",
                    "Distance and time based node selection for probabilistic coverage in People-Centric Sensing.",
                    "Demonstrating distributed consensus building by locating the spatial centroid of a WSN.",
                    "Towards secure multi-path routing for wireless mobile ad-hoc networks: A cross-layer strategy.",
                    "Bankrupting the jammer.",
                    "Congestion-aware multi-gateway routing for wireless mesh video surveillance networks.",
                    "Noise reduction for variance-based radio tomographic localization.",
                    "Sleep scheduling towards geographic routing in duty-cycled sensor networks with a mobile sink.",
                    "MEMS: Detection and tracking of mobile events using mobile sensors.",
                    "Campus++: A publish-subscribe architecture for intermittently connected 802.15.4 networks.",
                    "Dynamic node placement for multi-hop localization in cluttered environments.",
                    "Detection and tracking of dynamic amorphous events in wireless sensor networks.",
                    "Noise reduction for variance-based device-free localization and tracking.",
                    "Inferring mobile trajectories using a network of binary proximity sensors.",
                    "Ultra wide band impulse switching protocols for event and target tracking applications.",
                    "Adaptive energy-efficient spectrum probing in cognitive radio networks.",
                    "Delay analysis for cognitive radio networks supporting heterogeneous traffic.",
                    "Rateless-coding-based cooperative cognitive radio networks: Design and analysis.",
                    "Interference pair-based distributed spectrum allocation in wireless mesh networks with frequency-agile radios.",
                    "Realizing high performance multi-radio 802.11n wireless networks.",
                    "Characterizing WiFi link performance in open outdoor networks.",
                    "FOG: Fairness in mobile opportunistic networking.",
                    "Capacity bounds for energy efficient data streaming in homogeneous wireless ad hoc networks.",
                    "Fast identification of the missing tags in a large RFID system.",
                    "Efficient pinpointing of misplaced tags in large RFID systems.",
                    "Dynamic data prioritization for quality-of-service differentiation in heterogeneous Wireless Sensor Networks.",
                    "Geo-logical routing in wireless sensor networks.",
                    "An optimal distributed malware defense system for mobile networks with heterogeneous devices.",
                    "Trade-offs of source location protection in globally attacked sensor networks: A case analysis.",
                    "Making DTNs robust against spoofing attacks with localized countermeasures.",
                    "QUO VADIS: QoS-aware underwater optimization framework for inter-vehicle communication using acoustic directional transducers.",
                    "Minimizing age of information in vehicular networks.",
                    "VTube: Towards the media rich city life with autonomous vehicular content distribution.",
                    "Coping with packet replay attacks in wireless networks.",
                    "Broadcasting in multi channel wireless networks in the presence of adversaries.",
                    "Trust-assisted anomaly detection and localization in wireless sensor networks.",
                    "Collusion-resilient quality of information evaluation based on information provenance.",
                    "Optimal one-shot scheduling for MIMO networks.",
                    "Sensor-mission assignment in wireless sensor networks with energy harvesting.",
                    "Minimum-time aggregation scheduling in multi-sink sensor networks.",
                    "Interference-aware spatio-temporal link scheduling for long delay underwater sensor networks.",
                    "A software-hardware emulator for sensor networks.",
                    "Chrysso - A multi-channel approach to mitigate external interference.",
                    "A real-time rescue system: Towards practical implementation of robotic sensor network.",
                    "Nano-CF: A coordination framework for macro-programming in Wireless Sensor Networks.",
                    "On the construction of the minimum cost content-based publish/subscribe overlays.",
                    "Distributed coordination for fast iterative optimization in wireless sensor/actuator networks.",
                    "Distributed algorithms for bottleneck identification and segmentation in 3D wireless sensor networks.",
                    "Optimizing cooperative video streaming in wireless networks.",
                    "Analyzing credit evolution for credit-based incentive schemes in wireless mesh networks.",
                    "District: Embracing local markets in truthful spectrum double auctions.",
                    "A game approach for cell selection and resource allocation in heterogeneous wireless networks.",
                    "Incentive-aware data dissemination in delay-tolerant mobile networks.",
                    "TOM: Topology oriented maintenance in sparse Wireless Sensor Networks.",
                    "Exploring redundancy in sensor deployment to maximize network lifetime and coverage.",
                    "Dual power assignment optimization for k-edge connectivity in WSNs.",
                    "A cooperative clustering protocol for energy constrained networks.",
                    "Rate adaptation in visual MIMO.",
                    "A context-aware approach to wireless transmission adaptation.",
                    "End-to-end rate selection for opportunistic reception in multi-rate wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "7th SECON 2010",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2010",
                "sub_name": "Proceedings of the Seventh Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2010, June 21-25, 2010, Boston, Massachusetts, USA.",
                "count": 89,
                "papers": [
                    "N-Body: Social Based Mobility Model for Wireless Ad Hoc Network Research.",
                    "Small World in Motion (SWIM): Modeling Communities in Ad-Hoc Mobile Networking.",
                    "Practical Multi-Channel MAC for Ad Hoc Networks.",
                    "MCMAC: An Optimized Medium Access Control Protocol for Mobile Clusters in Wireless Sensor Networks.",
                    "Multiple Access Mechanisms with Performance Guarantees for Ad-Hoc Networks.",
                    "Spectrum Agile Medium Access Control Protocol for Wireless Sensor Networks.",
                    "Opportunistic Interference Management Increases the Capacity of Ad Hoc Networks.",
                    "Adaptive Instantiation of the Protocol Interference Model in Mission-Critical Wireless Networks.",
                    "Deconstructing Interference Relations in WiFi Networks.",
                    "SAND: Sectored-Antenna Neighbor Discovery Protocol for Wireless Networks.",
                    "Leveraging Cognitive Radios for Effective Communications over Water.",
                    "Managing TCP Connections in Dynamic Spectrum Access Based Wireless LANs.",
                    "Exploiting Microscopic Spectrum Opportunities in Cognitive Radio Networks.",
                    "A Two-Tier Market for Decentralized Dynamic Spectrum Access in Cognitive Radio Networks.",
                    "Power Control for Mobile Sensor Networks: An Experimental Approach.",
                    "Cloudy Computing: Leveraging Weather Forecasts in Energy Harvesting Sensor Systems.",
                    "Fair Energy-Efficient Network Design for Multihop Communications.",
                    "Throughput and Energy Efficiency in Wireless Ad Hoc Networks with Gaussian Channels.",
                    "Stochastic Analysis of Energy Consumption in Wireless Sensor Networks.",
                    "Energy-Efficient Transmission for Beamforming in Wireless Sensor Networks.",
                    "Minimum Cost Localization Problem in Wireless Sensor Networks.",
                    "EcoExec: An Interactive Execution Framework for Ultra Compact Wireless Sensor Nodes.",
                    "LTP: An Efficient Web Service Transport Protocol for Resource Constrained Devices.",
                    "A Dynamic Stream Merging Technique for Video-on-Demand Services over Wireless Mesh Access Networks.",
                    "C-DMRC: Compressive Distortion-Minimizing Rate Control for Wireless Multimedia Sensor Networks.",
                    "Practical Sensing for Sprint Parameter Monitoring.",
                    "Optimizing Link Assignment to Enhance Service in Probabilistic Network.",
                    "ANNOT: Automated Electricity Data Annotation Using Wireless Sensor Networks.",
                    "RFID Trees: A Distributed RFID Tag Storage Infrastructure for Forest Search and Rescue.",
                    "iPoint: A Platform-Independent Passive Information Kiosk for Cell Phones.",
                    "A Robust Push-To-Talk Service for Wireless Mesh Networks.",
                    "Real-Time Recognition and Profiling of Appliances through a Single Electricity Sensor.",
                    "Coexistence-Aware Scheduling for Wireless System-on-a-Chip Devices.",
                    "Transmission Scheduling for Routing Paths in Cognitive Radio Mesh Networks.",
                    "Scheduling for Scalable Energy-Efficient Localization in Mobile Ad Hoc Networks.",
                    "On the Uplink Capacity of Hybrid Cellular Ad Hoc Networks.",
                    "Two-Tiered Constrained Relay Node Placement in Wireless Sensor Networks: Efficient Approximations.",
                    "Placement and Orientation of Rotating Directional Sensors.",
                    "Utility-Based Gateway Deployment for Supporting Multi-Domain DTNs.",
                    "Optimized Operation for Infrastructure-Supported Wireless Sensor Networks.",
                    "Divide and Conquer: Localizing Coverage Holes in Sensor Networks.",
                    "Relay Placement for Reliable Base Station Connectivity in Polymorphous Networks.",
                    "Connected Barrier Coverage on a Narrow Band: Analysis and Deployment.",
                    "Back-Tracking Based Sensor Deployment by a Robot Team.",
                    "Rapid Convergecast on Commodity Hardware: Performance Limits and Optimal Policies.",
                    "Disruption-Tolerant Spatial Dissemination.",
                    "Secondis: An Adaptive Dissemination Protocol for Synchronizing Wireless Sensor Networks.",
                    "A Scalable Scheme for Preventing Feedback Implosion in a Large-Scale Multi-Tier Sensor Network.",
                    "RDAS: Reputation-Based Resilient Data Aggregation in Sensor Network.",
                    "Data Aggregation in Body Sensor Networks: A Power Optimization Technique for Collaborative Signal Processing.",
                    "Cross-Layer Optimization of Correlated Data Gathering in Wireless Sensor Networks.",
                    "Using BGP in a Satellite-Based Challenged Network Environment.",
                    "Connectivity-Driven Routing for Cognitive Radio Ad-Hoc Networks.",
                    "Multi-Constrained Anypath Routing in Wireless Mesh Networks.",
                    "Distributed Routing, Relay Selection, and Spectrum Allocation in Cognitive and Cooperative Ad Hoc Networks.",
                    "Connectivity in Wireless Underground Sensor Networks.",
                    "Exploiting Heterogeneity in Mobile Opportunistic Networks: An Analytic Approach.",
                    "Trajectory-Aware Communication Solution for Underwater Gliders Using WHOI Micro-Modems.",
                    "Cost Efficiency of Anycast-Based Forwarding in Duty-Cycled WSNs with Lossy Channel.",
                    "Fair Payments for Outsourced Computations.",
                    "QoI-Aware Wireless Sensor Network Management for Dynamic Multi-Task Operations.",
                    "Traffic Inference in Anonymous MANETs.",
                    "Bluetooth Coexistence with 4G Broadband Wireless Networks.",
                    "Tones for Real: Managing Multipath in Underwater Acoustic Wakeup.",
                    "Implementation of a Low-Power Acoustic Modem for Underwater Wireless Sensor Networks.",
                    "Field Deployment of a Large-Scale WSN for Parking Management System.",
                    "CRES: A Content-Based Routing Substrate for Large-Scale Data-Centric Sensor Networks.",
                    "A Physiological Authentication Scheme in Secure Healthcare Sensor Networks.",
                    "Packet Compression for Time-Synchronized Wireless Networks.",
                    "Designing Localization Algorithms Robust to Signal Strength Attacks.",
                    "Being Opportunistic or Being Concurrent -- On Designing Channel Assignment Algorithms in Multi-Radio, Multi-Channel Wireless Mesh Networks.",
                    "Efficient Access Protocols for High Storage RFID.",
                    "Overcoming MAC Overhead Using Packet-Size Dependent Channel Widths.",
                    "Batch Scheduling of Recurrent Applications for Energy Savings on Mobile Phones.",
                    "GINSENG: Performance Control in Wireless Sensor Networks.",
                    "GENESI: Green sEnsor NEtworks for Structural monItoring.",
                    "RFID Added Value Sensing Capabilities: European Advances in Integrated RFID-WSN Middleware.",
                    "Cooperative and Self-Growing Energy-Aware Networks.",
                    "Wirelessly Accessible Sensor Populations (WASP): Cross-Layer Design of Low Power Medium Access and Content Based Routing.",
                    "A Testbed for Performance Evaluation of Underwater Vehicle Team Formation and Steering Algorithms.",
                    "Prototyping Energy Harvesting Active Networked Tags (EnHANTs) with MICA2 Motes.",
                    "MercuryLive: A Web-Enhanced Platform for Long-Term High Fidelity Motion Analysis.",
                    "Demo Abstract: Appliance Load Monitoring by Power Load Disaggregation.",
                    "A Wireless Sensor Network Based System for Reducing Home Energy Consumption.",
                    "Egs: A Cortex M3-Based Mote Platform.",
                    "iPoint: A Platform-Independent Passive Information Kiosk for Cell Phones.",
                    "Implementation of a Distributed Joint Routing and Dynamic Spectrum Allocation Algorithm on USRP2 Radios.",
                    "Middleware for Wireless Devices and Sensors - Energy Efficiency at Device Level.",
                    "Smart-Sensor Infrastructure in the IPAC Architecture."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "6th SECON 2009",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2009",
                "sub_name": "Proceedings of the Sixth Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2009, June 22-26, 2009, Rome, Italy.",
                "count": 81,
                "papers": [
                    "A Cross-layer Optimized Distributed Scheduling Algorithm for Peer-to-Peer Video Streaming over Multi-hop Wireless Mesh Networks.",
                    "A Low-cost, Small-footprint Wireless Sensor for Container Integrity Monitoring.",
                    "A Low-energy, Multi-copy Inter-contact Routing Protocol for Disaster Response Networks.",
                    "A Packet-Centric Approach to Distributed Rateless Coding in Wireless Sensor Networks.",
                    "A Simple Non-Interactive Pairwise Key Establishment Scheme in Sensor Networks.",
                    "An Epidemiological Study of Information Dissemination in Mobile Networks.",
                    "An Optimal Sensing Framework Based on Spatial RSS-profile in Cognitive Radio Networks.",
                    "Application-Centric Routing for Video Streaming over Multi-hop Wireless Networks.",
                    "ARC: Joint Adaptation of Link Rate and Contention Window for IEEE 802.11 Multi-rate Wireless Networks.",
                    "Bargain-based Stimulation Mechanism for Selfish Mobile Nodes in Participatory Sensing Network.",
                    "Blindly Calibrating Mobile Sensors Using Piecewise Linear Functions.",
                    "Capacity Bounds for Large Scale Wireless Ad Hoc Networks Under Gaussian Channel Model.",
                    "Catching Packet Droppers and Modifiers in Wireless Sensor Networks.",
                    "Channel Access Throttling for Improving WLAN QoS.",
                    "COFFEE: A Context-Free Protocol for Stimulating Data Forwarding in Wireless Ad Hoc Networks.",
                    "Cognitive DISH: Virtual Spectrum Sensing Meets Cooperation.",
                    "Comparison of Data-driven Link Estimation Methods in Low-power Wireless Networks.",
                    "Control-theoretic Optimization of Utility over Mission Lifetimes in Multi-hop Wireless Networks.",
                    "Cooperation in Ad Hoc Networks with Noisy Channels.",
                    "Cooperative Network Coding and Coding-Aware Channel Assignment in Multi-Channel, Multi-Interface Wireless Networks.",
                    "CREST: An Opportunistic Forwarding Protocol Based on Conditional Residual Time.",
                    "Cross-layer Enhanced Source Location Privacy in Sensor Networks.",
                    "DEAL: Discover and Exploit Asymmetric Links in Dense Wireless Sensor Networks.",
                    "DEAMON: Energy-efficient Sensor Monitoring.",
                    "Detecting Spoofing Attacks in Mobile Wireless Environments.",
                    "Distributed or Centralized Traffic Advisory Systems-The Application's Take.",
                    "Diversity Routing for Multi-hop Wireless Networks with Cooperative Transmissions.",
                    "Efficient Pattern Detection in Extremely Resource-Constrained Devices.",
                    "Elucidating the Instability of Random Access Wireless Mesh Networks.",
                    "Empirical Evaluation of the Limits on Localization Using Signal Strength.",
                    "Energy-Aware Simulation for Wireless Sensor Networks.",
                    "Experimental Anatomy of Packet Losses in Wireless Mesh Networks.",
                    "Fault Localization Using Passive End-to-End Measurement and Sequential Testing for Wireless Sensor Networks.",
                    "Featherlight Information Network with Delay-Endurable RFID Support (FINDERS).",
                    "Forepressure Transmission Control for Wireless Video Sensor Networks.",
                    "Hansel: Distributed Localization in Passive Wireless Environments.",
                    "Idle Detection Based Optimal Throughput Rate Adaptation in Multi-Rate WLANs.",
                    "Infocast: A New Paradigm for Collaborative Content Distribution from Roadside Units to Vehicular Networks.",
                    "Interference Aware Routing and Scheduling in Wireless Backhaul Networks with Smart Antennas.",
                    "Internet Service in Developing Regions Through Network Coding.",
                    "LocalCom: A Community-based Epidemic Forwarding Scheme in Disruption-tolerant Networks.",
                    "Low Complexity Stable Link Scheduling for Maximizing Throughput in Wireless Networks.",
                    "Lukewarm Potato Forwarding: A Biased Random Walk Routing Protocol for Wireless Sensor Networks.",
                    "Maximize the Lifetime of a Data-gathering Wireless Sensor Network.",
                    "Medium Access Control Analytical Modeling and Optimization in Unslotted IEEE 802.15.4 Wireless Sensor Networks.",
                    "Modular Plug-and-Play Power Resources for Energy-Aware Wireless Sensor Nodes.",
                    "Multicast Throughput Order of Network Coding in Wireless Ad-hoc Networks.",
                    "Network Connectivity of VANETs in Urban Areas.",
                    "Node Reclamation and Replacement for Long-lived Sensor Networks.",
                    "NoSE: Efficient Maintenance and Initialization of Wireless Sensor Networks.",
                    "On The Accuracy of TCP Throughput Prediction for Opportunistic Wireless Networks.",
                    "On the Effectiveness of Cooperation in Carrier Sense-Based Ad Hoc Networks.",
                    "On the Impact of Introducing Advanced Devices into a Cognitive Radio Network.",
                    "Optimal Admission and Eviction Control of Secondary Users at Cognitive Radio HotSpots.",
                    "Optimal One-Shot Stream Scheduling for MIMO Links in a Single Collision Domain.",
                    "Order-Optimal Data Collection in Wireless Sensor Networks: Delay and Capacity.",
                    "Performance Analysis of GTS Allocation in Beacon Enabled IEEE 802.15.4.",
                    "Performance Evaluation of Link Quality Estimation Metrics for Static Multihop Wireless Sensor Networks.",
                    "Pilot-Assisted Distributed Co-Phasing for Wireless Sensor Networks.",
                    "Practical Connectivity-based Routing in Wireless Sensor Networks using Dimension Reduction.",
                    "Preserving Source-Location Privacy in Wireless Sensor Networks.",
                    "PRIDE: A Data Abstraction Layer for Large-Scale 2-tier Sensor Networks.",
                    "Proactive Data Dissemination to Mission Sites.",
                    "PROSE: Scalable Routing in MANETs Using Prefix Labels and Distributed Hashing.",
                    "Resilient Cluster Leader Election for Wireless Sensor Networks.",
                    "R-Factor: A New Parameter to Enhance Location Accuracy in RSSI Based Real-time Location Systems.",
                    "Selection and Orientation of Directional Sensors for Coverage Maximization.",
                    "Sensor Networks Protocol Design Using Random Markov Field Theory.",
                    "Separation of Sensor Control and Data in Closed-Loop Sensor Networks.",
                    "SewerSnort: A Drifting Sensor for In-situ Sewer Gas Monitoring.",
                    "Sidewinder: A Predictive Data Forwarding Protocol for Mobile Wireless Sensor Networks.",
                    "Slab Routing: Adapting Two-Dimensional Geographic Routing to Three-Dimensions.",
                    "Spectrum Opportunity-Based Control Channel Assignment in Cognitive Radio Networks.",
                    "Stream-oriented Lossless Packet Compression in Wireless Sensor Networks.",
                    "TACKing Together Efficient Authentication, Revocation, and Privacy in VANETs.",
                    "The Effects of Node Cooperation Level on Routing Performance in Delay Tolerant Networks.",
                    "To Hop or Not to Hop: Network Architecture for Body Sensor Networks.",
                    "Towards Continuous Asset Tracking: Low-Power Communication and Fail-Safe Presence Assurance.",
                    "Towards Lightweight Secure Communication Protocols for Passive RFIDs.",
                    "Traffic-Aware Relay Node Deployment for Data Collection in Wireless Sensor Networks.",
                    "XOR Rescue: Exploiting Network Coding in Lossy Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "5th SECON 2008",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2008",
                "sub_name": "Proceedings of the Fifth Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2008, June 16-20, 2008, Crowne Plaza, San Francisco International Airport, California, USA.",
                "count": 78,
                "papers": [
                    "Congestion-Aware Rate Adaptation in Wireless Networks: A Measurement-Driven Approach.",
                    "Distance- and Traffic-Aware Channel Assignment in Cognitive Radio Networks.",
                    "Scheduling and Dynamic Relocation for IEEE 802.11s Mesh Deterministic Access.",
                    "A Multi-AP Architecture for High-Density WLANs: Protocol Design and Experimental Evaluation.",
                    "Locating Nodes in Mobile Sensor Networks More Accurately and Faster.",
                    "Robust Localization for Wireless Sensor Networks.",
                    "The Impact of Using Multiple Antennas on Wireless Localization.",
                    "A Localization Technique for Mobile Sensor Networks Using Archived Anchor Information.",
                    "Analysis of Wireless Ad-Hoc and Sensor Networks in Finite Regime.",
                    "Understanding Radio Irregularity in Wireless Networks.",
                    "Per User Throughput in Large Wireless Networks.",
                    "Effect of Joint Cooperation and Multi-Hopping on the Capacity of Wireless Networks.",
                    "Feasibility of an Aeronautical Mobile Ad Hoc Network Over the North Atlantic Corridor.",
                    "Content Distribution in VANETs Using Network Coding: The Effect of Disk I/O and Processing O/H.",
                    "Coordinated Locomotion of Mobile Sensor Networks.",
                    "Fast Exclusion of Errant Devices from Vehicular Networks.",
                    "Analytical Study of Collaborative Information Coverage for Object Detection in Sensor Networks.",
                    "Deploying Directional Sensor Networks with Guaranteed Connectivity and Coverage.",
                    "Polynomial-Time Optimal Distributed Algorithm for Dynamic Allocation of Discrete Resources.",
                    "Joint k-Coverage and Hybrid Forwarding in Duty-Cycled Three-Dimensional Wireless Sensor Networks.",
                    "TCP Performance in Coded Wireless Mesh Networks.",
                    "SYNAPSE: A Network Reprogramming Protocol for Wireless Sensor Networks Using Fountain Codes.",
                    "A Study of Forward Error Correction Schemes for Reliable Transport in Underwater Sensor Networks.",
                    "PALER: A Reliable Transport Protocol for Code Distribution in Large Sensor Networks.",
                    "Predictive or Oblivious: A Comparative Study of Routing Strategies for Wireless Mesh Networks under Uncertain Demand.",
                    "On the Pitfalls of High-Throughput Multicast Metrics in Adversarial Wireless Mesh Networks.",
                    "Alleviating Congestion Using Traffic-Aware Dynamic Routing in Wireless Sensor Networks.",
                    "A Contention-Aware Routing Metric for Multi-Rate Multi-Radio Mesh Networks.",
                    "An Optimal Transmission Strategy for IEEE 802.11 Wireless LANs: Stochastic Control Approach.",
                    "Optimal Buffer Management Policies for Delay Tolerant Networks.",
                    "A Probability Model for Lifetime of Event-Driven Wireless Sensor Networks.",
                    "Utility-Based Adaptation in Mission-Oriented Wireless Sensor Networks.",
                    "Cue-Based Networking Using Wireless Sensor Networks: A Video-over-IP Application.",
                    "Gateway Design for Data Gathering Sensor Networks.",
                    "Real-Time Target Tracking with CPA Algorithm in Wireless Sensor Networks.",
                    "Anshan: Wireless Sensor Networks for Equipment Fault Diagnosis in the Process Industry.",
                    "Breath: A Self-Adapting Protocol for Wireless Sensor Networks in Control and Automation.",
                    "Practical Localized Network Coding in Wireless Mesh Networks.",
                    "On the Benefits of Network Coding in Multi-Channel Wireless Networks.",
                    "Congestion Control and Channel Assignment in Multi-Radio Wireless Mesh Networks.",
                    "Efficient Sensor Network Reprogramming through Compression of Executable Modules.",
                    "Broadcasting Info-Pages to Sensors: Efficiency vs. Energy Conservation.",
                    "STDCS: A Spatio-Temporal Data-Centric Storage Scheme For Real-Time Sensornet Applications.",
                    "Adaptive Radio Modes in Sensor Networks: How Deep to Sleep?",
                    "Cooperative Recovery in Heterogeneous Mobile Networks.",
                    "Phoenix: A Hybrid Cooperative-Network Coding Protocol for Fast Failure Recovery in Ad Hoc Networks.",
                    "Vector Kalman Filter Using Multiple Parents for Time Synchronization in Multi-Hop Sensor Networks.",
                    "Decentralized Tick Synchronization for Multi-Hop Medium Slotting in Wireless Ad Hoc Networks Using Black Bursts.",
                    "Hit and Run: A Bayesian Game Between Malicious and Regular Nodes in MANETs.",
                    "GossiCrypt: Wireless Sensor Network Data Confidentiality Against Parasitic Adversaries.",
                    "A Three-Tier Framework for Intruder Information Sharing in Sensor Networks.",
                    "AuCRB: An Efficient Mechanism to Provide Availability, Reliability and Authentication for Multihop Broadcasting in Wireless Networks.",
                    "Amorphous Placement and Informed Diffusion for Timely Field Monitoring by Autonomous, Resource-Constrained, Mobile Sensors.",
                    "Sensor-Based Clustering for Indoor Applications.",
                    "Practical Algorithms for Gathering Stored Correlated Data in a Network.",
                    "On Distributed Optimization Using Peer-to-Peer Communications in Wireless Sensor Networks.",
                    "OTGsim: Simulation of an Off-the-Grid Radar Network with High Sensing Energy Cost.",
                    "A Framework for Modeling, Simulation and Automatic Code Generation of Sensor Network Application.",
                    "UDAE: Universal Data Access Engine for Sensor Networks.",
                    "Calibrating Nonlinear Mobile Sensors.",
                    "Topology Maintenance in Asynchronous Sensor Networks.",
                    "Distributed Protocols for Finding Low-Cost Broadcast and Multicast Trees in Wireless Networks.",
                    "Load Balanced and Efficient Hierarchical Data-Centric Storage in Sensor Networks.",
                    "Enhancing the Data Collection Rate of Tree-Based Aggregation in Wireless Sensor Networks.",
                    "Real Time Locating System for Wireless Networks using IEEE 802.15.4 Radio.",
                    "A Demonstration of Video over a User Centric Prioritization Scheme for Wireless LANs.",
                    "A Calorie Count Application for a Mobile Phone Based on METS Value.",
                    "DiffQ: Differential Backlog Congestion Control for Wireless Multi-hop Networks.",
                    "Visualization and Representation of Mobile Network Users.",
                    "Exploiting Heterogeneity for Sensor Network Security.",
                    "The Worst and Best Case Capacity Analysis of Mobile Ad Hoc Networks (MANET) Using a 3-Phase Algorithm.",
                    "Mobile Sensor Network Resilient Against Node Replication Attacks.",
                    "A First Step Towards Dynamic Profiling of Sensor-Based Systems.",
                    "Rolling Out RFIDs: A Lightweight Positioning Environment for Ad Hoc Applications.",
                    "Making Sensor Networks Accessible to Undergraduates Through Activity-Based Laboratory Materials.",
                    "Immunity-Based Epidemic Routing in Intermittent Networks.",
                    "Reactive Identification of Misbehavior in Ad Hoc Networks Based on Random Audits.",
                    "Wireless Sensor Networks for Debris Flow Observation."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "4th SECON 2007",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2007",
                "sub_name": "Proceedings of the Fourth Annual IEEE Communications Society Conference on Sensor, Mesh and Ad Hoc Communications and Networks, SECON 2007, Merged with IEEE International Workshop on Wireless Ad-hoc and Sensor Networks (IWWAN), June 18-21, 2007, San Diego, California, USA.",
                "count": 80,
                "papers": [
                    "Multi-Channel Wireless Networks: Theory to Practice.",
                    "CODE: Cooperative Medium Access for Multirate Wireless Ad Hoc Network.",
                    "CMAC: An Energy Efficient MAC Layer Protocol Using Convergent Packet Forwarding for Wireless Sensor Networks.",
                    "Adaptive Control of Duty Cycling in Energy-Harvesting Wireless Sensor Networks.",
                    "HCRL: A Hop-Count-Ratio based Localization in Wireless Sensor Networks.",
                    "Distinguishing Data Transience from False Injection in Sensor Networks.",
                    "A Public Key Cryptographic Method for Denial of Service Mitigation in Wireless Sensor Networks.",
                    "DEEJAM: Defeating Energy-Efficient Jamming in IEEE 802.15.4-based Wireless Networks.",
                    "A Radio-independent Authentication Protocol (EAP-CRP) for Networks of Cognitive Radios.",
                    "On the Design of Energy-efficient Routing Protocols in Underwater Networks.",
                    "Efficient Distributed Topology Control in 3-Dimensional Wireless Networks.",
                    "Feasibility of In-car Wireless Sensor Networks: A Statistical Evaluation.",
                    "Effect of Antenna Placement and Diversity on Vehicular Network Communications.",
                    "Energy Consumption and Conservation in WiFi Based Phones: A Measurement-Based Study.",
                    "A SoC-based Sensor Node: Evaluation of RETOS-enabled CC2430.",
                    "Energy Consumption Model for Power Management in Wireless Sensor Networks.",
                    "A distributed approximation scheme for sleep sceduling in sensor networks.",
                    "Multi-hop-based Monte Carlo Localization for Mobile Sensor Networks.",
                    "Non-intrusive Neighbor Prediction in Sparse MANETs.",
                    "Coverage Protocol for Wireless Sensor Networks Using Distance Estimates.",
                    "Detecting and Localizing Wireless Spoofing Attacks.",
                    "Query privacy in wireless sensor networks.",
                    "On the Prevalence of Sensor Faults in Real-World Deployments.",
                    "Multi-user Broadcast Authentication in Wireless Sensor Networks.",
                    "Privacy Preserving Communication in MANETs.",
                    "Improving Scalability for Longest-lived Multicast Using Localized Operations in WANETs.",
                    "DRB and DCCB: Efficient and Robust Dynamic Broadcast for Ad Hoc and Sensor Networks.",
                    "BSMR: Byzantine-Resilient Secure Multicast Routing in Multi-hop Wireless Networks.",
                    "Wireless Ad Hoc Podcasting.",
                    "An Externality-based Decentralized Optimal Power Allocation Scheme for Wireless Mesh Networks.",
                    "Experimental Investigation of IEEE 802.15.4 Transmission Power Control and Interference Minimization.",
                    "Sleep-based Topology Control for Wakeup Scheduling in Wireless Sensor Networks.",
                    "On the Broadcast Capacity of Multihop Wireless Networks: Interplay of Power, Density and Interference.",
                    "INPoD: In-Network Processing over Sensor Networks based on Code Design.",
                    "Optimal Routing for Decode-and-Forward based Cooperation in Wireless Networks.",
                    "OPERA: An Optimal Progressive Error Recovery Algorithm for Wireless Sensor Networks.",
                    "Foxtrot: phase space data representation for correlation-aware aggregation.",
                    "Quasi-static Centralized Rate Allocation for Sensor Networks.",
                    "A Semi Markov-based Analysis of Rate Adaptation Algorithms in Wireless LANs.",
                    "Fairness and Physical Layer Capture in Random Access Networks.",
                    "Analysis of Latency and Related Tradeoffs in Distribute Sensor Networks.",
                    "MAC-Layer Capture: A Problem in Wireless Mesh Networks using Beamforming Antennas.",
                    "On Spatial Fairness of the 802.11 DCF Protocol and the Role of Directional Antenna.",
                    "Facilitating an Active Transmit-only RFID System Through Receiver-based Processing.",
                    "The Behavior of Unbounded Path-loss Models and the Effect of Singularity on Computed Network Interference.",
                    "On the Efficacy of Opportunistic Routing.",
                    "The Optimum Number of OSPF Areas for MANETs.",
                    "Impact of Mobility on Last Encounter Routing Protocols.",
                    "Robust Routing and Scheduling in Wireless Mesh Networks.",
                    "Minimum Interference Channel Assignment in Multi-Radio Wireless Mesh Networks.",
                    "RSS-based Carrier Sensing and Interference Estimation in 802.11 Wireless Networks.",
                    "A Spatial Backoff Algorithm Using the Joint Control of Carrier Sense Threshold and Transmission Rate.",
                    "Approximation Algorithm for Base Station Placement in Wireless Sensor Networks.",
                    "Coverage Problem for Sensors Embedded in Temperature Sensitive Environments.",
                    "DRACo: Distributed, Robust an Asynchronous Coverage in Wireless Sensor Networks.",
                    "A Framework for Resilient Online Coverage in Sensor Networks.",
                    "Log-normal shadowing meets SINR: A numerical study of Capacity in Wireless Networks.",
                    "Decentralized Multiuser Diversity with Cooperative Relaying in Wireless Sensor Networks.",
                    "Two-hop Relaying in Random Networks with Limited Channel State Information.",
                    "Revising buffering in multihop CSMA/CA wireless networks.",
                    "The ARESA Project: Facilitating Research, Development and Commercialization of WSNs.",
                    "A Duopoly Pricing Game for Wireless IP Services.",
                    "High-Level Application Development is Realistic for Wireless Sensor Networks.",
                    "Edge Processing and Enterprise Integration: Closing the Gap on Deployable Industrial Sensor Networks.",
                    "Self-Learning Repeated Game Framework for Distributed Primary-Prioritized Dynamic Spectrum Access.",
                    "Cross Layer Performance Evaluation of a Software Defined Radio UWB Receiver using Turbo Decoding.",
                    "Analysis of Search Schemes in Cognitive Radio.",
                    "SAFIRE: A Self-Organizing Architecture for Information Exchange between First Responders.",
                    "A Study of Radio-information Services for Networks of Cognitive Radios.",
                    "Service Discovery and Device Identification in Cognitive Radio Networks.",
                    "A Mechanism for Detecting and Responding to Misbehaving Nodes in Wireless Networks.",
                    "ProSe - A Programming Tool for Rapid Prototyping of Sensor Networks.",
                    "Concept of a Cross-Layer Design for Packet Routing in Vehicular Ad Hoc Networks.",
                    "Measurements on the Efficiency of Overlapping Channels.",
                    "Efficient Broadcast Authentication for Wireless Sensor Networks.",
                    "Concatenated Random Parity Forwarding in Wireless Sensor Networks.",
                    "Using \"Scaled Credit Payback\" to Achieve Soft-fairness for Disruptive Radios in CSMA Networks.",
                    "Demo Abstract: Service Oriented Wireless Sensor Networks - A Cluster-based Approach.",
                    "Sensor Localization with Lateral Inhibition & Statistical Inference.",
                    "SenNetSim: A GUI-Based Simulator for Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "3rd SECON 2006",
        "info": "Reston, VA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2006",
                "sub_name": "Proceedings of the Third Annual IEEE Communications Society on Sensor and Ad Hoc Communications and Networks, SECON 2006, September 25-28, 2006, Reston, VA, USA.",
                "count": 121,
                "papers": [
                    "Data-Centric Routing in Sensor Networks using Biased Walk.",
                    "Search-quality Tradeoffs for Routing in Non-ideal Wireless Networks.",
                    "GMR: Geographic Multicast Routing for Wireless Sensor Networks.",
                    "Scalable Routing in Sensor Actuator Networks with Churn.",
                    "Security Services in Wireless Sensor Networks Using Sparse Random Coding.",
                    "Relationship -based Detection of Spoofing -related Anomalous Traffic in Ad Hoc Networks.",
                    "A Trust Based Framework for Secure Data Aggregation in Wireless Sensor Networks.",
                    "An Anonymous Routing Protocol with The Local-repair Mechanism for Mobile Ad Hoc Networks.",
                    "Minimum Latency Broadcasting in Multi-Radio Multi-Channel Multi-Rate Wireless Meshes.",
                    "Solicitation-based Forwarding for Sensor Networks.",
                    "Coverage Aware Buffer Management and Scheduling for Wireless Sensor Networks.",
                    "A Communication Architecture for Mobile Wireless Sensor and Actor Networks.",
                    "Belief-Assisted Pricing for Dynamic Spectrum Allocation in Wireless Networks with Selfish Users.",
                    "Spatial Diversity Benefits by Means of Induced Fading.",
                    "Scheduling Optimization in wireless MESH Networks with Power Control and Rate Adaptation.",
                    "Bialancingv Computation and Communication Costs: The Case for Hybrid Execution in Sensor Networks.",
                    "EmPro: an Environment/Energy Emulation and Profiling Platform for Wireless Sensor Networks.",
                    "AmbiMax: Autonomous Energy Harvesting Platform for Multi-Supply Wireless Sensor Nodes.",
                    "TinyXXL: Language and Runtime Support for Cross-Layer Interactions.",
                    "When Does Cooperation Have Better Performance in Sensor Networks?",
                    "Balancing Cooperation and Interference in Wireless Sensor Networks.",
                    "Progressive Network Coding for Message-Forwarding in Ad-Hoc Wireless Networks.",
                    "A Proactive Data Bundling System for Intermittent Mobile Connections.",
                    "Island Hopping: Efficient Mobility-Assisted Forwarding in Partitioned Networks.",
                    "Effective Dissemination of Presence Information in Highly Partitioned Mobile Ad Hoc Networks.",
                    "Improving Geographical Routing for Wireless Networks with an Efficient Path Pruning Algorithm.",
                    "Supervised Learning in Sensor Networks: New Approaches with Routing, Reliability Optimizations.",
                    "MERLIN: A Synergetic Integration of MAC and Routing Protocol for Distributed Sensor Networks.",
                    "A spatio-temporal model for physical carrier sensing wireless ad-hoc networks.",
                    "A Realistic Power Consumption Model for Wireless Sensor Network Devices.",
                    "The Analysis of a Game Theoretic MAC Protocol for Wireless Networks.",
                    "Optimizing Delay in Sequential Change Detection on Ad Hoc Wireless Sensor Networks.",
                    "Deployment Strategies for Differentiated Detection in Wireless Sensor Networks.",
                    "Sacrificing a Little Coverage Can Substantially Increase Network Lifetime.",
                    "Optimal Worst-Case Coverage of Directional Field-of-View Sensor Networks.",
                    "Mutual Exclusion in Wireless Sensor and Actor Networks.",
                    "Consistency Error Modeling-based Localization in Sensor Networks.",
                    "A Practical Approach to Landmark Deployment for Indoor Localization.",
                    "Angle of Arrival Localization for Wireless Sensor Networks.",
                    "Robot-Assisted Localization Techniques for Wireless Image Sensor Networks.",
                    "Multichannel MAC Protocols for Wireless Networks.",
                    "RT-Link: A Time-Synchronized Link Protocol for Energy- Constrained Multi-hop Wireless Networks.",
                    "Understanding the Gap between the IEEE 802.11 Protocol Performance and the Theoretical Limits.",
                    "Throughput-Oriented MAC for Mobile Networks with Variable Packet Sizes.",
                    "Topology Control to Simultaneously Achieve Near-Optimal Node Degree and Low Path Stretch in Ad hoc Networks.",
                    "Distributed Linear Parameter Estimation in Sensor Networks based on Laplacian Dynamics Consensus Algorithm.",
                    "On the Information Lifetime and the Localization Cost in Sensor Networks with Random Topologies.",
                    "Cooperation Enforcement in Autonomous MANETs under Noise and Imperfect Observation.",
                    "Joint Range and Load Considerations for Topology Control in Wireless Ad Hoc Networks.",
                    "Distributed Fair Transmit Power Adjustment for Vehicular Ad Hoc Networks.",
                    "Lo~w-Comp-lexity Beamforming Techniques for Wireless Multihop Networks.",
                    "Energy Efficient Transmission Scheme for Data-Gathering in Mobile Sensor Networks.",
                    "LEARN: Localized Energy Aware Restricted Neighborhood Routing for Ad Hoc Networks.",
                    "A New Method for Distributing Power Usage across a Sensor Network.",
                    "Energy Efficient Network Reconfiguration for Mostly-Off Sensor Networks.",
                    "Distance Matrix Reconstruction from Incomplete Distance Information for Sensor Network Localization.",
                    "MERIT: MEsh of RF sensors for Indoor Tracking.",
                    "Reducing the Computational Cost of Bayesian Indoor Positioning Systems.",
                    "Sensor-Enhanced Mobility Prediction for Energy-Efficient Localization.",
                    "Memento: A Health Monitoring System for Wireless Sensor Networks.",
                    "Cross-Layer Analysis of Error Control in Wireless Sensor Networks.",
                    "RideSharing: Fault Tolerant Aggregation in Sensor Networks Using Corrective Actions.",
                    "Modeling the Effect of BEB for a Hidden Terminal Topology from a New Perspective.",
                    "Analysis of Co-existence between IEEE 802.11 and IEEE 802.16 Systems.",
                    "On-Demand Connection- Oriented Multi-Channel MAC Protocol for Ad-Hoc Network.",
                    "Novel Sensor MAC Protocol Applied to Cayley and Manhattan Street Networks with CrossBow MICA2.",
                    "Link Cost and Reliability of Frame Preamble MAC Protocols.",
                    "1-hopMAC: An Energy-Efficient MAC Protocol for Avoiding 1 -hop Neighborhood Knowledge.",
                    "Sensor Networks with Decentralized Binary Detection: Clustering and Lifetime.",
                    "Scalable Coverage Maintenance for Dense Wireless Sensor Networks.",
                    "Code Dissemination in Sensor Networks with MDeluge.",
                    "Dynamic Local Clustering for Hierarchical Ad Hoc Networks.",
                    "A Distributed Min-Max Tree Algorithm for Maximum-Lifetime Multicast in Resource-limited Wireless Ad Hoc Networks.",
                    "Ubiquitous Zone (U-Zone) based Community Networking Technologies.",
                    "Waveform Design and Diversity in Radar Sensor Networks: Theoretical Analysis and Application to Automatic Target Recognition.",
                    "Distributed timing synchronization for sensor networks with coupled discrete-time oscillators.",
                    "The Energy-per-Useful-Bit Metric for Evaluating and Optimizing Sensor Network Physical Layers.",
                    "Multichannel Feedback in OFDM Ad Hoc Networks.",
                    "Eavesdropping Minimization via Transmission Power Control in Ad-Hoc Wireless Networks.",
                    "A Communication-Theoretic Approach to Ad Hoc Wireless Networking.",
                    "Emulation Architecture Implementation and Design.",
                    "A Low Cost and Flexible Network Testbed.",
                    "A Biologically Inspired Architecture for Self-Managing Sensor Networks.",
                    "An Internet SIP Gateway for Ad-hoc Networks.",
                    "Bandwidth Consumption for Providing Fair Internet Access in Wireless Mesh Networks.",
                    "Modeling End-to-end Distance for Given Number of Hops in Dense Planar Wireless Sensor Networks.",
                    "A Statistical Model for the Evaluation of the Distribution of the Received Power in Ad Hoc and Wireless Sensor Networks.",
                    "Minimal Transmission Power vs. Signal Strength as Distance Estimation for Localization in Wireless Sensor Networks.",
                    "Performance of Cooperative and Single Relay Sensor Networks Under Same Energy Constraints.",
                    "Capacity Evaluation Framework and Validation of Self-Organized Routing Schemes.",
                    "Resilient JPv6 Multicast Address Allocation in Ad Hoc Networks.",
                    "Energy Efficiency in OLSR Protocol.",
                    "Study on an Enhanced Link-Stability based Routing Scheme for Mobile Ad hoc Networks.",
                    "Mobility Metrics for Adaptive Routing.",
                    "Dynamic Hybrid Multi Routing Protocol For Ad Hoc Wireless Network.",
                    "Joint Network-Channel Coding for the Multiple-Access Relay Channel.",
                    "Efficient Data Compression in Wireless Sensor Networks for Civil Infrastructure Health Monitoring.",
                    "Query Processing Optimization Through Sample Size and Monitoring Coverage Controlling in Wireless Sensor Networks.",
                    "On the Importance of Modeling the Environment when Analyzing Sensor Networks.",
                    "Cognitive Adaptive Radio Teams.",
                    "Hybrid Wireless Networks: Applications, Architectures and New Perspectives.",
                    "A P2P approach to Streaming Multimedia Contents in a F-learning Oriented Platform.",
                    "BENCEManet: An Evaluation Framework for Service Discovery Protocols in MANET.",
                    "Effect of Ad Hoc Routing Protocols on TCP Performance within MANETs.",
                    "Queuing Delay and Achievable Throughput in Random Access Wireless Ad Hoc Networks.",
                    "Towards Efficient Temperature Monitoring and Controlling in Large Grain Depot.",
                    "A NEW SOLUTION BASED ON MONTE CARLO TO WIRELESS SENSOR NETWORK DENSITY CONTROL PROBLEM.",
                    "Adaptive Multi-user Interference Cancellation for DS-UWB.",
                    "Bioeffects Control in Wireless Biomedical Sensor Networks.",
                    "LLM: Low Latency MAC Protocol for Wireless Sensor Networks.",
                    "Topology Discovering Mechanism for Power Saving in Ad-hoc Wireless Networks.",
                    "Application of Video Sensor Networks in Traffic Surveillance.",
                    "Clustering Ad Hoc Networks: Schemes and Classifications.",
                    "Performance Analysis of Multipath Data Transmission in Multihop Ad Hoc Networks.",
                    "A MAC Protocol Equipped by a Novel Transmission Scheduling Algorithm for Wireless LANs.",
                    "Power Efficient and Low Latency MAC for Wireless Sensor Networks.",
                    "Circular-Layer Algorithm for Ad Hoc Sensor Networks to Balance Power Consumption.",
                    "A Comprehensive Comparison of Routing Protocols for Large-Scale Wireless MANETs.",
                    "Doughnut Effect in Wireless Sensor Network and its Solution.",
                    "A Probabilistic Energy-Efficient Routing (PEER) Scheme for Ad-hoc Sensor Networks.",
                    "Performance Evaluation of Secure on-Demand Routing Protocols for Mobile Ad-hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "2nd SECON 2005",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2005",
                "sub_name": "Proceedings of the Second Annual IEEE Communications Society Conference on Sensor and Ad Hoc Communications and Networks, SECON 2005, September 26-29, 2005, Santa Clara, CA, USA.",
                "count": 55,
                "papers": [
                    "RISE - Co-S : high performance sensor storage and Co-processing architecture.",
                    "A scalable framework for distributed time synchronization in multi-hop sensor networks.",
                    "A layered architecture for delay sensitive sensor networks.",
                    "Designing new architectures and protocols for wireless sensor networks: a perspective.",
                    "Group key distribution via local collaboration in wireless sensor networks.",
                    "Secure cooperative mobile ad hoc networks against injecting traffic attacks.",
                    "Stimulating cooperation and defending against attacks in self-organized mobile ad hoc networks.",
                    "Efficient hierarchical key generation and key diffusion for sensor networks.",
                    "Price/utility-based optimized resource allocation in wireless ad hoc networks.",
                    "Congestion control in multi-hop wireless networks.",
                    "Proactive address autoconfiguration and prefix continuity in IPv6 hybrid ad hoc networks.",
                    "Key pre-distribution in wireless sensor networks using multivariate polynomials.",
                    "On the forwarding area of contention-based geographic forwarding for ad hoc and sensor networks.",
                    "Channel-adaptive relaying in mobile ad hoc networks with fading.",
                    "Improving the performability of data transfer in mobile ad hoc networks.",
                    "Routing in a highly dynamic topology.",
                    "Redundant reader elimination in RFID systems.",
                    "Streaming versus batch processing of sensor data in a hazardous weather detection system.",
                    "Switching kalman filters for prediction and tracking in an adaptive meteorological sensing network.",
                    "Embedding intelligent sensor signal change detection into sensor network protocols.",
                    "Expected data rate: an accurate high-throughput path metric for multi-hop wireless routing.",
                    "A local metric for geographic routing with power control in wireless networks.",
                    "Scalable routing for networked sensors and actuators.",
                    "Blacklist-aided forwarding in static multihop wireless networks.",
                    "Interference-aware topology control for wireless sensor networks.",
                    "Optimal placement of nodes in large sensor networks under a general physical layer model.",
                    "Mesh topology construction for interconnected wireless LANs.",
                    "Prolonging sensor network lifetime with energy provisioning and relay node placement.",
                    "Modeling spatially-correlated data of sensor networks with irregular topologies.",
                    "The impact of the topology on the throughput of interference-limited sensor networks with Rayleigh fading.",
                    "Practical limits on achievable energy improvements and useable delay tolerance in correlation aware data gathering in wireless sensor networks.",
                    "Modelling the effect of network parameters on delay in wireless ad-hoc networks.",
                    "Collaborative two-level task scheduling for wireless sensor nodes with multiple sensing units.",
                    "Energy efficient joint scheduling and power control for wireless sensor networks.",
                    "A dynamic clustering and scheduling approach to energy saving in data collection from wireless sensor networks.",
                    "Partitioning based mobile element scheduling in wireless sensor networks.",
                    "EASE: an energy-efficient in-network storage scheme for object tracking in sensor networks.",
                    "Evolutionary energy management and design of wireless sensor networks.",
                    "Power management in delay tolerant networks: a framework and knowledge-based mechanisms.",
                    "Battery discharge characteristics of wireless sensor nodes: an experimental analysis.",
                    "SoftMAC: layer 2.5 MAC for VoIP support in multi-hop wireless networks.",
                    "A multiband mac protocol for impulse-based UWB ad hoc networks.",
                    "Optimization models for fixed channel assignment in wireless mesh networks with multiple radios.",
                    "Distributed spectrum allocation via local bargaining.",
                    "Variable-resolution information dissemination.",
                    "Attribute-based clustering for information dissemination in wireless sensor networks.",
                    "Reliable broadcast in ZigBee networks.",
                    "Securing MAODV: attacks and countermeasures.",
                    "Precise localization in coarse-grained localization algorithms through local learning.",
                    "Robust, probabilistic, constraint-based localization for wireless sensor networks.",
                    "Acquiring medium models for sensing performance estimation.",
                    "Outage probabilities in poisson and clumped poisson-distributed hybrid ad-hoc networks.",
                    "Relay node deployment strategies in heterogeneous wireless sensor networks: multiple-hop communication case.",
                    "Energy-efficient sensor network design subject to complete coverage and discrimination constraints.",
                    "Fault tolerant connected sensor cover with variable sensing and transmission ranges."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "1st SECON 2004",
        "info": "Santa Clara, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/secon/2004",
                "sub_name": "Proceedings of the First Annual IEEE Communications Society Conference on Sensor and Ad Hoc Communications and Networks, SECON 2004, October 4-7, 2004, Santa Clara, CA, USA.",
                "count": 69,
                "papers": [
                    "Controlled mobility for sustainable wireless sensor networks.",
                    "Applications and experiments with eBlocks - electronic blocks for basic sensor-based systems.",
                    "Analysis of the performance of IEEE 802.15.4 for medical sensor body area networking.",
                    "Incremental network programming for wireless sensors.",
                    "Interaction of retransmission, blacklisting, and routing metrics for reliability in sensor network routing.",
                    "Cost-conscious geographic multicast on MANET.",
                    "Reducing data-overhead of mesh-based ad hoc multicast routing protocols by Steiner tree meshes.",
                    "Modelling routing in wireless ad hoc networks with dynamic Bayesian games.",
                    "A public-key infrastructure for key distribution in TinyOS based on elliptic curve cryptography.",
                    "Glacsweb: a sensor network for hostile environments.",
                    "A network layer covert channel in ad-hoc wireless networks.",
                    "Efficacy of misuse detection in ad hoc networks.",
                    "Quality of service-aware source-initiated ad-hoc routing.",
                    "Distributed QoS guarantees for realtime traffic in ad hoc networks.",
                    "Toward the use of local monitoring and network-wide correction to achieve QoS guarantees in mobile ad hoc networks.",
                    "Embedded networked sensors: signal search engine for signal classification.",
                    "ATEMU: a fine-grained sensor network simulator.",
                    "A two-tier representation of node mobility in ad hoc networks.",
                    "Modeling spatially-correlated sensor network data.",
                    "Effect of partially correlated data on clustering in wireless sensor networks.",
                    "Serial data fusion using space-filling curves in wireless sensor networks.",
                    "Hierarchical sensor networks: capacity bounds and cooperative strategies using the multiple-access relay channel model.",
                    "Throughput-delay analysis of mobile ad-hoc networks with a multi-copy relaying strategy.",
                    "Bounds on the throughput capacity of wireless ad hoc network with non-uniform traffic.",
                    "Feasibility analysis of stochastic sensor networks.",
                    "OSPF-style database exchange and reliable synchronization in the optimized link-state routing protocol.",
                    "Single-copy routing in intermittently connected mobile networks.",
                    "MARVIN: movement-aware routing over interplanetary networks.",
                    "Dynamic codeword routing (DCR): a cross-layer approach for performance enhancement of general multi-hop wireless routing.",
                    "Joint estimation in sensor networks under energy constraints.",
                    "Energy-constrained optimal quantization for wireless sensor networks.",
                    "The energy-limited capacity of wireless networks.",
                    "Experimental study of the effects of transmission power control and blacklisting in wireless sensor networks.",
                    "An energy-efficient virtual MIMO architecture based on V-BLAST processing for distributed wireless sensor networks.",
                    "Source and channel coding in wireless sensor networks using LDPC codes.",
                    "Effect of time-varying fading channels on control performance of a mobile sensor.",
                    "An efficient UWB radio architecture for busy signal MAC protocols.",
                    "Self organization and energy efficient TDMA MAC protocol by wake up for wireless sensor networks.",
                    "An adaptive ad-hoc self-organizing method for quasi-periodic sensor traffic.",
                    "Broadcasting for network lifetime maximization in wireless sensor networks.",
                    "An improvement to the reliability of IEEE 802.11 broadcast scheme for multicasting in mobile ad networks.",
                    "Impact of heterogeneous deployment on lifetime sensing coverage in sensor networks.",
                    "Coverage preserving redundancy elimination in sensor networks.",
                    "Variable radii connected sensor cover in sensor networks.",
                    "Using adaptive range control to maximize 1-hop broadcast coverage in dense wireless networks.",
                    "The limits of localization using signal strength: a comparative study.",
                    "Estimation bounds for localization.",
                    "A sub-optimal hierarchical maximum likelihood algorithm for collaborative localization in ad-hoc network.",
                    "Probability grid: a location estimation scheme for wireless sensor networks.",
                    "NASCENT: network layer service for vicinity ad-hoc groups.",
                    "Reliable transfer on wireless sensor networks.",
                    "Distributed parameter estimation for monitoring diffusion phenomena using physical models.",
                    "Increasingly correct message passing algorithms for heat source detection in sensor networks.",
                    "Topology control in ad hoc wireless networks with hitch-hiking.",
                    "A partition detection system for mobile ad-hoc networks.",
                    "On connectivity properties of large-scale sensor networks.",
                    "An information-theoretic view of connectivity in wireless sensor networks.",
                    "Analyzing the transitional region in low power wireless links.",
                    "Energy efficient power control policies for the low rate WPAN.",
                    "Channel assignment for ifying the critically exposed node problem in ad hoc wireless networks.",
                    "Bluetooth time division duplex - analysis as a polling system.",
                    "On the interaction between data aggregation and topology control in wireless sensor networks.",
                    "Improving lifetime data gathering and distortion for mobile sensing networks.",
                    "Model based error correction for wireless sensor networks.",
                    "Low complexity tracking for ad-hoc automotive sensor networks.",
                    "Reference architectures and management model for ad hoc sensor networks.",
                    "DAMON: a distributed architecture for monitoring multi-hop mobile networks.",
                    "Simplified simulation models for indoor MANET evaluation are not robust.",
                    "Extended multipoint relays to determine connected dominating sets in MANETs."
                ]
            }
        ]
    }
]