[
    {
        "year": "2021",
        "name": "ACM SenSys 2021",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2021",
                "sub_name": "SenSys '21: The 19th ACM Conference on Embedded Networked Sensor Systems, Coimbra, Portugal, November 15 - 17, 2021.",
                "count": 108,
                "papers": [
                    "RT-mDL: Supporting Real-Time Mixed Deep Learning Tasks on Edge Platforms.",
                    "FedDL: Federated Learning via Dynamic Layer Sharing for Human Activity Recognition.",
                    "Mercury: Efficient On-Device Distributed DNN Training via Stochastic Importance Sampling.",
                    "FedMask: Joint Computation and Communication-Efficient Personalized Federated Learning via Heterogeneous Masking.",
                    "NELoRa: Towards Ultra-low SNR LoRa Communication with Neural-enhanced Demodulation.",
                    "MultiScatter: Multistatic Backscatter Networking for Battery-Free Sensors.",
                    "COCOON: A Conductive Substrate-based Coupled Oscillator Network for Wireless Communication.",
                    "Wavoice: A Noise-resistant Multi-modal Speech Recognition System Fusing mmWave and Audio Signals.",
                    "MoRe-Fi: Motion-robust and Fine-grained Respiration Monitoring via Deep-Learning UWB Radar.",
                    "Sense Me on the Ride: Accurate Mobile Sensing over a LoRa Backscatter Channel.",
                    "LTE-based Pervasive Sensing Across Indoor and Outdoor.",
                    "CurveLight: An Accurate and Practical Indoor Positioning System.",
                    "SnapperGPS: Algorithms for Energy-Efficient Low-Cost Location Estimation Using GNSS Signal Snapshots.",
                    "Enabling Passive Backscatter Tag Localization Without Active Receivers.",
                    "RFusion: Robotic Grasping via RF-Visual Sensing and Learning.",
                    "OneFi: One-Shot Recognition for Unseen Gesture via COTS WiFi.",
                    "LIMU-BERT: Unleashing the Potential of Unlabeled Data for IMU Sensing Applications.",
                    "UniTS: Short-Time Fourier Inspired Neural Networks for Sensory Time Series Classification.",
                    "Morphy: Software Defined Charge Storage for the IoT.",
                    "ALFRED: Virtual Memory for Intermittent Computing.",
                    "STeC: Exploiting Spatial and Temporal Correlation for Event-based Communication in WSNs.",
                    "LAPD: Hidden Spy Camera Detection using Smartphone Time-of-Flight Sensors.",
                    "UltraDepth: Exposing High-Resolution Texture from Depth Cameras.",
                    "SpiderWeb: Enabling Through-Screen Visible Light Communication.",
                    "Adversarial Attacks against LiDAR Semantic Segmentation in Autonomous Driving.",
                    "Infrastructure-Free Smartphone Indoor Localization Using Room Acoustic Responses.",
                    "ROMeasure: Smartwatch-Based Practical Solution To Accurately Calculate Joint Range Of Motion.",
                    "Cognisense: A contactless rotation speed measurement system.",
                    "A Drone-based System for Intelligent and Autonomous Homes.",
                    "A Compliance Monitoring System for Open SDR Platforms.",
                    "BLE Location-based Services via WiFi.",
                    "Are CNN based Malware Detection Models Robust?: Developing Superior Models using Adversarial Attack and Defense.",
                    "Cyber-Physical System for Collecting Data on Moisture Inside the Walls of Buildings.",
                    "Exploring an Extensible Children Game Framework based on Augmented Reality Building Blocks.",
                    "Enhanced Virtual Reality: Exploring an Immersive and Realistic Virtual Reality Training for Nursing.",
                    "3D Human Pose Estimation Using WiFi Signals.",
                    "A Wearable-based Distracted Driving Detection Leveraging BLE.",
                    "Pushing the Limits of Respiration Sensing with Reconfigurable Metasurface.",
                    "Algorithm for Distributed Duty Cycle Adherence in Multi-Hop RPL Networks.",
                    "Muscle-Mind: towards the Strength Training Monitoring via the Neuro-Muscular Connection Sensing.",
                    "Image Reconstruction and Compression in Ultrasound Tomography Using Discrete Cosine Transform.",
                    "Identifying Bluetooth Low Energy Devices.",
                    "Determining Position of People in Closed Spaces using Radio Tomography Imaging.",
                    "Diagnosing Cardiovascular Diseases with Machine Learning on Body Surface Potential Mapping Data.",
                    "ElastiCL: Elastic Quantization for Communication Efficient Collaborative Learning in IoT.",
                    "On Utilizing Smartphone Time-of-Flight Sensors to Detect Hidden Spy Cameras.",
                    "ECSRL: A Learning-Based Scheduling Framework for AI Workloads in Heterogeneous Edge-Cloud Systems.",
                    "Ultrasound Tomography for Monitoring the Lower Urinary Tract.",
                    "Can Image Style Transfer Save Automotive Radar?",
                    "Pseudo Random Binary Sequence Excitation for Electrical Impedance Tomography.",
                    "Enabling Elasticity on the Edge using Heterogeneous Gateways.",
                    "Adaptive Video Transmission Strategy Based on Ising Machine.",
                    "Social Distancing Compliance Monitoring for COVID-19 Recovery Through Footstep-Induced Floor Vibrations.",
                    "Throughput Maximization in Low-Power IoT Networks via Tuning the Size of the TSCH Slotframe.",
                    "Robust and Affordable Deep Learning Models for Multimodal Sensor Fusion.",
                    "ECCO-Box: An Edge Computing and Connectivity Framework.",
                    "Privacy-Preserving Mechanisms for Heterogeneous Data Types.",
                    "Untangling the Cloud from Edge Computing for IoT.",
                    "Decentralised and Scalable Security for IoT Devices.",
                    "Federated Learning for Internet of Things.",
                    "OntoAugment: Ontology Matching through Weakly-Supervised Label Augmentation.",
                    "Better Never Than Late: Timely Edge Video Analytics Over the Air.",
                    "Exploring Co-dependency of IoT Data Quality and Model Robustness in Precision Cattle Farming.",
                    "Characterising the Role of Pre-Processing Parameters in Audio-based Embedded Machine Learning.",
                    "Device or User: Rethinking Federated Learning in Personal-Scale Multi-Device Environments.",
                    "Decentralized Federated Learning Framework for the Neighborhood: A Case Study on Residential Building Load Forecasting.",
                    "Sensor Virtualization for Efficient Sharing of Mobile and Wearable Sensors.",
                    "Deep Contextualized Compressive Offloading for Images.",
                    "Vision Paper: Towards Software-Defined Video Analytics with Cross-Camera Collaboration.",
                    "Through-Screen Visible Light Sensing Empowered by Embedded Deep Learning.",
                    "AI-assisted Cell-Level Fault Detection and Localization in Solar PV Electroluminescence Images.",
                    "Experimental Scalability Study of Consortium Blockchains with BFT Consensus for IoT Automotive Use Case.",
                    "The convergence of Blockchain and Machine Learning for Decentralized Trust Management in IoT Ecosystems.",
                    "Detecting Compromised Edge Smart Cameras using Lightweight Environmental Fingerprint Consensus.",
                    "A Blockchain and Machine Learning based Framework for Efficient Health Insurance Management.",
                    "Blockchain-based Decentralized Service Provisioning in Local 6G Mobile Networks.",
                    "Thermal Energy Harvesting Profiles in Residential Settings.",
                    "Enabling Offline Tuning of Fat Channel Communication.",
                    "Person Re-ID Testbed with Multi-Modal Sensors.",
                    "Container Escape Detection for Edge Devices.",
                    "Analysis of IFTTT Recipes to Study How Humans Use Internet-of-Things (IoT) Devices.",
                    "Motion Tracklet Oriented 6-DoF Inertial Tracking Using Commodity Smartphones.",
                    "Footstep-Induced Floor Vibration Dataset: Reusability and Transferability Analysis.",
                    "A Low-resolution infrared thermal dataset and potential privacy-preserving applications.",
                    "Longitudinal personal thermal comfort preference data in the wild.",
                    "Large-scale Urban IoT Activity Data for DDoS Attack Emulation.",
                    "Environmental Impact on the Long-Term Connectivity and Link Quality of an Outdoor LoRa Network.",
                    "Autonomous Energy Status Sharing and Synchronization for Batteryless Sensor Networks.",
                    "Persistent Timekeeping Using Harvested Power Measurements.",
                    "Joint Energy Management for Distributed Energy Harvesting Systems.",
                    "RESERVE: Remote Attestation of Intermittent IoT devices.",
                    "Designing a General Purpose Development Platform for Energy-harvesting Applications.",
                    "Energy-Aware Battery-Less Bluetooth Low Energy Device Prototype Powered By Ambient Light.",
                    "Demonstration of an Energy-Aware Task Scheduler for Battery-Less IoT Devices.",
                    "A Simulation and Prototyping Toolkit for Airflow Energy Harvesting in Vehicles.",
                    "Powering an E-Ink Display from Soil Bacteria.",
                    "RF Power Transmission: Energy Harvesting for Self-Sustaining Miniaturized Sensor Nodes.",
                    "A Battery-Free Long-Range Wireless Smart Camera for Face Recognition.",
                    "A Machine Learning Approach for Abnormality Detection in Blood Vessels via Mobile Nanosensors.",
                    "Enabling Protein Interactions Using Terahertz Signals for Intra-body Communication.",
                    "Modulated Molecular Channel Coding Scheme for Multi-Bacterial Transmitters.",
                    "Dynamic application mapping on CTH network: a performance-centric approach.",
                    "An analytical framework for Reconfigurable Intelligent Surfaces placement in a mobile user environment.",
                    "Design Exploration and Scalability Analysis of a CMOS-Integrated, Polymorphic, Nanophotonic Arithmetic-Logic Unit.",
                    "Coordinating a Swarm of Micro-Robots Under Lossy Communication.",
                    "On-Demand SIMO Channel Impulse Response Shaping in Smart On-Chip Electromagnetic Environments.",
                    "Cardiac Bio-Nanonetwork: Extracellular Matrix Modeling for the Propagation of Extracellular Vesicles.",
                    "Mitigating the Retroactivity Impact on Molecular Communications."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2021buildsys",
                "sub_name": "BuildSys '21: The 8th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation, Coimbra, Portugal, November 17 - 18, 2021.",
                "count": 78,
                "papers": [
                    "Learning-based framework for sensor fault-tolerant building HVAC control with model-assisted learning.",
                    "UbiTrack: enabling scalable & low-cost device localization with onboard wifi.",
                    "Learn to chill: intelligent chiller scheduling using meta-learning and deep reinforcement learning.",
                    "Activity-aware privacy protection for smart water meters.",
                    "Holistic energy awareness for intelligent drones.",
                    "QUILT: quantify, infer and label the thermal efficiency of heating and cooling residential homes.",
                    "CS-light: camera sensing based occupancy-aware robust smart building lighting control.",
                    "PIRMedic: physics-driven fault diagnosis for PIR sensors.",
                    "Energy-efficient parking analytics system using deep reinforcement learning.",
                    "Can I go for a roof walk today?: know your housing's air quality from a thermo-hygrometer.",
                    "The space broker: a middleware for mediating interactions in smart IoT spaces.",
                    "SCHMEAR: scalable construction of holistic models for energy analysis from rooftops.",
                    "VPeak: exploiting volunteer energy resources for flexible peak shaving.",
                    "Offline-online reinforcement learning for energy pricing in office demand response: lowering energy and data costs.",
                    "Marble: collaborative scheduling of batteryless sensors with meta reinforcement learning.",
                    "Query relaxation for portable brick-based applications.",
                    "Identifying the relationship between seasonal variation in residential load and socioeconomic characteristics.",
                    "Towards semantic search in building sensor data.",
                    "Improving load forecast in energy markets during COVID-19.",
                    "Neural network approaches and dataset parser for NILM toolkit.",
                    "Demand flexibility potential model for multi-zone commercial buildings using internal HVAC system states.",
                    "Temporal convolutional networks for fault diagnosis of photovoltaic systems using satellite and inverter measurements.",
                    "Operational characteristics of residential air conditioners with temporally granular remote thermographic imaging.",
                    "Heat reuse models for liquid cooled data centers integrated with district heating.",
                    "WinSet: the first multi-modal window dataset for heterogeneous window states.",
                    "Sharing economy meets energy markets: group purchasing of energy plans in retail energy markets.",
                    "Decoupling the unfairness propagation chain in crowd sensing and learning systems for spatio-temporal urban monitoring.",
                    "I want it that way: thermal desirability in shared spaces.",
                    "Marble: collaborative scheduling of batteryless sensors with meta reinforcement learning.",
                    "Real-time data visualisation on the adaptive city platform.",
                    "User privacy leakages from federated learning in NILM applications.",
                    "Cyber-attack detection for automotive cyber-physical systems.",
                    "A flagged or spam?: social media driven public interactions for natural disaster response and recovery.",
                    "The citylearn challenge 2021.",
                    "Offline-online reinforcement learning for generalizing demand response price-setting to energy systems.",
                    "Comparison of machine learning methods to predict sleep quality from daytime activity and nightly bedroom environmental conditions.",
                    "Energy efficient timely transportation: a comparative study of internal combustion trucks and electric trucks.",
                    "Integrating IoT-sensing and crowdsensing for privacy-preserving parking monitoring.",
                    "Assisting automated fault detection and diagnostics in building automation through semantic description of functions and process data.",
                    "Unsupervised personal thermal comfort prediction via adversarial domain adaptation.",
                    "Improving duck curve by dynamic pricing and battery scheduling based on a deep reinforcement learning approach.",
                    "Towards 3D indoor airflow monitoring based on differential pressure measurements.",
                    "The smart building privacy challenge.",
                    "Towards pro-social load balancing in energy communities.",
                    "Cohort-based personal comfort models for HVAC occupant-centric control.",
                    "Transactive multi-agent reinforcement learning for distributed energy price localization.",
                    "Autonomous buildings.",
                    "Towards utility-aware privacy-preserving sensor data anonymization in distributed IoT.",
                    "DeepOPF: deep neural networks for optimal power flow.",
                    "FATEsys 2021: the first ACM SIGEnergy workshop on fair, accountable, transparent, and ethical (FATE) AI for smart environments and energy systems.",
                    "Toward explainable and interpretable building energy modelling: an explainable artificial intelligence approach.",
                    "Towards equity in energy efficiency analyses.",
                    "Data balancing for thermal comfort datasets using conditional wasserstein GAN with a weighted loss function.",
                    "Transparent AI: explainability of deep learning based load disaggregation.",
                    "Estimating residential energy flexibility potential through forced activations.",
                    "Containerized framework for building control performance comparisons: model predictive control vs deep reinforcement learning control.",
                    "A representational learning assisted matrix factorization approach for electrical load disaggregation.",
                    "Towards improved thermal comfort predictions for building controls: hierarchical bayesian modelling of indoor environmental design conditions.",
                    "Clustering appliance energy consumption data for occupant energy-behavior modeling.",
                    "Semantic data integration with DevOps to support engineering process of intelligent building automation systems.",
                    "Intelligent household waste collection.",
                    "Tracking urban heartbeat and policy compliance through vision and language-based sensing.",
                    "The second ACM SIGEnergy workshop on reinforcement learning for energy management in buildings & cities (RLEM).",
                    "Comparative analysis of model-free and model-based HVAC control for residential demand response.",
                    "Sensitivity and robustness of end-to-end data-driven approach for building performance optimization.",
                    "Sinergym: a building simulation and control framework for training reinforcement learning agents.",
                    "Addressing partial observability in reinforcement learning for energy management.",
                    "Deep Q-network boosted with external knowledge for HVAC control.",
                    "Collaborative energy demand response with decentralized actor and centralized critic.",
                    "The 1st ACM international workshop on big data and machine learning for smart buildings and cities.",
                    "Data-driven identification of occupant-thermostat interactions in small commercial buildings.",
                    "Fifty shades of black: uncovering physical models from symbolic regressions for scalable building heat dynamics identification.",
                    "Application of occupant behavior prediction model on residential big data analysis.",
                    "Towards sensing urban-scale COVID-19 policy compliance in new york city.",
                    "Building sensor fault detection and diagnostic system.",
                    "Open set anomaly classification.",
                    "Dynamic bayesian network-based fault diagnosis for ASHRAE guideline 36: high performance sequence of operation for HVAC systems.",
                    "A linked-data paradigm for the integration of static and dynamic building data in digital twins."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "ACM SenSys 2020",
        "info": "Virtual Event, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2020",
                "sub_name": "SenSys '20: The 18th ACM Conference on Embedded Networked Sensor Systems, Virtual Event, Japan, November 16-19, 2020.",
                "count": 162,
                "papers": [
                    "UWHear: through-wall extraction and separation of audio vibrations using wireless signals.",
                    "Exploring commodity RFID for contactless sub-millimeter vibration sensing.",
                    "AcuTe: acoustic thermometer empowered by a single smartphone.",
                    "RTSense: passive RFID based temperature sensing.",
                    "LeakyTrack: non-coherent single-antenna nodal and environmental mobility tracking with a leaky-wave antenna.",
                    "Combating interference for long range LoRa sensing.",
                    "Symphony: localizing multiple acoustic sources with a single microphone array.",
                    "EarphoneTrack: involving earphones into the ecosystem of acoustic motion tracking.",
                    "milliEgo: single-chip mmWave radar aided egomotion estimation via deep sensor fusion.",
                    "LiTag: localization and posture estimation with passive visible light tags.",
                    "MobiPose: real-time multi-person pose estimation on mobile devices.",
                    "FM-track: pushing the limits of contactless multi-target tracking using acoustic signals.",
                    "Zero-wire: a deterministic and low-latency wireless bus through symbol-synchronous transmission of optical signals.",
                    "One flood to route them all: ultra-fast convergecast of concurrent flows over UWB.",
                    "Aloba: rethinking ON-OFF keying modulation for ambient LoRa backscatter.",
                    "BatComm: enabling inaudible acoustic communication with high-throughput for mobile devices.",
                    "X-MIMO: cross-technology multi-user MIMO.",
                    "Breaking the limitations of visible light communication through its side channel.",
                    "Patronus: preventing unauthorized speech recordings with support for selective unscrambling.",
                    "SLoRa: towards secure LoRa communications with fine-grained physical layer features.",
                    "TrustICT: an efficient trusted interaction interface between isolated execution domains on ARM multi-core processors.",
                    "Detecting replay attacks against industrial robots via power fingerprinting.",
                    "\"Alexa, stop spying on me!\": speech privacy protection against voice assistants.",
                    "VocalPrint: exploring a resilient and secure voice authentication via mmWave biometric interrogation.",
                    "DroneScale: drone load estimation via remote passive RF sensing.",
                    "Pointillism: accurate 3D bounding box estimation with multi-radars.",
                    "Spying with your robot vacuum cleaner: eavesdropping via lidar sensors.",
                    "Battery-less zero-maintenance embedded sensing at the mithræum of circus maximus.",
                    "ePerceptive: energy reactive embedded intelligence for batteryless sensors.",
                    "Starfish: resilient image compression for AIoT cameras.",
                    "Distream: scaling live video analytics with workload-adaptive distributed edge intelligence.",
                    "GazeGraph: graph-based few-shot cognitive context sensing from human visual behavior.",
                    "Wi-fi see it all: generative adversarial network-augmented versatile wi-fi imaging.",
                    "ApproxDet: content and contention-aware approximate object detection for mobiles.",
                    "MDLdroidLite: a release-and-inhibit control approach to resource-efficient deep neural networks on mobile devices.",
                    "Deep compressive offloading: speeding up neural network inference by trading edge computation for network latency.",
                    "Neuroplex: learning to detect complex events in sensor networks through knowledge injection.",
                    "Ember: energy management of batteryless event detection sensors with deep reinforcement learning.",
                    "RF-net: a unified meta-learning framework for RF-enabled one-shot human activity recognition.",
                    "Sensing finger input using an RFID transmission line.",
                    "Noninvasive glucose monitoring using polarized light.",
                    "ERICA: enabling real-time mistake detection & corrective feedback for free-weights exercises.",
                    "RFWash: a weakly supervised tracking of hand hygiene technique.",
                    "A method for detecting street parking using dashboard camera videos on an edge device: demo abstract.",
                    "A monitoring, modeling, and interactive recommendation system for in-home caregivers: demo abstract.",
                    "A smartwatch product provides on-body tapping gestures recognition: demo abstract.",
                    "Achieving deterministic and low-latency wireless connection with zero-wire: demo abstract.",
                    "Activity recognition through intermittent distributed processing by energy harvesting PIR sensors: demo abstract.",
                    "Aerial sensing system for wildfire detection: demo abstract.",
                    "AI thermometer for temperature screening: demo abstract.",
                    "Analysis of gaze points when looking at paintings and saliency map to improve the accuracy of ROI (region of interest): demo abstract.",
                    "Automated, autonomous, and repeatable wireless experimentation in heterogeneous 3D environments: demo abstract.",
                    "Continuous micro finger writing recognition with a commodity smartwatch: demo abstract.",
                    "CoPED: a smartwatch based voice cognitive assistant for the pandemic and beyond: demo abstract.",
                    "CSI assisted channel selection for BLE protocol in integrated chips: demo abstract.",
                    "Ember - energy management of batteryless event detection sensors with deep reinforcement learning: demo abstract.",
                    "Fault diagnosis system for low-cost air pollution sensors: demo abstract.",
                    "Federated learning on wearable devices: demo abstract.",
                    "Fishing activity sensing and visualization system using sensor-equipped fishing rod: demo abstract.",
                    "Fusing wifi and camera for fast motion tracking and person identification: demo abstract.",
                    "Hand motion capture system based on multiple inertial sensors: demo abstract.",
                    "IMACS - an interactive cognitive assistant module for cardiac arrest cases in emergency medical service: demo abstract.",
                    "Indoor positioning system in visually-degraded environments with millimetre-wave radar and inertial sensors: demo abstract.",
                    "Intelligent and autonomous wheelchair design: demo abstract.",
                    "Large-scale decimeter-level indoor tracking using a single access point: demo abstract.",
                    "On-demand communication with the batteryless MiroCard: demo abstract.",
                    "Proposal of an interest word presentation system when browsing the web using eye movements: demo abstract.",
                    "Real-time robust estimation of breathing rate from PPG using commercial-grade smart devices: demo abstract.",
                    "SCaRT-SIoT: towards a scalable and robust trust platform for social internet of things: demo abstract.",
                    "Side-channel information leaks of Z-wave smart home IoT devices: demo abstract.",
                    "ThermoTrak: smartphone based real-time fever screening: demo abstract.",
                    "User decision support system for on-site tourism navigation on smartphone: demo abstract.",
                    "Visual and inertial sensor fusion for mobile X-ray detector tracking: demo abstract.",
                    "A mobility-aware pub/sub architecture for short-lived data in smart cities: poster abstract.",
                    "A performance investigation of thermal infrared camera and optical camera for searching victims with an unmanned aerial vehicle: poster abstract.",
                    "A scalable, data-driven approach for estimating battery health degradation of IoT devices: poster abstract.",
                    "A sensor-based application for road conditions detection: poster abstract.",
                    "A toolkit for spatial interpolation and sensor placement: poster abstract.",
                    "An adaptive noise removal tool for IoT image processing under influence of weather conditions: poster abstract.",
                    "An incentive mechanism design for resource collection in crowdsourced CDN: poster abstract.",
                    "An open system for monitoring environmental phenomena: poster abstract.",
                    "Analysis of healing effects caused by changes in display resolution using biosensors: poster abstract.",
                    "APPLE: a new compression scheme for bitmap indexes: poster abstract.",
                    "Automatic recognition of vocal reactions in music listening using smart earbuds: poster abstract.",
                    "Blockchain-based scalable authentication for IoT: poster abstract.",
                    "CapTag: toward printable ubiquitous internet of things: poster abstract.",
                    "Crowdsensing spatial data to follow epidemic evolution: poster abstract.",
                    "DeepPower: fast and scalable energy assessment of mobile sensing applications: poster abstract.",
                    "Enabling identity-aware tracking by vision-RFID fusion: poster abstract.",
                    "Exploring drivers' embarrassing moments in using automotive navigation: poster abstract.",
                    "Exploring effectiveness of a predictive light control mechanism for wireless sensor networks: poster abstract.",
                    "HARaaS: HAR as a service using wifi signal in IoT-enabled edge computing: poster abstract.",
                    "How robust are malware detection models for Android smartphones against adversarial attacks?: poster abstract.",
                    "Impact of COVID19 lockdown on household energy consumption on two Indian cities: poster abstract.",
                    "In-ear thermometer: wearable real-time core body temperature monitoring: poster abstract.",
                    "Inaudible acoustic signal based key agreement system for IoT devices: poster abstract.",
                    "Incremental firmware update using an efficient differencing algorithm: poster abstract.",
                    "Indoor air quality monitoring system for proactive control of respiratory infectious diseases: poster abstract.",
                    "Investigating the biological impacts of radio transmissions: poster abstract.",
                    "Itocon - a system for visualizing the congestion of bus stops around Ito campus in real-time: poster abstract.",
                    "IWannaPlay - an eye-tracking based AI tutoring chinese chess system: poster abstract.",
                    "LidarPhone: acoustic eavesdropping using a lidar sensor: poster abstract.",
                    "Localization from activity sensor data: poster abstract.",
                    "Low-cost multi-person continuous skin temperature sensing system for fever detection: poster abstract.",
                    "Magnetic sensor based indoor positioning by multi-channel deep regression: poster abstract.",
                    "Participatory sound meter calibration system for mobile devices: poster abstract.",
                    "Predictive monitoring with uncertainty for deep learning enabled smart cities: poster abstract.",
                    "Real-time reassurance monitoring shopping basket in retail store: poster abstract.",
                    "Scenario-based energy estimation for continuous mobile sensing applications: poster abstract.",
                    "Security and privacy in the age of cordless power world: poster abstract.",
                    "Sensitivity of radiometric fingerprint against wireless channel: poster abstract.",
                    "Smart earpieces that know who you are quietly: poster abstract.",
                    "SmartEye - a wearable device that help visually impaired people during on-site banking: poster abstract.",
                    "Spatiotemporal security in mixed reality systems.",
                    "Tap it and you know what it is: a surface identification system based on acoustic dispersion: poster abstract.",
                    "Teacher, trainee, and student based knowledge distillation technique for monitoring indoor activities: poster abstract.",
                    "The ZotBins solution to waste management using internet of things: poster abstract.",
                    "Toward efficient power delivery using USB power delivery hub: poster abstract.",
                    "Towards identifying IoT traffic anomalies on the home gateway: poster abstract.",
                    "Towards optimizing time-slotted channel hopping scheduling on 6TiSCH networks: poster abstract.",
                    "Towards recognizing perceived level of understanding for online lectures using earables: poster abstract.",
                    "Towards secure backscatter-based in-body sensor networks: poster abstract.",
                    "A nudge-based smart system for hand hygiene promotion in private organizations: poster abstract.",
                    "A privacy-enabled platform for COVID-19 applications: poster abstract.",
                    "Automating decontamination of N95 masks for frontline workers in COVID-19 pandemic: poster abstract.",
                    "BluBLE, space-time social distancing to monitor the spread of COVID-19: poster abstract.",
                    "Contact analysis on COVID-19 using a campus network: poster abstract.",
                    "COVID-19 tracer: passive close-contacts searching through wi-fi probes: poster abstract.",
                    "Development of the portal site of COVID-19 data in Japan: poster abstract.",
                    "DigitalPPE: low cost wearable that acts as a social distancingreminder and contact tracer: poster abstract.",
                    "Dual-radio discovery and ranging for infrastructure-less social distancing with Janus: poster abstract.",
                    "Evaluation of distance learning on concentration and relax by EEG and HRV: poster abstract.",
                    "How blockchain helps to combat trust crisis in COVID-19 pandemic?: poster abstract.",
                    "How much does human mobility behavior affect the COVID-19 infection spread?: poster abstract.",
                    "Identifying human contact points on environmental surfaces using heat traces to support disinfect activities: poster abstract.",
                    "Mitigating denial-of-service attacks on digital contact tracing: poster abstract.",
                    "Physical distance monitoring system for COVID-19 using raspberry Pi and a monocular camera: poster abstract.",
                    "Poirot: private contact summary aggregation: poster abstract.",
                    "Privacy-preserving contact tracing using homomorphic encryption: poster abstract.",
                    "Proactive privacy-preserving proximity prevention through bluetooth transceivers: poster abstract.",
                    "SelfGuard: semi-automated activity tracking for enhancing self-protection against the COVID-19 pandemic: poster abstract.",
                    "Simulating COVID-19 containment measures using the South Korean patient data: poster abstract.",
                    "Structure of psychological stress during the COVID-19 pandemic and effects of essential oil odor exposure: poster abstract.",
                    "The CORONA business in modern cities: poster abstract.",
                    "Towards ICT based mobility support system with in the COVID-19 era: poster abstract.",
                    "VenueTrace: a privacy-by-design COVID-19 digital contact tracing solution: poster abstract.",
                    "WiFiMon: a mobility analytics platform for building occupancy monitoring and contact tracing using wifi sensing: poster abstract.",
                    "A robust discrete event method for the design of cyber-physical systems: PhD forum abstract.",
                    "Adversarial attacks on malware detection models for smartphones using reinforcement learning: PhD forum abstract.",
                    "Distributed machine learning for collaborative mobile robots: PhD forum abstract.",
                    "Generating location data with generative adversarial networks for sensing applications: PhD forum abstract.",
                    "Improving cyber-physical system performance through actuator-sensor interactions: PhD forum abstract.",
                    "Inferring finer-grained human information with multi-modal cross-granularity learning: PhD forum abstract.",
                    "Mobile application for caregiver in collecting statistical data of BPSD attack focused on macro activities: PhD forum abstract.",
                    "Multilabel classification in human activity recognition: PhD forum abstract.",
                    "Noise-tolerant and context-aware structural vibration based activity monitoring: PhD forum abstract.",
                    "Privacy-preserving machine learning for time series data: PhD forum abstract.",
                    "Requirements analysis for reminder system in daily activity recognition dementia: PhD forum abstract.",
                    "Scalable bridge health monitoring using drive-by vehicles: PhD forum abstract.",
                    "Scalable mHealth technologies for public health monitoring: PhD forum abstract.",
                    "Towards robust and low-complexity radiometric fingerprint: PhD forum abstract.",
                    "Uncovering opportunities for energy harvesting technologies: PhD forum abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020buildsys",
                "sub_name": "BuildSys '20: The 7th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation, Virtual Event, Japan, November 18-20, 2020.",
                "count": 61,
                "papers": [
                    "See the Light: Modeling Solar Performance using Multispectral Satellite Data.",
                    "DeepSnow: Modeling the Impact of Snow on Solar Generation.",
                    "SMITE: Using Smart Meters to Infer the Thermal Efficiency of Residential Homes.",
                    "COHORT: Coordination of Heterogeneous Thermostatically Controlled Loads for Demand Flexibility.",
                    "Who's in Charge Here?: Scheduling EV Charging on Dynamic Grids via Online Auctions with Soft Deadlines.",
                    "MB2C: Model-Based Deep Reinforcement Learning for Multi-zone Building Control.",
                    "SolarTrader: Enabling Distributed Solar Energy Trading in Residential Virtual Power Plants.",
                    "Shepherding Metadata Through the Building Lifecycle.",
                    "Smartphone-assisted Automatic Indoor Localization of BLE-enabled Appliances Using BLE and GNSS Signals.",
                    "EdgeNILM: Towards NILM on Edge devices.",
                    "Keep it open, Keep it safe: Maximizing Space Utilization in Intelligent Bio-safe Buildings.",
                    "Bidding Strategy for Two-Sided Electricity Markets: A Reinforcement Learning based Framework.",
                    "Balancing thermal comfort datasets: We GAN, but should we?",
                    "PoisonIvy: (In)secure Practices of Enterprise IoT Systems in Smart Buildings.",
                    "Tool-chain for supporting Privacy Risk Assessments.",
                    "Robust and Practical WiFi Human Sensing Using On-device Learning with a Domain Adaptive Model.",
                    "Experiences and Learned Lessons from an Air Free-Cooled Tropical Data Center Testbed.",
                    "MARLISA: Multi-Agent Reinforcement Learning with Iterative Sequential Action Selection for Load Shaping of Grid-Interactive Connected Buildings.",
                    "Greening Electric Bike Sharing Using Solar Charging Stations.",
                    "Real-Time Cooling Power Attribution for Co-Located Data Center Rooms with Distinct Temperatures.",
                    "Kalibre: Knowledge-based Neural Surrogate Model Calibration for Data Center Digital Twins.",
                    "Is my sensor sleeping, hibernating, or broken?: A data-driven monitoring system for indoor energy harvesting sensors.",
                    "A Guide for the Design of Benchmark Environments for Building Energy Optimization.",
                    "One for Many: Transfer Learning for Building HVAC Control.",
                    "Minimizing Emission for Timely Truck Transportation with Adaptive Fuel Injection.",
                    "ProcureOpt: Optimizing Electricity Procurement Cost for Large Electricity Customers.",
                    "Exploring Time Series Imaging for Load Disaggregation.",
                    "Intelligent network topology based post-pandemic reintroduction policies for offices.",
                    "Feature Mapping based Deep Neural Networks for Non-intrusive Load Monitoring of Similar Appliances in Buildings.",
                    "EnergonQL: A Building Independent Acquisitional Query Language for Portable Building Analytics.",
                    "On the Impact of Temporal Data Resolution on the Accuracy of Non-Intrusive Load Monitoring.",
                    "Sense, Send, Store, See, Share: the journey of SEIL-R, an electricity consumption dataset.",
                    "The Impacts of CSI Temporal Variations on CSI-based Occupancy Monitoring Systems: An Exploratory Study.",
                    "Assessing ADL Routine Variability from High-dimensional Sensing Data using Hierarchical Clustering.",
                    "Can Future Wireless Networks Detect Fires?",
                    "Compressive Non-Intrusive Load Monitoring.",
                    "FIRED: A Fully-labeled hIgh-fRequency Electricity Disaggregation Dataset.",
                    "High-Throughput Analysis of Urban Textures using Methods from Molecular Simulation.",
                    "Zonal Air Handling in Commercial Buildings.",
                    "AdaPool: An Adaptive Model-Free Ride-Sharing Approach for Dispatching using Deep Reinforcement Learning.",
                    "Super-Resolution Reconstruction of Interval Energy Data.",
                    "A Probability-based Approach Resolving Thermal Preference Conflicts through Optimal Cubicle Assignment.",
                    "Geo-Distributed Driving Maneuver Anomaly Detection.",
                    "Connecting LoRaWANs Deep Inside a Building.",
                    "COBS: COmprehensive Building Simulator.",
                    "Viability of a Dense, Low-Cost Particulate Matter Sensor Network.",
                    "An Urban Tropical Thermal Comfort Dataset for Smart Buildings.",
                    "The CityLearn Challenge 2020.",
                    "Impact of COVID-19 on Academic Campus Energy Use.",
                    "Detecting Building Occupancy with Synthetic Environmental Data.",
                    "Ecologically Valid Multimodal Data Collection.",
                    "Towards Identifying Alien Appliances using Semantic Information.",
                    "EMIoT: A LoRa-enabled Smart Building Solution Based on Emergency Lights.",
                    "Automatic Damage Detection on Rooftop Solar Photovoltaic Arrays.",
                    "Incentivizing Privacy-Preserving Crowdsensing for Smart Transportation.",
                    "On the feasibility of an IoT Multi-Radio Architecture for Smart Buildings.",
                    "C-HVAC: A practical tool for assessing ventilation capacity for HVAC systems during the COVID-19 Pandemic.",
                    "HVAC Scheduling based on Wi-Fi derived Occupancy.",
                    "Vista: Spatial Data Representation for Smart Buildings.",
                    "Interactive Metadata Integration with Brick.",
                    "Privacy-Preserving Camera-based Monitoring and Tracking System for Parking Spaces."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020aic",
                "sub_name": "AIChallengeIoT@SenSys 2020: Proceedings of the 2nd International Workshop on Challenges in Artificial Intelligence and Machine Learning for Internet of Things, Virtual Event, Japan, November 16, 2020.",
                "count": 10,
                "papers": [
                    "MetaDigit: Towards A Practical Digits Input System with Few User Effort.",
                    "Incremental On-Device Tiny Machine Learning.",
                    "Towards Objection Detection Under IoT Resource Constraints: Combining Partitioning, Slicing and Compression.",
                    "Pushing the Envelope of Dynamic Spatial Gating technologies.",
                    "Understanding the Impact of Dynamic Channel Pruning on Conditionally Parameterized Convolutions.",
                    "Learning in the Wild: When, How, and What to Learn for On-Device Dataset Adaptation.",
                    "PAMS: Improving Privacy in Audio-Based Mobile Systems.",
                    "A Low footprint Automatic Speech Recognition System For Resource Constrained Edge Devices.",
                    "Deep Associated Elastic Tracker for Intelligent Traffic Intersections.",
                    "Position paper: A systematic framework for categorising IoT device fingerprinting mechanisms."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020data",
                "sub_name": "DATA@SenSys 2020: Proceedings of the Third Workshop on Data: Acquisition To Analysis, Virtual Event, Japan, November 16-19, 2020.",
                "count": 9,
                "papers": [
                    "Designing privacy preserving data sharing middleware for internet of things.",
                    "LoED: The LoRaWAN at the edge dataset: dataset.",
                    "Lessons from large scale campus deployment.",
                    "The quest for raw signals: a quality review of publicly available photoplethysmography datasets.",
                    "Multi-city street-sidewalk imagery from pedestrian mobile cameras: dataset.",
                    "Pollen video library for benchmarking detection, classification, tracking and novelty detection tasks: dataset.",
                    "Person tracking and identification using cameras and wi-fi channel state information (CSI) from smartphones: dataset.",
                    "Toothbrushing data and analysis of its potential use in human activity recognition applications: dataset.",
                    "A video dataset of a wooden box assembly process: dataset."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020nilm",
                "sub_name": "NILM '20, Proceedings of the 5th International Workshop on Non-Intrusive Load Monitoring, November18, 2020, Virtual Event, Japan.",
                "count": 21,
                "papers": [
                    "Annoticity: A Smart Annotation Tool and Data Browser for Electricity Datasets.",
                    "Solar Disaggregation: State of the Art and Open Challenges.",
                    "Lightweight Non-Intrusive Load Monitoring Employing Pruned Sequence-to-Point Learning.",
                    "NILM based Energy Disaggregation Algorithm for Dairy Farms.",
                    "Matrix Factorization for High Frequency Non Intrusive Load Monitoring: Definitions and Algorithms.",
                    "Bayesian model of electrical heating disaggregation.",
                    "Finite Precision Analysis for an FPGA-based NILM Event-Detector.",
                    "Evaluation of low-complexity supervised and unsupervised NILM methods and pre-processing for detection of multistate white goods.",
                    "Stop: Exploring Bayesian Surprise to Better Train NILM.",
                    "Edge computed NILM: a phone-based implementation using MobileNet compressed by Tensorflow Lite.",
                    "Virtual metering of heat supplied by hydronic perimeter heaters in variable air volume zones.",
                    "Non-Intrusive Load Monitoring of Water Heaters Using Low-Resolution Data.",
                    "Energy Disaggregation for Small and Medium Businesses and their Operational Characteristics.",
                    "Explainable NILM Networks.",
                    "On the Relationship between Seasons of the Year and Disaggregation Performance.",
                    "On the Impact of the Sequence Length on Sequence-to-Sequence and Sequence-to-Point Learning for NILM.",
                    "Performance Analysis of Similar Appliances Identification using NILM Technique under Different Data Sampling Rates.",
                    "UNet-NILM: A Deep Neural Network for Multi-tasks Appliances State Detection and Power Estimation in NILM.",
                    "BERT4NILM: A Bidirectional Transformer Model for Non-Intrusive Load Monitoring.",
                    "Phased: Phase-Aware Submodularity-Based Energy Disaggregation.",
                    "An Open Problem: Energy Data Super-Resolution."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020ensSYS",
                "sub_name": "Proceedings of the 8th International Workshop on Energy Harvesting & Energy-Neutral Sensing Systems, ENSsys@SenSys 2020, Virtual Event, Japan, November 16, 2020.",
                "count": 15,
                "papers": [
                    "Intermittence Anomalies not Considered Harmful.",
                    "On Securing Persistent State in Intermittent Computing.",
                    "Energy Harvesting Systems Need an Operating System Too.",
                    "Reliable Energy Sources as a Foundation for Reliable Intermittent Systems.",
                    "A Battery-Free Long-Range Wireless Smart Camera for Face Detection.",
                    "Defragmenting Energy Storage in Batteryless Sensing Devices.",
                    "Zero Power Energy-Aware Communication for Transiently-Powered Sensing Systems.",
                    "eProfiler: High-Precision Power Monitoring System for IoT Devices Featuring Extreme Dynamic Range of Operation.",
                    "Energy-aware HW/SW Co-modeling of Batteryless Wireless Sensor Nodes.",
                    "Analysing and Improving Robustness of Predictive Energy Harvesting Systems.",
                    "Estimating Harvestable Energy in Time-Varying Indoor Light Conditions.",
                    "Comparing NVM Technologies through the Lens of Intermittent Computation.",
                    "Towards Battery-Free Body Sensor Networks.",
                    "Adaptive Energy Budgeting for Atomic Operations in Intermittently-Powered Systems.",
                    "Can Crystal Oscillators Keep Time Without Power?"
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2020nanococoa",
                "sub_name": "NanoCoCoA@SenSys '20: Proceedings of the 1st ACM International Workshop on Nanoscale Computing, Communication, and Application, Virtual Event, Japan, November, 2020.",
                "count": 8,
                "papers": [
                    "On the Feasibility of Flow-Guided Nanocommunication Networks for some Medical Applications.",
                    "A Molecular Communication Scheme to Estimate the State of Biochemical Processes on a Lab-on-a-Chip.",
                    "Hydrogel-based Bio-nanomachine Transmitters for Bacterial Molecular Communications.",
                    "Toward Dynamically Adapting Wireless Intra-Chip Channels to Traffic Needs with a Programmable Metasurface.",
                    "A cube-tree hybrid NoC topology with 3D mirroring technique for load balancing.",
                    "Secrecy Capacity of Diffusive Molecular Communication Under Biological Spherical Environment.",
                    "Metasurface Sensing Platforms for Medical Diagnostics.",
                    "Work in Progress: Intelligent Metasurface Holograms."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "ACM SenSys 2019",
        "info": "New York, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2019",
                "sub_name": "Proceedings of the 17th Conference on Embedded Networked Sensor Systems, SenSys 2019, New York, NY, USA, November 10-13, 2019.",
                "count": 67,
                "papers": [
                    "VitaMon: measuring heart rate variability using smartphone front camera.",
                    "SenseHAR: a robust virtual activity sensor for smartphones and wearables.",
                    "ALT: towards automating driver license testing using smartphones.",
                    "HyperSight: boosting distant 3D vision on a single dual-camera smartphone.",
                    "Intermittent asynchronous peripheral operations.",
                    "SkinnyPower: enabling batteryless wearable sensors via intra-body power transfer.",
                    "Shepherd: a portable testbed for the batteryless IoT.",
                    "Frugal following: power thrifty object detection and tracking for mobile augmented reality.",
                    "MetaSense: few-shot adaptation to untrained conditions in deep mobile sensing.",
                    "Moving target defense for embedded deep visual sensing against adversarial examples.",
                    "Neuro.ZERO: a zero-energy neural network accelerator for embedded sensing and inference systems.",
                    "DeepAPP: a deep reinforcement learning framework for mobile application usage prediction.",
                    "LuxLink: creating a wireless link from ambient light.",
                    "LTE2B: time-domain cross-technology emulation under LTE constraints.",
                    "FTrack: parallel decoding for LoRa transmissions.",
                    "Parallel inclusive communication for connecting heterogeneous IoT devices at the edge.",
                    "WISDOM: watering intelligently at scale with distributed optimization and modeling.",
                    "Caesar: cross-camera complex activity recognition.",
                    "SmrtFridge: IoT-based, user interaction-driven food item & quantity sensing.",
                    "WideSee: towards wide-area contactless wireless sensing.",
                    "A closer look at quality-aware runtime assessment of sensing models in multi-device environments.",
                    "HandSense: capacitive coupling-based dynamic, micro finger gesture recognition.",
                    "RFID based real-time recognition of ongoing gesture with adversarial learning.",
                    "U-Verse: a miniaturized platform for end-to-end closed-loop implantable internet of medical things systems.",
                    "FerroTag: a paper-based mmWave-scannable tagging infrastructure.",
                    "Tagtag: material sensing with commodity RFID.",
                    "FaHo: deep learning enhanced holographic localization for RFID tags.",
                    "KinPhy: a kinetic in-band channel for millimetre-wave networks.",
                    "Acoustic anomaly detection system: demo abstract.",
                    "Adaptive AR visual output security using reinforcement learning trained policies: demo abstract.",
                    "An architecture for edge computing over underutilized gateways: demo abstract.",
                    "ARMove: A smartphone augmented reality exergaming system for upper and lower extremities stroke rehabilitation: demo abstract.",
                    "BatteryLab, a distributed power monitoring platform for mobile devices: demo abstract.",
                    "BIGHand - A bilateral, integrated, and gamified handgrip stroke rehabilitation system for independent at-home exercise: demo abstract.",
                    "Detailed recording and emulation of spatio-temporal energy environments with shepherd: demo abstract.",
                    "E-Eye: mmWave nonlinear response for hidden electronic device recognition: demo abstract.",
                    "Edge-assisted collaborative image recognition for augmented reality: demo abstract.",
                    "Enabling battery-less wearable sensors via intra-body power transfer: demo abstract.",
                    "Privacy preserving pregnancy weight gain management: demo abstract.",
                    "Smartphone-based driver license testing: demo abstract.",
                    "Stardust: A deep learning serving system in IoT: demo abstract.",
                    "Two-phase dissemination scheme for CoAP-based firmware-over-the-air update of wireless sensor networks: demo abstract.",
                    "\"Sensing\" the IoT network: Ethical capture of domestic IoT network traffic: poster abstract.",
                    "A neural networks based caching scheme for mobile edge networks: poster abstract.",
                    "A swarm of crop spraying drones solution for optimising safe pesticide usage in arable lands: poster abstract.",
                    "Anomaly detection in surface mount technology process using multi-modal data: poster abstract.",
                    "Caching scheme for internet of vehicles using parked vehicles: poster abstract.",
                    "Conflict detection for smart cities services: poster abstract.",
                    "Enhanced air quality inference with mobile sensing attention mechanism: poster abstract.",
                    "Fine-grained travel time sensing in heterogeneous mobile networks: poster abstract.",
                    "Mobile golf swing tracking using deep learning with data fusion: poster abstract.",
                    "Patient identification using a smart pill-bottle: poster abstract.",
                    "Privacy preserving speech analysis using emotion filtering at the edge: poster abstract.",
                    "Privacy-aware synthesis of sensing data based on learning model at metropolitan scale: poster abstract.",
                    "QoS in software defined IoT network using blockchain based smart contract: poster abstract.",
                    "Reducing synchronization error in wireless sensor nodes by using previous timing information as training data: poster abstract.",
                    "Revealing insights for improvements in LoRaWAN in multiple applications scenarios: poster abstract.",
                    "Side channel attack on smartphone sensors to infer gender of the user: poster abstract.",
                    "System for vehicle selection in drive-by sensing: poster abstract.",
                    "tCharge - A fleet-oriented real-time charging scheduling system for electric taxi fleets: poster abstract.",
                    "Towards wide-area contactless human sensing: poster abstract.",
                    "Two-terminal connectivity in UWSN probabilistic graphs: A polynomial time algorithm: poster abstract.",
                    "Ultrasonic waste monitoring in the future industrial kitchen: poster abstract.",
                    "Understanding air pollution patterns in city based on minute-level event detection: poster abstract.",
                    "Understanding real-time interaction in heterogeneous vehicular sensing: poster abstract.",
                    "Using machine learning to orchestrate cloud resources in a RAN enabled edge environment: poster abstract.",
                    "Vehicular mobility modeling based on heterogeneous sensor networks: poster abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019buildsys",
                "sub_name": "Proceedings of the 6th ACM International Conference on Systems for Energy-Efficient Buildings, Cities, and Transportation, BuildSys 2019, New York, NY, USA, November 13-14, 2019.",
                "count": 71,
                "papers": [
                    "One Size Does Not Fit All: Multi-Scale, Cascaded RNNs for Radar Classification.",
                    "Smart Surface Classification for Accessible Routing through Built Environment: A Crowd-sourced Approach.",
                    "COLTRANE: ConvolutiOnaL TRAjectory NEtwork for Deep Map Inference.",
                    "City Scale Monitoring of On-Street Parking Violations with StreetHAWK.",
                    "Hot or Not: Leveraging Mobile Devices for Ubiquitous Temperature Sensing.",
                    "DUET: Towards a Portable Thermal Comfort Model.",
                    "Heterogeneous Transfer Learning for Thermal Comfort Modeling.",
                    "Skin Temperature Extraction Using Facial Landmark Detection and Thermal Imaging for Comfort Assessment.",
                    "OccuTherm: Occupant Thermal Comfort Inference using Body Shape Information.",
                    "Abstracting Interactions with IoT Devices Towards a Semantic Vision of Smart Spaces.",
                    "RemedioT: Remedial Actions for Internet-of-Things Conflicts.",
                    "Evaluation of Clustering and Time Series Features for Point Type Inference in Smart Building Retrofit.",
                    "Who can Access What, and When?: Understanding Minimal Access Requirements of Building Applications.",
                    "Beyond a House of Sticks: Formalizing Metadata Tags with Brick.",
                    "AIM3S: Autonomous Inventory Monitoring through Multi-Modal Sensing for Cashier-Less Convenience Stores.",
                    "Good to see you again: Capture and recapture method on mobile devices to estimate occupancy profiles.",
                    "Fine-Grained Recognition of Activities of Daily Living through Structural Vibration and Electrical Sensing.",
                    "Electricity Consumption Data Sets: Pitfalls and Opportunities.",
                    "Future Industrial Kitchen: Challenges and Opportunities.",
                    "Urban Transportation System Resilience and Diversity Coupling using Large-scale Taxicab GPS Data.",
                    "Ride the Tide of Traffic Conditions: Opportunistic Driving Improves Energy Efficiency of Timely Truck Transportation.",
                    "Tracking the Evolution of Public Transport Demand using Spatial-Social-Temporal Contexts.",
                    "TripAware: Emotional and Informational Approaches to Encourage Sustainable Transportation via Mobile Applications.",
                    "A Missing Link between Urban Mobility and Wellbeing.",
                    "Sequential Learning with Active Partial Labeling for Building Metadata.",
                    "Towards reproducible state-of-the-art energy disaggregation.",
                    "Learning from Correlated Events for Equipment Relation Inference in Buildings.",
                    "Machine Learning-based Irrigation Control Optimization.",
                    "Comparing Gray Box Methods to Derive Building Properties from Smart Thermostat Data.",
                    "SWaP: Probabilistic Graphical and Deep Learning Models for Water Consumption Prediction.",
                    "GridInSight: Monitoring Electricity Using Visible Lights.",
                    "Building an Online Defect Detection System for Large-scale Photovoltaic Plants.",
                    "Semantic search in household energy consumption segmentation through descriptive characterization.",
                    "Data-Driven Energy and Population Estimation for Real-Time City-Wide Energy Footprinting.",
                    "One for all, All for one: a scalable decision-making framework for demand response with a district cooling plant.",
                    "Building HVAC Scheduling Using Reinforcement Learning via Neural Network Based Model Approximation.",
                    "Development of a clustering-based morning start time estimation algorithm for space heating and cooling.",
                    "Control of Air Free-Cooled Data Centers in Tropics via Deep Reinforcement Learning.",
                    "Gnu-RL: A Precocial Reinforcement Learning Solution for Building HVAC Control Using a Differentiable MPC Policy.",
                    "OCTOPUS: Deep Reinforcement Learning for Holistic Smart Building Control.",
                    "Peak Demand Reduction using Energy Storage System for Demand Response.",
                    "Investigating occupancy profiles using convolutional neural networks.",
                    "Interactive Building Metadata Normalization.",
                    "No Time to Waste, with SWAM!",
                    "Reduced state space and cost function in reinforcement learning for demand response control of multiple EV charging stations.",
                    "The Standby Energy in Smart Homes: Problems, Progress, & Potential.",
                    "A toolkit for low-cost thermal comfort sensing.",
                    "BESOS: a Collaborative Building and Energy Simulation Platform.",
                    "SemIoTic: Bridging the Semantic Gap in IoT Spaces.",
                    "Generative Interior Design using BIM.",
                    "CityLearn v1.0: An OpenAI Gym Environment for Demand Response with Deep Reinforcement Learning.",
                    "A demonstration of reproducible state-of-the-art energy disaggregation using NILMTK.",
                    "Lightweight, Deep RNNs for Radar Classification.",
                    "Coordinated Scheduling of Residential Appliances and Heterogeneous Energy Sources in a Smart Microgrid.",
                    "On Electrical Load Disaggregation using Recurrent Neural Networks.",
                    "Electrical Load Disaggregation using a two-stage deep learning approach.",
                    "Enforcing accountability in Smart built-in IoT environment using MUD.",
                    "Predicting Impact of Cooling Set-Point Change on Demand Reduction in Real-time.",
                    "Solar-TK: A Solar Modeling and Forecasting Toolkit.",
                    "Capturing Regularity of ADL Routines Using Hierarchical Clustering Models.",
                    "An Improved API and User Experience for the Mortar Testbed.",
                    "Measuring Routine Variability of Daily Activities with Image Complexity Metrics.",
                    "Monitoring Electric Grid Reliability Using Satellite Data.",
                    "Towards Adaptive Anomaly Detection in Buildings with Deep Reinforcement Learning.",
                    "Path and Speed Planning Online Platform for Energy-Efficient Timely Truck Transportation.",
                    "Indoor Path Planning and Decentralized Access Control in Commercial Buildings.",
                    "Colloidal Luminaries for Architectural Lighting.",
                    "Exploiting Multiple Receivers for CSI-Based Activity Classification Using A Hybrid CNN-LSTM Model.",
                    "Towards Class-Balancing Human Comfort Datasets with GANs.",
                    "Energy Exchange Model in Routed Energy Distribution Network.",
                    "Autonomous Inventory Monitoring through Multi-Modal Sensing (AIM3S) for Cashier-Less Stores."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019data",
                "sub_name": "Proceedings of the 2nd Workshop on Data Acquisition To Analysis, DATA@SenSys 2019, New York, NY, USA, November 10, 2019.",
                "count": 16,
                "papers": [
                    "Occupancy Sensing and Activity Recognition with Cameras and Wireless Sensors.",
                    "Dataset: Occupancy Detection, Tracking, and Estimation Using a Vertically Mounted Depth Sensor.",
                    "Dataset: User side acquisition of People-Centric Sensing in the Internet-of-Things.",
                    "Dataset: Inferring Thermal Comfort using Body Shape Information Utilizing Depth Sensors.",
                    "Designing a Vehicle Mounted High Resolution Multi-Spectral 3D Scanner: Concept Design.",
                    "Dataset: Horse Movement Data and Analysis of its Potential for Activity Recognition.",
                    "Dataset: LoRa Underground Farm Sensor Network.",
                    "A Signal Quality Assessment Metrics for Vibration-based Human Sensing Data Acquisition.",
                    "Dataset: Indoor Localization with Narrow-band, Ultra-Wideband, and Motion Capture Systems.",
                    "Synchronization between Sensors and Cameras in Movement Data Labeling Frameworks.",
                    "Dataset: An Open Dataset and Collection Tool for BMS Point Labels.",
                    "Dataset: Occupancy Presence and Trajectory Data from an Instrumented Public Building.",
                    "Dataset: Tracing Indoor Solar Harvesting.",
                    "Channel State Information (CSI) analysis for Predictive Maintenance using Convolutional Neural Network (CNN).",
                    "Dataset: Wireless Link Quality Estimation on FlockLab - and Beyond.",
                    "Dataset: Channel state information for different activities, participants and days."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019dfhs",
                "sub_name": "Proceedings of the 1st ACM International Workshop on Device-Free Human Sensing, DFHS@BuildSys 2019, New York, NY, USA, November 10, 2019.",
                "count": 15,
                "papers": [
                    "Unobtrusive Occupancy Detection with FastGRNN on Resource-Constrained BLE Devices.",
                    "Receiver-Side Beamforming to Isolate Channel Perturbations from a Human Target in a Device-Free Setting.",
                    "Pulse Rate Monitoring Using Narrowband Received Signal Strength Measurements.",
                    "Occupancy Visualization towards Activity Recognition.",
                    "Exploiting Multiple Receivers for CSI-Based Activity Classification Using A Hybrid CNN-LSTM Model.",
                    "Non-Line-of-Sight Around the Corner Human Presence Detection Using Commodity WiFi Devices.",
                    "A Computer Vision Framework for Human User Sensing in Public Open Spaces.",
                    "Occupant-detection strategy using footstep-induced floor vibrations.",
                    "Collaborative Channel Estimation in Backscattering Tag-to-Tag Networks.",
                    "Device-free Sleep Stage Recognition through Bed Frame Vibration Sensing.",
                    "Promises of Meta-Learning for Device-Free Human Sensing: Learn to Sense.",
                    "Practical IR-UWB-based Occupant Counting evaluated in Multiple Field Settings.",
                    "A Sensing-Based Framework for Medication Compliance Monitoring.",
                    "Device-free Multiple People Localization through Floor Vibration.",
                    "Is there a relationship between footstep-impact locations and measured signal characteristics?"
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019ml",
                "sub_name": "Proceedings of the 1st Workshop on Machine Learning on Edge in Sensor Systems, SenSys-ML 2019, New York, NY, USA, November 10, 2019.",
                "count": 7,
                "papers": [
                    "Emotion Filtering at the Edge.",
                    "KingFisher: an Industrial Security Framework based on Variational Autoencoders.",
                    "GazeFCW: Filter Collision Warning Triggers by Detecting Driver's Gaze Area.",
                    "Efficient Sparse Processing in Smart Home Applications.",
                    "Embedded Deep Inference in Practice: Case for Model Partitioning.",
                    "Skipping RNN State Updates without Retraining the Original Model.",
                    "Finding Dory in the Crowd: Detecting Social Interactions using Multi-Modal Mobile Sensing."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019ensSYS",
                "sub_name": "Proceedings of the 7th International Workshop on Energy Harvesting & Energy-Neutral Sensing Systems, ENSsys@SenSys 2019, New York, NY, USA, November 10, 2019.",
                "count": 12,
                "papers": [
                    "TinyBird: An Energy Neutral Acoustic Bluetooth-Low-Energy Sensor Node with RF Energy Harvesting.",
                    "Camaroptera: a Batteryless Long-Range Remote Visual Sensing System.",
                    "No Batteries Needed: Providing Physical Context with Energy-Harvesting Beacons.",
                    "Eco: A Hardware-Software Co-Design for In Situ Power Measurement on Low-end IoT Systems.",
                    "A Scalable, Data-driven Approach for Power Estimation of Photovoltaic Devices under Indoor Conditions.",
                    "On the Accuracy of Network Synchronization Using Persistent Hourglass Clocks.",
                    "Low-Power Ultrasonic Wake-Up and Communication through Structural Elements.",
                    "The Internet of Intermittent Things, a Land of Low-Hanging Fruits.",
                    "Towards battery-free LPWAN wearables.",
                    "TEG Data Collection Platform for Wearable Applications.",
                    "DUO: Integration of Dependable Undervolting in Operating Systems.",
                    "Revisiting Time Remanence Clocks for Energy Harvesting Wireless Sensor Nodes."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2019bs",
                "sub_name": "Proceedings of the 2nd Workshop on Blockchain-enabled Networked Sensor Systems, BlockSys@SenSys 2019, New York, NY, USA, November 10, 2019.",
                "count": 5,
                "papers": [
                    "Conceptualizing Blockchain based Energy Market for Self Sustainable Community.",
                    "EngraveChain: Tamper-proof distributed log system.",
                    "An experimental framework for investigating hashgraph algorithm transaction speed.",
                    "Node Criticality Assessment in a Blockchain Network.",
                    "Secure and Effective Implementation of an IOTA Light Node using STM32."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "ACM SenSys 2018",
        "info": "Shenzhen, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2018",
                "sub_name": "Proceedings of the 16th ACM Conference on Embedded Networked Sensor Systems, SenSys 2018, Shenzhen, China, November 4-7, 2018.",
                "count": 87,
                "papers": [
                    "EXIMIUS: A Measurement Framework for Explicit and Implicit Urban Traffic Sensing.",
                    "Automatic Unusual Driving Event Identification for Dependable Self-Driving.",
                    "Sentio: Driver-in-the-Loop Forward Collision Warning Using Multisample Reinforcement Learning.",
                    "InK: Reactive Kernel for Tiny Batteryless Sensors.",
                    "CapBand: Battery-free Successive Capacitance Sensing Wristband for Hand Gesture Recognition.",
                    "E-Eye: Hidden Electronics Recognition through mmWave Nonlinear Effects.",
                    "Hidebehind: Enjoy Voice Input with Voiceprint Unclonability and Anonymity.",
                    "Fall-curve: A novel primitive for IoT Fault Detection and Isolation.",
                    "3D Localization for Sub-Centimeter Sized Devices.",
                    "Accurate 3D Localization for 60 GHz Networks.",
                    "SALMA: UWB-based Single-Anchor Localization System using Multipath Assistance.",
                    "Mixer: Efficient Many-to-All Broadcast in Dynamic Wireless Mesh Networks.",
                    "Passive-ZigBee: Enabling ZigBee Communication in IoT Networks with 1000X+ Less Power Consumption.",
                    "Exploiting WiFi Guard Band for Safeguarded ZigBee.",
                    "ShieldScatter: Improving IoT Security with Backscatter Assistance.",
                    "Fabric as a Sensor: Towards Unobtrusive Sensing of Human Behavior with Triboelectric Textiles.",
                    "UbiTap: Leveraging Acoustic Dispersion for Ubiquitous Touch Interface on Solid Surfaces.",
                    "Continuous Low-Power Ammonia Monitoring Using Long Short-Term Memory Neural Networks.",
                    "EAR: Exploiting Uncontrollable Ambient RF Signals in Heterogeneous Networks for Gesture Recognition.",
                    "CapeVM: A Safe and Fast Virtual Machine for Resource-Constrained Internet-of-Things Devices.",
                    "System Architecture Directions for Post-SoC/32-bit Networked Sensors.",
                    "FastDeepIoT: Towards Understanding and Optimizing Neural Network Execution Time on Mobile and Embedded Devices.",
                    "MARVEL: Enabling Mobile Augmented Reality with Low Energy and Low Latency.",
                    "Automated Sleep Period Estimation in Wearable Multi-sensor Systems.",
                    "Deep Neural Network-based Telco Outdoor Localization.",
                    "WINS: WiFi-Inertial Indoor State Estimation for MAVs.",
                    "Frequent Pattern-based Trajectory Completion.",
                    "Breathing Disorder Detection Using Wearable Electrocardiogram And Oxygen Saturation.",
                    "An efficient CNN model for transportation mode sensing.",
                    "Design Considerations for Low Power Internet Protocols.",
                    "sKey: A Sensing-free Smart Key Handle.",
                    "Learning for Device Pairing in Body Area Networks.",
                    "Locally Differentially Private Participant Recruitment for Mobile Crowdsourcing.",
                    "Energy Efficient LPWAN Decoding via Joint Sparse Approximation.",
                    "HATBED: Hardware Assisted Tracing Testbed for Embedded Networked Sensor Systems.",
                    "Using Deep Learning to Count Garbage Bags.",
                    "Worldwide emerging disease-related information extraction system from news data.",
                    "Autonomous UAV sensor system for searching and locating VHF radio-tagged wildlife.",
                    "Selective Visible Light Communication for Multiple Video Cameras using a Single Light Source.",
                    "Image Compression Task Coordination Mechanism Based on Dynamic Alliance in Mobile Wireless Multimedia Sensor Networks.",
                    "Wearable-based Human-Computer Interaction with LimbMotion.",
                    "DISCO: Ultra-Lightweight Mobility Discovery.",
                    "GazeLabel: A Cost-free Data Labeling System with Public Displays using Eye-tracking.",
                    "Interpreting Contextual Information through User-centric Network Discovery.",
                    "Dynamic Multi-Clock Management for Embedded Systems.",
                    "Vibration-Based Occupant Activity Level Monitoring System.",
                    "Automatic Detection of Minimal Repeated Pattern in Printing Fabric Images.",
                    "IoT for the Power Industry: Recent Advances and Future Directions with Pavatar.",
                    "Safeguarded ZigBee via WiFi Guard Band.",
                    "Real-time Attitude and Motion Tracking for Mobile Device in Moving Vehicle.",
                    "Sensing Emotion from Voice Jitter.",
                    "LPWA-MAC: a Low Power Wide Area network MAC protocol for cyber-physical systems.",
                    "Speech Emotion Recognition via Attention-based DNN from Multi-Task Learning.",
                    "Sleep Position Management System for Enhancing Sleep Quality using Wearable Devices.",
                    "Biometric Gait Identification for Exercise Reward System using Smart Earring.",
                    "Field Deployable Real-Time Indoor Spatial Tracking System for Human Behavior Observations.",
                    "eSense: Open Earable Platform for Human Sensing.",
                    "Aerial Interactions with Wireless Sensors.",
                    "Sensor Identification and Fault Detection in IoT Systems.",
                    "Automatic Face Recognition Adaptation via Ambient Wireless Identifiers.",
                    "CitySense: A Data Collection Approach for City Computing Applications.",
                    "Long Range Retroreflective V2X Communication with Polarization-based Differential Reception.",
                    "Material Identification with Commodity Wi-Fi Devices.",
                    "Toward Automated Acupressure Therapy.",
                    "Bringing Full-Scale TCP to Low-Power Networks.",
                    "Toward Automated Acupressure Therapy.",
                    "Enabling Concurrent IoT Transmissions in Distributed C-RAN.",
                    "Human Activity Recognition Using Motion Sensors.",
                    "ECRT: An Edge Computing System for Real-Time Image-based Object Tracking.",
                    "Multimodal Emotion Recognition by extracting common and modality-specific information.",
                    "SECY APP: Self Configuration and Easy Management for Software Defined Smart Homes.",
                    "Vehicle Air Pollution Monitoring Using IoTs.",
                    "Real-time Occupancy Correction Method for 3D Stereovision Counting Cameras.",
                    "An Energy-driven Wireless Bicycle Trip Counter with Zero Energy Storage.",
                    "DIY Health IoT Apps.",
                    "A Hybrid Air Pollution Reconstruction by Adaptive Interpolation Method.",
                    "Attention-based LSTM-CNNs For Time-series Classification.",
                    "Robust Detection of Motor-Produced Audio Signals.",
                    "AI-Enhanced 3D RF Representation Using Low-Cost mmWave Radar.",
                    "Sensing People's Time Management Behaviors: A Study Using Wearable Devices.",
                    "The Energy Harvesting Mode Abstraction.",
                    "Real-Time Emotion Detection via E-See.",
                    "64Key: A Mesh-based Collaborative Plaform.",
                    "A Smart Ontology-driven IoT Platform.",
                    "Generative Model Based Fine-Grained Air Pollution Inference for Mobile Sensing Systems.",
                    "RF Technologies for Indoor Localization and Positioning.",
                    "Preliminary results on LoRaWAN and IEEE 802.15.4-SUN Interference."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018buildsys",
                "sub_name": "Proceedings of the 5th Conference on Systems for Built Environments, BuildSys 2018, Shenzen, China, November 07-08, 2018.",
                "count": 33,
                "papers": [
                    "Plaster: an integration, benchmark, and development framework for metadata normalization methods.",
                    "Scrabble: transferrable semi-automated semantic metadata normalization using intermediate representation.",
                    "Evaluation of the opportunities and limitations of using IFC models as source of building metadata.",
                    "Trust me, my neighbors say it's raining outside: ensuring data trustworthiness for crowdsourced weather stations.",
                    "Efficient integration of smart appliances for demand response programs.",
                    "Rimor: towards identifying anomalous appliances in buildings.",
                    "Disaggregating solar generation behind individual meters in real time.",
                    "Staring at the sun: a physical black-box solar performance model.",
                    "Helios: a programmable software-defined solar module.",
                    "DeepLane: camera-assisted GPS for driving lane detection.",
                    "Buildings affect mobile patterns: developing a new urban mobility model.",
                    "Virtual energy storage from TCLs using QoS persevering local randomized control.",
                    "The impact of occupancy resolution on the accuracy of building energy performance simulation.",
                    "Enhancing household-level load forecasts using daily load profile clustering.",
                    "Profiling urban activity hubs using transit smart card data.",
                    "Inferring occupant ties: automated inference of occupant network structure in commercial buildings.",
                    "Shopping intent recognition and location prediction from cyber-physical activities via wi-fi logs.",
                    "An early resource characterisation of wi-fi sensing on residential gateways.",
                    "Good set-points make good neighbors: user seating and temperature control in uberized workspaces.",
                    "Practical implementation and evaluation of deep reinforcement learning control for a radiant heating system.",
                    "Smart lighting control using oblivious mobile sensors.",
                    "Pible: battery-free mote for perpetual indoor BLE applications.",
                    "Mortar: an open testbed for portable building analytics.",
                    "Web of things based IoT standard interworking test case: demo abstract.",
                    "Pible: battery-free mote for perpetual indoor BLE applications: demo abstract.",
                    "FloorViz - a bricked dashboard: demo abstract.",
                    "Data-driven occupant modeling strategies and digital tools enabled by IEA EBC annex 79: poster abstract.",
                    "A smart surveillance system using visual sensors: poster abstract.",
                    "Multiple door opening/closing detection and identification system using infrasound sensors: poster abstract.",
                    "A data-driven system for city-scale personal energy footprint estimations: poster abstract.",
                    "Towards developing a large energy store using small scale distributed batteries: poster abstract.",
                    "Reputation system for ensuring data trustworthiness of crowdsourced weather stations: poster abstract.",
                    "A design of data-driven energy-use profiling in residential buildings: poster abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018data",
                "sub_name": "Proceedings of the First Workshop on Data Acquisition To Analysis, DATA@SenSys 2018, Shenzhen, China, November 4, 2018.",
                "count": 14,
                "papers": [
                    "PiMi: two-month indoor/outdoor PM2.5 concentrations along with behavior labels through large-scale participatory sensing.",
                    "One-month beijing taxi GPS trajectory dataset with taxi IDs and vehicle status.",
                    "Occupant-induced office floor vibration dataset for activity level monitoring.",
                    "Seat vibration for heart monitoring in a moving automobile: extended abstract.",
                    "Vehicle sensing data acquisition and analysis.",
                    "Indoor ultra wideband ranging samples from the DecaWave DW1000 including frequency and polarization diversity.",
                    "Room-level occupant counts, airflow and CO2 data from an office building.",
                    "ILOS: a data collection tool and open datasets for fingerprint-based indoor localization.",
                    "A testbed and data yields for studying data center energy efficiency and reliability.",
                    "The big house dataset: desired applications and interactions.",
                    "Dataset: single-anchor indoor localization with decawave DW1000 and directional antennas.",
                    "Set and forget sensing with applets on IFTTT.",
                    "Structural vibration sensing to evaluate animal activity on a pig farm: extended abstract.",
                    "Bluetooth low energy in the wild dataset."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018realwsn",
                "sub_name": "Proceedings of the 7th International Workshop on Real-World Embedded Wireless Systems and Networks, RealWSN@SenSys 2018, Shenzhen, China, November 4, 2018.",
                "count": 9,
                "papers": [
                    "A Feasibility Study on Energy Harvesting from Soil Temperature Differences.",
                    "On Predicting the Battery Lifetime of IoT Devices: Experiences from the SPHERE Deployments.",
                    "Contactless Breathing Rate Monitoring in Vehicle Using UWB Radar.",
                    "Capturing Inhalation Efficiency with Acoustic Sensors in Mobile Phones.",
                    "Beyond Pulse: Can the in-Ear Photoplethysmogram Signal Understand What You Say?",
                    "Escape or Exploit?: A Noise-Modulation-Based Communication Under Harsh Interference.",
                    "LoRa Parameter Choice for Minimal Energy Usage.",
                    "To Monitor or Not: Lessons from Deploying Wireless Sensor Networks in Data Centers.",
                    "DTARP: A Dynamic Traffic Aware Routing Protocol for Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018ensSYS",
                "sub_name": "Proceedings of the 6th International Workshop on Energy Harvesting & Energy-Neutral Sensing Systems, ENSsys@SenSys 2018, Shenzhen, China, November 4, 2018.",
                "count": 7,
                "papers": [
                    "An extensible system simulator for intermittently-powered multiple-peripheral IoT devices.",
                    "Scaling configuration of energy harvesting sensors with reinforcement learning.",
                    "Reconsidering batteries in energy harvesting sensing.",
                    "Enabling intermittent computing on high-performance out-of-order processors.",
                    "Feasibility of multi-tenancy on intermittent power.",
                    "Making sense of intermittent energy harvesting.",
                    "Backing out of backscatter for intermittent wireless networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018BlockSys",
                "sub_name": "Proceedings of the 1st Workshop on Blockchain-enabled Networked Sensor Systems, BlockSys@SenSys 2018, Shenzhen, China, November 4, 2018.",
                "count": 5,
                "papers": [
                    "FAST: A MapReduce Consensus for High Performance Blockchains.",
                    "Distributed Ledger Technology and the Internet of Things: A Feasibility Study.",
                    "BlockPro: Blockchain based Data Provenance and Integrity for Secure IoT Environments.",
                    "Blockchain framework for IoT data quality via edge computing.",
                    "RDV: An Alternative To Proof-of-Work And A Real Decentralized Consensus For Blockchain."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2018CitiFog",
                "sub_name": "Proceedings of the 1st ACM International Workshop on Smart Cities and Fog Computing, CitiFog@SenSys 2018, Shenzhen, China, November 4, 2018.",
                "count": 7,
                "papers": [
                    "A Unified Cross-entropy Based Task Scheduling Algorithm for Heterogeneous Fog Networks.",
                    "Roadside Unit Allocation for Fog-based Information Sharing in Vehicular Networks.",
                    "SSL: Synchronous Self-paced Learning for Internet-of-Things Devices.",
                    "Partitioning of CNN Models for Execution on Fog Devices.",
                    "iOccupancy: An Investigation of Online Occupancy-driven HVAC Control in Campus Classrooms.",
                    "Providing Occupancy as a Service with Databox.",
                    "Internet of Personalized and Autonomous Things (IoPAT): Smart Homes Case Study."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "ACM SenSys 2017",
        "info": "Delft, The Netherlands",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2017",
                "sub_name": "Proceedings of the 15th ACM Conference on Embedded Network Sensor Systems, SenSys 2017, Delft, Netherlands, November 06-08, 2017.",
                "count": 78,
                "papers": [
                    "Network-wide Consensus Utilizing the Capture Effect in Low-power Wireless Networks.",
                    "BLEach: Exploiting the Full Potential of IPv6 over BLE in Constrained Embedded IoT Devices.",
                    "BlueBee: a 10, 000x Faster Cross-Technology Communication via PHY Emulation.",
                    "DeepIoT: Compressing Deep Neural Network Structures for Sensing Systems with a Compressor-Critic Framework.",
                    "DeepASL: Enabling Ubiquitous and Non-Intrusive Word and Sentence-Level Sign Language Translation.",
                    "Monitoring a Person's Heart Rate and Respiratory Rate on a Shared Bed Using Geophones.",
                    "mCerebrum: A Mobile Sensing Software Platform for Development and Validation of Digital Biomarkers and Interventions.",
                    "Glasses for the Third Eye: Improving the Quality of Clinical Data Analysis with Motion Sensor-based Data Filtering.",
                    "Enabling Reliable, Asynchronous, and Bidirectional Communication in Sensor Networks over White Spaces.",
                    "Application-Layer Clock Synchronization for Wearables Using Skin Electric Potentials Induced by Powerline Radiation.",
                    "SmartLight: Light-weight 3D Indoor Localization Using a Single LED Lamp.",
                    "Indoor Localization with Aircraft Signals.",
                    "BatTracker: High Precision Infrastructure-free Mobile Device Tracking in Indoor Environments.",
                    "Non-Intrusive Multi-Modal Estimation of Building Occupancy.",
                    "Calibrating Time-variant, Device-specific Phase Noise for COTS WiFi Devices.",
                    "WiFi-Enabled Smart Human Dynamics Monitoring.",
                    "Timely Execution on Intermittently Powered Batteryless Sensors.",
                    "LoRea: A Backscatter Architecture that Achieves a Long Communication Range.",
                    "Flicker: Rapid Prototyping for the Batteryless Internet-of-Things.",
                    "Exploiting Multi-Cell Battery for Mobile Devices: Design, Management, and Performance.",
                    "The Future of Sensing is Batteryless, Intermittent, and Awesome.",
                    "Proof-Carrying Sensing: Towards Real-World Authentication in Cyber-Physical Systems.",
                    "SWANS: Sensor Wireless Actuator Network in Space.",
                    "Wireless Robotic Materials.",
                    "Ultra-Low Power Gaze Tracking for Virtual Reality.",
                    "PhO2: Smartphone based Blood Oxygen Level Measurement Systems using Near-IR and RED Wave-guided Light.",
                    "LuBan: Low-Cost and In-Situ Droplet Micro-Sensing for Inkjet 3D Printing Quality Assurance.",
                    "Ditio: Trustworthy Auditing of Sensor Activities in Mobile & IoT Devices.",
                    "Secure Sharing of Partially Homomorphic Encrypted IoT Data.",
                    "CamForensics: Understanding Visual Privacy Leaks in the Wild.",
                    "A New Sensor for Gait Analysis: Demonstration of the IEE's Smart Insole.",
                    "Supporting Heterogeneous IoT Traffic using the IEEE 802.11ah Restricted Access Window.",
                    "Enabling En-Route Filtering for End-to-End Encrypted CoAP Messages.",
                    "UWB-based Single-anchor Low-cost Indoor Localization System.",
                    "Decomposing Data Analytics in Fog Networks.",
                    "Packetized-LTE Physical Layer Framework for Coexistence Experiments.",
                    "A Model-based Framework for the Situated Design and Deployment of Wireless Embedded Systems.",
                    "Zebra-RFO: A Spectrum Repository for the Masses.",
                    "An Intuitive Drag and Drop Framework for Wireless Network Experimentation.",
                    "Cross-Technology Communication via PHY-Layer Emulation.",
                    "Niflheim: End-to-End Middleware for Applications Across all Tiers of the IoT.",
                    "A Low-Complexity Eyewear System for Direction-based Augmented Reality Applications.",
                    "Light in the Box: Reproducible Lighting Conditions for Solar-Powered Sensor Nodes.",
                    "Virtual Keyboard for Wearable Wristbands.",
                    "The Tock Embedded Operating System.",
                    "Ultra-Low Power Gaze Tracking for Virtual Reality.",
                    "The Signpost Platform for City-Scale Sensing.",
                    "Indoor Navigation Leveraging Gradient WiFi Signals.",
                    "Using LEDs for Visible Light Communication and as a Wake-up Mechanism in the Internet of Things.",
                    "LoRea: A Backscatter Architecture that Achieves a Long Communication Range.",
                    "Cooperative GPS Localization for Stationless Shared Bikes.",
                    "On the Challenges of Mobile Crowdsensing for Traffic Estimation.",
                    "Standardized Localization Service.",
                    "Judging Dynamic Co-Existence with Smartphone Magnetometer Traces.",
                    "Predicting Blood Glucose Dynamics with Multi-time-series Deep Learning.",
                    "Taming Link-layer Heterogeneity in IoT through Interleaving Multiple Link-Layers over a Single Radio.",
                    "OFDM Visible Light Communication using Off-the-shelf Video Camera.",
                    "Stalwart: a Predictable Reliable Adaptive and Low-latency Real-time Wireless Protocol.",
                    "HeartBeat the Odds: A Novel Digital Ballistocardiographic Sensor System.",
                    "Supply Chain Object Discovery with Semantic-enhanced Blockchain.",
                    "A Versatile Annotated Dataset for Multimodal Locomotion Analytics with Mobile Devices.",
                    "High reliability Android application for multidevice multimodal mobile data acquisition and annotation.",
                    "Enabling dual-band operation with the RPL routing protocol.",
                    "Mitigating Erroneous Wake-ups.",
                    "Resource-Efficient Detection of Elephant Rumbles.",
                    "An Empirical Study of WiFi-based Radio Tomographic Imaging.",
                    "Towards realistic lifetime estimation in battery-powered IoT devices.",
                    "A Machine Learning Approach for Identifying Mosquito Breeding Sites via Drone Images.",
                    "Hierarchical Subchannel Allocation for Mode-3 Vehicle-to-Vehicle Sidelink Communications.",
                    "Towards Self-supervised Face Labeling via Cross-modality Association.",
                    "AquaMote: Ultra Low Power Sensor Tag for Animal Localization and Fine Motion Tracking.",
                    "Real-time and Nearly Ideal Hologram for RFID-based Indoor Localization.",
                    "Delay Effect in Mobile Sensing System for Urban Air Pollution Monitoring.",
                    "Individualized Calibration of Industrial-Grade Gas Sensors in Air Quality Sensing System.",
                    "Augmenting WSNs with Interoperable 802.15.4 Sensor Tags.",
                    "Applications of Energy-Driven and Transient Computing: A Wireless Bicycle Trip Counter.",
                    "Data Hub Architecture for Smart Cities.",
                    "Network Bootstrapping and Leader Election Utilizing the Capture Effect in Low-power Wireless Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017buildsys",
                "sub_name": "Proceedings of the 4th ACM International Conference on Systems for Energy-Efficient Built Environments, BuildSys 2017, Delft, The Netherlands, November 08-09, 2017.",
                "count": 51,
                "papers": [
                    "DA-HOC: semi-supervised domain adaptation for room occupancy prediction using CO2 sensor data.",
                    "Sensetribute: smart home occupant identification via fusion across on-object sensing devices.",
                    "Sonicdoor: scaling person identification with ultrasonic sensors by novel modeling of shape, behavior and walking patterns.",
                    "PAD: protecting anonymity in publishing building related datasets.",
                    "A clustering-based rule-mining approach for monitoring long-term energy use and understanding system behavior.",
                    "ePrints: a real-time and scalable system for fair apportionment and tracking of personal energy footprints in commercial buildings.",
                    "Longitudinal energy waste detection with visualization.",
                    "Customizing indoor wireless coverage via 3D-fabricated reflectors.",
                    "Buildsense: long-term, fine-grained building monitoring with minimal sensor infrastructure.",
                    "Streaming sensor data from dynamically reprogrammable tasks running on mobile devices.",
                    "Design and analysis of a query processor for brick.",
                    "Designing sustainable smart connected communities using dynamic spectrum access via band selection.",
                    "Towards a socially responsible smart city: dynamic resource allocation for smarter community service.",
                    "Autocalib: automatic traffic camera calibration at scale.",
                    "Resilience in urban transportation: towards a participatory sensing-based framework.",
                    "Want to reduce energy consumption?: don't depend on the consumers!",
                    "Predicting success of energy savings interventions and industry type using smart meter and retrofit data from thousands of non-residential buildings.",
                    "Inverting HVAC for energy efficient thermal comfort in populous emerging countries.",
                    "Exploring fairness in participatory thermal comfort control in smart buildings.",
                    "Indoor environmental quality monitoring by autonomous mobile sensing.",
                    "Towards integration of doppler radar sensors into personalized thermoregulation-based control of HVAC.",
                    "Estimation of physical buildings parameters using interval thermostat data.",
                    "Democratizing authority in the built environment.",
                    "Efficient probabilistic model checking of smart building maintenance using fault maintenance trees.",
                    "sTube+: an IoT communication sharing architecture for smart after-sales maintenance in buildings.",
                    "Using simple predictive models to improve control of complex building systems.",
                    "Optimal net-load balancing in smart grids with high PV penetration.",
                    "Enforcing fair grid energy access for controllable distributed solar capacity.",
                    "Incentive design for demand-response based on building constraints: a utility perspective.",
                    "Revisiting selection of residential consumers for demand response programs.",
                    "Autocalib: automatic traffic camera calibration at scale.",
                    "Privacy-preserving building-related data publication using PAD.",
                    "FORK: fine grained occupancy estimatoR using kinect on ARM embedded platforms.",
                    "Design and implementation of a low-cost arduino-based high-frequency AC waveform meter board for the raspberry pi.",
                    "HodDB: a query processor for brick.",
                    "Hamilton: a cost-effective, low power networked sensor for indoor environment monitoring.",
                    "Visualloc: vision based localization using a single smart-bulb.",
                    "Synthetic dataset generation for non-intrusive load monitoring in commercial buildings.",
                    "Occupancy count prediction for model predictive control in buildings.",
                    "Energy disaggregation for identifying anomalous appliance.",
                    "An energy-harvesting facade optimization system for built environments.",
                    "DejaVu: visual diffing of cyber physical systems.",
                    "Energy-related occupant behavior change analysis and building user activity detection: a case study in a hungarian office space.",
                    "Schemas for IoT interoperability for smart cities.",
                    "Integrated building energy management using aquifer thermal energy storage (ATES) in smart thermal grids.",
                    "Scalable architectures for stream analytics and data predictions dedicated to smart spaces.",
                    "Scrabble: converting unstructured metadata into brick for many buildings.",
                    "The heterogeneity of thermal sensitivity of residential electricity load between China and USA.",
                    "COD: a dataset of commercial building occupancy traces.",
                    "Time-aware chiller sequencing control with data-driven chiller performance profiling.",
                    "EMD-DF: a data model and file format for energy disaggregation datasets."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017crowdsensys",
                "sub_name": "Proceedings of the First ACM Workshop on Mobile Crowdsensing Systems and Applications, CrowdSenSys@SenSys 2017, Delft, The Netherlands, November 5, 2017.",
                "count": 12,
                "papers": [
                    "Quantifying Personal Exposure to Spatio-Temporally Distributed Air Pollutants using Mobile Sensors.",
                    "Offloading Surrogates Characterization via Mobile Crowdsensing.",
                    "Accurate and Low-cost Mobile Indoor Localization with 2-D Magnetic Fingerprints.",
                    "Mew: A Plug-n-Play Framework for Task Allocation in Mobile Crowdsensing.",
                    "Design Strategies for Efficient Access to Mobile Device Users via Amazon Mechanical Turk.",
                    "Whom to Query?: Spatially-Blind Participatory Crowdsensing under Budget Constraints.",
                    "Impact of Crowdsourced Data Quality on Travel Pattern Estimation.",
                    "Detecting Location Fraud in Indoor Mobile Crowdsensing.",
                    "Integrity of Data in a Mobile Crowdsensing Campaign: A Case Study.",
                    "SPICE: Secure Proximity-based Infrastructure for Close Encounters.",
                    "A Privacy Preserving Mobile Crowdsensing Architecture for a Smart Farming Application.",
                    "VeriNet: User Verification on Smartwatches via Behavior Biometrics."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017safethings",
                "sub_name": "Proceedings of the 1st ACM Workshop on the Internet of Safe Things, SafeThings@SenSys 2017, Delft, The Netherlands, November 5, 2017.",
                "count": 11,
                "papers": [
                    "Challenges to ensuring human safety throughout the life-cycle of Smart Environments.",
                    "An Architectural Mechanism for Resilient IoT Services.",
                    "A Reference Separation Architecture for Mixed-Criticality Medical and IoT Devices.",
                    "Adaptable End-To-End Security For Mobile IoT Sensing Applications.",
                    "Privacy of Personal Things in Active Learning Spaces Need Individually Evolved Requirements.",
                    "Simultaneous Measurement and Correlation of PPG Signals Taken from Two Different Body Parts for Enhanced Biometric Security via Two-level Authentication.",
                    "EchoSafe: Sonar-based Verifiable Interaction with Intelligent Digital Agents.",
                    "Runtime Monitoring of Safety and Performance Requirements in Smart Cities.",
                    "Continuous Verification for Cryptographic Protocol Development.",
                    "Towards a Thing-In-the-Loop approach for the Verification and Validation of IoT systems.",
                    "Exploiting Submodularity in Security Measure Allocation for Industrial Control Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017failsafe",
                "sub_name": "Proceedings of the First ACM International Workshop on the Engineering of Reliable, Robust, and Secure Embedded Wireless Sensing Systems, FAILSAFE@SenSys 2017, Delft, Netherlands, November 5, 2017.",
                "count": 9,
                "papers": [
                    "Accurate Sensor Traffic Estimation for Station Grouping in Highly Dense IEEE 802.11ah Networks.",
                    "Tackling malfunctions caused by Radio Duty Cycling protocols that do not appear in simulation studies.",
                    "MCGC: A Network Coding Approach for Reliable Large-scale Wireless Networks.",
                    "Tales from the C130 Horror Room: A Wireless Sensor Network Story in a Data Center.",
                    "Issues of using wireless sensor network to monitor urban air quality.",
                    "Understanding packet loss for sound monitoring in a smart stadium IoT testbed.",
                    "Relative Localisation Algorithm for Neighbour Classification in Ad Hoc Networks of Moving Robots.",
                    "On the Experiences with Testbeds and Applications in Precision Farming.",
                    "Tales from the Wild: Lessons Learned from Creating a Living Lab."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017ensSYS",
                "sub_name": "Proceedings of the Fifth ACM International Workshop on Energy Harvesting and Energy-Neutral Sensing Systems, ENSsys@SenSys 2017, Delft, Netherlands, November 5, 2017.",
                "count": 10,
                "papers": [
                    "Applications of Energy-Driven Computing: A Transiently-Powered Wireless Cycle Computer.",
                    "Light Insight: Emulation of Radiation Traces for Analysis and Evaluation of Solar-Harvesting Algorithms.",
                    "Can WiFi Beamforming Support an Energy-Harvesting Wearable?",
                    "Reap What You Store: Side-channel Resilient Computing Through Energy Harvesting.",
                    "Energy Isolation Required for Multi-tenant Energy Harvesting Platforms.",
                    "Using Sleep States to Maximize the Active Time of Transient Computing Systems.",
                    "A Generic Middleware for External Peripheral State Retention in Transiently-Powered Sensor Systems.",
                    "Opportunities and challenges for energy harvesting sensor systems for harsh environments.",
                    "Energy Gatekeeper Architecture for Enabling Rapid Development of Energy-Harvesting Internet of Things.",
                    "Autonomous power meter with adaptive processing."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2017humansys",
                "sub_name": "Proceedings of the First International Workshop on Human-centered Sensing, Networking, and Systems, HumanSys@SenSys 2017, Delft, Netherlands, November 5, 2017.",
                "count": 10,
                "papers": [
                    "Privacy-Preserving Behavioral Authentication on Smartphones.",
                    "Privacy preserving data management in recruiting participants for digital clinical trials.",
                    "Privacy-Preserving Location-Based Services by using Intel SGX.",
                    "C2P: An Unobtrusive Smartwatch-Based Platform for Automatic Background Monitoring of Fatigue.",
                    "Design and Evaluation of a Person-Centric Heart Monitoring System over Fog Computing Infrastructure.",
                    "Novel Statistical Post Processing to Improve Blood Pressure Estimation from Smartphone Photoplethysmogram.",
                    "Personalized Medicine in the Wearable Era: Translational Barriers and Call to Action.",
                    "Spee-Navi: An Indoor Navigation System via Speech Crowdsourcing.",
                    "Smartphone-based Qualitative Analyses of Social Activities During Family Time.",
                    "CAMDroid: An Adaptation Framework for Android Context-Aware Multitasking."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "ACM SenSys 2016",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2016",
                "sub_name": "Proceedings of the 14th ACM Conference on Embedded Network Sensor Systems, SenSys 2016, Stanford, CA, USA, November 14-16, 2016.",
                "count": 69,
                "papers": [
                    "AoT: Authentication and Access Control for the Entire IoT Device Life-Cycle.",
                    "Robust, low-cost, auditable random number generation for embedded system security.",
                    "Secret from Muscle: Enabling Secure Pairing with Electromyography.",
                    "From Physical to Cyber: Escalating Protection for Personalized Auto Insurance.",
                    "Staffetta: Smart Duty-Cycling for Opportunistic Data Collection.",
                    "Effectively Capturing Attention Using the Capture Effect.",
                    "Data Prediction + Synchronous Transmissions = Ultra-low Power Wireless Sensor Networks.",
                    "Empirical Validation of Commodity Spectrum Monitoring.",
                    "Battery-Free Identification Token for Touch Sensing Devices.",
                    "Nutrilyzer: A Mobile System for Characterizing Liquid Food with Photoacoustic Effect.",
                    "SurePoint: Exploiting Ultra Wideband Flooding and Diversity to Provide Robust, Scalable, High-Fidelity Indoor Localization.",
                    "Tackling the Redundancy and Sparsity in Crowd Sensing Applications.",
                    "Deep Learning for RFID-Based Activity Recognition.",
                    "Sparsification and Separation of Deep Learning Layers for Constrained Resource Inference on Wearables.",
                    "Monoxalyze: Verifying Smoking Cessation with a Keychain-sized Carbon Monoxide Breathalyzer.",
                    "Toothbrushing Monitoring using Wrist Watch.",
                    "Amulet: An Energy-Efficient, Multi-Application Wearable Platform.",
                    "A Lightweight and Inexpensive In-ear Sensing System For Automatic Whole-night Sleep Stage Monitoring.",
                    "B2W2: N-Way Concurrent Communication for IoT Devices.",
                    "HitchHike: Practical Backscatter Using Commodity WiFi.",
                    "SNOW: Sensor Network over White Spaces.",
                    "CScrypt: A Compressive-Sensing-Based Encryption Engine for the Internet of Things: Demo Abstract.",
                    "RocketLogger: Mobile Power Logger for Prototyping IoT Devices: Demo Abstract.",
                    "The Amulet Wearable Platform: Demo Abstract.",
                    "Propagation-Aware Time Synchronization for Indoor Applications: Demo Abstract.",
                    "Shake meter: An Autonomous Vibration Measurement System using Optical Strobing: Demo Abstract.",
                    "Human Mobility Profiling Using Privacy-Friendly Wi-Fi and Activity Traces: Demo Abstract.",
                    "Gondola: a Parametric Robot Infrastructure for Repeatable Mobile Experiments: Demo Abstract.",
                    "A Platform Enabling Local Oscillator Frequency Synchronization: Demo Abstract.",
                    "3S: Sensing Sensor Signal: Demo Abstract.",
                    "Visible Light Localization Using Incumbent Light Fixtures: Demo Abstract.",
                    "Utilizing IP-over-NFC for Secure Data Transmissions: Demo Abstract.",
                    "Talos a Platform for Processing Encrypted IoT Data: Demo Abstract.",
                    "FindIt: Real-time Through-Wall Human Motion Detection Using Narrow Band SDR: Demo Abstract.",
                    "Power-Aware Neighbor Discovery for Energy Harvesting Things: Demo Abstract.",
                    "Rebooting the Embedded System: Demo Abstract.",
                    "Telepresence Robot with Autonomous Navigation and Virtual Reality: Demo Abstract.",
                    "SurePoint: Exploiting Ultra Wideband Flooding and Diversity to Provide Robust, Scalable, High-Fidelity Indoor Localization: Demo Abstract.",
                    "The Signpost Network: Demo Abstract.",
                    "Occupancy and Activity Monitoring with Doppler Sensing and Edge Analytics: Demo Abstract.",
                    "Collaborative Localization and Navigation in Heterogeneous UAV swarms: Demo Abstract.",
                    "Software-defined Wireless Charging of Internet of Things using Distributed Beamforming: Demo Abstract.",
                    "Observability-driven Sensor Deployment in Smart Academic Environments: Demo Abstract.",
                    "SEUS: A Wearable Multi-Channel Acoustic Headset Platform to Improve Pedestrian Safety: Demo Abstract.",
                    "A Benchmark for Low-power Wireless Networking: Poster Abstract.",
                    "Transmission Power Control in IPv6 Routing Protocol for Low-Power Wireless Network: Poster Abstract.",
                    "HAP: Fine-Grained Dynamic Air Pollution Map Reconstruction by Hybrid Adaptive Particle Filter: Poster Abstract.",
                    "Aerial Drones with Ears: Poster Abstract.",
                    "Energy Efficient GPS Acquisition with Sparse-GPS+: Poster Abstract.",
                    "Emotion Analysis from Context Understanding: Poster Abstract.",
                    "Enabling a New Resource for WSN Radio Tomographic Imaging: LQI in Transitional Links: Poster Abstract.",
                    "Side Channel Communication over Wireless Traffic: A CTC Design: Poster Abstract.",
                    "LifeMaps: An Automated Diary System Based on the Structure of Lives: Poster Abstract.",
                    "Incremental Checkpointing for Interruptible Computations: Poster Abstract.",
                    "M2FED: Monitoring and Modeling Family Eating Dynamics: Poster Abstract.",
                    "Toward Robust Concurrent Transmission for sub-GHz Non-DSSS Communication: Poster Abstract.",
                    "Beating the Beat: RSSI-Based Packet Combining in Concurrent Transmission Sensor Networks: Poster Abstract.",
                    "WiTraffic: Non-intrusive Vehicle Classification Using WiFi: Poster Abstract.",
                    "All-to-all Communication in Multi-hop Wireless Networks with Mixer: Poster Abstract.",
                    "Deploying a 6LoWPAN, CoAP, low power, wireless sensor network: Poster Abstract.",
                    "USN: an Extremely Large Sensor Network based on Urban Infrastructures for Smart Cities: Poster Abstract.",
                    "Multiple Pedestrian Tracking through Ambient Structural Vibration Sensing: Poster Abstract.",
                    "Towards a Heterogeneous Internet-of-Things Testbed via Mesh inside a Mesh: Poster Abstract.",
                    "dBHound: Privacy Sensitive Acoustic Perception in Home Settings: Poster Abstract.",
                    "Constructing a Bio-Signal Repository from an Intensive Care Unit for Effective Big-data Analysis: Poster Abstract.",
                    "An Indirect Traffic Monitoring Approach Using Building Vibration Sensing System: Poster Abstract.",
                    "Gotcha II: Deployment of a Vehicle-based Environmental Sensing System: Poster Abstract.",
                    "Non-intrusive Occupant Localization Using Floor Vibrations in Dispersive Structure: Poster Abstract.",
                    "Accurately Measuring Heart Rate Using Smart Watch: Poster Abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2016buildsys",
                "sub_name": "Proceedings of the 3rd ACM International Conference on Systems for Energy-Efficient Built Environments, BuildSys@SenSys 2016, Palo Alto, CA, USA, November 16-17, 2016.",
                "count": 49,
                "papers": [
                    "Nonintrusive Occupant Identification by Sensing Body Shape and Movement.",
                    "BOLT: Energy Disaggregation by Online Binary Matrix Factorization of Current Waveforms.",
                    "Non-Intrusive Techniques for Establishing Occupancy Related Energy Savings in Commercial Buildings.",
                    "Robust Anomaly Detection for Large-Scale Sensor Data.",
                    "Brick: Towards a Unified Metadata Schema For Buildings.",
                    "Analyzing Energy Usage on a City-scale using Utility Smart Meters.",
                    "Hypertemporal Imaging of NYC Grid Dynamics: Short paper.",
                    "MotionSync: Personal Energy Analytics through Motion Tags and Wearable Sensing.",
                    "The SPOT* Personal Thermal Comfort System.",
                    "SunSpot: Exposing the Location of Anonymous Solar-powered Homes.",
                    "Can computers visually quantify human thermal comfort?: Short Paper.",
                    "Optimized Risk-Aware Nomination Strategy in Demand Response Markets.",
                    "Data Predictive Control for Peak Power Reduction.",
                    "Frequency Regulation Services from Connected Residential Devices: Short Paper.",
                    "SPOCK: A Sensor Value Prediction and Online Control Algorithm for Building Resource Management.",
                    "Systematically Debugging IoT Control System Correctness for Building Automation.",
                    "Manual Shade Control Simulation, Algorithm and Impact: Short Paper.",
                    "PLCount: A Probabilistic Fusion Algorithm for Accurately Estimating Occupancy from 3D Camera Counts.",
                    "AURES: A Wide-Band Ultrasonic Occupancy Sensing Platform.",
                    "WalkSense: Classifying Home Occupancy States Using Walkway Sensing.",
                    "Channel State Information Based Human Presence Detection using Non-linear Techniques.",
                    "Data mining-based localisation of spatial low-resolution sensors in commercial buildings.",
                    "Observability: A Principled Approach to Provisioning Sensors in Buildings.",
                    "Indoor Air Quality Assessments of Diverse Buildings in an Energy Conservation District from a Life Cycle Assessment Lens: Short Paper.",
                    "A Virtual Testbed for Net Zero Energy Communities: Demo Abstract.",
                    "Acoustic Signal Processing for Anomaly Detection in Machine Room Environments: Demo Abstract.",
                    "Demonstrating OccuRE: an Occupancy REasoning Platform for Occupancy-driven Applications: Demo Abstract.",
                    "Swarm Gateway: Demo Abstract.",
                    "Portable Queries Using the Brick Schema for Building Applications: Demo Abstract.",
                    "Data-driven Comfort Models for User-centric Predictive Control in Smart Buildings: Poster Abstract.",
                    "Development of a Hardware-in-the-loop Framework with Modelica for Energy Efficient Buildings: Poster Abstract.",
                    "Preliminary Exploration of Virtual-Storage-Based Load Management: Poster Abstract.",
                    "Project Tidy: Ranking Time Series for Smart Energy Systems: Poster Abstract.",
                    "Predicting Occupancy Presence in Multiple Resolutions for Commercial Buildings: Poster Abstract.",
                    "Disaggregated Forecasting for Large Office Buildings: Poster Abstract.",
                    "Clustering and Visualisation of Electricity Data to identify Demand Response Opportunities: Poster Abstract.",
                    "A Practical Model for Human-Smart Appliances Interaction: Poster Abstract.",
                    "Bridge structural monitoring through a vibration energy harvesting wireless sensor network: Poster Abstract.",
                    "A data-driven design framework for urban slum housing: Case of Mumbai: Poster Abstract.",
                    "Towards City-Scale Building Energy Performance Benchmarking: Poster Abstract.",
                    "Homeowner Preference Elicitation: A Multi-Method Comparison: Poster Abstract.",
                    "Data Predictive Control for Building Energy Management: Poster Abstract.",
                    "Adaptive and Personalized Energy Saving Suggestions for Occupants in Smart Buildings: Poster Abstract.",
                    "Mining Device Data to Auto-commission Buildings: Poster Abstract.",
                    "Delivering Group-based Feedback of Electricity Usage in Campus Dorms: Poster Abstract.",
                    "Prototype system for a ultra long distance via sensor network MAD-SS balloon transmitter: Poster Abstract.",
                    "SmartImpute: Missing Data Analytics for Smart Spaces: Poster Abstract.",
                    "LastStep: Vision-based Bus Stop Localization and Mapping for Improving Accessibility for Blind Riders: Poster Abstract.",
                    "Estimating Behind-the-meter Solar Generation with Existing Measurement Infrastructure: Poster Abstract."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "ACM SenSys 2015",
        "info": "Seoul, South Korea",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2015",
                "sub_name": "Proceedings of the 13th ACM Conference on Embedded Networked Sensor Systems, SenSys 2015, Seoul, South Korea, November 1-4, 2015.",
                "count": 95,
                "papers": [
                    "Self-Driving Vehicles: The Challenges and Opportunities Ahead.",
                    "From Smart Sensors to Smarter Solutions with Physical Analytics.",
                    "Tragedy of the Coulombs: Federating Energy Storage for Tiny, Intermittently-Powered Sensors.",
                    "PowerBlade: A Low-Profile, True-Power, Plug-Through Energy Meter.",
                    "PowerForecaster: Predicting Smartphone Power Impact of Continuous Sensing Applications at Pre-installation Time.",
                    "Zippy: On-Demand Network Flooding.",
                    "Rise of the Indoor Crowd: Reconstruction of Building Interior View via Mobile Crowdsourcing.",
                    "ALPS: A Bluetooth and Ultrasound Platform for Mapping and Localization.",
                    "iMoon: Using Smartphones for Image-based Indoor Navigation.",
                    "VeTrack: Real Time Vehicle Tracking in Uninstrumented Indoor Environments.",
                    "ShopMiner: Mining Customer Shopping Behavior in Physical Clothing Stores with COTS RFID Devices.",
                    "Smart Devices are Different: Assessing and MitigatingMobile Sensing Heterogeneities for Activity Recognition.",
                    "FEMO: A Platform for Free-weight Exercise Monitoring with RFIDs.",
                    "Glimpse: Continuous, Real-Time Object Recognition on Mobile Devices.",
                    "Truth Discovery on Crowd Sensing of Correlated Entities.",
                    "Cloud-Enabled Privacy-Preserving Truth Discovery in Crowd Sensing Systems.",
                    "Talos: Encrypted Query Processing for the Internet of Things.",
                    "SpinLight: A High Accuracy and Robust Light Positioning System for Indoor Applications.",
                    "Contour-based Trilateration for Indoor Fingerprinting Localization.",
                    "Accurate Positioning via Cross-Modality Training.",
                    "CARLOC: Precise Positioning of Automobiles.",
                    "Bolt: A Stateful Processor Interconnect.",
                    "MarketNet: An Asymmetric Transmission Power-based Wireless System for Managing e-Price Tags in Markets.",
                    "DrunkWalk: Collaborative and Adaptive Planning for Navigation of Micro-Aerial Sensor Swarms.",
                    "Sensing Ambient Light for User Experience-Oriented Color Scheme Adaptation on Smartphone Displays.",
                    "cETX: Incorporating Spatiotemporal Correlation for Better Wireless Networking.",
                    "Orchestra: Robust Mesh Networks Through Autonomously Scheduled TSCH.",
                    "Directional Transmissions and Receptions for High-throughput Bulk Forwarding in Wireless Sensor Networks.",
                    "When Pipelines Meet Fountain: Fast Data Dissemination in Wireless Sensor Networks.",
                    "Poster: Robust and Efficient Sensor-assisted Face Recognition System on Smart Glass.",
                    "Poster: Shonabondhu: A Sensing Middleware to Handle Flash Flood.",
                    "Poster: Exact All-terminal Reliability Analysis of Bounded-degree Networks with Tutte Polynomials.",
                    "Poster: Accurate Vehicle Detection in Intelligent Transportation Systems (ITS) using Wireless Magnetic Sensors.",
                    "Poster: Power Spectrum Analysis of Reflected Waves with Ultrasonic Sensors Indicates \"What the Target is\".",
                    "Poster: An Online Approach for Gait Recognition on Smart Glasses.",
                    "Poster: L3: Vehicle Lane-Level Localization on Highways Using Smartphones.",
                    "Poster: Asynchronous Acoustic Localization using Commercial Devices.",
                    "Poster: ParkGauge: Gauging the Congestion Level of Parking Garages with Crowdsensed Parking Characteristics.",
                    "Poster: Non-invasive Human Activity Monitoring using a Low-cost Doppler Sensor and an RF Link.",
                    "Poster: A Medium Access Control Protocol for Full-duplex Wireless Information and Power Transfer.",
                    "Poster: Maximizing Renewable Energy Usage in Buildings using Smart Energy Switching Platform.",
                    "Poster: A Dynamically Switchable Scheduling System in Wireless Sensor Networks.",
                    "Poster: Solar-Powered Adaptive Street Lighting Evaluated with Real Traffic and Sunlight Data.",
                    "Poster: Enspect: Simplifying the Design of Energy Harvesting Systems.",
                    "Poster: MICO: Model-Based Irrigation Control Optimization.",
                    "Poster: CARLOC: Precisely Tracking Automobile Position.",
                    "Poster: A Low-Power Sensing Method Using Linux Kernel on Android Devices.",
                    "Poster: An Indoor-Outdoor Navigation Service for Subway Transportation Systems.",
                    "Poster: Data-Centric Task Scheduling for Battleship Island Monitoring.",
                    "Poster: Fair Scheduling for Energy Harvesting WSN in Smart City.",
                    "Poster: Coordination of Wireless Sensor Networks using Visible Light.",
                    "Poster: Exploring the Need for Sensor Learning and Collaboration in IoT-based Parking Systems.",
                    "Poster: Toward Efficient and Secure Code Dissemination Protocol for the Internet of Things.",
                    "Poster: CountryRoads: Large-Scale Nationwide Ridesharing System.",
                    "Poster: Were You in the Cafe Yesterday?: Location Proof Generation & Verification for Mobile Users.",
                    "Poster: Context-aware Adaptation Mechanism for Smart Resources.",
                    "Poster: Drone Can Find Lost Smartphones.",
                    "Poster: Communicating \"in the Air\": Studying the Impact of UAVs on Sensor Network Data Collection.",
                    "Poster: Model Predictive Control with Real-time Occupancy Detection.",
                    "Poster: Towards Robust Reprogramming for Wireless Sensors.",
                    "Poster: Energy Optimization Framework in Wireless Sensor Network.",
                    "Poster: Cross-Layer Optimization for Low-power Wireless Coexistence.",
                    "Demo: KAIHUI: Towards Quantifying Activeness of Meeting Using Smartphones.",
                    "Demo: A Hardware Platform for Separating Energy Concerns in Tiny, Intermittently-Powered Sensors.",
                    "Demo: iMoon: Using Smartphones for Image-based Indoor Navigation.",
                    "Demo: AsthmaGuide: An Ecosystem for Asthma Monitoring and Advice.",
                    "Demo: A Connection Oriented Mesh Network for Mobile Devices using Bluetooth Low Energy.",
                    "Demo: A Smart Framework for IoT Analytic Workflow Development.",
                    "Demo: Scalable Visual Codes for Embedding Digital Data in the Physical World.",
                    "Demo: KinVocal: Detecting Agitated Vocal Events.",
                    "Demo: Building Reliable Wireless Embedded Platforms using the Bolt Processor Interconnect.",
                    "Demo: PowerBlade A Low-Profile, True-Power, Plug-Through Energy Meter.",
                    "Demo: Bringing Down Wires in Vehicles: Interconnecting ECUs using Wireless Connectivity.",
                    "Demo: RPL over Bluetooth Low Energy.",
                    "Demo: IAS: Information Analytics for Sensors.",
                    "Demo: Towards Recognition of Rich Non-Negative Emotions Using Daily Wearable Devices.",
                    "Demo: Towards Global Interworking of IoT Systems - oneM2M Interworking Proxy Entities.",
                    "Demo: Choco - A Versatile Communication Protocol in Wireless Sensor Networks.",
                    "Demo: Real-time Detection for Multiple Occupancy and Near Real-time Hogging Detection.",
                    "Demo: Distributed MaxRS in Wireless Sensor Networks.",
                    "Demo: Browsing the Web of Things with Summon.",
                    "Demo: PolyPoint: High-Precision Indoor Localization with UWB.",
                    "Demo: Michigan's IoT Toolkit.",
                    "Demo: Glimpse - Continuous, Real-Time Object Recognition on Mobile Devices.",
                    "Demo: Tethys - An Energy Harvesting Networked Water Flow Sensor.",
                    "Demo: ALPS - The Acoustic Location Processing System.",
                    "Demo: User Support for Power Management of Continuous Sensing Applications.",
                    "Demo: Posture Correction Using Smartphone-Based Relational Intervention Model.",
                    "Sophisticated Sensing on Transient Power.",
                    "Secure and Efficient Management Architecture for the Internet of Things.",
                    "Non Intrusive Load Monitoring: Systems, Metrics and Use Cases.",
                    "Tackling Self Interference, Cross-Technology Interference and Channel Fading in Wireless Sensor Networks.",
                    "Mobile Applications Based on Smart Wearable Devices.",
                    "ENSsys 2015: 3rd International Workshop on Energy Harvesting and Energy Neutral Sensing Systems.",
                    "SenSys 2015 Proceedings Workshop Summary Abstract / IoT-App'15: The 2015 International Workshop on Internet of Things towards Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2015csar",
                "sub_name": "Proceedings of the 1st Workshop on Context Sensing and Activity Recognition, CSAR 2015, Seoul, South Korea, November 1, 2015.",
                "count": 10,
                "papers": [
                    "The Design and Implementation of A Cost-effective RFID Indoor Localization System.",
                    "FM-based Device-Free Localization and Activity Recognition via Sparse Representation.",
                    "Prevent CSI Spoofing in Uplink MU-MIMO Transmission.",
                    "Invisible Cloak Fails: CSI-based Passive Human Detection.",
                    "The UbiDCC Data Set: Collecting Wi-Fi and Bluetooth Scans During a Large-scale Conference.",
                    "Device-free Human Activity Recognition using CSI.",
                    "Context Sensing and Feature Discovery for Improving Classifications.",
                    "Doppler Effect based Moving Target Detection Adaptive to Speed.",
                    "An Efficient Variable Dimension PSO Algorithm for Mobile Node Tour Planning in WSN.",
                    "SenSys: A Sensor Data Sharing System for Smart Devices using Bluetooth Low Energy."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2015enssys",
                "sub_name": "Proceedings of the 3rd International Workshop on Energy Harvesting & Energy Neutral Sensing Systems, ENSsys 2015, Seoul, South Korea, November 1, 2015.",
                "count": 9,
                "papers": [
                    "Batteries Not Included: Moving Toward Long-Term Sustainable Sensing.",
                    "Approaches to Transient Computing for Energy Harvesting Systems: A Quantitative Evaluation.",
                    "Delay Tolerant Routing Protocols for Energy-Neutral Animal Tracking.",
                    "Photovoltaic Cells for Micro-Scale Wireless Sensor Nodes: Measurement and Modeling to Assist System Design.",
                    "ASIM: Solar Energy Availability Model for Wireless Sensor Networks.",
                    "Enspect: A Complete Tool using Modeling and Real Data to Assist the Design of Energy Harvesting Systems.",
                    "An Energy-Efficient Transmission Strategy in Integrated HAP/Satellite Wireless Sensor Networks.",
                    "Accurate Indoor localization with Channel State Information.",
                    "Low-cost Device-Free Localization using Detection Probability Model in Outdoors."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2015iotapp",
                "sub_name": "Proceedings of the 2015 International Workshop on Internet of Things towards Applications, IoT-App 2015, Seoul, South Korea, November 1, 2015.",
                "count": 6,
                "papers": [
                    "Ravel: Programming IoT Applications as Distributed Models, Views, and Controllers.",
                    "An Early Resource Characterization of Deep Learning on Wearables, Smartphones and Internet-of-Things Devices.",
                    "Multi Criteria assisted Context aware Vertical Hand-over for Seamless Health-care services in Smart City.",
                    "Urban Sensing and Smart Home Energy Optimisations: A Machine Learning Approach.",
                    "The Haunted House: Networking Smart Homes to Enable Casual Long-Distance Social Interactions.",
                    "Real-time Detection Of Seat Occupancy & Hogging."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2015realwsn",
                "sub_name": "Proceedings of the 6th ACM Workshop on Real World Wireless Sensor Networks, RealWSN 2015, Seoul, South Korea, November 1, 2015.",
                "count": 10,
                "papers": [
                    "Real-world Drone Sensor Networks: A Multi-disciplinary Challenge.",
                    "Paint it Black: Increase WSN Energy Efficiency with the Right Housing.",
                    "Optimising Low Power Dual Prediction Systems.",
                    "IEEE 802.15.4 Channel Diversity in an Outdoor Environment.",
                    "An Architectural Concept for Sensor Cloud QoSaaS Testbed.",
                    "Minimising the Entry Effort in Experimenting with WSN Testbeds to Perform Heterogeneous Research.",
                    "Listening to the Giants: Using Elephant Infra-Sound to Solve the Human-Elephant Conflict.",
                    "Monitoring A Large Construction Site Using Wireless Sensor Networks.",
                    "SenseFlow: An Experimental Study of People Tracking.",
                    "Panel: Student Competitions to Motivate Research in Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2015buildsys",
                "sub_name": "Proceedings of the 2nd ACM International Conference on Embedded Systems for Energy-Efficient Built Environments, BuildSys 2015, Seoul, South Korea, November 4-5, 2015.",
                "count": 39,
                "papers": [
                    "From Smart Sensors to Smarter Solutions with Physical Analytics.",
                    "Automated Metadata Construction to Support Portable Building Applications.",
                    "Zodiac: Organizing Large Deployment of Sensors to Create Reusable Applications for Buildings.",
                    "A Data-driven Meta-data Inference Framework for Building Automation Systems.",
                    "Short Paper: Analyzing Metadata Schemas for Buildings: The Good, the Bad, and the Ugly.",
                    "Multi-User Energy Consumption Monitoring and Anomaly Detection with Partial Context Information.",
                    "LocED: Location-aware Energy Disaggregation Framework.",
                    "Neural NILM: Deep Neural Networks Applied to Energy Disaggregation.",
                    "From Pressure to Path: Barometer-based Vehicle Tracking.",
                    "Water or Slime?: A Platform for Automating Water Treatment Systems.",
                    "Energy Efficiency Gains in Daily Grass Heating Operation of Sports Facilities through Supervisory Holistic Control.",
                    "Short Paper: Microgrid Losses: When the Whole is Greater Than the Sum of Its Parts.",
                    "Demo Abstract: The Immersive Reality of Building Data.",
                    "Demo Abstract: Human-in-the-loop BMS Point Matching and Metadata Labeling with Babel.",
                    "Poster Abstract: Intuitive Appliance Identification using Image Matching in Smart Buildings.",
                    "Poster Abstract: Controlling Actuation in Central HVAC Systems in Buildings.",
                    "Poster Abstract: Analytics Driven Operational Efficiency in HVAC Systems.",
                    "Poster Abstract: MapSentinel: Map-Aided Non-intrusive Indoor Tracking in Sensor-Rich Environments.",
                    "Poster Abstract: A Data-Driven Demand Response Recommender System.",
                    "Poster Abstract: Improving Occupancy Presence Prediction via Multi-Label Classification.",
                    "Poster Abstract: Learning Individual Preferences for Energy-Efficiency and Comfortable Living.",
                    "Poster Abstract: Contextual Air Conditioning Disaggregation with Probabilistic Soft Logic.",
                    "Poster Abstract: XBOS: An Extensible Building Operating System.",
                    "Poster Abstract: Well-Connected Microzones for Increased Building Efficiency and Occupant Comfort.",
                    "The Building Adapter: Towards Quickly Applying Building Analytics at Scale.",
                    "Short Paper: A Method for Discovering Functional Relationships Between Air Handling Units and Variable-Air-Volume Boxes From Sensor Data.",
                    "Sometimes, Money Does Grow On Trees: Data-Driven Demand Response with DR-Advisor.",
                    "An Efficient Approach to Fault Identification in Urban Water Networks Using Multi-Level Sensing.",
                    "Centralized Management of HVAC Energy in Large Multi-AHU Zones.",
                    "A Contract-based Framework for Integrated Demand Response Management in Smart Grids.",
                    "Cross-Space Building Occupancy Modeling by Contextual Information Based Learning.",
                    "Short Paper: Data Driven Pre-cooling for Peak Demand Reduction in Commercial Buildings.",
                    "If You Measure It, Can You Improve It?: Exploring The Value of Energy Disaggregation.",
                    "ThermoCoach: Reducing Home Energy Consumption with Personalized Thermostat Recommendations.",
                    "iProgram: Inferring Smart Schedules for Dumb Thermostats.",
                    "Short Paper: Comparing Energy Feedback Techniques for Dormitory Students in India.",
                    "Detecting Anomalies in Activities of Daily Living of Elderly Residents via Energy Disaggregation and Cox Processes.",
                    "A Multidimensional Continuous Contextual Lighting Control System Using Google Glass.",
                    "Short Paper: : The Smart Conference Room: An Integrated System Testbed for Efficient, Occupancy-Aware Lighting Control."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "ACM SenSys 2014",
        "info": "Memphis, TN, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2014",
                "sub_name": "Proceedings of the 12th ACM Conference on Embedded Network Sensor Systems, SenSys '14, Memphis, Tennessee, USA, November 3-6, 2014.",
                "count": 49,
                "papers": [
                    "Ekho: realistic and repeatable experimentation for tiny energy-harvesting sensors.",
                    "NEAT: a novel energy analysis toolkit for free-roaming smartphones.",
                    "Dynamic power management for long-term energy neutral operation of solar energy harvesting systems.",
                    "GruMon: fast and accurate group monitoring for heterogeneous urban spaces.",
                    "Opo: a wearable sensor for capturing high-fidelity face-to-face interactions.",
                    "MobyDick: an interactive multi-swimmer exergame.",
                    "iLocScan: harnessing multipath for simultaneous indoor source localization and space scanning.",
                    "RushNet: practical traffic prioritization for saturated wireless sensor networks.",
                    "ZiSense: towards interference resilient duty cycling in wireless sensor networks.",
                    "From rateless to distanceless: enabling sparse sensor network deployment in large areas.",
                    "Kinesis: a security incident response and prevention system for wireless sensor networks.",
                    "Privacy.tag: privacy concern expressed and respected.",
                    "Team-level programming of drone sensor networks.",
                    "Using mobile phone barometer for low-power transportation context detection.",
                    "Accurate real-time relative localization using single-frequency GPS.",
                    "CARLOG: a platform for flexible and efficient automotive sensing.",
                    "Mining users' significant driving routes with low-power sensors.",
                    "AirCloud: a cloud-based air-quality monitoring system for everyone.",
                    "Feasibility and limits of wi-fi imaging.",
                    "A semi-supervised learning approach for robust indoor-outdoor detection with smartphones.",
                    "DSP.Ear: leveraging co-processor support for continuous audio sensing on smartphones.",
                    "MoodMagician: a pervasive and unobtrusive emotion sensing system using mobile phones for improving human mental health.",
                    "From rateless to distanceless: enabling sparse sensor network deployment in large areas.",
                    "Interconnecting zigbee and bluetooth networks with BLupZi.",
                    "Gotcha: a mobile urban sensing system.",
                    "Group analytics and insights for public spaces.",
                    "Evolving shapes in wireless sensor networks.",
                    "HeartSense: smart phones to estimate blood pressure from photoplethysmography.",
                    "PinPtr: a high-precision GPS cloud service.",
                    "BUSICO 3D: building simulation and control in unity 3D.",
                    "Mote-scale human-animal classification via micropower radar.",
                    "Ekho: realistic and repeatable experimentation for tiny energy-harvesting sensors.",
                    "Wireless sensor/actuator network for model railroad control.",
                    "A browsing system with learning capability for internet of things.",
                    "Yottos operating system connecting low-power devices with high-level programming.",
                    "Facilitating continued run of sensor data analytics services using user driven proactive memory reclamation scheme.",
                    "Hybrid underwater environmental monitoring.",
                    "Automatic configuration of controlled interference experiments in sensornet testbeds.",
                    "Ravel a framework for embedded-gateway-cloud applications.",
                    "VeLoc: finding your car in the parking lot.",
                    "Controlled sensor network installation with unmanned aerial vehicles.",
                    "Person identification from arbitrary position and posture using kinect.",
                    "A modular software architecture for miniature capsule robots based on TinyOS.",
                    "A networked embedded system platform for the post-mote era.",
                    "Robust time synchronization in wireless sensor networks using real time clock.",
                    "A multimodal data set for evaluating continuous authentication performance in smartphones.",
                    "Mobile contents on the big screen: adaptive frame filtering for mobile device screen sharing.",
                    "Understanding radio activity signature of wireless sensor network protocols.",
                    "Automated metadata transformation for a-priori deployed sensor networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2014buildsys",
                "sub_name": "Proceedings of the 1st ACM Conference on Embedded Systems for Energy-Efficient Buildings, BuildSys 2014, Memphis, TN, USA, November 3-6, 2014.",
                "count": 49,
                "papers": [
                    "PresenceSense: zero-training algorithm for individual presence detection based on power monitoring.",
                    "BlueSentinel: a first approach using iBeacon for an energy efficient occupancy detection system.",
                    "Discerning electrical and water usage by individuals in homes.",
                    "WattShare: detailed energy apportionment in shared living spaces within commercial buildings.",
                    "SolarCast: a cloud-based black box solar predictor for smart homes.",
                    "Data driven investigation of faults in HVAC systems with model, cluster and compare (MCC).",
                    "PowerPlay: creating virtual power meters through online load tracking.",
                    "An in depth study into using EMI signatures for appliance identification.",
                    "The ECO data set and the performance of non-intrusive load monitoring algorithms.",
                    "Occupancy monitoring using environmental & context sensors and a hierarchical analysis framework.",
                    "An energy-harvesting sensor architecture and toolkit for building monitoring and event detection.",
                    "Piloteur: a lightweight platform for pilot studies of smart homes.",
                    "Minimizing electricity costs by sharing energy in sustainable microgrids.",
                    "Collaborative energy conservation in a microgrid.",
                    "Quantifying flexibility of residential thermostatically controlled loads for demand response: a data-driven approach.",
                    "Distributed independent actuation for irrigation control.",
                    "Comparison of linear correlation and a statistical dependency measure for inferring spatial relation of temperature sensors in buildings.",
                    "Social spring: encounter-based path refinement for indoor tracking systems.",
                    "Strategy-proof thermal comfort voting in buildings.",
                    "Towards automating the deployment of energy saving approaches in buildings.",
                    "Optimal HVAC building control with occupancy prediction.",
                    "Distributed control of a swarm of buildings connected to a smart grid: demo abstract.",
                    "SolarCast - an open web service for predicting solar power generation in smart homes: demo abstract.",
                    "Nerv - contextual information retrieval for Google Glass: demo abstract.",
                    "Optimal energy incentive design for occupant-engaged commercial building control: demo abstract.",
                    "A restful API to control a energy plus smart grid-ready residential building: demo abstract.",
                    "NILMTK v0.2: a non-intrusive load monitoring toolkit for large scale data sets: demo abstract.",
                    "QiLoc - a Qi-wireless based platform for robust user-initiated indoor location services: demo abstract.",
                    "Model-free occupancy-based control of variable-air-volume terminal boxes: demo abstract.",
                    "Flexhouse-2 - an open source building automation platform with a focus on flexible control: demo abstract.",
                    "An iBeacon primer for indoor localization: demo abstract.",
                    "SPA: smart meter privacy analyzer: demo abstract.",
                    "BEAD - building energy asset discovery tool for automating smart building analytics: demo abstract.",
                    "Writing scalable building efficiency applications using normalized metadata: demo abstract.",
                    "PLAID: a public dataset of high-resoultion electrical appliance measurements for load identification research: demo abstract.",
                    "Automated diagnostics for AHU-VAV systems using pattern matching: demo abstract.",
                    "BuildingSherlock: fault management framework for HVAC systems: demo abstract.",
                    "Mortar.io: a concrete building automation system: demo abstract.",
                    "Estimating human interactions with electrical appliances for activity-based energy savings recommendations: poster abstract.",
                    "The transactional network platform: poster abstract.",
                    "Bits and watts: improving energy disaggregation performance using power line communication modems: poster abstract.",
                    "Low cost HVAC systems for energy management in developing countries: poster abstract.",
                    "Applying extended kalman filters to adaptive thermal modelling in homes: poster abstract.",
                    "Water or slime? A platform for automating water treatment systems: poster abstract.",
                    "eAir: an energy efficient air quality management system in residential buildings: poster abstract.",
                    "Occupant engaged fast demand responses for commercial buildings: poster abstract.",
                    "SBD: a signature-based detection for activities of appliances: poster abstract.",
                    "Low power and low cost tide gauge sensor node using a long distance communication technology -MAD-SS-: poster abstract.",
                    "Generating home energy footprint by assigning fixture usage to individuals in homes: poster abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2014enssys",
                "sub_name": "Proceedings of the 2nd International Workshop on Energy Neutral Sensing Systems, ENSsys '14, Memphis, Tennessee, USA, November 6, 2014.",
                "count": 9,
                "papers": [
                    "An instrument scheduler design for energy neutral coastal monitoring systems deployment.",
                    "Energy-harvesting thermoelectric sensing for unobtrusive water and appliance metering.",
                    "Energy-neutral solar-powered street lighting with predictive and adaptive behaviour.",
                    "A power manager with balanced quality of service for energy-harvesting wireless sensor nodes.",
                    "Enabling opportunistic energy trading between overlapping energy harvesting wireless sensor networks.",
                    "Reducing charge redistribution loss for supercapacitor-operated energy harvesting wireless sensor nodes.",
                    "Energy harvesting framework for network simulator 3 (ns-3).",
                    "Lossless compression of cloud-cover forecasts for low-overhead distribution in solar-harvesting sensor networks.",
                    "Empirical validation of energy-neutral operation on wearable devices by MISO beamforming of IEEE 802.11ac."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2014mma",
                "sub_name": "Proceedings of the 1st Workshop on Mobile Medical Applications, MMA '14, Memphis, Tennessee, USA, November 3-6, 2014.",
                "count": 7,
                "papers": [
                    "A smartphone-based digital hearing aid to mitigate hearing loss at specific frequencies.",
                    "MindLogger: a brain-computer interface for word building using brainwaves.",
                    "Pilot study to evaluate the effectiveness of a mobile-based therapy and educational app for children.",
                    "Amulet: a secure architecture for mHealth applications for low-power wearable devices.",
                    "Model based code generation for medical cyber physical systems.",
                    "Kinematic-based sedentary and light-intensity activity detection for wearable medical applications.",
                    "RecFit: a context-aware system for recommending physical activities."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "ACM SenSys 2013",
        "info": "Roma, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2013",
                "sub_name": "The 11th ACM Conference on Embedded Network Sensor Systems, SenSys '13, Roma, Italy, November 11-15, 2013.",
                "count": 89,
                "papers": [
                    "Chaos: versatile and efficient all-to-all data sharing and in-network processing at scale.",
                    "Let the tree Bloom: scalable opportunistic routing with ORPL.",
                    "Practical error correction for resource-constrained wireless networks: unlocking the full power of the CRC.",
                    "iSleep: unobtrusive sleep quality monitoring using smartphones.",
                    "Lifestreams: a modular sense-making toolset for identifying important patterns from everyday life.",
                    "iDiary: from GPS signals to a text-searchable diary.",
                    "Piggyback CrowdSensing (PCS): energy efficient crowdsourcing of mobile sensor data by exploiting smartphone app opportunities.",
                    "FOCUS: clustering crowdsourced videos by line-of-sight.",
                    "coRide: carpool service with a win-win fare model for large-scale taxicab networks.",
                    "Carat: collaborative energy diagnosis for mobile devices.",
                    "Safe system-level concurrency on resource-constrained nodes.",
                    "Minerva: distributed tracing and debugging in wireless sensor networks.",
                    "Accelerometer-based transportation mode detection on smartphones.",
                    "Social-Loc: improving indoor localization with social sensing.",
                    "E3: energy-efficient engine for frame rate adaptation on smartphones.",
                    "Powering indoor sensing with airflows: a trinity of energy harvesting, synchronous duty-cycling, and sensing.",
                    "Sentinel: occupancy based HVAC actuation using existing WiFi infrastructure within commercial buildings.",
                    "Monjolo: an energy-harvesting energy meter architecture.",
                    "The sound of silence.",
                    "SocialWeaver: collaborative inference of human conversation networks using smartphones.",
                    "Real-time classification via sparse representation in acoustic sensor networks.",
                    "Projection matrix optimisation for compressive sensing based applications in embedded systems.",
                    "Exploiting physical layer information to mitigate cross-technology interference effects on low-power wireless networks.",
                    "AMRITA remote triggered wireless sensor network laboratory framework.",
                    "Temperature hints for sensornet routing.",
                    "Smart traffic monitoring with participatory sensing.",
                    "An adaptive energy management scheme for real-time landslide detection.",
                    "Revealing the limits of spatio-temporal high-resolution pollution maps.",
                    "SparseGPS: energy efficient GPS acquisition via sparse approximation.",
                    "A robust iterative filtering technique for wireless sensor networks in the presence of malicious attacks.",
                    "Network sensing through smartphone-based crowdsourcing.",
                    "A site properties assessment framework for wireless sensor networks.",
                    "YAMATO: a wearable floor map generation system.",
                    "CoSense: a collaborative sensing platform for mobile devices.",
                    "A reliable wireless nurse call system: overview and pilot results from a summer camp for teenagers with duchenne muscular dystrophy.",
                    "WSN-aided people localization: a ray tracing network planning and performance analysis tool.",
                    "Towards spatial macroprogramming for sensing and actuating robot swarms.",
                    "Fine-grained analysis of packet loss symptoms in wireless sensor networks.",
                    "Using a platform for mobile gesture-based interaction to control smart objects.",
                    "Unobtrusive indoor surveillance of patients at home using multiple Kinect sensors.",
                    "Improving energy predictions in EH-WSNs with Pro-Energy-VLT.",
                    "User profiling and micro-accounting for smart energy management.",
                    "SUNSET: an innovative framework for underwater simulation, emulation and real-life testing.",
                    "Communication in extreme wireless sensor networks.",
                    "Synchronous transmissions enable simple yet accurate protocol modeling.",
                    "Structural health monitoring in an underground construction site: the roman experience.",
                    "Using unlabeled Wi-Fi scan data to discover occupancy patterns of private households.",
                    "Adapting protocol characteristics of CoAP using sensed indication for vehicular analytics.",
                    "Pushing a standard wireless sensor network stack for ultra-low data rates.",
                    "Directional transmissions and receptions for high throughput burst forwarding.",
                    "Are those trees messing with my wireless sensor network?",
                    "Tracking smartphones using low-power sensor nodes.",
                    "Towards TCP communication with the low power wireless bus.",
                    "High-sensitivity cloud-offloaded instant GPS for indoor environments.",
                    "Towards the benchmarking of ultra-low latency communication protocols for wireless sensor and actuator networks.",
                    "A prototype system of the MAD-SS wide area sensor network using a weather balloon.",
                    "Optimizing mission allocation in wireless sensor networks under geographically correlated failures.",
                    "Ambient sound-based proximity detection with smartphones.",
                    "KinSpace: to provide fall prevention using Kinect.",
                    "A sensor data streaming service for visualizing urban public spaces.",
                    "Exploiting ultra-low-power ultrasonic wake-up triggering for sensor nodes distance measurements.",
                    "Comparison of two paradigms for image analysis in visual sensor networks.",
                    "FOCUS: clustering crowdsourced videos by line-of-sight.",
                    "Interoperable mobile agents in heterogeneous wireless sensor networks.",
                    "Mirage: body motion and activity recognition using off-body static electric field sensing.",
                    "mockSensor: faking remote sensors as embedded sensors for a functional enhancement of Android.",
                    "High-fidelity environmental monitoring using wireless sensor networks.",
                    "ProvinciaSense: extending the capillary WiFi infrastructure of Lazio region with static and mobile sensor networks.",
                    "Exploring smartphone-based participatory computing to improve pervasive surveillance.",
                    "A Cooja-based tool for maintaining sensor network coverage requirements in a building.",
                    "Supporting interoperability of things in IoT systems.",
                    "BodySim: a multi-domain modeling and simulation framework for body sensor networks research and design.",
                    "Powering indoor sensing with airflows: a trinity of energy harvesting, synchronous duty-cycling, and sensing.",
                    "A user-centric mobility sensing system for transportation activity surveys.",
                    "Kintense: a robust, accurate, real-time and evolving system for detecting aggressive actions from streaming 3D skeleton data.",
                    "Plants as sensing devices: the PLEASED experience.",
                    "Self-organized Bluetooth scatternets for wireless sensor networks.",
                    "Plug&Play site management or, why your solar panel should be like your webcam.",
                    "Introducing the MagoNode platform.",
                    "Adaptive cross-layer routing for underwater acoustic sensor networks with the SUNSET framework.",
                    "Disambiguating household energy-harvesting energy meter data streams.",
                    "Building embedded applications via REST services for the internet of things.",
                    "Bliss Buzzer, a system to monitor health and stress with real-time feedback.",
                    "Extrapolation from participatory sensing data.",
                    "Securing data provenance in body area networks using lightweight wireless link fingerprints.",
                    "Understanding the effects of carrier frequency difference in concurrent transmission.",
                    "ThermoSense: thermal array sensor networks in building management.",
                    "HeartSense: estimating blood pressure and ECG from photoplethysmograph using smart phones.",
                    "Twonet: large-scale wireless sensor network testbed with dual-radio nodes."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2013buildsys",
                "sub_name": "BuildSys 2013, Proceedings of the 5th ACM Workshop On Embedded Systems For Energy-Efficient Buildings, Roma, Italy, November 13-14, 2013.",
                "count": 40,
                "papers": [
                    "A Scalable Low-Cost Solution to Provide Personalised Home Heating Advice to Households.",
                    "Incentivizing Advanced Load Scheduling in Smart Homes.",
                    "It's Different: Insights into home energy consumption in India.",
                    "Watts in the basket?: Energy Analysis of a Retail Chain.",
                    "A Distributed Energy Monitoring and Analytics Platform and its Use Cases.",
                    "EnergyTrack: Sensor-Driven Energy Use Analysis System.",
                    "BuildingDepot 2.0: An Integrated Management System for Building Analysis and Control.",
                    "Estimation of building occupancy levels through environmental signals deconvolution.",
                    "Non-Intrusive Occupancy Monitoring using Smart Meters.",
                    "Occupancy Detection from Electricity Consumption Data.",
                    "ThermoSense: Occupancy Thermal Based Sensing for HVAC Control.",
                    "Reduce the Number of Sensors: Sensing Acoustic Emissions to Estimate Appliance Energy Usage.",
                    "Towards Automatic Spatial Verification of Sensor Placement in Buildings.",
                    "Performance of the Latest Generation Powerline Networking for Green Building Applications.",
                    "The Energy-Water Nexus in Campuses.",
                    "Circulo: Saving Energy with Just-In-Time Hot Water Recirculation.",
                    "Exploiting Generalized Additive Models for Diagnosing Abnormal Energy Use in Buildings.",
                    "ZonePAC: Zonal Power Estimation and Control via HVAC Metering and Occupant Feedback.",
                    "Randomized Model Predictive Control for HVAC Systems.",
                    "Online Learning for Personalized Room-Level Thermal Control: A Multi-Armed Bandit Framework.",
                    "Carrying My Environment with Me: A Participatory-sensing Approach to Enhance Thermal Comfort.",
                    "Optimal Personal Comfort Management Using SPOT+.",
                    "An In Situ System for Annotation of Home Energy Data.",
                    "Appliance State Estimation based on Particle Filtering.",
                    "Exploring Sequential and Association Rule Mining for Pattern-based Energy Demand Characterization.",
                    "Insert-coin: turning the household into a prepaid billing system.",
                    "Occupancy inferencing from non-intrusive data sources.",
                    "Occupancy-based heating control for residential buildings using environmental sensors.",
                    "On Human Behavioral Patterns in Elevator Usages.",
                    "Predicting the Power Consumption of Electric Appliances through Time Series Pattern Matching.",
                    "Robust Controlled Invariance for UFAD Regulation.",
                    "Towards a Smart Home Framework.",
                    "IAQSense: Indoor Air Quality Enhancement using Participatory-sensing.",
                    "the KTH open testbed for smart HVAC control.",
                    "TOSS: Thermal Occupancy Sensing System.",
                    "A Distributed Energy Monitoring and Analytics Platform and its Use Cases.",
                    "Performance of the Latest Generation Powerline Networking for Green Building Applications.",
                    "EnergyTrack: Sensor-Driven Energy Use Analysis System.",
                    "Towards a Smart Home Framework.",
                    "Disaggregating End Loads with Energy-Harvesting Sensors and Cloud Analytics."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2013enssys",
                "sub_name": "Proceedings of the 1st International Workshop on Energy Neutral Sensing Systems, ENSSys 2013, Rome, Italy, November 13, 2013.",
                "count": 20,
                "papers": [
                    "Solar harvest prediction supported by cloud cover forecasts.",
                    "Comparison of energy update models for wireless sensor nodes with supercapacitors.",
                    "Power management for long-term sensing applications with energy harvesting.",
                    "Stochastic modeling and analysis of wireless sensor nodes with hybrid storage systems.",
                    "A rotating machine acoustic emission monitoring system powered by multi-source energy harvester.",
                    "Improving the efficiency of air-flow energy harvesters combining active and passive rectifiers.",
                    "GreenCastalia: an energy-harvesting-enabled framework for the Castalia simulator.",
                    "Wireless sensor networks for environmental monitoring powered by microprocessors heat dissipation.",
                    "Modeling and implementation of energy neutral sensing systems.",
                    "Ultra low power asynchronous MAC protocol using wake-up radio for energy neutral WSN.",
                    "Opportunistic energy trading between co-located energy-harvesting wireless sensor networks.",
                    "Idleness as a resource in energy-neutral WSNs.",
                    "Harvesting energy from aircraft power lines.",
                    "Heterogeneous multi-harvester for wireless sensor networks.",
                    "Self-powered wireless energy meter.",
                    "Powering wireless sensor nodes with micro fuel cells.",
                    "M3: a mm-scale wireless energy harvesting sensor platform.",
                    "Tunable vibration energy harvester.",
                    "Multi-source power manager for super-capacitor based energy harvesting WSN.",
                    "Wireless noncontact temperature measurement system powered by intentional human action."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2013sensemine",
                "sub_name": "Proceedings of First International Workshop on Sensing and Big Data Mining, SENSEMINE 2013, Roma, Italy, November 11-15, 2013.",
                "count": 8,
                "papers": [
                    "Challenges and Opportunities in Taxi Fleet Anomaly Detection.",
                    "Lessons learned from the design, implementation, and management of a smartphone-based crowdsourcing system.",
                    "WRENMining: Large-Scale Data Collection for Human Contact Network Research.",
                    "PhoneLab: A Large Programmable Smartphone Testbed.",
                    "Spatially Resolved Monitoring of Radio-Frequency Electromagnetic Fields.",
                    "Noisemap: Discussing Scalability in Participatory Sensing.",
                    "A Bio-chemical Approach to Awareness in Pervasive Systems.",
                    "Fusing Traffic Sensor Data for Real-time Road Conditions."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "ACM SenSys 2012",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2012",
                "sub_name": "The 10th ACM Conference on Embedded Network Sensor Systems, SenSys '12, Toronto, ON, Canada, November 6-9, 2012.",
                "count": 58,
                "papers": [
                    "Low-power wireless bus.",
                    "How was your journey?: uncovering routing dynamics in deployed sensor networks with multi-hop network tomography.",
                    "Broadcast-free collection protocol.",
                    "MusicalHeart: a hearty way of listening to music.",
                    "Cloud-enabled privacy-preserving collaborative learning for mobile sensing.",
                    "Accurate caloric expenditure of bicyclists using cellphones.",
                    "Energy efficient GPS sensing with cloud offloading.",
                    "Indoor pseudo-ranging of mobile devices using ultrasonic chirps.",
                    "IODetector: a generic service for indoor outdoor detection.",
                    "Kyun queue: a sensor network system to monitor road traffic queues.",
                    "City-scale traffic estimation from a roving sensor network.",
                    "Low cost crowd counting using audio tones.",
                    "Acc: generic on-demand accelerations for neighbor discovery in mobile applications.",
                    "Prius: generic hybrid trace compression for wireless sensor networks.",
                    "AudioDAQ: turning the mobile phone's ubiquitous headset port into a universal data acquisition interface.",
                    "SymPhoney: a coordinated sensing flow execution engine for concurrent mobile sensing applications.",
                    "DoubleDip: leveraging thermoelectric harvesting for low power monitoring of sporadic water use.",
                    "Exploiting ephemeral link correlation for mobile wireless networks.",
                    "TALENT: temporal adaptive link estimator with no training.",
                    "Reconfiguring the software radio to improve power, price, and portability.",
                    "Tracking unmodified smartphones using wi-fi monitors.",
                    "Efficient background subtraction for real-time tracking in embedded camera networks.",
                    "Doorjamb: unobtrusive room-level tracking of people in homes using doorway sensors.",
                    "Improving indoor localization with social interactions.",
                    "Just send me the summary!: analyzing sensor data for accurate summary reports in indoor environments.",
                    "In-vivo NFC: remote monitoring of implanted medical devices with improved privacy.",
                    "Energy management for wireless sensor networks.",
                    "Tagging cities?: reading RFID tags from inside brick and mortar.",
                    "A fast gradient projection algorithm for efficient cross-correlation via sparse representation in sensor networks.",
                    "Towards crowd-aware sensing platform for metropolitan environments.",
                    "Sensor network architecture for soil and weather data extraction and database generation.",
                    "Towards robust device-free passive localization through automatic camera-assisted recalibration.",
                    "Capture effect based communication primitives: closing the loop in wireless cyber-physical systems.",
                    "Reducing energy consumption with batched task executions.",
                    "Energy synchronized charging in sensor networks.",
                    "ARM-based robot platform for sensor networks.",
                    "Using batteries wisely.",
                    "Dynamic switching-based reliable flooding in low-duty-cycle wireless sensor networks.",
                    "Towards full RPL interoperability: addressing the case with downwards routing interoperability.",
                    "Pattern-based matrix-size optimization algorithm for compressive sensing in real-world wireless sensor networks.",
                    "Using anisotropic magnetoresistive (AMR) sensor arrays for electric sub-metering.",
                    "iBookshelf: accurately search and locate books with an adaptive and intelligent bookshelf.",
                    "IODetector: a generic service for indoor outdoor detection.",
                    "Genius-on-the-go: FM radio based proximity sensing and audio information sharing.",
                    "Modular approach in sensor board design.",
                    "PEAKSAVE: energy monitoring service.",
                    "Preambleless TDD/TDMA OFDM system for real-time wireless control networks.",
                    "The CLEO mobile sensing platform.",
                    "Distributed and synchronized measurements with FlockLab.",
                    "Commissioning of low power embedded devices with IPv6/CoAP.",
                    "A novel system design and implementation for realtime sensing and warning of roadway hazards round-the-clock.",
                    "Supporting posture-free gameplay for motion-based mobile games.",
                    "iCEnergy: augmented reality display for intuitive energy monitoring.",
                    "Rapid deployable system for human contact network research.",
                    "[MARS] a real time motion capture and muscle fatigue monitoring tool.",
                    "Septimu2 - earphones for continuous and non-intrusive physiological and environmental monitoring.",
                    "Collaborative reactive behavior in heterogeneous wireless sensor networks.",
                    "Indoor pseudo-ranging of mobile devices using ultrasonic chirps."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2012buildsys",
                "sub_name": "BuildSys '12 Proceedings of the Fourth ACM Workshop on Embedded Sensing Systems for Energy-Efficiency in Buildings, Toronto, Canada, November 6, 2012.",
                "count": 40,
                "papers": [
                    "Toward adaptive comfort management in office buildings using participatory sensing for end user driven control.",
                    "Thermovote: participatory sensing for efficient building HVAC conditioning.",
                    "Effect of social network type on building occupant energy use.",
                    "Building the case for automated building energy management.",
                    "Weather-clustering based strategy design for dynamic demand response building HVAC control.",
                    "Smart energy case study.",
                    "EarlyOff: using house cooling rates to save energy.",
                    "Towards real-time, fine-grained energy analytics in buildings through mobile phones.",
                    "Risk-sensitive plan execution for connected sustainable home.",
                    "Low-cost appliance state sensing for energy disaggregation.",
                    "Minimizing intrusiveness in home energy measurement.",
                    "BuildingDepot: an extensible and distributed architecture for building data storage, access and sharing.",
                    "Building application stack (BAS).",
                    "SensorAct: a privacy and security aware federated middleware for building management.",
                    "A methodology for sensor modeling and placement optimization to support temperature monitoring.",
                    "Hot water DJ: saving energy by pre-mixing hot water.",
                    "Semi-automated modular modeling of buildings for model predictive control.",
                    "Active actuator fault detection and diagnostics in HVAC systems.",
                    "Accurate real-time occupant energy-footprinting in commercial buildings.",
                    "MLE+: a tool for integrated design and deployment of energy efficient building controls.",
                    "ConcreteCom: a new communication paradigm for building structural health monitoring.",
                    "Designing cost-efficient wireless sensor/actuator networks for building control systems.",
                    "An integrated performance analysis framework for HVAC systems using heterogeneous data models and building automation systems.",
                    "A finite state machine-based characterization of building entities for monitoring and control.",
                    "Energy-aware meeting scheduling algorithms for smart buildings.",
                    "Towards automatic classification of private households using electricity consumption data.",
                    "Creating a room connectivity graph of a building from per-room sensor units.",
                    "Lies, damn lies and preferences: a Gaussian process model for ubiquitous thermal preference trials.",
                    "Scalable load disaggregation system using distributed electrical signature detection.",
                    "Holistic energy consumption monitoring in buildings with IP-based wireless sensor networks.",
                    "A wi-fi based occupancy sensing approach to smart energy in commercial office buildings.",
                    "Social learning SoftThermostat for commercial buildings.",
                    "An adaptive smart lighting system.",
                    "TWIST Actu: a RESTful testbed platform for remote experimentation with building automation sensors and actuators.",
                    "Zone-level occupancy counting with existing infrastructure.",
                    "Dynamic resource look-up and discovery architecture for indoor location-based service.",
                    "Acomni: an alternative smart thermostat interface to aid end users to visualize energy and cost tradeoffs.",
                    "A scalable low-cost solution to provide personalized home heating advice to households.",
                    "Augmenting homes with custom devices using .NET Gadgeteer and HomeOS.",
                    "MLE+: design and deployment integration for energy-efficient building controls."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2012mh",
                "sub_name": "Proceedings of the Second ACM Workshop on Mobile Systems, Applications, and Services for HealthCare, mHealthSys '12, Toronto, Ontario, Canada, November 6, 2012.",
                "count": 9,
                "papers": [
                    "Smart rapid diagnostics test reader running on a cell-phone for real-time mapping of epidemics.",
                    "A community based vaccination strategy over mobile phone records.",
                    "Towards smart phone based monitoring of bipolar disorder.",
                    "HealthOS: a platform for pervasive health applications.",
                    "Towards an automatic version of the Berg balance scale test through a serious game.",
                    "Accurate cirrhosis identification with wrist-pulse data for mobile healthcare.",
                    "TeleHealth: intelligent healthcare with M2M communication module.",
                    "SAFE-points: a lightweight algorithm for analyzing remote mobile ECG signals.",
                    "A provenance framework for mHealth."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "ACM SenSys 2011",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2011",
                "sub_name": "Proceedings of the 9th International Conference on Embedded Networked Sensor Systems, SenSys 2011, Seattle, WA, USA, November 1-4, 2011.",
                "count": 75,
                "papers": [
                    "Industry: beyond interoperability: pushing the performance of sensor network IP stacks.",
                    "Lossy links, low power, high throughput.",
                    "On the implications of the log-normal path loss model: an efficient method to deploy and move sensor motes.",
                    "Hierarchical aggregate classification with limited supervision for data reduction in wireless sensor networks.",
                    "Balancing energy, latency and accuracy for mobile sensor data classification.",
                    "EasyTracker: automatic transit tracking, mapping, and arrival time prediction using smartphones.",
                    "Mobility prediction-based smartphone energy optimization for everyday location monitoring.",
                    "Acoustic shooter localization with a minimal number of single-channel wireless sensor nodes.",
                    "Stochastic radio interferometric positioning in the 2.4 GHz range.",
                    "Programming micro-aerial vehicle swarms with karma.",
                    "CarMA: towards personalized automotive tuning.",
                    "EasiCPRS: design and implementation of a portable Chinese pulse-wave retrieval system.",
                    "Data muling with mobile phones for sensornets.",
                    "YouProve: authenticity and fidelity in mobile sensing.",
                    "On the feasibility of real-time phone-to-phone 3D localization.",
                    "Steam-powered sensing.",
                    "Industry: using dynamic WSNs in smart logistics for fruits and pharmacy.",
                    "The hitchhiker's guide to successful residential sensing deployments.",
                    "PBN: towards practical activity recognition using smartphone-based body sensor networks.",
                    "E-Gesture: a collaborative architecture for energy-efficient gesture recognition with hand-worn sensor and mobile devices.",
                    "AutoSense: unobtrusively wearable sensor suite for inferring the onset, causality, and consequences of stress in the field.",
                    "Aveksha: a hardware-software approach for non-intrusive tracing and profiling of wireless embedded systems.",
                    "Offline GC: trashing reachable objects on tiny devices.",
                    "A database in every sensor.",
                    "A novel measurement system for environmental exposure monitoring.",
                    "Deploying a mesh-based command and control sensing system in a disaster area maneuver.",
                    "Smart buildings, sensor networks, and the Internet of Things.",
                    "Earthen site protection using wireless sensor networks.",
                    "INPRESS: indoor climate prediction and evaluation system for energy efficiency using sensor networks.",
                    "Enhanced collaborative sensing scheme for user activity recognition.",
                    "Securing the internet of things with DTLS.",
                    "Click based IP border router for low-power and lossy networks.",
                    "EMMON: a WSN system architecture and toolset for large-scale and dense real-time embedded monitoring.",
                    "Energy-efficiency of WSN concast communication: a reality-check.",
                    "Node placement adviser for sensor network deployment.",
                    "Reducing power consumption of human activity sensing using compressed sensing.",
                    "Single channel, full-duplex wireless.",
                    "Impulse radio UWB testbed for indoor and sensor network applications.",
                    "Phones and robots: brains and brawn.",
                    "SUNSHINE extension: a hardware-software emulator for flexible sensor nodes in wireless networks.",
                    "Statistical learning strategies for RF-based indoor device-free passive localization.",
                    "Selective reference mechanism for neighbor discovery in low-duty-cycle wireless sensor networks.",
                    "Neighbor discovery with distributed quorum system.",
                    "Achieving robust sensor networks through close coordination between narrow-band power line and low-power wireless communications.",
                    "Achieving a 10x lifetime increase with IEEE 802.15.4e motes.",
                    "HierTrack: an energy efficient target tracking system for wireless sensor networks.",
                    "Micro energy efficiency system based on QR code mote.",
                    "A robot-in-residence for data center thermal monitoring and energy efficiency management.",
                    "Smarter data center power monitoring and management.",
                    "Organic solar cell-equipped energy harvesting active networked tag (EnHANT) prototypes.",
                    "Capacitor leakage aware duty cycle control for energy harvesting wireless sensor networks.",
                    "An IEEE 802.15.4-compatible, battery-free, energy-harvesting sensor node.",
                    "Zoom: a multi-resolution tasking framework for crowdsourced geo-spatial sensing.",
                    "Uno: a sharing infrastructure for smartphone sensors and files.",
                    "A mesh-based command and control sensing system for public safety scenarios.",
                    "Friendbook: privacy preserving friend matching based on shared interests.",
                    "AD-Sense: activity-driven sensing for mobile devices.",
                    "Tracking transit with EasyTracker.",
                    "Sword fight with smartphones.",
                    "Snap: rapid sensornet deployment with a sensornet appstore.",
                    "Towards bug-free implementation for wireless sensor networks.",
                    "TRIDENT, untethered observation of physical communication made to share.",
                    "Automatically generating interesting events with LifeJoin.",
                    "An interoperability development and performance diagnosis environment.",
                    "A complete framework for programming event-driven, self-reconfigurable low power wireless networks.",
                    "Distilling likely truth from noisy streaming data with Apollo.",
                    "Automatic personal identification system for security in critical services: a case study.",
                    "A solar-powered wireless parking guidance system for outdoor car parks.",
                    "Tracking vehicles in a container terminal.",
                    "Rhinopithecus roxellana monitoring and identification using wireless sensor networks.",
                    "WiFlow: real time travel time estimation using wi-fi monitors.",
                    "Creating interactive virtual zones in physical space with magnetic-induction.",
                    "WISP-based access control combining electronic and mechanical authentication.",
                    "INGA: an inexpensive node for general applications.",
                    "An unobtrusively wearable sensor suite for inferring the onset, causality, and consequences of stress in the field."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2011buildsys",
                "sub_name": "BuildSys 2011, Proceedings of the Third ACM Workshop on Embedded Sensing Systems for Energy-Efficiency in Buildings, Held in conjunction with ACM SenSys 2011, November 1, Seattle, Washington, USA.",
                "count": 19,
                "papers": [
                    "A living laboratory study in personalized automated lighting controls.",
                    "Exploiting home automation protocols for load monitoring in smart buildings.",
                    "Managing plug-loads for demand response within buildings.",
                    "WaterSense: water flow disaggregation using motion sensors.",
                    "COPOLAN: non-invasive occupancy profiling for preliminary assessment of HVAC fixed timing strategies.",
                    "Enabling building energy auditing using adapted occupancy models.",
                    "POEM - a user-centric approach to energy efficiency in office buildings.",
                    "Building energy management systems actuated using wireless camera sensor networks.",
                    "Toward data-driven demand-response optimization in a campus microgrid.",
                    "ThermoNet: fine-grain building comfort-efficiency assessment.",
                    "Preliminary results from an advanced lighting controls demonstration at Fort Irwin.",
                    "Reliable state transition detection in off-the-shelf low frequency electric meters.",
                    "Segmenting consumers using smart meter data.",
                    "Appliance classification and energy management using multi-modal sensing.",
                    "Low-cost continuous thermal sensing.",
                    "Co-simulation based building controls implementation with networked sensors and actuators.",
                    "Simulation-assisted building energy performance improvement using sensible control decisions.",
                    "The case for efficient renewable energy management in smart homes.",
                    "Towards an understanding of campus-scale power consumption."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2011mh",
                "sub_name": "Proceedings of the First ACM Workshop on Mobile Systems, Applications, and Services for Healthcare, mHealthSys '11, Seattle, Washington, USA, November 1, 2011.",
                "count": 12,
                "papers": [
                    "mobileSpiro: accurate mobile spirometry for self-management of asthma.",
                    "Planipes: mobile foot pressure analysis.",
                    "Analysis of gait in patients with normal pressure hydrocephalus.",
                    "StrokeTrack: wireless inertial motion tracking of human arms for stroke telerehabilitation.",
                    "Power-aware action recognition with optimal sensor selection: an AdaBoost driven distributed template matching approach.",
                    "PowerSense: power aware dengue diagnosis on mobile phones.",
                    "Real-time joint angle measurement using the Shimmer wireless sensor platform.",
                    "Chronic Care Continuum (C3): mobile-ready life skills training for adolescents with chronic diseases.",
                    "HygeiaTel: an intelligent telemedicine system with cognitive support.",
                    "A virtual sleep laboratory.",
                    "Non-invasive and long-term core temperature measurement.",
                    "Activity-aware heart sensing in mobile healthcare."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "ACM SenSys 2010",
        "info": "Zurich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2010",
                "sub_name": "Proceedings of the 8th International Conference on Embedded Networked Sensor Systems, SenSys 2010, Zurich, Switzerland, November 3-5, 2010.",
                "count": 71,
                "papers": [
                    "Design and evaluation of a versatile and efficient receiver-initiated link layer for low-power wireless.",
                    "PIP: a connection-oriented, multi-hop, multi-channel TDMA-based MAC for high throughput bulk transfer.",
                    "AutoWitness: locating and tracking stolen property while tolerating GPS and radio outages.",
                    "SensLoc: sensing everyday places and paths using less energy.",
                    "Adaptive GPS duty cycling and radio ranging for energy-efficient localization.",
                    "The Jigsaw continuous sensing engine for mobile phone applications.",
                    "Cooperative transit tracking using smart-phones.",
                    "Privacy-aware regression modeling of participatory sensing data.",
                    "PipeProbe: a mobile sensor droplet for mapping hidden pipeline.",
                    "Evolution and sustainability of a wildlife monitoring sensor network.",
                    "Meeting ecologists' requirements with adaptive data acquisition.",
                    "Reliable clinical monitoring using wireless sensor networks: experiences in a step-down hospital unit.",
                    "Efficient diagnostic tracing for wireless sensor networks.",
                    "Enix: a lightweight dynamic operating system for tightly constrained wireless sensor platforms.",
                    "sMAP: a simple measurement and actuation profile for physical information.",
                    "The smart thermostat: using occupancy sensors to save energy in homes.",
                    "Estimating building consumption breakdowns using ON/OFF state sensing and incremental sub-meter deployment.",
                    "eShare: a capacitor-driven energy storage and sharing network for long-term operation.",
                    "Adaptive decentralized control of underwater sensor networks for modeling underwater phenomena.",
                    "A case against routing-integrated time synchronization.",
                    "Revealing the hidden lives of underground animals using magneto-inductive tracking.",
                    "Locating sensors in the wild: pursuit of ranging quality.",
                    "Surviving wi-fi interference in low power ZigBee networks.",
                    "Mapping the urban wireless landscape with Argos.",
                    "Practical 3D geographic routing for wireless sensor networks.",
                    "Proposal for a sensor network application development with ActionScript.",
                    "Enabling flexible MAC protocol design for wireless sensor networks.",
                    "The Lorien dynamic component based OS.",
                    "A multi-view visual surveillance system based on angle coverage.",
                    "Whistle: synchronization-free TDOA for localization.",
                    "A wifi-based low-cost mobile video surveillance system for dynamic police force deployment and real-time guard for public security.",
                    "RF sounding.",
                    "Magneto-inductive tracking of underground animals.",
                    "A shared sensor network infrastructure.",
                    "RealSSim: a simulator for indoor sensor network systems.",
                    "A MAC contest between LPL (the champion) and Reins-MAC (the challenger, an anarchic TDMA scheduler providing QoS).",
                    "Traffic related observations by line sensing techniques.",
                    "TinyTune, a collaborative sensor network musical instrument.",
                    "Kitokito: supporting impromptu collaboration in participatory sensing using smart camera phones.",
                    "Fast alarm broadcasting in critical event monitoring using wireless sensor networks.",
                    "CASINO: creating alea with a sensor-based interactive network.",
                    "Integrating symbolic execution with sensornet simulation for efficient bug finding.",
                    "Cooja TimeLine: a power visualizer for sensor network simulation.",
                    "A versatile heterogeneous sensor networks testbed.",
                    "Hijacking power and bandwidth from the mobile phone's audio interface.",
                    "Enhancing wi-fi coverage through ZigBee mesh network of energy scan devices.",
                    "DisCord: discovering and coordinating data exchange protocol in opportunistic wireless sensor networks.",
                    "Visualizing sensor network data with Powertron.",
                    "Energy transference for sensornets.",
                    "BSMX: message exchange between unassociated WLAN devices.",
                    "iAssist: rapid deployment and maintenance of tiny sensing systems.",
                    "The SpiderBat ultrasound positioning system.",
                    "TouchAble: a camera-based multitouch system.",
                    "Code in the air: simplifying sensing on smartphones.",
                    "ADACEM: automatic daily activity and calorie expenditure monitor on mobile phones.",
                    "Fine-scale tracking by fusing phase profiles from multiple low-power Doppler radars.",
                    "Open sensor network interface for U-City service platform.",
                    "NOMAD: networked-observation and mobile-agent-based scene abstraction and determination.",
                    "Long range wireless sensor networks using transmit-only nodes.",
                    "END: a topology-aware collection metric for sensor networks.",
                    "Reliable and energy-efficient bulk-data dissemination in wireless sensor networks.",
                    "If you have time, save energy with pull.",
                    "A wireless MEMS-sensor network concept for the condition monitoring of ball screw drives in industrial plants.",
                    "MansOS: easy to use, portable and resource efficient operating system for networked embedded devices.",
                    "TinyOS meets wireless mesh networks.",
                    "Towards a life without link estimation.",
                    "SAntArray: passive element array antenna for wireless sensor networks.",
                    "Balancing visibility and resource consumption for long-term monitoring of sensornets.",
                    "Data-enriched simulation of data management applications for wireless sensor networks.",
                    "Network-wide energy profiling of CTP.",
                    "When ultra low power meets high performance: the WiseMAC high availability protocol."
                ]
            },
            {
                "sub_name_abbr": "conf/sensys/2010buildsys",
                "sub_name": "BuildSys'10, Proceedings of the 2nd ACM Workshop on Embedded Sensing Systems for Energy-Efficiency in Buildings, Zurich, Switzerland, November 3-5, 2010.",
                "count": 14,
                "papers": [
                    "Occupancy-driven energy management for smart building automation.",
                    "Occupancy based demand response HVAC control strategy.",
                    "Building-level occupancy data to improve ARIMA-based electricity use forecasts.",
                    "Contactless sensing of appliance state transitions through variations in electromagnetic fields.",
                    "Meter any wire, anywhere by virtualizing the voltage channel.",
                    "TinyEARS: spying on house appliances with audio sensor nodes.",
                    "Distributed wireless control for building energy management?",
                    "Granger causality analysis on IP traffic and circuit-level energy monitoring.",
                    "NetBem: business equipment energy monitoring through network auditing.",
                    "HBCI: human-building-computer interaction.",
                    "Private memoirs of a smart meter.",
                    "A limited-data model of building energy consumption.",
                    "Using simple light sensors to achieve smart daylight harvesting.",
                    "Wireless, collaborative virtual sensors for thermal comfort."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "ACM SenSys 2009",
        "info": "Berkeley, California, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2009",
                "sub_name": "Proceedings of the 7th International Conference on Embedded Networked Sensor Systems, SenSys 2009, Berkeley, California, USA, November 4-6, 2009.",
                "count": 83,
                "papers": [
                    "Collection tree protocol.",
                    "RACNet: a high-fidelity data center sensing network.",
                    "Explicit and precise rate control for wireless sensor networks.",
                    "ADB: an efficient multihop broadcast protocol based on asynchronous duty-cycling in wireless sensor networks.",
                    "M&M: multi-level Markov model for wireless link simulations.",
                    "Bursty traffic over bursty links.",
                    "VTrack: accurate, energy-aware road traffic delay estimation using mobile phones.",
                    "Canopy closure estimates with GreenOrbs: sustainable sensing in the forest.",
                    "Experiences with a high-fidelity wireless building energy auditing network.",
                    "TOSThreads: thread-safe and non-invasive preemption in TinyOS.",
                    "Macrodebugging: global views of distributed program execution.",
                    "Evaluating a BASIC approach to sensor network node programming.",
                    "Darjeeling, a feature-rich VM for the resource poor.",
                    "Mercury: a wearable sensor network platform for high-fidelity motion analysis.",
                    "Suelo: human-assisted sensing for exploratory soil monitoring studies.",
                    "Low-power clock synchronization using electromagnetic energy radiating from AC power lines.",
                    "Optimal clock synchronization in networks.",
                    "A tale of two synchronizing clocks.",
                    "FIND: faulty node detection for wireless sensor networks.",
                    "The case for a network protocol isolation layer.",
                    "Achieving range-free localization beyond connectivity.",
                    "YETI: an Eclipse plug-in for TinyOS 2.1.",
                    "ASSERT: Advanced wireleSS Environment Research Testbed.",
                    "Distributed energy measurements in wireless sensor networks.",
                    "Generation of controllable radio interference for protocol testing in wireless sensor networks.",
                    "A wireless sensor network for border surveillance.",
                    "Macrodebugging with MDB.",
                    "HONS (hybrid open networking stack) for diverse wireless sensor networks.",
                    "A service-oriented operating system and an application development infrastructure for wireless sensor networks.",
                    "A navigation system based on a sensor network without exit and locations.",
                    "NISAT: a zero-side-effect testbed for wireless sensor networks.",
                    "iLight: device-free passive tracking by wireless sensor networks.",
                    "Physicalnet: a middleware for programming concurrent, across administrative domain sensor and actuator networks.",
                    "A virtualization framework for heterogeneous sensor network platforms.",
                    "An implementation of a wireless sensor network-based meter reading system.",
                    "Towards power transformer condition monitoring.",
                    "Measuring foot pronation using RFID sensor networks.",
                    "SensorFly: a controlled-mobile aerial sensor network.",
                    "TransitGenie: a context-aware, real-time transit navigator.",
                    "Hallway monitoring with sensor networks.",
                    "Whac-A-Bee: a sensor network game.",
                    "Radio information management for distributed spectrum sensing.",
                    "Low-power high-precision timing hardware for sensor networks.",
                    "SNORES: towards a less-intrusive home sleep monitoring system using wireless sensor networks.",
                    "A wake-on sensor network.",
                    "WIA-PA network and its interconnection with legacy process automation system.",
                    "Hybrid-powered RFID sensor networks.",
                    "mCrowd: a platform for mobile crowdsourcing.",
                    "Common Sense: participatory urban sensing using a network of handheld air quality monitors.",
                    "An affordable, long-lasting, and autonomous theft detection and tracking system.",
                    "A human probe for measuring walkability.",
                    "Integrated GPS-denied localization, tracking and automatic personal identification.",
                    "Application of geosensor nodes in low-rate networks.",
                    "Live photo mosaic with a group of wireless image sensors.",
                    "Analysis of an omni-directional narrowband ultrasonic receiver and CSS-based broadband transmission.",
                    "ANN-based non-linearity compensator of LVDT sensor for structural health monitoring.",
                    "Teaching wireless sensor networks through testbed development.",
                    "Run time assurance of application-level requirements in wireless sensor networks.",
                    "Prototyping a software factory for wireless sensor networks.",
                    "Wildlife and environmental monitoring using RFID and WSN technology.",
                    "Characterization of link asymmetry in wireless sensor networks.",
                    "PipeProbe: mapping hidden water pipelines.",
                    "On building mobility models for floating objects.",
                    "An efficient operating system abstraction layer for portable applications in the domain of wireless sensor networks.",
                    "Integrated distributed energy awareness for wireless sensor networks.",
                    "Learning from sensor network data.",
                    "Heuristics for scheduling periodic real-time streams in wireless sensor networks.",
                    "Recovering network topology with binary sensors.",
                    "A wireless routing protocol in d-dimensional spaces.",
                    "Wireless link simulations using multi-level Markov models.",
                    "A wireless pedestrian tracking network.",
                    "Ear-Phone assessment of noise pollution with mobile phones.",
                    "Design of a low-cost sensor node for distributed spectrum sensing.",
                    "TinyVM, an efficient virtual machine infrastructure for sensor networks.",
                    "A cyber-physical middleware framework for continuous monitoring of water distribution systems.",
                    "Exploiting the tradeoff between fast wakeup and long standby in event-monitoring WSN.",
                    "A stolen object detection and tracing system for mobile valuables.",
                    "Energy profiling for mPlatform.",
                    "Energy-efficient management of wireless sensor networks.",
                    "SensorTrust: a resilient trust model for WSNs.",
                    "SolarMote: a low-cost solar energy supplying and monitoring system for wireless sensor networks.",
                    "The FlockLab testbed architecture.",
                    "Implementation of the low power performance analysis system for WSN."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "ACM SenSys 2008",
        "info": "Raleigh, NC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2008",
                "sub_name": "Proceedings of the 6th International Conference on Embedded Networked Sensor Systems, SenSys 2008, Raleigh, NC, USA, November 5-7, 2008.",
                "count": 77,
                "papers": [
                    "RI-MAC: a receiver-initiated asynchronous duty cycle mac protocol for dynamic traffic loads in wireless sensor networks.",
                    "IP is dead, long live IP for wireless sensor networks.",
                    "The beta-factor: measuring wireless link burstiness.",
                    "The hitchhiker's guide to successful wireless sensor network deployments.",
                    "Robust topology control for indoor wireless sensor networks.",
                    "Practical asynchronous neighbor discovery and rendezvous for mobile sensing applications.",
                    "Declarative tracepoints: a programmable and application independent debugging system for wireless sensor networks.",
                    "Dustminer: troubleshooting interactive complexity bugs in sensor networks.",
                    "Passive diagnosis for wireless sensor networks.",
                    "Spinning beacons for precise indoor localization.",
                    "A measurement study of interference modeling and scheduling in low-power wireless networks.",
                    "Distributed image search in camera sensor networks.",
                    "Lance: optimizing high-resolution signal collection in wireless sensor networks.",
                    "Accurate localization of low-level radioactive source under noise and measurement errors.",
                    "A methodology for in-network evaluation of integrated logical-statistical models.",
                    "Resource aware programming in the Pixie OS.",
                    "MacroLab: a vector-based macroprogramming framework for cyber-physical systems.",
                    "Steady and fair rate allocation for rechargeable sensors in perpetual sensor networks.",
                    "Tiny web services: design and implementation of interoperable and evolvable sensor networks.",
                    "A building block approach to sensornet systems.",
                    "PoolView: stream privacy for grassroots participatory sensing.",
                    "Model-based monitoring for early warning flood detection.",
                    "NAWMS: nonintrusive autonomous water monitoring system.",
                    "Nericell: rich monitoring of road and traffic conditions using mobile smartphones.",
                    "Sensing meets mobile social networks: the design, implementation and evaluation of the cenceme application.",
                    "Leakage-aware energy synchronization on twin-star nodes.",
                    "PCP: the personal commute portal.",
                    "Creating greener homes with IP-based wireless ac energy monitors.",
                    "Nericell: using mobile smartphones for rich monitoring of road and traffic conditions.",
                    "Safety assurance for archeologists using sensor network.",
                    "MEDiSN: medical emergency detection in sensor networks.",
                    "Programming cyber-physical systems with MacroLab.",
                    "Wireless sensor network for substation monitoring: design and deployment.",
                    "Transforming the social networking experience with sensing presence from mobile phones.",
                    "A java compatible virtual machine for wireless sensor nodes.",
                    "Passive diagnosis for wireless sensor networks.",
                    "Distributed cut detection in sensor networks.",
                    "Using wireless sensor networks to develop pervasive multi-player games.",
                    "An efficient event detection scheme for wireless sensor networks.",
                    "Bringing sensor networks underwater with low-power acoustic communications.",
                    "A complete wirelessHART network.",
                    "Integrating sensor presence into virtual worlds using mobile phones.",
                    "SIDnet-SWANS: a simulator and integrated development platform for sensor networks applications.",
                    "In-network training and distributed event detection in wireless sensor networks.",
                    "Self-organizing service distribution.",
                    "Sensor network navigation without locations.",
                    "RFID sensor networks with the intel WISP.",
                    "SWAT: enabling wireless network measurements.",
                    "NoSE: efficient initialization of wireless sensor networks.",
                    "Introducing TakaTuka: a java virtualmachine for motes.",
                    "Development of a long-lived, real-time automatic weather station based on WSN.",
                    "Optimizing declarative sensornets.",
                    "Integrating multiple sensor modalities for environmental monitoring of marine locations.",
                    "Using mobile wireless sensors for in-situ tracking of debris flows.",
                    "Exploiting the capture effect for low-latency flooding in wireless sensor networks.",
                    "Exploring diversity: evaluating the cost of frequency diversity in communication and routing.",
                    "TinyOS 2.1 adding threads and memory protection to TinyOS.",
                    "RFID-based localization in heterogeneous mesh networks.",
                    "A quantitative error analysis of synchronized sampling on wireless sensor networks for earthquake monitoring.",
                    "Efficient time synchronization for wireless sensor networks in an industrial setting.",
                    "Making sensor networks IPv6 ready.",
                    "Emuli: model driven sensor stimuli for experimentation.",
                    "KleeNet: automatic bug hunting in sensor network applications.",
                    "Deployments of wide and local area wireless sensor networks for environmental studies.",
                    "Dyser: towards a real-time search engine for the web of things.",
                    "An RFID based system for monitoring free weight exercises.",
                    "Application-specific trace compression for low bandwidth trace logging.",
                    "Considering real world issues for delivering data in multi-robot sensor networks.",
                    "WI-HTest: testing suite for diagnosing wirelesshart devices and networks.",
                    "A sensor network for compression and streaming of GPS trajectory data.",
                    "On the scaling properties of low power wireless links.",
                    "Accurate, fast fall detection using posture and context information.",
                    "Satellite based wireless sensor networks: global scale sensing with nano- and pico-satellites.",
                    "A public key technology platform for wireless sensor networks.",
                    "Rateless erasure codes for bulk transfer in asymmetric wireless sensor networks.",
                    "MODEL: moving object detection and localization in wireless networks based on small-scale fading.",
                    "Achieving stable network performance for wireless sensornetworks."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "ACM SenSys 2007",
        "info": "Sydney, NSW, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2007",
                "sub_name": "Proceedings of the 5th International Conference on Embedded Networked Sensor Systems, SenSys 2007, Sydney, NSW, Australia, November 6-9, 2007.",
                "count": 62,
                "papers": [
                    "BeepBeep: a high accuracy acoustic ranging system using COTS mobile devices.",
                    "MSP: multi-sequence positioning of wireless sensor nodes.",
                    "Tracking mobile nodes using RF Doppler shifts.",
                    "CountTorrent: ubiquitous access to query aggregates in dynamic and mobile sensor networks.",
                    "A component-based architecture for power-efficient media access control in wireless sensor networks.",
                    "Visibility: a new metric for protocol design.",
                    "The BikeNet mobile sensing system for cyclist experience mapping.",
                    "LUSTER: wireless sensor network for environmental research.",
                    "SensorFlock: an airborne wireless sensor network of micro-air vehicles.",
                    "Meeting lifetime goals with energy levels.",
                    "CargoNet: a low-cost micropower sensor node exploiting quasi-passive wakeup for adaptive asychronous monitoring of exceptional events.",
                    "Eon: a language and runtime system for perpetual systems.",
                    "The design and implementation of a declarative sensor network system.",
                    "Clairvoyant: a comprehensive source-level debugger for wireless sensor networks.",
                    "Efficient memory safety for TinyOS.",
                    "A framework for the automated generation of power-efficient classifiers for embedded sensor nodes.",
                    "Message-in-a-bottle: user-friendly and secure key deployment for sensor nodes.",
                    "Multi-user data sharing in radar sensor networks.",
                    "Catching elephants with mice: sparse sampling for monitoring sensor networks.",
                    "Simulation-based augmented reality for sensor network development.",
                    "Exploring in-situ sensing irregularity in wireless sensor networks.",
                    "RCRT: rate-controlled reliable transport for wireless sensor networks.",
                    "Data forwarding in extremely low duty-cycle sensor networks with unreliable communication links.",
                    "An adaptive communication architecture for wireless sensor networks.",
                    "Flush: a reliable bulk transport protocol for multihop wireless networks.",
                    "A real-time sensor network visualization system using KVS: Kyoto visualization system.",
                    "The national weather sensor grid.",
                    "A multi-channel MAC implementation for wireless sensor networks.",
                    "A high-density earthquake monitoring system using wireless sensor networks.",
                    "A 6LoWPAN application environment.",
                    "Multi-user data sharing in radar sensor networks.",
                    "Navigation and interaction in physical spaces using RFID enabled spatial sensing.",
                    "An interactive UNIX shell for low-end sensor nodes with LiteOS.",
                    "A co-simulation platform for actuator networks.",
                    "Sensor network programming with Flask.",
                    "Design and implementation of a PCO-based protocol for sensor networks.",
                    "Fountain reprogramming protocol (FRP): a reliable data dissemination scheme for wireless sensor networks using fountain codes.",
                    "Acoustic sensor networks for environmental monitoring.",
                    "Programming wireless sensor networks with logical neighborhoods: a road tunnel use case.",
                    "Video surveillance patrol robot system in 3G, Internet and sensor networks.",
                    "A BeepBeep ranging system on mobile phones.",
                    "A traveling wave-based self-organizing communication mechanism for WSNs.",
                    "Micro-Blog: map-casting from mobile phones to virtual sensor maps.",
                    "Multi-radio medium access control protocol for wireless sensor networks.",
                    "Effective source-level debugging of wireless sensor networks.",
                    "Castalia: revealing pitfalls in designing distributed algorithms in WSN.",
                    "Software-based sensor node energy estimation.",
                    "Fair waiting protocol: achieving isolation in wireless sensornets.",
                    "Secure multi-path in sensor networks.",
                    "PrivaSense: providing privacy protection for sensor networks.",
                    "A framework for data quality and feedback in participatory sensing.",
                    "TomuDB: multi-resolution queries in heterogeneous sensor networks through overlay network.",
                    "A model-based routing protocol for a mobile, delay tolerant network.",
                    "A fault-tolerant node scheduling scheme to extend the lifetime of wireless sensor networks.",
                    "Detection and tracking using wireless sensor networks.",
                    "An effective method for state-of-charge estimation in wireless sensor networks.",
                    "Adaptive sampling in the COlumbia RIvEr observation network.",
                    "SASSI: the sliverware architecture for sensor system integration.",
                    "On node isolation in directional sensor networks.",
                    "Application semantics in query optimization for WSNs.",
                    "Distributed computation in wireless ad hoc grids with bandwidth control.",
                    "An autonomic communication framework for sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "ACM SenSys 2006",
        "info": "Boulder, Colorado, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2006",
                "sub_name": "Proceedings of the 4th International Conference on Embedded Networked Sensor Systems, SenSys 2006, Boulder, Colorado, USA, October 31 - November 3, 2006.",
                "count": 72,
                "papers": [
                    "t-kernel: providing reliable OS support to wireless sensor networks.",
                    "Run-time dynamic linking for reprogramming wireless sensor networks.",
                    "Protothreads: simplifying event-driven programming of memory-constrained embedded systems.",
                    "Virtual high-resolution for sensor networks.",
                    "StarDust: a flexible architecture for passive localization in wireless sensor networks.",
                    "The design and implementation of a self-calibrating distributed acoustic sensing platform.",
                    "RBP: robust broadcast propagation in wireless networks.",
                    "Interest dissemination with directional antennas for wireless sensor networks with mobile sinks.",
                    "Lazy cross-link removal for geographic routing.",
                    "CarTel: a distributed mobile sensor computing system.",
                    "Supporting concurrent applications in wireless sensor networks.",
                    "The tenet architecture for tiered sensor networks.",
                    "Abstractions for safe concurrent programming in networked embedded systems.",
                    "Scalable data aggregation for dynamic events in sensor networks.",
                    "Capsule: an energy-optimized object storage system for memory-constrained sensor devices.",
                    "Datalink streaming in wireless sensor networks.",
                    "ATPC: adaptive transmission power control for wireless sensor networks.",
                    "Experimental study of concurrent transmission in wireless sensor networks.",
                    "Target tracking with binary proximity sensors: fundamental limits, minimal descriptions, and algorithms.",
                    "Data compression algorithms for energy-constrained devices in delay tolerant networks.",
                    "Capturing high-frequency phenomena using a bandwidth-limited sensor network.",
                    "Funneling-MAC: a localized, sink-oriented MAC for boosting fidelity in sensor networks.",
                    "X-MAC: a short preamble MAC protocol for duty-cycled wireless sensor networks.",
                    "Ultra-low duty cycle MAC with scheduled channel polling.",
                    "A self-calibrating distributed acoustic sensing platform.",
                    "A storage-centric camera sensor network.",
                    "Cascades: an extensible heterogeneous sensor networking framework.",
                    "Data analysis tools for sensor-based science.",
                    "Data collection in delay tolerant mobile sensor networks using SCAR.",
                    "A funneling-MAC for high performance data collection in sensor networks.",
                    "A new embedded web services approach to wireless sensor networks.",
                    "A unified architecture for flexible radio power management in wireless sensor networks.",
                    "An eventual consistent wireless light control system.",
                    "GRAIL: general real-time adaptable indoor localization.",
                    "Demonstrating distributed signal strength location estimation.",
                    "Flexible hardware/software platform for tracking applications.",
                    "Real-time volcanic earthquake localization.",
                    "eCAM: ultra compact, high data-rate wireless sensor node with a miniature camera.",
                    "liteOS: a lightweight operating system for c++ software development in sensor networks.",
                    "Low power, low cost, wireless camera sensor nodes For human detection.",
                    "A hierarchical location directory service across sensor and IP networks.",
                    "Responsive and energy-efficient sensor networking for real time location tracking.",
                    "Sensing and reproducing the shapes of 3D objects using claytronics.",
                    "Mobility centric campus area sensor network for locality specific applications.",
                    "SensorMap: a web site for sensors world-wide.",
                    "SignetLab: deployable sensor network testbed and management tool.",
                    "Simple sensor syndiciation.",
                    "Step-wise context extraction in AoK mule system.",
                    "Software radio implementation of short-range wireless standards for sensor networking.",
                    "The CarTel mobile sensor computing system.",
                    "A virtualizing OS kernel for wireless sensor networks.",
                    "TOSDev: a rapid development environment for tinyOS.",
                    "Using grid technologies to optimise a wireless sensor network for flood management.",
                    "Routing and processing multiple aggregate queries in sensor networks.",
                    "Rateless codes for data dissemination in sensor networks.",
                    "AMSecure: secure link-layer communication in TinyOS for IEEE 802.15.4-based wireless sensor networks.",
                    "Virtual sensing range.",
                    "uScan: a lightweight two-tier global sensing coverage design.",
                    "SkiScape sensing.",
                    "Channel surfing: defending wireless sensor networks from jamming and interference.",
                    "Energy adaptation techniques to optimize data delivery in store-and-forward sensor networks.",
                    "A distributed reliable data transport strategy for event based wireless sensor networks.",
                    "Lowering radio duty cycle through temperature compensated timing.",
                    "Collaborative scheduling of event types and allocation of rates for wireless sensor nodes with multiple sensing units.",
                    "Kaizen: improving sensor network operating systems.",
                    "Achieving realistic sensing area modeling.",
                    "Is data-centric storage and querying scalable?",
                    "Understanding the causes of packet delivery success and failure in dense wireless sensor networks.",
                    "WaveScope: a signal-oriented data stream management system.",
                    "Comprehensive monitoring of CO2 sequestration in subalpine forest ecosystems and its relation to global warming.",
                    "TINX: a tiny index design for flash memory on wireless sensor devices.",
                    "Wireless sensor networks for structural health monitoring."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "ACM SenSys 2005",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2005",
                "sub_name": "Proceedings of the 3rd International Conference on Embedded Networked Sensor Systems, SenSys 2005, San Diego, California, USA, November 2-4, 2005.",
                "count": 61,
                "papers": [
                    "Radio interferometric geolocation.",
                    "A high-accuracy, low-cost localization system for wireless sensor networks.",
                    "A new approach for establishing pairwise keys for securing wireless sensor networks.",
                    "TSAR: a two tier sensor storage architecture using interval skip graphs.",
                    "A macroscope in the redwoods.",
                    "Design and deployment of industrial sensor networks: experiences from a semiconductor plant and the north sea.",
                    "A unifying link abstraction for wireless sensor networks.",
                    "Z-MAC: a hybrid MAC for wireless sensor networks.",
                    "Packet combining in sensor networks.",
                    "Siphon: overload traffic management using multi-radio virtual sinks in sensor networks.",
                    "Estimating clock uncertainty for efficient duty-cycling in sensor networks.",
                    "Firefly-inspired sensor network synchronicity with realistic radio effects.",
                    "Data collection, storage, and retrieval with an underwater sensor network.",
                    "MAX: human-centric search of the physical world.",
                    "CenWits: a sensor-based loosely coupled search and rescue system using witnesses.",
                    "Cyclops: in situ image sensing and interpretation in wireless sensor networks.",
                    "Lightweight detection and classification for wireless sensor networks in realistic environments.",
                    "Intelligent light control using sensor networks.",
                    "Algorithms for generic role assignment in wireless sensor networks.",
                    "VMSTAR: synthesizing scalable runtime environments for sensor networks.",
                    "Sympathy for the sensor network debugger.",
                    "Sensor networks for landslide detection.",
                    "Splitting the sensor node.",
                    "Bayesian localization in wireless networks using angle of arrival.",
                    "Concert: aggregation-based congestion control for sEnsoR neTworks.",
                    "Robot couriers: precise mobility in a wireless network testbed.",
                    "Secure dissemination of code updates in sensor networks.",
                    "SenSlide: a sensor network based landslide prediction aystem.",
                    "Accuracy-aware data modeling in sensor networks.",
                    "Stop the clock!: new directions for embedded controllers in wireless sensor networks.",
                    "Impact of intentional mobility in sparse sensor networks.",
                    "A new scheme on link quality prediction and its applications to metric-based routing.",
                    "Automatic programming with semantic streams.",
                    "Exploiting multi-Channel diversity to speed up over-the-air programming of wireless sensor networks.",
                    "A dynamic en-route scheme for filtering false data injection in wireless sensor networks.",
                    "Intel mote 2: an advanced platform for demanding sensor network applications.",
                    "Claytronics: highly scalable communications, sensing, and actuation networks.",
                    "Online camera calibration and node localization in sensor networks.",
                    "D.A.S.: deployment analysis system.",
                    "Viptos: a graphical development and simulation environment for tinyOS-based wireless sensor networks.",
                    "Agile cargo tracking using mobile agents.",
                    "Field server: multi-functional wireless sensor network node for earth observation.",
                    "A hybrid sensor network for cane-toad monitoring.",
                    "Emulab's wireless sensor net testbed: true mobility, location precision, and remote access.",
                    "Coordinating camera motion for sensing uncertainty reduction.",
                    "Reprogramming sensor networks safely, quickly, and efficiently.",
                    "Heliomote: enabling long-lived sensor networks through solar energy harvesting.",
                    "Network of cyclops; image inference and interpretation in sensor network.",
                    "A human-based sensor network connecting mobile phones.",
                    "Distance enlargement and reduction attacks on ultrasound ranging.",
                    "A spreadsheet toolkit for streaming sensor data.",
                    "Sensor networks for medical care.",
                    "Everlast: long-life, supercapacitor-operated wireless sensor node.",
                    "Sensor fusion and correlation.",
                    "Full-system simulation for sensor networks.",
                    "Localization system for outdoor wireless sensor networks.",
                    "Distributed sensory systems and developer platforms from crossbow technology.",
                    "TinyOS 2.0.",
                    "Dynamically configurable robotic sensor networks.",
                    "SQualNet: a scalable simulation framework for sensor networks.",
                    "Localization and mapping with mobile sensor networks."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "ACM SenSys 2004",
        "info": "Baltimore, MD, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2004",
                "sub_name": "Proceedings of the 2nd International Conference on Embedded Networked Sensor Systems, SenSys 2004, Baltimore, MD, USA, November 3-5, 2004.",
                "count": 62,
                "papers": [
                    "Sensor network-based countersniper system.",
                    "A wireless sensor network For structural monitoring.",
                    "Call and response: experiments in sampling the environment.",
                    "The flooding time synchronization protocol.",
                    "Robust distributed network localization with noisy range measurements.",
                    "Decentralized synchronization protocols with nearest neighbor communication.",
                    "A sensor network application construction kit (SNACK).",
                    "The dynamic behavior of a data dissemination protocol for network programming at scale.",
                    "Versatile low power media access for wireless sensor networks.",
                    "Energy-efficient forwarding strategies for geographic routing in lossy wireless sensor networks.",
                    "Combs, needles, haystacks: balancing push and pull for discovery in large-scale sensor networks.",
                    "Mitigating congestion in wireless sensor networks.",
                    "Congestion control and fairness for many-to-one routing in sensor networks.",
                    "TinySec: a link layer security architecture for wireless sensor networks.",
                    "ELF: an efficient log-structured flash file system for micro sensor nodes.",
                    "Simulating the power consumption of large-scale sensor network applications.",
                    "A system for simulation, emulation, and deployment of heterogeneous sensor networks.",
                    "An analysis of a large scale habitat monitoring application.",
                    "Hardware design experiences in ZebraNet.",
                    "Medians and beyond: new aggregation techniques for sensor networks.",
                    "Synopsis diffusion for robust aggregation in sensor networks.",
                    "Active rules for wireless networks of sensors & actuators.",
                    "Analysis of RFID anti-collision algorithms using smart antennas.",
                    "A case for all-wireless, dual-radio virtual sinks.",
                    "A clustering method that uses lossy aggregation of data.",
                    "Data acquisition in multiple-sink sensor networks.",
                    "Energy-efficient data organization and query processing in sensor networks.",
                    "Exploring the predictability of network metrics in the presence of unreliable wireless links.",
                    "Flexible hardware abstraction of the TI MSP430 microcontroller in TinyOS.",
                    "Implementation and evaluation of scalable and robust scheme for data gathering in wireless sensor networks.",
                    "Infuse: a TDMA based reprogramming service for sensor networks.",
                    "The limits of localization using RSS.",
                    "MNP: multihop network reprogramming service for sensor networks.",
                    "M2RC - multiplicative-increase/additive-decrease multipath routing control for wireless sensor networks.",
                    "A new metric for fault-tolerance in sensor networks.",
                    "Next-generation prototyping of sensor networks.",
                    "Power - time optimal algorithm for computing FFT over sensor networks.",
                    "Practical and robust geographic routing in wireless networks.",
                    "RAODV: an efficient routing algorithm for sensor networks.",
                    "Revisiting the lifetime of wireless sensor networks.",
                    "SpyGlass: taking a closer look at sensor networks.",
                    "A TDMA-based MAC protocol for WSNs.",
                    "Using hierarchical location names for scalable routing and rendezvous in wireless sensor networks.",
                    "Automating server tracking for data centers.",
                    "CODA + PSFQ + virtual sinks = enabling technologies for resilient sensor networking.",
                    "Collaborative control and coordination of hazardous chemicals.",
                    "Continuous medical monitoring using wireless microsensors.",
                    "Cyclops, image sensing and interpretation in wireless networks.",
                    "Demonstration of EmStar.",
                    "Distributed attention.",
                    "The DSYS25 sensor platform.",
                    "Electronic tripwires for power-efficient surveillance and target classification.",
                    "Follow-me application: active visitor guidance system.",
                    "Integrated wireless sensor/actuator networks in an agricultural application.",
                    "Intel Mote: using bluetooth in sensor networks.",
                    "Low power mesh networking with telos and IEEE 802.15.4.",
                    "MobiQuery: a spatiotemporal data service for sensor networks.",
                    "The REKF localization system: node localization using mobile robots.",
                    "A scheme for calibrating smart camera networks using active lights.",
                    "A sensor-actuator network for damage detection in civil structures.",
                    "Sensor networks in intel fabrication plants.",
                    "Sensor networks for media production."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "ACM SenSys 2003",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sensys/2003",
                "sub_name": "Proceedings of the 1st International Conference on Embedded Networked Sensor Systems, SenSys 2003, Los Angeles, California, USA, November 5-7, 2003.",
                "count": 49,
                "papers": [
                    "Understanding packet delivery performance in dense wireless sensor networks.",
                    "Taming the underlying challenges of reliable multihop routing in sensor networks.",
                    "Integrated coverage and connectivity configuration in wireless sensor networks.",
                    "Minimal and maximal exposure path algorithms for wireless embedded sensor networks.",
                    "Differentiated surveillance for sensor networks.",
                    "Multi-dimensional range queries in sensor networks.",
                    "GEM: graph eMbedding for routing and data-centric storage in sensor networks without geographic information.",
                    "An evaluation of multi-resolution storage for sensor networks.",
                    "Bluetooth and sensor networks: a reality check.",
                    "DFuse: a framework for distributed data fusion.",
                    "TOSSIM: accurate and scalable simulation of entire tinyOS applications.",
                    "Timing-sync protocol for sensor networks.",
                    "Tracking a moving object with a binary sensor network.",
                    "Overload management in sensor-actuator networks used for spatially-distributed control systems.",
                    "An adaptive energy-efficient MAC protocol for wireless sensor networks.",
                    "Energy-efficient collision-free medium access control for wireless sensor networks.",
                    "Minimum-energy asynchronous dissemination to mobile sinks in wireless sensor networks.",
                    "Spatiotemporal multicast in sensor networks.",
                    "Matching data dissemination algorithms to application requirements.",
                    "Model-based compression in wireless ad hoc networks.",
                    "Application-specific compression for time delay estimation in sensor networks.",
                    "SIA: secure information aggregation in sensor networks.",
                    "CODA: congestion detection and avoidance in sensor networks.",
                    "Practical lazy scheduling in sensor networks.",
                    "BTnodes - a distributed platform for sensor nodes.",
                    "Online data cleaning in wireless sensor networks.",
                    "Density, accuracy, delay and lifetime tradeoffs in wireless sensor networks - a multidimensional design perspective.",
                    "Spatial average of a continuous physical process in sensor networks.",
                    "An energy-balanced transmission scheme for sensor networks.",
                    "wiseMAC, an ultra low power MAC protocol for the wiseNET wireless sensor network.",
                    "Entropy-based sensor selection for localization.",
                    "Bandwidth management in wireless sensor networks.",
                    "LEAP - efficient security mechanisms for large-scale distributed sensor networks.",
                    "Contour detection using actuated sensor networks.",
                    "On the effect of localization errors on geographic face routing in sensor networks.",
                    "Using adaptive range control to optimize 1-hop broadcast coverage in dense wireless networks.",
                    "On the interaction of network characteristics and collaborative target tracking in sensor networks.",
                    "On the scaling laws of dense wireless sensor networks.",
                    "Sensor network as a distributed manager for multi-robot task allocation.",
                    "A modular power-aware wireless microsensor architecture.",
                    "Secure locations: routing on trust and isolating compromised sensors in location-aware sensor networks.",
                    "Serial data aggregation using space-filling curves in wireless sensor networks.",
                    "Multidimensional scaling based sensor positioning algorithms in wireless sensor networks.",
                    "Statistical en-route filtering in large scale sensor networks.",
                    "Cooperative tracking with binary-detection sensor networks.",
                    "Wireless sensor network characterization - application to demand response energy pricing.",
                    "mantis - system supports for multimodAl neTworks on in-situ sensors.",
                    "Sensors on wheels - towards a zero-infrastructure solution for intelligent transportation systems.",
                    "Anchor-free distributed localization in sensor networks."
                ]
            }
        ]
    }
]