[
    {
        "year": "2021",
        "name": "SIGCOMM 2021",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2021",
                "sub_name": "ACM SIGCOMM 2021 Conference, Virtual Event, USA, August 23-27, 2021.",
                "count": 55,
                "papers": [
                    "Toward formally verifying congestion control behavior.",
                    "Aquila: a practically usable verification system for production-scale programmable data planes.",
                    "Snowcap: synthesizing network-wide configuration updates.",
                    "Synthesizing safe and efficient kernel extensions for packet processing.",
                    "Understanding host network stack overheads.",
                    "1Pipe: scalable total order communication in data center networks.",
                    "CliqueMap: productionizing an RMA-based distributed caching system.",
                    "Gimbal: enabling multi-tenant storage disaggregation on SmartNIC JBOFs.",
                    "LAVA: fine-grained 3D indoor wireless coverage for small IoT devices.",
                    "Personalizing head related transfer functions for earables.",
                    "L2D2: low latency distributed downlink for LEO satellites.",
                    "RoS: passive smart surface for roadside-to-vehicle communication.",
                    "Programmable packet scheduling with a single queue.",
                    "Sailfish: accelerating cloud-scale multi-tenant multi-service gateways with programmable switches.",
                    "CocoSketch: high-performance sketch-based measurement over arbitrary partial key query.",
                    "RedPlane: enabling fault-tolerant stateful in-switch applications.",
                    "revisiting the open vSwitch dataplane ten years later.",
                    "Network planning with deep reinforcement learning.",
                    "Semi-automated protocol disambiguation and code generation.",
                    "MimicNet: fast performance estimates for data center networks with machine learning.",
                    "Verifying learning-augmented systems.",
                    "Designing data center networks using bottleneck structures.",
                    "A throughput-centric view of the performance of datacenter topologies.",
                    "Congestion detection in lossless networks.",
                    "ACC: automatic ECN tuning for high-speed datacenter networks.",
                    "Anycast In context: a tale of two systems.",
                    "XLINK: QoE-driven multi-path QUIC transport in large-scale video services.",
                    "The ties that un-bind: decoupling IP from web services and sockets for robust addressing agility at CDN-scale.",
                    "AnyOpt: predicting and optimizing IP Anycast performance.",
                    "mmTag: a millimeter wave backscatter network.",
                    "BlueFi: bluetooth over WiFi.",
                    "Two beams are better than one: towards reliable and high throughput mmWave links.",
                    "Concurrent interference cancellation: decoding multi-packet collisions in LoRa.",
                    "Seven years in the life of Hypergiants' off-nets.",
                    "Cost-effective capacity provisioning in wide area networks with Shoofly.",
                    "Capacity-efficient and uncertainty-resilient backbone network planning with hose.",
                    "ARROW: restoration-aware traffic engineering.",
                    "Concordia: teaching the 5G vRAN to share compute.",
                    "A nationwide study on cellular reliability: measurement, analysis, and enhancements.",
                    "A variegated look at 5G in the wild: performance, power, and QoE implications.",
                    "Democratizing cellular access with CellBricks.",
                    "Hoplite: efficient and fault-tolerant collective communication for task-based distributed systems.",
                    "SiP-ML: high-bandwidth optical network interconnects for machine learning training.",
                    "Efficient sparse collective communication and its application to accelerate distributed deep learning.",
                    "Solar superstorms: planning for an internet apocalypse.",
                    "Nationwide deployment and operation of a virtual arrival detection system in the wild.",
                    "Insights from operating an IP exchange provider.",
                    "Lucid: a language for control in the data plane.",
                    "Campion: debugging router configuration differences.",
                    "Prognosis: closed-box analysis of network protocol implementations.",
                    "Test coverage metrics for the network.",
                    "A composition framework for change management.",
                    "Auric: using data-driven recommendation to automatically generate cellular configuration.",
                    "Bento: safely bringing network function virtualization to Tor.",
                    "From IP to transport and beyond: cross-layer attacks against applications."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021p",
                "sub_name": "SIGCOMM '21: ACM SIGCOMM 2021 Conference, Virtual Event, August 23-27, 2021, Poster and Demo Sessions.",
                "count": 30,
                "papers": [
                    "Cost-effective data analytics across multiple cloud regions.",
                    "Non-interoperability detection for routing protocol implementations.",
                    "Mining social interactionsin connection traces of a campus wi-fi network.",
                    "Blockchain and games: a novel middleware for blockchain-based multiplayer games.",
                    "Planter: seeding trees within switches.",
                    "The last RTT matters and we can preact.",
                    "The effect of consumer portfolio on the risk profile of cloud provider.",
                    "Constructing the face of network data.",
                    "DNS water torture detection in the data plane.",
                    "A cloud-scale per-flow backpressure system via FPGA-based heavy hitter detection.",
                    "Modular switch deployment in programmable forwarding planes with switch (de)composer.",
                    "SCASys: a smart congestion control algorithm selection system.",
                    "UQCom: underwater safety communication based on 3D blue-green QR arrays.",
                    "Implementing the plugin distribution system.",
                    "Quantifying the transient performance of congestion control algorithms.",
                    "SRv6-FEC: bringing forward erasure correction to IPv6 segment routing.",
                    "Federating trust: network orchestration for cross-boundary zero trust.",
                    "A novel approach for network resource sharing via blockchain.",
                    "Steal task scheduling from OS: enabling task-network co-schedule for time-critical traffic.",
                    "Decentralization, privacy and performance for DNS.",
                    "Silent tracker: in-band beam management for soft handover for mm-wave networks.",
                    "Sarasate: a strong representation system for networking policies.",
                    "A design for a secure network of networks using a hardware and software co-engineering architecture.",
                    "Linc: low-cost inter-domain connectivity for industrial systems.",
                    "IGNNITION: fast prototyping of graph neural networks for communication networks.",
                    "Intent-based policy optimization in SD-WAN.",
                    "Speeding up IPv4 connections via IPv6 infrastructure.",
                    "Aerial: a GPU hyper-converged platform for 5G.",
                    "Blockgraph proof-of-concept.",
                    "CAMES: enabling centralized automotive embedded systems with time-sensitive network."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021flexnets",
                "sub_name": "FlexNets '21: Proceedings of the 4th FlexNets Workshop on Flexible Networks Artificial Intelligence Supported Network Flexibility and Agility, Virtual Event, USA, 23 August 2021.",
                "count": 9,
                "papers": [
                    "AI-driven Closed-loop Automation in 5G and beyond Mobile Networks.",
                    "Practical Automation for Management Planes of Service Provider Infrastructure.",
                    "FedRAN: Federated Mobile Edge Computing with Differential Privacy.",
                    "Recommending Changes on QoE Factors with Conditional Variational AutoEncoder.",
                    "Reinforcement Learning and Energy-Aware Routing.",
                    "Mitigation of Scheduling Violations in Time-Sensitive Networking using Deep Deterministic Policy Gradient.",
                    "Internet Traffic Classification Using an Ensemble of Deep Convolutional Neural Networks.",
                    "Automated Collaborator Selection for Federated Learning with Multi-armed Bandit Agents.",
                    "A Reinforcement Learning Framework for Optimizing Throughput in DOCSIS Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021foci",
                "sub_name": "FOCI '21: Proceedings of the ACM SIGCOMM 2021 Workshop on Free and Open Communications on the Internet, Virtual Event, USA, 27 August 2021.",
                "count": 7,
                "papers": [
                    "Even Censors Have a Backup: Examining China's Double HTTPS Censorship Middleboxes.",
                    "Measuring QQMail's automated email censorship in China.",
                    "Interactions with Potential Mis/Disinformation URLs Among U.S. Users on Facebook, 2017-2019.",
                    "A multi-perspective view of Internet censorship in Myanmar.",
                    "Exploring Simple Detection Techniques for DNS-over-HTTPS Tunnels.",
                    "BlindTLS: Circumventing TLS-based HTTPS censorship.",
                    "On the state of V3 onion services."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021nai",
                "sub_name": "NAI'21: Proceedings of the ACM SIGCOMM 2021 Workshop on Network-Application Integration, Virtual Event, USA, August 27, 2021.",
                "count": 12,
                "papers": [
                    "Wide Area Network Autoscaling for Cloud Applications.",
                    "Towards a Software-Defined, Fine-Grained QoS Framework for 5G and Beyond Networks.",
                    "Socker: Network-application Co-programming with Socket Tracing.",
                    "Characterizing the Relationship Between Application QoE and Network QoS for Real-Time Services.",
                    "NetGraph: An Intelligent Operated Digital Twin Platform for Data Center Networks.",
                    "Learning Application-Layer Traffic Optimization Maps from Internet Measurement: How Far are We from Practical?",
                    "Toward Stable Interdomain Network-Application Integration.",
                    "Do Larger (More Accurate) Deep Neural Network Models Help in Edge-assisted Augmented Reality?",
                    "Tighter application-network interfacing to drive innovation in networked systems.",
                    "IntQOE: Integrated End-to-end QoE Optimization for Edge Computing Enabled Web Application.",
                    "Leveraging In-Network Application Awareness.",
                    "Towards an API for the Path-Aware Internet."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021optsys",
                "sub_name": "OptSys '21: Proceedings of the ACM SIGCOMM 2021 Workshop on Optical Systems, Virtual Event, USA, 23 August 2021.",
                "count": 6,
                "papers": [
                    "Towards All-optical Circuit-switched Datacenter Network Cores: The Case for Mitigating Traffic Skewness at the Edge.",
                    "Abstractions for Reconfigurable Hybrid Network Update and A Consistent Update Approach.",
                    "Internet Photonic Sensing: Using the Internet Optical Transport Signals for Vibration and Deformation Sensing.",
                    "IOI: In-network Optical Inference.",
                    "Reconfigurable Optical Datacom Networks by Self-supervised Learning.",
                    "Are WANs Ready for Optical Topology Programming?"
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021spin",
                "sub_name": "SPIN '21: Proceedings of the ACM SIGCOMM 2021 Workshop on Secure Programmable network INfrastructure, Virtual Event, USA, 27 August 2021.",
                "count": 3,
                "papers": [
                    "Faster enclave transitions for IO-intensive network applications.",
                    "Anomaly Detection in Data Plane Systems using Packet Execution Paths.",
                    "Secure Keyed Hashing on Programmable Switches."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021taurin",
                "sub_name": "TAURIN'21: Proceedings of the ACM SIGCOMM 2021 Workshop on Technologies, Applications, and Uses of a Responsible Internet, Virtual Event, USA, August 23, 2021.",
                "count": 5,
                "papers": [
                    "Global Distributed Secure Mapping of Network Addresses.",
                    "Increasing the Transparency, Accountability and Controllability of multi-domain networks with the UPIN framework.",
                    "On the Deployment of Default Routes in Inter-domain Routing.",
                    "Divesting in Socially (Ir)responsible Internet Service Providers.",
                    "Accounting Value Effects for Responsible Networking."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/20215g",
                "sub_name": "5G-MeMU '21: Proceedings of the 1st Workshop on 5G Measurements, Modeling, and Use Cases, Virtual Event, 23 August 2021.",
                "count": 5,
                "papers": [
                    "Experimentation and 5G KPI measurements in the 5GENESIS platforms.",
                    "Improving railway track coverage with mmWave bridges: A Measurement Campaign.",
                    "Learning from large-scale commercial networks: challenges and knowledge extraction towards machine learning use cases.",
                    "Extending network slice management to the end-host.",
                    "Case for 5G-aware video streaming applications."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2021visnext",
                "sub_name": "VisNEXT@SIGCOMM 2021: Proceedings of the Workshop on Design, Deployment, and Evaluation of Network-assisted Video Streaming, Virtual Event, Germany, 7 December 2021.",
                "count": 4,
                "papers": [
                    "PRISM based Transport: How Networks can Boost QoS for Advanced Video Services?",
                    "An ML-Based Approach for Near Real-Time Content Caching.",
                    "Learning-driven MU-MIMO Grouping for Multi-User Multimedia Applications Over Commodity WiFi.",
                    "LwTE-Live: Light-weight Transcoding at the Edge for Live Streaming."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "SIGCOMM 2020",
        "info": "Virtual Event, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2020",
                "sub_name": "SIGCOMM '20: Proceedings of the 2020 Annual conference of the ACM Special Interest Group on Data Communication on the applications, technologies, architectures, and protocols for computer communication, Virtual Event, USA, August 10-14, 2020.",
                "count": 53,
                "papers": [
                    "MasQ: RDMA for Virtual Private Cloud.",
                    "TACK: Improving Wireless Transport Performance by Taming Acknowledgments.",
                    "VTrace: Automatic Diagnostic System for Persistent Packet Loss in Cloud-Scale Overlay Network.",
                    "Switch Code Generation Using Program Synthesis.",
                    "Concurrent Entanglement Routing for Quantum Networks: Model and Designs.",
                    "Flow Event Telemetry on Programmable Data Plane.",
                    "TEA: Enabling State-Intensive Network Functions on Programmable Switches.",
                    "Neural-Enhanced Live Streaming: Improving Live Video Ingest via Online Learning.",
                    "NetLock: Fast, Centralized Lock Management Using Programmable Switches.",
                    "PCF: Provably Resilient Flexible Routing.",
                    "Interpreting Deep Learning-Based Networking Systems.",
                    "Leveraging Ambient LTE Traffic for Ubiquitous Passive Communication.",
                    "Turboboosting Visible Light Backscatter Communication.",
                    "Fault Tolerant Service Function Chaining.",
                    "Routing on Multiple Optimality Criteria.",
                    "BeauCoup: Answering Many Network Traffic Queries, One Memory Update at a Time.",
                    "WiTAG: Seamless WiFi Backscatter Communication.",
                    "Scouts: Improving the Diagnosis Process Through Domain-customized Incident Routing.",
                    "Contention-Aware Performance Prediction For Virtualized Network Functions.",
                    "Gallium: Automated Software Middlebox Offloading to Programmable Switches.",
                    "Mantis: Reactive Programmable Switches.",
                    "GRooT: Proactive Verification of DNS Configurations.",
                    "Composing Dataplane Programs with μP4.",
                    "Beyond 5G: Reliable Extreme Mobility Management.",
                    "Reducto: On-Camera Filtering for Resource-Efficient Real-Time Video Analytics.",
                    "A Public Option for the Core.",
                    "Microscope: Queue-based Performance Diagnosis for Network Functions.",
                    "OmniMon: Re-architecting Network Telemetry with Resource Efficiency and Full Accuracy.",
                    "Aeolus: A Building Block for Proactive Transport in Datacenters.",
                    "Lyra: A Cross-Platform Language and Compiler for Data Plane Programming on Heterogeneous ASICs.",
                    "Pbe-CC: Congestion Control via Endpoint-Centric, Physical-Layer Bandwidth Measurements.",
                    "Akamai DNS: Providing Authoritative Answers to the World's Queries.",
                    "Understanding Operational 5G: A First Measurement Study on Its Coverage, Performance and Energy Consumption.",
                    "Caching with Delayed Hits.",
                    "Swift: Delay is Simple and Effective for Congestion Control in the Datacenter.",
                    "Zero Downtime Release: Disruption-free Load Balancing of a Multi-Billion User Website.",
                    "A Computational Approach to Packet Classification.",
                    "Server-Driven Video Streaming for Deep Learning Inference.",
                    "bf4: towards bug-free P4 programs.",
                    "Come as You Are: Helping Unmodified Clients Bypass Censorship with Server-side Evasion.",
                    "Accuracy, Scalability, Coverage: A Practical Configuration Verifier on a Global WAN.",
                    "PCC Proteus: Scavenger Transport And Beyond.",
                    "Classic Meets Modern: a Pragmatic Learning-Based Congestion Control for the Internet.",
                    "A Low Latency and Consistent Cellular Control Plane.",
                    "PINT: Probabilistic In-band Network Telemetry.",
                    "SmartNIC Performance Isolation with FairNIC.",
                    "NFC+: Breaking NFC Networking Limits through Resonance Engineering.",
                    "1RMA: Re-envisioning Remote Memory Access for Multi-tenant Datacenters.",
                    "Ultra-Wideband Underwater Backscatter via Piezoelectric Metamaterials.",
                    "Annulus: A Dual Congestion Control Loop for Datacenter and WAN Traffic Aggregates.",
                    "Probabilistic Verification of Network Configurations.",
                    "Beyond the mega-data center: networking multi-data center regions.",
                    "Sirius: A Flat Datacenter Network with Nanosecond Optical Switching."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2020p",
                "sub_name": "SIGCOMM '20: ACM SIGCOMM 2020 Conference, Virtual Event, August 10-14, 2020, Poster and Demo Sessions.",
                "count": 35,
                "papers": [
                    "Traffic classification using deep learning: being highly accurate is not enough.",
                    "MeshScope: a bottom-up approach for configuration inspection in service mesh.",
                    "AnnaBellaDB: a key value store for stateless network functions.",
                    "FSO clusters for data center network management and packet telemetry.",
                    "Large scale symmetric network malfunction detection.",
                    "BeamSurfer: simple in-band beam management for mobile mm-wave devices.",
                    "In-network defense against AR-DDoS attacks.",
                    "Network protocol safe configuration search in one shot.",
                    "Corona-warn-app: tracing the start of the official COVID-19 exposure notification app for germany.",
                    "Automatic optimization of software data planes.",
                    "Defending lightweight virtual switches from cross-app poisoning attacks with vIFC.",
                    "Dynamic latency control of serverless applications operated on AWS lambda and greengrass.",
                    "How good is your mobile (web) surfing?: speed index inference from encrypted traffic.",
                    "Model predictive control for load balancing.",
                    "SSRDM: semi-supervised real-time DDoS detection mechanism.",
                    "Visualizing QUIC and HTTP/3 with qlog and qvis.",
                    "AR over NDN: augmented reality applications and the rise of information centric networking.",
                    "Optimized bitrate ladders for adaptive video streaming with deep reinforcement learning.",
                    "Revisiting heavy-hitters: don't count packets, compute flow inter-packet metrics in the data plane.",
                    "Towards optimal path encoding using SAT solver.",
                    "RAL: reinforcement active learning for network traffic monitoring and analysis.",
                    "System call interception for serverless isolation.",
                    "Fenglin-I: an open-source TSN chip for scenario-driven customization.",
                    "Network anomaly detection with net-GAN, a generative adversarial network for analysis of multivariate time-series.",
                    "5G tracker: a crowdsourced platform to enable research using commercial 5g services.",
                    "A proof-of-concept 5G mobile gateway with eBPF.",
                    "Millimeter wave wireless network on chip using deep reinforcement learning.",
                    "Accelerating disaggregated data centers using unikernel.",
                    "Real-time deep learning based traffic analytics.",
                    "TSNTag: a multi-semantic flow identification mechanism enabling full-custom TSN design.",
                    "COC: hierarchical coflow ordering for WAN bandwidth optimization in inter-data center.",
                    "AS relationships inference from the internet routing registries.",
                    "Towards in-network time-decaying aggregates for heavy-hitter detection.",
                    "Optimized tracing of iCF-enabled programmable data planes.",
                    "Observing BGP route poisoning in the wild."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2020netai",
                "sub_name": "Proceedings of the 2020 Workshop on Network Meets AI & ML, NetAI@SIGCOMM, Virtual Event, USA, August 14, 2020.",
                "count": 9,
                "papers": [
                    "SmartEntry: Mitigating Routing Update Overhead with Reinforcement Learning for Traffic Engineering.",
                    "Is Network the Bottleneck of Distributed Training?",
                    "SAM: Self-Attention based Deep Learning Method for Online Traffic Classification.",
                    "Challenges in Using ML for Networking Research: How to Label If You Must.",
                    "Neural Packet Routing.",
                    "A Deep Learning Approach for IP Hijack Detection Based on ASN Embedding.",
                    "Pitfalls of data-driven networking: A case study of latent causal confounders in video streaming.",
                    "DeepBGP: A Machine Learning Approach for BGP Configuration Synthesis.",
                    "An Adaptive Tree Algorithm to Approach Collision-Free Transmission in Slotted ALOHA."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2020spin",
                "sub_name": "Proceedings of the 2020 ACM SIGCOMM 2020 Workshop on Secure Programmable Network Infrastructure, SPIN@SIGCOMM 2020, Virtual Event, USA, August 14, 2020.",
                "count": 7,
                "papers": [
                    "FastFE: Accelerating ML-based Traffic Analysis with Programmable Switches.",
                    "Implementing AES Encryption on Programmable Switches via Scrambled Lookup Tables.",
                    "Carpe Elephants: Seize the Global Heavy Hitters.",
                    "A Feasibility Study on Time-aware Monitoring with Commodity Switches.",
                    "Secure State Migration in the Data Plane.",
                    "Measuring TCP Round-Trip Time in the Data Plane.",
                    "Fighting Fire with Light: Tackling Extreme Terabit DDoS Using Programmable Optics."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2020nai",
                "sub_name": "Proceedings of the 2020 Workshop on Network Application Integration/CoDesign, NAI@SIGCOMM 2020, Virtual Event, USA, August 14, 2020.",
                "count": 10,
                "papers": [
                    "Towards Deep Network & Application Integration: Possibilities, Challenges, and Research Directions.",
                    "NetworkAPI: An In-band Signalling Application-aware Traffic Engineering using SRv6 and IP anycast.",
                    "Dawn: Co-programming Distributed Applications with Network Control.",
                    "MoWIE: Toward Systematic, Adaptive Network Information Exposure as an Enabling Technique for Cloud-Based Applications over 5G and Beyond (Invited Paper).",
                    "Federated Adaptive Bitrate Live Streaming over Locality Sensitive Playback Coalitions.",
                    "Trading Latency for Compute in the Network.",
                    "Semantically Aware, Mission-Oriented (SAMO) Networks: A Framework for Application/Network Integration.",
                    "Bi-directional Network and Application Interaction: Application Intents upon Abstracted Network Information (Invited Paper).",
                    "ETCNet: Encrypted Traffic Classification using Siamese Convolutional Networks.",
                    "Tackling Cold Start in Serverless Computing with Container Runtime Reusing."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "SIGCOMM 2019",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2019",
                "sub_name": "Proceedings of the ACM Special Interest Group on Data Communication, SIGCOMM 2019, Beijing, China, August 19-23, 2019.",
                "count": 32,
                "papers": [
                    "Enabling a permanent revolution in internet architecture.",
                    "Bridging the data charging gap in the cellular edge.",
                    "TEAVAR: striking the right utilization-availability balance in WAN traffic engineering.",
                    "HPCC: high precision congestion control.",
                    "Pluginizing QUIC.",
                    "Gentle flow control: avoiding deadlock in lossless networks.",
                    "Socksdirect: datacenter sockets can be fast and compatible.",
                    "Zooming in on wide-area latencies to a global cloud provider.",
                    "RF-based inertial measurement.",
                    "A large-scale analysis of deployed traffic differentiation practices.",
                    "Residential links under the weather.",
                    "A link layer protocol for quantum networks.",
                    "A millimeter wave network for billions of things.",
                    "Underwater backscatter networking.",
                    "Validating datacenters at scale.",
                    "Safely and automatically updating in-network ACL configurations with intent language.",
                    "Formal specification and testing of QUIC.",
                    "Leveraging quantum annealing for large MIMO processing in centralized radio access networks.",
                    "Neural packet classification.",
                    "Learning scheduling algorithms for data processing clusters.",
                    "E2E: embracing user heterogeneity to improve quality of experience on the web.",
                    "Graphene: efficient interactive set reconciliation applied to blockchain propagation.",
                    "Offloading distributed applications onto smartNICs using iPipe.",
                    "Nitrosketch: robust and general sketch-based monitoring in software switches.",
                    "PicNIC: predictable virtualized NIC.",
                    "Fast, scalable, and programmable packet scheduler in hardware.",
                    "Vantage: optimizing video upload for time-shifted viewing of social live streams.",
                    "Pano: optimizing 360° video streaming with a better understanding of quality perception.",
                    "End-to-end transport for video QoE fairness.",
                    "Towards highly available clos-based WAN routers.",
                    "On optimal neighbor discovery.",
                    "Elmo: source routed multicast for public clouds."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2019p",
                "sub_name": "Proceedings of the ACM SIGCOMM 2019 Conference Posters and Demos, SIGCOMM 2019, Beijing, China, August 19-23, 2019.",
                "count": 62,
                "papers": [
                    "AOMO: An AI-aided Optimizer for Microservices Orchestration.",
                    "Towards Automated Inter-Service Authorization for Microservice Applications.",
                    "P4BFT: A Demonstration of Hardware-Accelerated BFT in Fault-Tolerant Network Control Plane.",
                    "TinyNet: A Lightweight, Modular, and Unified Network Architecture for The Internet of Things.",
                    "Being more Effective and Interpretable: Bridging the Gap Between Heuristics and AI for ABR Algorithms.",
                    "iFIT: Intelligent Flow Information Telemetry.",
                    "Cooperative Trajectory Optimization for a Cellular Internet of UAVs.",
                    "CellScope: Automatically Specifying and Verifying Cellular Network Protocols.",
                    "A3: An Automatic Malfunction Detection and Fixation System in FatTree Data Center Networks.",
                    "Toward a Production-ready General-purpose RDMA-enabled RPC.",
                    "Web Quality of Experience from Encrypted Packets.",
                    "DeepDiag: Detailed NFV Performance Diagnosis.",
                    "An Edge Computing Marketplace for Distributed Machine Learning.",
                    "Cooperative Signaling of DDoS Attacks in a Blockchain-based Network.",
                    "HyperGen: High-Performance Flexible Packet Generator Using Programmable Switching ASIC.",
                    "Tyrus: PHY-Assisted Neural Adaptive Congestion Control for Cellular Networks.",
                    "NOracle: Who is communicating with whom in my network?",
                    "Faster Control Plane Experimentation with Horse.",
                    "Resilient Disaggregated Network Flow Monitoring.",
                    "HyFabric: Minimizing FCT in Optical and Electrical Hybrid Data Center Networks.",
                    "QUINCE: A unified crowdsourcing-based QoE measurement platform.",
                    "Learning Tree: Neural Network-based Index for NDN Forwarding Plane.",
                    "iBaby: A Mobile Children Monitoring and Finding System with Stranger Holding Detection Based on IoT Technologies.",
                    "TimerTasks: Towards Time-driven Execution in Programmable Dataplanes.",
                    "Cheetah: Accelerating Database Queries with Switch Pruning.",
                    "Measurement and Redesign of BBR-based MPTCP.",
                    "RF-based Inertial Measurement.",
                    "Hard Virtualization of P4-based switches with VirtP4.",
                    "Deploying Natural Language Intents with Lumi.",
                    "Attack Time Localization using Interval Queries.",
                    "SINET: Enabling Scalable Network Routing with Deep Reinforcement Learning on Partial Nodes.",
                    "Real-Time Power Profiling of Narrowband Internet of Things Networks.",
                    "Identifying Structural Hole Spanners in Online Social Networks Using Machine Learning.",
                    "Network-Aware and Unsupervised Diagnostics for Latent Issues in Network Management Databases.",
                    "Device-Aware Adaptive Video Streaming.",
                    "Smile, you are in the spotlight!",
                    "Enabling Rapid Edge System Deployment with TinyEdge.",
                    "Fast EPC: A Low Latency Cellular Control Plane.",
                    "A Light-weight Wi-Fi Fingerprint Generator with AR.",
                    "ZiFi: a lightweight Cross-Technology Communication via RSS Encoding.",
                    "Challenging the generalization capabilities of Graph Neural Networks for network modeling.",
                    "The Performance of Multi-Path TCP with Overlapping Paths.",
                    "Adaptive Fuzzy Game-based Energy Efficient Localization in Underwater Sensor Networks.",
                    "White Mirror: Leaking Sensitive Information from Interactive Netflix Movies using Encrypted Traffic Analysis.",
                    "A fast flow table engine for Open vSwitch with high performance on both lookups and updates.",
                    "Decoupling Delay and Resource Sharing Targets with Efficient Core-Stateless AQM.",
                    "Fast and Scalable Name Prefix Lookup with Hash Table.",
                    "Bounded Latency with RoCE.",
                    "Sharpening Kubernetes for the Edge.",
                    "L3VTP: A Low-Latency Live Video Transmission Platform.",
                    "Bridging the Data Charging Gap in the Cellular Edge.",
                    "DNS Negative Caching in the Wild.",
                    "Protecting OpenFlow Flow Tables with Intel SGX.",
                    "Towards an AQM Evaluation Testbed with P4 and DPDK.",
                    "λ-NIC: Interactive Serverless Compute on SmartNICs.",
                    "NFD: Using Behavior Models to Develop Cross-Platform NFs.",
                    "Sluice: Network-Wide Data Plane Programming.",
                    "Fully Functional Rate Limiter Design on Programmable Hardware Switches.",
                    "SwimTrack: Drowning Detection using RFID.",
                    "A Practical Range Encoding Scheme for TCAMs.",
                    "iTLS/iDTLS: Lightweight End-to-End Security Protocol for IoT Through Minimal Latency.",
                    "ExpressPass+: ECN-friendly Credit Reservation Congestion Control for Datacenters."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2019netai",
                "sub_name": "Proceedings of the 2019 Workshop on Network Meets AI & ML, NetAI@SIGCOMM 2019, Beijing, China, August 23, 2019.",
                "count": 13,
                "papers": [
                    "Runtime Verification of P4 Switches with Reinforcement Learning.",
                    "NetBOA: Self-Driving Network Benchmarking.",
                    "ONTAS: Flexible and Scalable Online Network Traffic Anonymization System.",
                    "Smart Prediction of the Complaint Hotspot Problem in Mobile Network.",
                    "Cracking Open the Black Box: What Observations Can Tell Us About Reinforcement Learning Agents.",
                    "DeePCCI: Deep Learning-based Passive Congestion Control Identification.",
                    "Contextual Multi-Armed Bandits for Link Adaptation in Cellular Networks.",
                    "Towards a Profiling View for Unsupervised Traffic Classification by Exploring the Statistic Features and Link Patterns.",
                    "RL-Cache: Learning-Based Cache Admission for Content Delivery.",
                    "Assisting Delay and Bandwidth Sensitive Applications in a Self-Driving Network.",
                    "UDAAN: Embedding User-Defined Analytics Applications in Network Devices.",
                    "Hierarchical Bayesian Modelling for Wireless Cellular Networks.",
                    "Verifying Deep-RL-Driven Systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2019neat",
                "sub_name": "Proceedings of the ACM SIGCOMM 2019 Workshop on Networking for Emerging Applications and Technologies, NEAT@SIGCOMM 2019, Beijing, China, August 19, 2019.",
                "count": 8,
                "papers": [
                    "KolmoLD: Data Modeling for the Modern Internet.",
                    "Analysis of Cellular Network Latency for Edge-Based Remote Rendering Streaming Applications.",
                    "Efficient Dynamic Isolation of Congestion in Lossless DataCenter Networks.",
                    "A Framework for Qualitative Communications Using Big Packet Protocol.",
                    "Toward Consistent State Management of Adaptive Programmable Networks Based on P4.",
                    "Dynamically Optimizing End-to-End Latency for Time-Triggered Networks.",
                    "Routing and Addressing with Length Variable IP Address.",
                    "Deep Learning-based Short Video Recommendation and Prefetching for Mobile Commuting Users."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2019magesys",
                "sub_name": "Proceedings of the ACM SIGCOMM 2019 Workshop on Mobile AirGround Edge Computing, Systems, Networks, and Applications, MAGESys@SIGCOMM 2019, Beijing, China, August 19, 2019.",
                "count": 7,
                "papers": [
                    "Feasibility Study of Autonomous Drone-based IoT Device Management in Indoor Environments.",
                    "Joint Optimization of UAV Placement and Caching under Battery Constraints in UAV-aided Small-Cell Networks.",
                    "Leader-Follower Formations on Real Terrestrial Robots.",
                    "Corner-3D: a RF Simulator for UAV Mobility in Smart Cities.",
                    "A Measurement Study on Edge Computing for Autonomous UAVs.",
                    "Scheduling of Distributed Collaborative Tasks on NDN based MANET.",
                    "Human-Drone Interaction: state of the art, open issues and challenges."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2019netpl",
                "sub_name": "Proceedings of the ACM SIGCOMM 2019 Workshop on Networking and Programming Languages, NetPL@SIGCOMM 2019, Beijing, China, August 23, 2019.",
                "count": 3,
                "papers": [
                    "Optimizing Data Plane Programs for the Network.",
                    "Real Time Control Plane Verification.",
                    "NV: An intermediate language for network verification."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "SIGCOMM 2018",
        "info": "Budapest, Hungary",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2018",
                "sub_name": "Proceedings of the 2018 Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2018, Budapest, Hungary, August 20-25, 2018.",
                "count": 40,
                "papers": [
                    "Inferring persistent interdomain congestion.",
                    "Sincronia: near-optimal network design for coflows.",
                    "Restructuring endpoint congestion control.",
                    "Oboe: auto-tuning video ABR algorithms to network conditions.",
                    "Internet anycast: performance, problems, & potential.",
                    "B4 and after: managing hierarchy, partitioning, and asymmetry for availability and scale in google's software-defined WAN.",
                    "On low-latency-capable topologies, and their impact on the design of intra-domain routing.",
                    "Asynchronous convergence of policy-rich distributed bellman-ford routing protocols.",
                    "Networking across boundaries: enabling wireless communication through the water-air interface.",
                    "In-body backscatter communication and localization.",
                    "PLoRa: a passive long-range data network from ambient LoRa transmissions.",
                    "A measurement study on multi-path TCP with multiple cellular carriers on high speed rails.",
                    "Masking failures from application performance in data center networks with shareable backup.",
                    "AuTO: scaling deep reinforcement learning for datacenter-scale automatic traffic optimization.",
                    "Leveraging interconnections for performance: the serving infrastructure of a large CDN.",
                    "Homa: a receiver-driven low-latency transport protocol using network priorities.",
                    "AWStream: adaptive wide-area streaming analytics.",
                    "Chameleon: scalable adaptation of video analytics.",
                    "RF-based 3D skeletons.",
                    "MUTE: bringing IoT to noise cancellation.",
                    "Hyperloop: group-based NIC-offloading to accelerate replicated transactions in multi-tenant storage systems.",
                    "Revisiting network support for RDMA.",
                    "Understanding PCIe performance for end host networking.",
                    "FBOSS: building switch software at scale.",
                    "Sonata: query-driven streaming network telemetry.",
                    "Automated synthesis of adversarial workloads for network functions.",
                    "Trident: toward a unified SDN programming framework with automatic updates.",
                    "Synchronized network snapshots.",
                    "Enabling deep-tissue networking for miniature medical devices.",
                    "Fast millimeter wave beam alignment.",
                    "Polymorphic radios: a new design paradigm for ultra-low power communication.",
                    "Chorus: truly distributed distributed-MIMO.",
                    "Control plane compression.",
                    "p4v: practical verification for programmable data planes.",
                    "Microboxes: high performance NFV with customizable, asynchronous TCP stacks and dynamic subscriptions.",
                    "Debugging P4 programs with vera.",
                    "Incentivizing censorship measurements via circumvention.",
                    "RADWAN: rate adaptive wide area network.",
                    "Elastic sketch: adaptive and fast network-wide measurements.",
                    "Sketchlearn: relieving user burdens in approximate measurement with automated statistical inference."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018p",
                "sub_name": "Proceedings of the ACM SIGCOMM 2018 Conference on Posters and Demos, SIGCOMM 2018, Budapest, Hungary, August 20-25, 2018.",
                "count": 52,
                "papers": [
                    "A Programmable Framework for Validating Data Planes.",
                    "Adaptive Network Security through Stream Machine Learning.",
                    "CircuitStart: A Slow Start For Multi-Hop Anonymity Systems.",
                    "CoFilter: A High-Performance Switch-Assisted Stateful Packet Filter.",
                    "Dynam-IX: a Dynamic Interconnection eXchange.",
                    "DynaShield: A Cost-Effective DDoS Defense Architecture.",
                    "Enabling Dense Spatial Reuse in mmWave Networks.",
                    "Equivalence and its applications to network verification.",
                    "Fast Congestion Control in RDMA-based Datacenter Networks.",
                    "Fine-Grained, Multi-Domain Network Resource Abstraction as a Fundamental Primitive to Enable High-Performance, Collaborative Data Sciences.",
                    "Flowtree: Enabling Distributed Flow Summarization at Scale.",
                    "High speed adaptive rack-scale fabrics.",
                    "High-Fidelity Interdomain Routing Experiments.",
                    "Immersion on the Edge: A Cooperative Framework for Mobile Immersive Computing.",
                    "In-band Network Function Telemetry.",
                    "KeySched: Timeslot-based Hot Key Scheduling for Load Balancing in Key-Value Store.",
                    "Modeling IP-to-IP Communication using the Weighted Stochastic Block Model.",
                    "Filtering Spoofed IP Traffic Using Switching ASICs.",
                    "Observing Network Handovers with Multipath TCP.",
                    "On the Potential of BGP Flowspec for DDoS Mitigation at Two Sources: ISP and IXP.",
                    "Operating a DNS-based Active Internet Observatory.",
                    "PAM: When Overloaded, Push Your Neighbor Aside!",
                    "perfbench: A Tool for Predictability Analysis in Multi-Tenant Software-Defined Networks.",
                    "Polyraptor: Embracing Path and Data Redundancy in Data Centres for Efficient Data Transport.",
                    "Poster: Towards a Collaborative and Retrospective Understanding of Security Events with Retro-Future.",
                    "RawPower: Deep Learning based Anomaly Detection from Raw Network Traffic Measurements.",
                    "Redundant Logic Elimination in Network Functions.",
                    "Revealing Hidden Hierarchical Heavy Hitters in network traffic.",
                    "Scalable Surface Reconstruction in the Mobile Edge.",
                    "SFP: Toward Interdomain Routing for SDN Networks.",
                    "SN-FFC: Improving Survivability of LEO Satellite Network with Forward Fault Correction.",
                    "The Case for a Rackless Data Center Network Architecture.",
                    "vNS: a modular programmable virtual network switch.",
                    "A Fully Portable TCP Implementation Using XFSMs.",
                    "A large-scale demonstration of SDN-based handover management in IEEE 802.11 networks.",
                    "A practical method for measuring Web above-the-fold time.",
                    "Accelerating Linux Security with eBPF iptables.",
                    "BB-Gen: A Packet Crafter for P4 Target Evaluation.",
                    "Blockchain-based Decentralized Applications meet Multi-Administrative Domain Networking.",
                    "CLICK-UP: Towards Software Upgrades of Click-driven Stateful Network Elements.",
                    "Controlling Drones from 5G Networks.",
                    "Controlling Real Cloud Experiments from BGP to the Server (and Back).",
                    "Design of SOCKS Version 6.",
                    "Exploring various use cases for IPv6 Segment Routing.",
                    "Fair dropping for multi-resource fairness in software routers Extended Abstract.",
                    "FENDE: Marketplace and Federated Ecosystem for the Distribution and Execution of VNFs.",
                    "High-speed per-flow software monitoring with limited resources.",
                    "Muses: Enabling Lightweight and Diversity for Learning Based Congestion Control.",
                    "Overbooking Network Slices End-to-End: Implementation and Demonstration.",
                    "Policy Injection: A Cloud Dataplane DoS Attack.",
                    "ShadowP4: Building and Testing Modular Programs.",
                    "Testing IDS using GENESIDS: Realistic Mixed Traffic Generation for IDS Evaluation."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018netai",
                "sub_name": "Proceedings of the 2018 Workshop on Network Meets AI & ML, NetAI@SIGCOMM 2018, Budapest, Hungary, August 24, 2018.",
                "count": 12,
                "papers": [
                    "HiPS: Hierarchical Parameter Synchronization in Large-Scale Distributed Machine Learning.",
                    "DeepConf: Automating Data Center Network Topologies Management with Machine Learning.",
                    "Empowering Sketches with Machine Learning for Network Measurements.",
                    "Efficient Distribution-Derived Features for High-Speed Encrypted Flow Classification.",
                    "Adaptive Multiple Non-negative Matrix Factorization for Temporal Link Prediction in Dynamic Networks.",
                    "Tracking Groups in Mobile Network Traces.",
                    "Wireless Optimisation via Convex Bandits: Unlicensed LTE/WiFi Coexistence.",
                    "DeepCache: A Deep Learning Based Framework For Content Caching.",
                    "IFS-RL: An Intelligent Forwarding Strategy Based on Reinforcement Learning in Named-Data Networking.",
                    "Improving TCP Congestion Control with Machine Intelligence.",
                    "Deep-Q: Traffic-driven QoS Inference using Deep Generative Network.",
                    "Assessing the Impact of Network Events with User Feedback."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018selfdn",
                "sub_name": "Proceedings of the Afternoon Workshop on Self-Driving Networks, SelfDN@SIGCOMM 2018, Budapest, Hungary, August 24, 2018.",
                "count": 6,
                "papers": [
                    "On Analyzing Self-Driving Networks: A Systems Thinking Approach.",
                    "Empowering Self-Driving Networks.",
                    "Refining Network Intents for Self-Driving Networks.",
                    "Catching the Microburst Culprits with Snappy.",
                    "Automatic Life Cycle Management of Network Configurations.",
                    "Automated Detection and Mitigation of Application-level Asymmetric DoS Attacks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018vrarn",
                "sub_name": "Proceedings of the 2018 Morning Workshop on Virtual Reality and Augmented Reality Network, VR/AR Network@SIGCOMM 2018, Budapest, Hungary, August 24, 2018.",
                "count": 5,
                "papers": [
                    "Adaptive Fog-Based Output Security for Augmented Reality.",
                    "Supporting Augmented Reality: Looking Beyond Performance.",
                    "Smart Streaming of Panoramic Videos.",
                    "Predictive View Generation to Enable Mobile 360-degree and VR Experiences.",
                    "Joint Rate and FoV adaptation in immersive video streaming."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018big-dama",
                "sub_name": "Proceedings of the 2018 Workshop on Big Data Analytics and Machine Learning for Data Communication Networks, Big-DAMA@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 8,
                "papers": [
                    "Stream-based Machine Learning for Network Security and Anomaly Detection.",
                    "Finding Anomalies in Network System Logs with Latent Variables.",
                    "Telemetry-based stream-learning of BGP anomalies.",
                    "NetSlicer: Automated and Traffic-Pattern Based Application Clustering in Datacenters.",
                    "Data Analytics Service Composition and Deployment on Edge Devices.",
                    "Deep Learning IP Network Representations.",
                    "Learning and Generating Distributed Routing Protocols Using Graph-Based Deep Learning.",
                    "Understanding the Modeling of Computer Network Delays using Neural Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018netcompute",
                "sub_name": "Proceedings of the 2018 Morning Workshop on In-Network Computing, NetCompute@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 6,
                "papers": [
                    "In-network computing to the rescue of faulty links.",
                    "MP-HULA: Multipath Transport Aware Load Balancing Using Programmable Data Planes.",
                    "Towards In-Network Industrial Feedback Control.",
                    "Can the Network be the AI Accelerator?",
                    "Infinite Resources for Optimistic Concurrency Control.",
                    "P4CEP: Towards In-Network Complex Event Processing."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018neat",
                "sub_name": "Proceedings of the 2018 Workshop on Networking for Emerging Applications and Technologies, NEAT@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 9,
                "papers": [
                    "Bridging the ICN Deployment Gap with IPoC: An IP-over-ICN protocol for 5G Networks.",
                    "Data-driven Approaches to Edge Caching.",
                    "FEC Killed The Cut-Through Switch.",
                    "A New Framework and Protocol for Future Networking Applications.",
                    "Open Carrier Interface: An Open Source Edge Computing Framework.",
                    "A Distributed Core Network Architecture for 5G Systems and Beyond.",
                    "AIRCoN-Stack - Introducing Flexibility to Wireless Industrial Real-Time Applications.",
                    "Fast network congestion detection and avoidance using P4.",
                    "Supporting Emerging Applications With Low-Latency Failover in P4."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018secson",
                "sub_name": "Proceedings of the 2018 Workshop on Security in Softwarized Networks: Prospects and Challenges, SecSoN@SIGCOMM 2018, Budapest, Hungary, August 24, 2018.",
                "count": 8,
                "papers": [
                    "Virtual Network Isolation: Are We There Yet?",
                    "Practical Authentication and Access Control for Software-Defined Networking over Optical Networks.",
                    "Trust Modelling in 5G mobile networks.",
                    "AEGIS: An Automated Permission Generation and Verification System for SDNs.",
                    "Offloading Security Services to the Cloud Infrastructure.",
                    "HEX Switch: Hardware-assisted security extensions of OpenFlow.",
                    "Preventing Malicious SDN Applications From Hiding Adverse Network Manipulations.",
                    "High-coverage testing of softwarized networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018mecomm",
                "sub_name": "Proceedings of the 2018 Workshop on Mobile Edge Communications, MECOMM@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 8,
                "papers": [
                    "CESSNA: Resilient Edge-Computing.",
                    "Anveshak: Placing Edge Servers In The Wild.",
                    "Joint Allocation of Computing and Wireless Resources to Autonomous Devices in Mobile Edge Computing.",
                    "CABaRet: Leveraging Recommendation Systems for Mobile Edge Caching.",
                    "ARVE: Augmented Reality Applications in Vehicle to Edge Networks.",
                    "Edge Intelligence: On-Demand Deep Learning Model Co-Inference with Device-Edge Synergy.",
                    "Edge-assisted Traffic Engineering and applications in the IoT.",
                    "Deployment Characteristics of \"The Edge\" in Mobile Edge Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018iotsp",
                "sub_name": "Proceedings of the 2018 Workshop on IoT Security and Privacy, IoT S&P@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 8,
                "papers": [
                    "Combining MUD Policies with SDN for IoT Intrusion Detection.",
                    "Clear as MUD: Generating, Validating and Applying IoT Behavioral Profiles.",
                    "Towards a Resilient Smart Home.",
                    "Traversing the Quagmire that is Privacy in your Smart Home.",
                    "Web-based Attacks to Discover and Control Local IoT Devices.",
                    "IP-Based IoT Device Detection.",
                    "A Developer-Friendly Library for Smart Home IoT Privacy-Preserving Traffic Obfuscation.",
                    "Towards Secure Distributed Trust Management on a Global Scale: An analytical approach for applying Distributed Ledgers for authorization in the IoT."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018kbnets",
                "sub_name": "Proceedings of the 2018 Afternoon Workshop on Kernel Bypassing Networks, KBNets@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 4,
                "papers": [
                    "Circuit Switched VM Networks for Zero-Copy IO.",
                    "A Formally Verified NAT Stack.",
                    "Flow control for Latency-Critical RPCs.",
                    "Hash Table Design and Optimization for Software Virtual Switches."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2018wtmc",
                "sub_name": "Proceedings of the 2018 Workshop on Traffic Measurements for Cybersecurity, WTMC@SIGCOMM 2018, Budapest, Hungary, August 20, 2018.",
                "count": 8,
                "papers": [
                    "Measuring the Impact of a Successful DDoS Attack on the Customer Behaviour of Managed DNS Service Providers.",
                    "How Media Reports Trigger Copycats: An Analysis of the Brewing of the Largest Packet Storm to Date.",
                    "Leveraging Controlled Information Sharing for Botnet Activity Detection.",
                    "Beyond Telnet: Prevalence of IoT Protocols in Telescope and Honeypot Measurements.",
                    "Evaluating the Impact of Traffic Sampling on AATAC's DDoS Detection.",
                    "BIGMOMAL: Big Data Analytics for Mobile Malware Detection.",
                    "Speculating Incident Zone System on Local Area Networks.",
                    "How to Test an IDS?: GENESIDS: An Automated System for Generating Attack Traffic."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "SIGCOMM 2017",
        "info": "Los Angeles, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2017",
                "sub_name": "Proceedings of the Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2017, Los Angeles, CA, USA, August 21-25, 2017.",
                "count": 36,
                "papers": [
                    "dRMT: Disaggregated Programmable Switching.",
                    "SilkRoad: Making Stateful Layer-4 Load Balancing Fast and Cheap Using Switching ASICs.",
                    "Re-architecting datacenter networks and stacks for low latency and high performance.",
                    "NFP: Enabling Network Function Parallelism in NFV.",
                    "Dynamic Service Chaining with Dysco.",
                    "NFVnice: Dynamic Backpressure and Scheduling for NFV Service Chains.",
                    "Language-Directed Hardware Design for Network Performance Monitoring.",
                    "Quantitative Network Monitoring with NetQRE.",
                    "SketchVisor: Robust Network Measurement for Software Packet Processing.",
                    "Constant Time Updates in Hierarchical Heavy Hitters.",
                    "A Formally Verified NAT.",
                    "A General Approach to Network Configuration Verification.",
                    "Pretzel: Email encryption and provider-supplied functions are compatible.",
                    "The QUIC Transport Protocol: Design and Internet-Scale Deployment.",
                    "Neural Adaptive Video Streaming with Pensieve.",
                    "Disk|Crypt|Net: rethinking the stack for high-performance video streaming.",
                    "DRILL: Micro Load Balancing for Low-latency Data Center Networks.",
                    "Credit-Scheduled Delay-Bounded Congestion Control for Datacenters.",
                    "Resilient Datacenter Load Balancing in the Wild.",
                    "RotorNet: A Scalable, Low-complexity, Optical Datacenter Network.",
                    "Beyond fat-trees without antennae, mirrors, and disco-balls.",
                    "A Tale of Two Topologies: Exploring Convertible Data Center Network Architectures with Flat-tree.",
                    "Empowering Low-Power Wide Area Networks in Urban Settings.",
                    "Wi-Fi Goes to Town: Rapid Picocell Switching for Wireless Transit Networks.",
                    "Drone Relays for Battery-Free Networks.",
                    "A High Performance Packet Core for Next Generation Cellular Networks.",
                    "Understanding and Mitigating Packet Corruption in Data Center Networks.",
                    "Who is Fiddling with Prices?: Building and Deploying a Watchdog Service for E-commerce.",
                    "Vroom: Accelerating the Mobile Web with Server-Aided Dependency Resolution.",
                    "Carousel: Scalable Traffic Shaping at End Hosts.",
                    "Engineering Egress with Edge Fabric: Steering Oceans of Content to the World.",
                    "Taking the Edge off with Espresso: Scale, Reliability and Programmability for Global Internet Peering.",
                    "Detecting Peering Infrastructure Outages in the Wild.",
                    "SWIFT: Predictive Fast Reroute.",
                    "Bootstrapping evolvability for inter-domain routing with D-BGP.",
                    "The Impact of Router Outages on the AS-level Internet."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017p",
                "sub_name": "Posters and Demos Proceedings of the Conference of the ACM Special Interest Group on Data Communication, SIGCOMM 2017, Los Angeles, CA, USA, August 21-25, 2017.",
                "count": 52,
                "papers": [
                    "Boosting the BGP Convergence in SDXes with SWIFT.",
                    "Automatic Custom Generation of Topologies and Configuration of Routing protocols in SDN.",
                    "Privacy-Preserving Detection of Inter-Domain SDN Rules Overlaps.",
                    "Quick Incremental Routing Logic for Dynamic Network Graphs.",
                    "Gather: A Way to Optimize the Routing Process of In-band Control Network.",
                    "SDN/NFV-enabled Security Architecture for Fine-grained Policy Enforcement and Threat Mitigation for Enterprise Networks.",
                    "HERO: A Hybrid Electrical and Optical Multicast for Accelerating High-Performance Data Center Applications.",
                    "Cooperative Active Distribution of Videos in Telco-CDNs.",
                    "Enhancing Mobile Video Delivery over an Heterogeneous Network Access with Information-Centric Networking.",
                    "A Case for Information Centric Networking For Smart Grid Communications.",
                    "Towards Zero Copy Dataflows using RDMA.",
                    "uniprof: A Unikernel Stack Profiler.",
                    "SymPerf: Predicting Network Function Performance.",
                    "Network Data Monetization Using Net2Vec.",
                    "Closing the Network Diagnostics Gap with Vigil.",
                    "Demystifying Hardware Bottlenecks in Mobile Web Quality of Experience.",
                    "Ruru: High-speed, Flow-level Latency Measurement and Visualization of Live Internet Traffic.",
                    "AS Hegemony: A Robust Metric for AS Centrality.",
                    "The Implications of Twitterbot Generated Data Traffic on Networked Systems.",
                    "Characterizing the Click and Share Dynamics of Micro-Videos in Social Media.",
                    "Demonstration of the Marple System for Network Performance Monitoring.",
                    "LDplayer: DNS Experimentation at Scale.",
                    "The Root Canary: Monitoring and Measuring the DNSSEC Root Key Rollover.",
                    "TIDE: Threat Identification Using Active DNS Measurements.",
                    "Authentication-Bypass Vulnerabilities in SOHO Routers.",
                    "A Demonstration of the DeDoS Platform for Defusing Asymmetric DDoS Attacks in Data Centers.",
                    "DPS-Discuss: Demonstrating Decentralized, Pseudonymous, Sybil-resistant Communication.",
                    "Towards Distributed Threat Intelligence in Real-Time.",
                    "WVCC: Weighted Virtual Congestion Control for Datacenter Networks.",
                    "3D Fabric: Differential Deceleration and Detour for Congestion Free Data Center Networks.",
                    "Rethinking TCP Throughput and Latency Modeling.",
                    "TCP Proxy Bypass: All the Gain with No Pain!",
                    "HARMLESS: Cost-Effective Transitioning to SDN.",
                    "Network-Assisted Raft Consensus Algorithm.",
                    "Making the Data Plane Ready for NFV: An Effective Way of Handling Resources.",
                    "ClickP4: Towards Modular Programming of P4.",
                    "Sandboxing Data Plane Programs for Fun and Profit.",
                    "NS4: A P4-driven Network Simulator.",
                    "CacheP4: A Behavior-level Caching Mechanism for P4.",
                    "Wi-Fi Goes to Town: Rapid Picocell Switching for Wireless Transit Networks.",
                    "Deploy a 5G Network in Less Than 5 Minutes.",
                    "Fine-grained RFID Localization via Ultra-wideband Emulation.",
                    "Time Synchronization in a Network of Bluetooth Low Energy Beacons.",
                    "Cognitive IoT Gateways: Automatic Task Sharing and Switching between Cloud and Edge/Fog Computing.",
                    "Enabling Fine-Grained Edge Offloading for IoT.",
                    "Use of Cuckoo Filters with FD.io VPP for Software IPv6 Routing Lookup.",
                    "bitFA: A Novel Data Structure for Fast and Update-friendly Regular Expression Matching.",
                    "Stateful Layer-4 Load Balancing in Switching ASICs.",
                    "BLOP: Batch-Level Order Preserving for GPU-Accelerated Packet Processing.",
                    "Is it a SmartNIC or a Key-Value Store?: Both!",
                    "FTGuard: A Priority-Aware Strategy Against the Flow Table Overflow Attack in SDN.",
                    "Safeguarding VNF Credentials with Intel SGX."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017iqoe",
                "sub_name": "Proceedings of the 2017 Workshop on QoE-based Analysis and Management of Data Communication Networks, Internet-QoE@SIGCOMM 2017, Los Angeles, CA, USA, August 21, 2017.",
                "count": 7,
                "papers": [
                    "A QoE Perspective on HTTP/2 Server Push.",
                    "PAIN: A Passive Web Speed Indicator for ISPs.",
                    "Perceived Performance of Top Retail Webpages In the Wild: Insights from Large-scale Crowdsourcing of Above-the-Fold QoE.",
                    "Server and Content Selection for MPEG DASH Video Streaming with Client Information.",
                    "On the Bitrate Adaptation of Shared Media Experience Services.",
                    "On Active Sampling of Controlled Experiments for QoE Modeling.",
                    "Designing a Survey Tool for Monitoring Enterprise QoE."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017kbnets",
                "sub_name": "Proceedings of the Workshop on Kernel-Bypass Networks, KBNets@SIGCOMM 2017, Los Angeles, CA, USA, August 21, 2017.",
                "count": 9,
                "papers": [
                    "LogMemcached: An RDMA based Continuous Cache Replication.",
                    "Accelerating Open vSwitch with Integrated GPU.",
                    "VIRTIO-USER: A New Versatile Channel for Kernel-Bypass Networks.",
                    "Towards a Scalable Modular QUIC Server.",
                    "RoCE Rocks without PFC: Detailed Evaluation.",
                    "Sharing CPUs via Endpoint Congestion Control.",
                    "How to Measure the Killer Microsecond.",
                    "Performance Isolation Anomalies in RDMA.",
                    "Design Challenges for High Performance, Scalable NFV Interconnects."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017mecomm",
                "sub_name": "Proceedings of the Workshop on Mobile Edge Communications, MECOMM@SIGCOMM 2017, Los Angeles, CA, USA, August 21, 2017.",
                "count": 10,
                "papers": [
                    "Virtualization and Programmability in Mobile Wireless Networks: Architecture and Resource Management.",
                    "Information-Centric Mobile Edge Computing for Connected Vehicle Environments: Challenges and Research Directions.",
                    "Wi-Stitch: Content Delivery in Converged Edge Networks.",
                    "Managing Data in Computational Edge Clouds.",
                    "Mobility-based Proactive Multicast for Seamless Mobility Support in Cellular Network Environments.",
                    "Optimization of Webpage Downloading Performance with Content-aware Mobile Edge Computing.",
                    "Realization of CDMA-based IoT Services with Shared Band Operation of LTE in 5G.",
                    "Geo-partitioning of MEC Resources.",
                    "RAERA: A Robust Auctioning Approach for Edge Resource Allocation.",
                    "SDLB: A Scalable and Dynamic Software Load Balancer for Fog and Mobile Edge Computing."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017rep",
                "sub_name": "Proceedings of the Reproducibility Workshop, Reproducibility@SIGCOMM 2017, Los Angeles, CA, USA, August 25, 2017.",
                "count": 7,
                "papers": [
                    "Challenges with Reproducibility.",
                    "Towards an Ecosystem for Reproducible Research in Computer Networking.",
                    "Learning Reproducibility with a Yearly Networking Contest.",
                    "Taming the Complexity of Artifact Reproducibility.",
                    "A Meta-Analysis Approach for Feature Selection in Network Traffic Research.",
                    "Lessons Learned while Trying to Reproduce the OpenRF Experiment.",
                    "Testbeds Support for Reproducible Research."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017vrarn",
                "sub_name": "Proceedings of the Workshop on Virtual Reality and Augmented Reality Network, VR/AR Network@SIGCOMM 2017, Los Angeles, CA, USA, August 25, 2017.",
                "count": 8,
                "papers": [
                    "Characterization of 360-degree Videos.",
                    "VR Video Conferencing over Named Data Networks.",
                    "Prioritized Buffer Control in Two-tier 360 Video Streaming.",
                    "Ultra Wide View Based Panoramic VR Streaming.",
                    "On the Networking Challenges of Mobile Augmented Reality.",
                    "VR is on the Edge: How to Deliver 360° Videos in Mobile Networks.",
                    "VR/AR Immersive Communication: Caching, Edge Computing, and Transmission Trade-Offs.",
                    "Delivering Deep Learning to Mobile Devices via Offloading."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017big-dama",
                "sub_name": "Proceedings of the Workshop on Big Data Analytics and Machine Learning for Data Communication Networks, Big-DAMA@SIGCOMM 2017, Los Angeles, CA, USA, August 21, 2017.",
                "count": 9,
                "papers": [
                    "Ensemble-learning Approaches for Network Security and Anomaly Detection.",
                    "Cluster-Based Load Balancing for Better Network Security.",
                    "Net2Vec: Deep Learning for the Network.",
                    "o'zapft is: Tap Your Network Algorithm's Big Data!",
                    "Hierarchical IP flow clustering.",
                    "NETPerfTrace: Predicting Internet Path Dynamics and Performance with Machine Learning.",
                    "Neural Network Based Wavelength Assignment in Optical Switching.",
                    "Call Detail Records for Human Mobility Studies: Taking Stock of the Situation in the \"Always Connected Era\".",
                    "Users' Fingerprinting Techniques from TCP Traffic."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017mobiarch",
                "sub_name": "Proceedings of the Workshop on Mobility in the Evolving Internet Architecture, MobiArch@SIGCOMM 2017, Los Angeles, CA, USA, August 25, 2017.",
                "count": 8,
                "papers": [
                    "BlueSkyNet: BLE Multi-Hop Network Management Architecture.",
                    "A NEAT Approach to Mobile Communication.",
                    "Popularity-aware Intra-domain Mobility Management.",
                    "A Robust Sign Language Recognition System with Multiple Wi-Fi Devices.",
                    "Privacy-preserving Quantified Self: Secure Sharing and Processing of Encrypted Small Data.",
                    "DICE: Dynamic Multi-RAT Selection in the ICN-enabled Wireless Edge.",
                    "The Named-Object Abstraction for Realizing Advanced Mobility Services in the Future Internet.",
                    "Receiver Mobility in Vehicular Named Data Networking."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2017hotconnet",
                "sub_name": "Proceedings of the Workshop on Hot Topics in Container Networking and Networked Systems, HotConNet@SIGCOMM 2017, Los Angeles, CA, USA, August 25, 2017.",
                "count": 8,
                "papers": [
                    "Performance of Container Networking Technologies.",
                    "The Grand CRU Challenge.",
                    "Contain-ed: An NFV Micro-Service System for Containing e2e Latency.",
                    "Reproducible Distributed Clusters with Mutable Containers: To Minimize Cost and Provisioning Time.",
                    "Container-based Emulation of Network Control Plane.",
                    "Characterizing Docker Overhead in Mobile Edge Computing Scenarios.",
                    "FADES: Fine-Grained Edge Offloading with Unikernels.",
                    "A Framework based on SDN and Containers for Dynamic Service Chains on IoT Gateways."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "SIGCOMM 2016",
        "info": "Florianopolis, Brazil",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2016",
                "sub_name": "Proceedings of the ACM SIGCOMM 2016 Conference, Florianopolis, Brazil, August 22-26, 2016.",
                "count": 78,
                "papers": [
                    "ClickNP: Highly flexible and High-performance Network Processing with Reconfigurable Hardware.",
                    "Packet Transactions: High-Level Programming for Line-Rate Switches.",
                    "SNAP: Stateful Network-Wide Abstractions for Packet Processing.",
                    "Programmable Packet Scheduling at Line Rate.",
                    "Evolve or Die: High-Availability Design Principles Drawn from Googles Network Infrastructure.",
                    "Dynamic Pricing and Traffic Engineering for Timely Inter-Datacenter Transfers.",
                    "Optimizing Bulk Transfers with Software-Defined Optical WAN.",
                    "One Sketch to Rule Them All: Rethinking Network Flow Monitoring with UnivMon.",
                    "The Good, the Bad, and the Differences: Better Network Diagnostics with Differential Provenance.",
                    "Trumpet: Timely and Precise Triggers in Data Centers.",
                    "2DFQ: Two-Dimensional Fair Queuing for Multi-Tenant Cloud Services.",
                    "CODA: Toward Automatically Identifying and Scheduling Coflows in the Dark.",
                    "Scheduling Mix-flows in Commodity Datacenters with Karuna.",
                    "NUMFabric: Fast and Flexible Bandwidth Allocation in Datacenters.",
                    "RDMA over Commodity Ethernet at Scale.",
                    "ProjecToR: Agile Reconfigurable Data Center Interconnect.",
                    "Virtualized Congestion Control.",
                    "AC/DC TCP: Virtual Congestion Control Enforcement for Datacenter Networks.",
                    "WebPerf: Evaluating What-If Scenarios for Cloud-hosted Web Applications.",
                    "CS2P: Improving Video Bitrate Selection and Adaptation with Data-Driven Throughput Prediction.",
                    "Via: Improving Internet Telephony Call Quality Using Predictive Relay Selection.",
                    "Fast Control Plane Analysis Using an Abstract Representation.",
                    "SymNet: Scalable symbolic execution for modern networks.",
                    "Don't Mind the Gap: Bridging Network-wide Objectives and Device-level Configurations.",
                    "Jumpstarting BGP Security with Path-End Validation.",
                    "Inter-Technology Backscatter: Towards Internet Connectivity for Implanted Devices.",
                    "Enabling Practical Backscatter Communication for On-body Sensors.",
                    "Braidio: An Integrated Active-Passive Radio for Mobile Devices with Asymmetric Energy Budgets.",
                    "Eliminating Channel Feedback in Next-Generation Cellular Networks.",
                    "Real-time Distributed MIMO Systems.",
                    "Robotron: Top-down Network Management at Facebook Scale.",
                    "Taking the Blame Game out of Data Centers Operations with NetPoirot.",
                    "Globally Synchronized Time via Datacenter Networks.",
                    "An Internet-Wide Analysis of Traffic Policing.",
                    "Neutral Net Neutrality.",
                    "The Deforestation of L2.",
                    "OpenBox: A Software-Defined Framework for Developing, Deploying, and Managing Network Functions.",
                    "PISCES: A Programmable, Protocol-Independent Software Switch.",
                    "Dataplane Specialization for High-performance OpenFlow Software Switching.",
                    "PieBridge: A Cross-DR scale Large Data Transmission Scheduling System.",
                    "Best Effort Task Scheduling for Data Parallel Jobs.",
                    "A Longitudinal Analysis of .i2p Leakage in the Public DNS Infrastructure.",
                    "Application-specific Acceleration Framework for Mobile Applications.",
                    "Performance Evaluation of Locator/Identifier Separation Protocol through RIPE Atlas.",
                    "TafLoc: Time-adaptive and Fine-grained Device-free Localization with Little Cost.",
                    "Efficient Remapping of Internet Routing Events.",
                    "A First Look into Transnational Routing Detours.",
                    "PathCache: A Path Prediction Toolkit.",
                    "Privacy-Aware Infrastructure for Managing Personal Data.",
                    "Named Data Networking Based Smart Home Lighting.",
                    "Conan: Content-aware Access Network Flow Scheduling to Improve QoE of Home Users.",
                    "Horse: towards an SDN traffic dynamics simulator for large scale networks.",
                    "FAST: A Simple Programming Abstraction for Complex State-Dependent SDN Programming.",
                    "SLA-NFV: an SLA-aware High Performance Framework for Network Function Virtualization.",
                    "Building Application-Aware Network Environments using SDN for Optimizing Hadoop Applications.",
                    "Achieving Consistent SDN Control With Declarative Applications.",
                    "Modular SDN Compiler Design with Intermediate Representation.",
                    "Rethinking the Design of OpenFlow Switch Counters.",
                    "Taming the Flow Table Overflow in OpenFlow Switch.",
                    "Magellan: Generating Multi-Table Datapath from Datapath Oblivious Algorithmic SDN Policies.",
                    "Source Address Validation in Software Defined Networks.",
                    "Towards Transiently Secure Updates in Asynchronous SDNs.",
                    "Cases for Including a Reference Monitor to SDN.",
                    "Roaming Edge vNFs using Glasgow Network Functions.",
                    "A Transparent Highway for inter-Virtual Network Function Communication with Open vSwitch.",
                    "Modeling Native Software Components as Virtual Network Functions.",
                    "Mininet-WiFi: A Platform for Hybrid Physical-Virtual Software-Defined Wireless Networking Research.",
                    "Off-the-Shelf Software-defined Wi-Fi Networks.",
                    "Enabling Backscatter Communication among Commodity WiFi Radios.",
                    "Multi-Domain Orchestration across RAN and Transport for 5G.",
                    "EasyApp: A Cross-platform Mobile Applications Development Environment Based on OSGi.",
                    "Application Driven Network: providing On-Demand Services for Applications.",
                    "Fibbing in action: On-demand load-balancing for better video delivery.",
                    "Capture and Replay: Reproducible Network Experiments in Mininet.",
                    "MACSAD: Multi-Architecture Compiler System for Abstract Dataplanes (aka Partnering P4 with ODP).",
                    "ARTEMIS: Real-Time Detection and Automatic Mitigation for BGP Prefix Hijacking.",
                    "A 60Gbps DPI Prototype based on Memory-Centric FPGA.",
                    "High speed packet forwarding compiled from protocol independent data plane specifications."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2016lancomm",
                "sub_name": "Proceedings of the 2016 workshop on Fostering Latin-American Research in Data Communication Networks, LANCOMM@SIGCOMM 2016, Florianopolis, Brazil, August 22-26, 2016.",
                "count": 19,
                "papers": [
                    "Big-DAMA: Big Data Analytics for Network Traffic Monitoring and Analysis.",
                    "Hidden Internet topologies info: Truth or Myth?",
                    "Should I Wait or Should I Push? A Performance Analysis of Push Feature in HTTP/2 Connections.",
                    "Looking for Network Latency Clusters in the LAC Region.",
                    "WhatsApp Calling: a Revised Analysis on WhatsApp's Architecture and Calling Service.",
                    "A Preliminary Performance Measurement Study of Residential Broadband Services in Brazil.",
                    "SDN-based Overlay Networks for QoS-aware Routing.",
                    "Metherxis: Virtualized Network Functions for Micro-second Grade Latency Measurements.",
                    "RAUflow: building Virtual Private Networks with MPLS and OpenFlow.",
                    "A Datacenter Network Architecture for Low Latency, Automation and Virtualization.",
                    "Dynamic Backhauling within Converged Networks.",
                    "Avoiding Voice Traffic Degradation in IP Enterprise Networks Using CAoS.",
                    "Improving performance of multiple-level cache systems.",
                    "Cognitive Radio Networks: Analysis of a Paid-Sharing Approach based on a Fluid Model.",
                    "Analysing Costs and Benefits of Content Sharing in Cloud Storage.",
                    "Computing a Precise Timeout Interval Despite a Communication Channel with Varying Behavior.",
                    "Network Monitoring with Imperfect Tests.",
                    "Improving delivery delay in social-based message forwarding in Delay Tolerant Networks.",
                    "Adopting security routines in legacy organizations."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2016iqoe",
                "sub_name": "Proceedings of the 2016 workshop on QoE-based Analysis and Management of Data Communication Networks, Internet-QoE@SIGCOMM 2016, Florianopolis, Brazil, August 22-26, 2016.",
                "count": 10,
                "papers": [
                    "An Educated Guess on QoE in Operational Networks through Large-Scale Measurements.",
                    "Impact of Access Speed on Adaptive Video Streaming Quality: A Passive Perspective.",
                    "Predicting the effect of home Wi-Fi quality on Web QoE.",
                    "QoE Inference Without Application Control.",
                    "QoE Analysis of DASH Cross-Layer Dependencies by Extensive Network Emulation.",
                    "Towards a causal analysis of Video QoE from Network and Application QoS.",
                    "Measuring the Quality of Experience of Web users.",
                    "BingeOn Under the Microscope: Understanding T-Mobiles Zero-Rating Implementation.",
                    "Concept for Client-initiated Selection of Cloud Instances for Improving QoE of Distributed Cloud Services.",
                    "Client-Driven Network-level QoE fairness for Encrypted 'DASH-S'."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2016gaia",
                "sub_name": "Proceedings of the 2016 workshop on Global Access to the Internet for All, Florianopolis, Brazil, August 22-26, 2016.",
                "count": 6,
                "papers": [
                    "Will 5G See its Blind Side? Evolving 5G for Universal Internet Access.",
                    "A Techno-Economic Framework for Broadband Deployment in Underserved Areas.",
                    "Open and regionalised spectrum repositories for emerging countries.",
                    "Tangible Sharing, Invisible Mechanisms: The Design and Implementation of the BayanihaNets Access Sharing Network.",
                    "RemIX: A Distributed Internet Exchange for Remote and Rural Networks.",
                    "Making Community Networks economically sustainable, the guifi.net experience."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2016hotmiddlebox",
                "sub_name": "Proceedings of the ACM SIGCOMM Workshop on Hot topics in Middleboxes and Network Function Virtualization, HotMiddlebox@SIGCOMM 2016, Florianopolis, Brazil, August, 2016.",
                "count": 9,
                "papers": [
                    "Light at the middle of the tunnel: middleboxes for selective disclosure of network monitoring to distrusted parties.",
                    "SplitBox: Toward Efficient Private Network Function Virtualization.",
                    "Measurement Based Fair Queuing for Allocating Bandwidth to Virtual Machines.",
                    "Datacenter Scale Load Balancing for Multipath Transport.",
                    "OpenNetVM: A Platform for High Performance Network Service Chains.",
                    "Adaptive Service-Chain Routing for Virtual Network Functions in Software-Defined Networks.",
                    "A Standardized Southbound API for VNF Management.",
                    "On the Fly TCP Acceleration with Miniproxy.",
                    "CliMB: Enabling Network Function Composition with Click Middleboxes."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "SIGCOMM 2015",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2015",
                "sub_name": "Proceedings of the 2015 ACM Conference on Special Interest Group on Data Communication, SIGCOMM 2015, London, United Kingdom, August 17-21, 2015.",
                "count": 88,
                "papers": [
                    "BwE: Flexible, Hierarchical Bandwidth Allocation for WAN Distributed Computing.",
                    "A Declarative and Expressive Approach to Control Forwarding Paths in Carrier-Grade Networks.",
                    "PGA: Using Graphs to Express and Automatically Reconcile Network Policies.",
                    "Central Control Over Distributed Routing.",
                    "Poptrie: A Compressed Trie with Population Count for Fast and Scalable Software IP Routing Table Lookup.",
                    "How to Bid the Cloud.",
                    "Coracle: Evaluating Consensus at the Internet Edge.",
                    "Challenging Entropy-based Anomaly Detection and Diagnosis in Cellular Networks.",
                    "Toward Automated Testing of Geo-Distributed Replica Selection Algorithms.",
                    "The Internet of Names: A DNS Big Dataset.",
                    "BitMiner: Bits Mining in Internet Traffic Classification.",
                    "Coarse-grained Scheduling with Software-Defined Networking Switches.",
                    "FlyCast: Free-Space Optics Accelerating Multicast Communications in Physical Layer.",
                    "Analysis of Game Bot's Behavioral Characteristics in Social Interaction Networks of MMORPG.",
                    "Could End System Caching and Cooperation Replace In-Network Caching in CCN?",
                    "Yo-Yo Attack: Vulnerability In Auto-scaling Mechanism.",
                    "Towards the 5G Revolution: A Software Defined Network Architecture Exploiting Network Coding as a Service.",
                    "RPKI MIRO: Monitoring and Inspection of RPKI Objects.",
                    "WiMAC: Rapid Implementation Platform for User Definable MAC Protocols Through Separation.",
                    "Extreme Web Caching for Faster Web Browsing.",
                    "i-tee: A fully automated Cyber Defense Competition for Students.",
                    "See How ISPs Care: An RPKI Validation Extension for Web Browsers.",
                    "Programming the Home and Enterprise WiFi with OpenSDWN.",
                    "A Real-time 802.11 Compatible Distributed MIMO System.",
                    "Sub-Nanosecond Time of Flight on Commercial Wi-Fi Cards.",
                    "Inside the Social Network's (Datacenter) Network.",
                    "Pingmesh: A Large-Scale System for Data Center Network Latency Measurement and Analysis.",
                    "Large-scale Measurements of Wireless Network Behavior.",
                    "End-User Mapping: Next Generation Request Routing for Content Delivery.",
                    "Jupiter Rising: A Decade of Clos Topologies and Centralized Control in Google's Datacenter Network.",
                    "Multi-Context TLS (mcTLS): Enabling Secure In-Network Functionality in TLS.",
                    "BlindBox: Deep Packet Inspection over Encrypted Traffic.",
                    "Rollback-Recovery for Middleboxes.",
                    "Scaling Up Clustered Network Appliances with ScaleBricks.",
                    "Laissez-Faire: Fully Asymmetric Backscatter Communication.",
                    "SpotFi: Decimeter Level Localization Using WiFi.",
                    "BackFi: High Throughput WiFi Backscatter.",
                    "Caraoke: An E-Toll Transponder Network for Smart Cities.",
                    "Practical, Real-time Centralized Control for CDN-based Live Video Delivery.",
                    "A Control-Theoretic Approach for Dynamic Adaptive Video Streaming over HTTP.",
                    "BitCuts: Towards Fast Packet Classification for Order-Independent Rules.",
                    "Supercharge me: Boost Router Convergence with SDN.",
                    "Towards Scalable SDN Switches: Enabling Faster Flow Table Entries Installation.",
                    "Sampling and Large Flow Detection in SDN.",
                    "On the Optimization of Request Routing for Content Delivery.",
                    "Short vs. Long Flows: A Battle That Both Can Win.",
                    "Extreme Data-rate Scheduling for the Data Center.",
                    "Alternative Trust Sources: Reducing DNSSEC Signature Verification Operations with TLS.",
                    "A Case for a Stateful Middlebox Networking Stack.",
                    "FreeSurf: Application-Centric Wireless Access with SDN.",
                    "EPOXIDE: A Modular Prototype for SDN Troubleshooting.",
                    "nf.io: A File System Abstraction for NFV Orchestration.",
                    "NetFPGA: Rapid Prototyping of Networking Devices in Open Source.",
                    "A Mininet-based Virtual Testbed for Distributed SDN Development.",
                    "A High-Radix, Low-Latency Optical Switch for Data Centers.",
                    "Enabling Performance Evaluation Beyond 10 Gbps.",
                    "Chaos Monkey: Increasing SDN Reliability through Systematic Network Destruction.",
                    "Network Policy Whiteboarding and Composition.",
                    "Virtual Network Function Orchestration with Scylla.",
                    "Multi-Domain Service Orchestration Over Networks and Clouds: A Unified Approach.",
                    "Hopper: Decentralized Speculation-aware Cluster Scheduling at Scale.",
                    "Efficient Coflow Scheduling Without Prior Knowledge.",
                    "Network-Aware Scheduling for Data-Parallel Jobs: Plan When You Can.",
                    "Low Latency Geo-distributed Data Analytics.",
                    "Silo: Predictable Message Latency in the Cloud.",
                    "Condor: Better Topologies Through Declarative Design.",
                    "Presto: Edge-based Load Balancing for Fast Datacenter Networks.",
                    "Packet-Level Telemetry in Large Datacenter Networks.",
                    "Enabling End-Host Network Functions.",
                    "Adaptive Congestion Control for Unpredictable Cellular Networks.",
                    "Congestion Control for Large-Scale RDMA Deployments.",
                    "TIMELY: RTT-based Congestion Control for the Datacenter.",
                    "R2C2: A Network Stack for Rack-scale Computers.",
                    "InterTubes: A Study of the US Long-haul Fiber-optic Infrastructure.",
                    "Spatiotemporal Traffic Matrix Synthesis.",
                    "Extractocol: Autoatic Extraction of Application-level Protocol Behaviors for Android Applications.",
                    "Rule-level Data Plane Monitoring With Monocle.",
                    "Santa: Faster Packet Delivery for Commonly Wished Replies.",
                    "Cache'n DASH: Efficient Caching for DASH.",
                    "FALE: Fine-grained Device Free Localization that can Adaptively work in Different Areas with Little Effort.",
                    "Federated End-to-End Authentication for the Constrained Internet of Things Using IBC and ECC.",
                    "eSDN: Rethinking Datacenter Transports Using End-Host SDN Controllers.",
                    "BRB: BetteR Batch Scheduling to Reduce Tail Latencies in Cloud Data Stores.",
                    "Design and Implementation: the Native Web Browser and Server for Content-Centric Networking.",
                    "Alibi Routing.",
                    "ASwatch: An AS Reputation System to Expose Bulletproof Hosting ASes.",
                    "Herd: A Scalable, Traffic Analysis Resistant Anonymity Network for VoIP Systems.",
                    "Encore: Lightweight Measurement of Web Censorship with Cross-Origin Requests."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2015atc",
                "sub_name": "Proceedings of the 5th Workshop on All Things Cellular: Operations, Applications and Challenges, AllThingsCellular@SIGCOMM 2015, London, United Kingdom, August 17, 2015.",
                "count": 11,
                "papers": [
                    "An In-depth Analysis of 3G Traffic and Performance.",
                    "Examining TCP Short Flow Performance in Cellular Networks Through Active and Passive Measurements.",
                    "Exploring QoE in Cellular Networks: How Much Bandwidth do you Need for Popular Smartphone Apps?",
                    "MobiScud: A Fast Moving Personal Cloud in the Mobile Network.",
                    "An Architecture for Energy-aware On-demand Mobile Network Management.",
                    "State Space Analysis to Refactor the Mobile Core.",
                    "On the Interaction between Content Caching and Request Assignment in Cellular Cache Networks.",
                    "Core Network Challenges in the 5G Time Frame.",
                    "Impact of Indoor-Outdoor Context on Crowdsourcing based Mobile Coverage Analysis.",
                    "Investigating Excessive Delays in Mobile Broadband Networks.",
                    "MetaPush: Cellular-Friendly Server Push For HTTP/2."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2015hotmiddlebox",
                "sub_name": "Proceedings of the 2015 ACM SIGCOMM Workshop on Hot Topics in Middleboxes and Network Function Virtualization, HotMiddlebox@SIGCOMM 2015, London, United Kingdom, August 21, 2015.",
                "count": 12,
                "papers": [
                    "Love All, Trust Few: on Trusting Intermediaries in HTTP.",
                    "Towards a Safe Playground for HTTPS and Middle Boxes with QoS2.",
                    "GREP: Guaranteeing Reliability with Enhanced Protection in NFV.",
                    "Lost in Network Address Translation: Lessons from Scaling the World's Simplest Middlebox.",
                    "Header Enrichment or ISP Enrichment?: Emerging Privacy Threats in Mobile Networks.",
                    "Experiences Deploying a Transparent Split TCP Middlebox and the Implications for NFV.",
                    "Centrally Controlled Distributed VNF State Management.",
                    "Improving the Safety, Scalability, and Efficiency of Network Function State Transfers.",
                    "Stateless Network Functions.",
                    "Scalable Routing in SDN-enabled Networks with Consolidated Middleboxes.",
                    "CO-REDUCE: Collaborative Redundancy Reduction Service in Software-Defined Networks.",
                    "OpenBox: Enabling Innovation in Middlebox Applications."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2015nsethics",
                "sub_name": "Proceedings of the 2015 ACM SIGCOMM Workshop on Ethics in Networked Systems Research, NS Ethics@SIGCOMM 2015, London, United Kingdom, August 21, 2015.",
                "count": 11,
                "papers": [
                    "Submission Summary ACM SigComm2015 - Workshop on Ethics in Networked Systems Research - Considerations from practical examples.: The Mysterious Case of the Disappearing Domain - Considerations from Practical Examples.",
                    "Forgive Us our SYNs: Technical and Ethical Considerations for Measuring Internet Filtering.",
                    "Does the Internet Deserve Everybody?",
                    "Ethical Challenges in the MOSAIC 2B project.",
                    "Some Challenges for Ethics in Social Network Research.",
                    "Ethical Concerns for Censorship Measurement.",
                    "Cyber Research Ethics Decision Support (CREDS) Tool.",
                    "High Fidelity, High Risk, High Reward: Using High-Fidelity Networking Data in Ethically Sound Research.",
                    "RoboCode-Ethicists: Privacy-friendly robots, an ethical responsibility of engineers?",
                    "Ethical Challenges in Collaborative Storytelling.",
                    "Addressing Ethical Considerations in Network Measurement Papers: Abstract."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2015s2bid",
                "sub_name": "Proceedings of the 2015 ACM SIGCOMM Workshop on Crowdsourcing and Crowdsharing of Big (Internet) Data, C2B(I)D@SIGCOMM 2015, London, United Kingdom, August 17, 2015.",
                "count": 10,
                "papers": [
                    "3 is Not a Crowd, It's an Anecdote.",
                    "Informing Protocol Design Through Crowdsourcing: the Case of Pervasive Encryption.",
                    "Second Chance: Understanding diversity in broadband access network performance.",
                    "AntMonitor: A System for Monitoring from Mobile Devices.",
                    "Experiment Coordination for Large-scale Measurement Platforms.",
                    "Experience in using MTurk for Network Measurement.",
                    "Spatial Interpolation based Cellular Coverage Prediction with Crowdsourced Measurements.",
                    "Evaluation of a User-centric QoE-based Recommendation Tool for Wireless Access.",
                    "Measuring the Internet Topology with Smartphones.",
                    "What has Worked and What Won't Work in Crowdsourcing."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "SIGCOMM 2014",
        "info": "Chicago, IL, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2014",
                "sub_name": "ACM SIGCOMM 2014 Conference, SIGCOMM'14, Chicago, IL, USA, August 17-22, 2014.",
                "count": 96,
                "papers": [
                    "Keynote: life in the fast lane.",
                    "Millions of little minions: using packets for low latency network programming and visibility.",
                    "SAX-PAC (Scalable And eXpressive PAcket Classification).",
                    "Duet: cloud scale load balancing with hardware and software.",
                    "Guarantee IP lookup performance with FIB explosion.",
                    "From the consent of the routed: improving the transparency of the RPKI.",
                    "Network neutrality inference.",
                    "Balancing accountability and privacy in the network.",
                    "Measuring IPv6 adoption.",
                    "One tunnel is (often) enough.",
                    "YouSlow: a performance analysis tool for adaptive bitrate video streaming.",
                    "RPKI vs ROVER: comparing the risks of BGP security solutions.",
                    "CTE: cost-effective intra-domain traffic engineering.",
                    "Traffic statistics collection with FleXam.",
                    "Identifying traffic differentiation on cellular data networks.",
                    "NIMBUS: cloud-scale attack detection and mitigation.",
                    "A user behavior based cheat detection mechanism for crowdtesting.",
                    "ESCAPE: extensible service chain prototyping environment using mininet, click, NETCONF and POX.",
                    "Sampling online social networks: an experimental study of twitter.",
                    "Mahimahi: a lightweight toolkit for reproducible web measurement.",
                    "A time for reliability: the growing importance of being always on.",
                    "Vivisecting whatsapp through large-scale measurements in mobile networks.",
                    "Behind the curtain: the importance of replica selection in next generation cellular networks.",
                    "Flowinsight: decoupling visibility from operability in SDN data plane.",
                    "A cliq of content curators.",
                    "Native actors: how to scale network forensics.",
                    "SOUP: an online social network by the people, for the people.",
                    "AI3: application-independent information infrastructure.",
                    "Robust full duplex radio link.",
                    "Demonstrating the prospects of dynamic application-aware networking in a home environment.",
                    "A middlebox-cooperative TCP for a non end-to-end internet.",
                    "OpenNF: enabling innovation in network function control.",
                    "Network stack specialization for performance.",
                    "A buffer-based approach to rate adaptation: evidence from a large video streaming service.",
                    "FastForward: fast and constructive full duplex relays.",
                    "LTE radio analytics made easy and accessible.",
                    "Control-plane protocol interactions in cellular networks.",
                    "RF-IDraw: virtual touch screen in the air using RF signals.",
                    "A global name service for a highly mobile internetwork.",
                    "Towards a quantitative comparison of location-independent network architectures.",
                    "Lightweight source authentication and path validation.",
                    "Quartz: a new design element for low-latency DCNs.",
                    "Using RDMA efficiently for key-value services.",
                    "Fastpass: a centralized \"zero-queue\" datacenter network.",
                    "FireFly: a reconfigurable wireless data center fabric using free-space optics.",
                    "A \"hitchhiker's\" guide to fast and efficient data reconstruction in erasure-coded data centers.",
                    "Enabling near real-time central control for live video delivery in CDNs.",
                    "NetAssay: providing new monitoring primitives for network operators.",
                    "OpenSAN: a software-defined satellite network architecture.",
                    "SENSS: observe and control your own traffic in the internet.",
                    "Locating throughput bottlenecks in home networks.",
                    "OpenANFV: accelerating network function virtualization with a consolidated framework in openstack.",
                    "Towards the super fluid cloud.",
                    "Ziria: language for rapid prototyping of wireless PHY.",
                    "Demonstrating the optimal placement of virtualized cellular network functions in case of large crowd events.",
                    "Tracing multipath TCP connections.",
                    "Demo: a virtualized lab testbed with physical network outlets for hands-on computer networking education.",
                    "Rethinking congestion control architecture: performance-oriented congestion control.",
                    "DOT: distributed OpenFlow testbed.",
                    "Evaluating the effect of centralization on routing convergence on a hybrid BGP-SDN emulation framework.",
                    "Droid-Sec: deep learning in android malware detection.",
                    "Accelerating incast and multicast traffic delivery for data-intensive applications using physical layer optics.",
                    "Social SDN: online social networks integration in wireless network provisioning.",
                    "Flow-level state transition as a new switch primitive for SDN.",
                    "T-DNS: connection-oriented DNS to improve privacy and security (poster abstract).",
                    "Extending the software-defined network boundary.",
                    "Diagnosing missing events in distributed systems with negative provenance.",
                    "Troubleshooting blackbox SDN control software with minimal causal sequences.",
                    "Planck: millisecond-scale monitoring and control for commodity networks.",
                    "DREAM: dynamic resource allocation for software-defined measurement.",
                    "Decentralized task-aware scheduling for data center networks.",
                    "Efficient coflow scheduling with Varys.",
                    "Multi-resource packing for cluster schedulers.",
                    "Application-driven bandwidth guarantees in datacenters.",
                    "An experimental study of the learnability of congestion control.",
                    "Friends, not foes: synthesizing existing transport strategies for data center networks.",
                    "CONGA: distributed congestion-aware load balancing for datacenters.",
                    "Calendaring for wide area networks.",
                    "Traffic engineering with forward fault correction.",
                    "Dynamic scheduling of network updates.",
                    "SDX: a software defined internet exchange.",
                    "A network-state management service.",
                    "Rethinking buffer management in data center networks.",
                    "VIRL: the virtual internet routing lab.",
                    "SDX: a software defined internet exchange.",
                    "Toward a biometric-aware cloud service engine for multi-screen video applications.",
                    "SDN-based live VM migration across datacenters.",
                    "Characterizing botnets-as-a-service.",
                    "Aerial wireless localization using target-guided flight route.",
                    "An educational networking framework for full layer implementation and testing.",
                    "Drawbridge: software-defined DDoS-resistant traffic engineering.",
                    "DesktopDC: setting all programmable data center networking testbed on desk.",
                    "Vidyut: exploiting power line infrastructure for enterprise wireless networks.",
                    "Wi-fi backscatter: internet connectivity for RF-powered devices.",
                    "Turbocharging ambient backscatter communication.",
                    "Geosphere: consistently turning MIMO capacity into throughput."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2014atc",
                "sub_name": "Proceedings of the 4th workshop on All things cellular: operations, applications, & challenges, AllThingsCellular 2014, Chicago, Illinois, USA, August 22, 2014.",
                "count": 11,
                "papers": [
                    "Networking with massive MU-MIMO base stations.",
                    "How green is multipath TCP for mobile devices?",
                    "Increasing cellular capacity using ISM band side-channels: a first study.",
                    "SON conflict resolution using reinforcement learning with state aggregation.",
                    "SMORE: software-defined networking mobile offloading architecture.",
                    "Dynamic tunnel switching for SDN-based cellular core networks.",
                    "Applying NFV and SDN to LTE mobile core gateways, the functions placement problem.",
                    "Building a cellular networking research program.",
                    "Towards understanding TCP performance on LTE/EPC mobile networks.",
                    "Performance of LTE in a high-velocity environment: a measurement study.",
                    "Cacheability of YouTube videos in cellular networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2014csws",
                "sub_name": "Proceedings of the 2014 ACM SIGCOMM workshop on Capacity sharing workshop, CSWS '14, Chicago, Illinois, USA, August 18, 2014.",
                "count": 11,
                "papers": [
                    "The value of repeatable experiments and negative results: - a journey through the history and future of AQM and fair queuing algorithms.",
                    "Revisiting old friends: is CoDel really achieving what RED cannot?",
                    "Managing fairness and application performance with active queue management in docsis-based cable networks.",
                    "WQM: an aggregation-aware queue management scheme for IEEE 802.11n based networks.",
                    "Coupled congestion control for RTP media.",
                    "Experimental evaluation of multipath TCP schedulers.",
                    "Conex lite for mobile networks.",
                    "Mobile network sharing between operators: a demand trace-driven study.",
                    "Network assisted rate adaptation for conversational video over LTE, concept and performance evaluation.",
                    "Self-clocked rate adaptation for conversational video in LTE.",
                    "Dynamic bandwidth allocation for multiple network connections: improving user QoE and network usage of YouTube in mobile broadband."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2014dcc",
                "sub_name": "Proceedings of the 2014 ACM SIGCOMM workshop on Distributed cloud computing, DCC '14, Chicago, Illinois, USA, August 18, 2014.",
                "count": 17,
                "papers": [
                    "Distributed cloud computing in high energy physics.",
                    "ProActive routing in scalable data centers with PARIS.",
                    "Modeling and simulation of concurrent workload processing in cloud-distributed enterprise information systems.",
                    "DEIDtect: towards distributed elastic intrusion detection.",
                    "Performance of network and computing resource sharing in federated cloud systems.",
                    "Capacity of inter-cloud layer-2 virtual networking.",
                    "A virtual machine repacking in clouds: faster live migration algorithms.",
                    "Experiences with distributed heterogeneous clouds over community networks.",
                    "Traffic-aware clustering and VM migration in distributed data center.",
                    "ParaDrop: a multi-tenant platform for dynamically installed third party services on home gateways.",
                    "Green latency-aware data deployment in data centers: balancing latency, energy in networks and servers.",
                    "Response time-optimized distributed cloud resource allocation.",
                    "A decomposition-based architecture for distributed virtual network embedding.",
                    "Optimizing job reliability via contention-free, distributed scheduling of vm checkpointing.",
                    "Traffic steering in software defined networks: planning and online routing.",
                    "Design and implementation of an OpenFlow hardware abstraction layer.",
                    "Achieving efficient and fast update for multiple flows in software-defined networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2014srif",
                "sub_name": "Proceedings of the 2014 ACM workshop on Software radio implementation forum, SRIF '14, Chicago, Illinois, USA, August 18, 2014.",
                "count": 13,
                "papers": [
                    "Improving transport design for WARP SDR deployments.",
                    "SDR-based passive indoor localization system for GSM.",
                    "A real-time and protocol-aware reactive jamming framework built on software-defined radios.",
                    "Demo: CogMAC+ - a decentralized multichannel MAC protocol for cognitive wireless networks.",
                    "Demo: 802.11 a/g PHY implementation in ziria, domain-specific language for wireless programming.",
                    "Demo: WARP drive - accelerating wireless multi-hop cross-layer experimentation on SDRs.",
                    "Software defined radio for smart utility networks.",
                    "whiteLAN: facilitate cost-efficient SDR research with cots ieee 802.11b/g devices.",
                    "Paper: exploring MAC parallelization on software defined radio platforms.",
                    "Implementing TD-LTE as software defined radio in general purpose processor.",
                    "Joint phase tracking and channel decoding for OFDM PNC: algorithm and experimental evaluation.",
                    "Proof-of-concept implementation for network orchestrated relay selection mechanism.",
                    "MIMO-OFDM spatial multiplexing technique implementation for GNU radio."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "SIGCOMM 2013",
        "info": "Hong Kong, China",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2013",
                "sub_name": "ACM SIGCOMM 2013 Conference, SIGCOMM 2013, Hong Kong, August 12-16, 2013.",
                "count": 90,
                "papers": [
                    "Zen and the art of network architecture.",
                    "B4: experience with a globally-deployed software defined wan.",
                    "Achieving high utilization with software-driven WAN.",
                    "SIMPLE-fying middlebox policy enforcement using SDN.",
                    "Ambient backscatter: wireless communication out of thin air.",
                    "Dude, where's my card?: RFID positioning that works with multipath and non-line of sight.",
                    "Dhwani: secure peer-to-peer acoustic NFC.",
                    "See through walls with WiFi!",
                    "Maple: simplifying SDN programming using algorithmic policies.",
                    "Forwarding metamorphosis: fast programmable match-action processing in hardware for SDN.",
                    "Compressing IP forwarding tables: towards entropy bounds and beyond.",
                    "TCP ex machina: computer-generated congestion control.",
                    "FCP: a flexible transport framework for accommodating diversity.",
                    "Less pain, most of the gain: incrementally deployable ICN.",
                    "Reducing web latency: the virtue of gentle aggression.",
                    "BGP security in partial deployment: is the juice worth the squeeze?",
                    "PoiRoot: investigating the root cause of interdomain path changes.",
                    "Verifiable auctions for online ad exchanges.",
                    "Ananta: cloud scale load balancing.",
                    "Speeding up distributed request-response workflows.",
                    "Leveraging endpoint flexibility in data-intensive clusters.",
                    "A provider-side view of web search response time.",
                    "Trinocular: understanding internet reliability through adaptive probing.",
                    "An empirical reexamination of global DNS behavior.",
                    "Mosaic: quantifying privacy leakage in mobile networks.",
                    "Expressive privacy control with pseudonyms.",
                    "Towards efficient traffic-analysis resistant anonymity networks.",
                    "SplitX: high-performance private analytics.",
                    "Participatory networking: an API for application control of SDNs.",
                    "Developing a predictive model of quality of experience for internet video.",
                    "ElasticSwitch: practical work-conserving bandwidth guarantees for cloud computing.",
                    "An in-depth study of LTE: effect of network protocol and application behavior on performance.",
                    "Full duplex radios.",
                    "Bringing cross-layer MIMO to today's wireless LANs.",
                    "BigStation: enabling scalable real-time signal processingin large mu-mimo systems.",
                    "zUpdate: updating data center networks with zero loss.",
                    "Got loss?: get zOVN!",
                    "pFabric: minimal near-optimal datacenter transport.",
                    "Integrating microsecond circuit switching into the data center.",
                    "Dispatch: secure, resilient mobile reporting.",
                    "Contextualized information-centric home network.",
                    "Locating using prior information: wireless indoor localization algorithm.",
                    "AutoEmbed: automated multi-provider virtual network embedding.",
                    "Design and implementation of a framework for software-defined middlebox networking.",
                    "An evaluation testbed for adaptive, topology-aware deployment of elastic applications.",
                    "Automated configuration and measurement of emulated networks with AutoNetkit.",
                    "Incremental SDN deployment in enterprise networks.",
                    "Seamless interworking of SDN and IP.",
                    "Qphone: a quantum security VoIP phone.",
                    "Security risks evaluation toolbox for smart grid devices.",
                    "A large-scale multipath playground for experimenters and early adopters.",
                    "D-tunes: self tuning datastores for geo-distributed interactive applications.",
                    "Whole-home gesture recognition using wireless signals (demo).",
                    "Application-awareness in SDN.",
                    "On HTTP live streaming in large enterprises.",
                    "Automatic configuration of routing control platforms in OpenFlow networks.",
                    "HomeLab: a platform for conducting experiments with connected devices in the home.",
                    "Named data networking on a router: forwarding at 20gbps and beyond.",
                    "OMware: an open measurement ware for stable residential broadband measurement.",
                    "Cloud3DView: an interactive tool for cloud data center operations.",
                    "To 4, 000 compute nodes and beyond: network-aware vertex placement in large-scale graph processing systems.",
                    "Don't drop, detour!",
                    "Harnessing receive diversity in distributed multi-user MIMO networks.",
                    "R2D2: bufferless, switchless data center networks using commodity ethernet hardware.",
                    "Smart in-network deduplication for storage-aware SDN.",
                    "The architecture and traffic management of wireless collaborated hybrid data center network.",
                    "Toward content-centric privacy in ICN: attribute-based encryption and routing.",
                    "Interest set mechanism to improve the transport of named data networking.",
                    "M2cloud: software defined multi-site data center network control framework for multi-tenant.",
                    "Supporting application-specific in-network processing in data centres.",
                    "In-network caching assisted wireless AP storage management: challenges and algorithms.",
                    "Using DAIM as a reactive interpreter for openflow networks to enable autonomic functionality.",
                    "Characterizing correlated latency anomalies in broadband access networks.",
                    "A (not) NICE way to verify the openflow switch specification: formal modelling of the openflow switch using alloy.",
                    "An empirical study of analog channel feedback.",
                    "Towards fast regular expression matching in practice.",
                    "Cooperation policies for efficient in-network caching.",
                    "Collaborative caching based on hash-routing for information-centric networking.",
                    "Characterizing and detecting malicious crowdsourcing.",
                    "Replication free rule grouping for packet classification.",
                    "Which flows are hiding behind my wildcard rule?: adding packet sampling to openflow.",
                    "The contagion of malicious behaviors in online games.",
                    "CSPAN: cost-effective geo-replicated storage spanning multiple cloud services.",
                    "A software defined approach to unified IPv6 transition.",
                    "OpenRAN: a software-defined ran architecture via virtualization.",
                    "Exponential quantization: user-centric rate control for skype calls.",
                    "Making intra-domain traffic engineering resistant to failures.",
                    "Greedy forwarding for mobile social networks embedded in hyperbolic spaces.",
                    "The effectiveness of time dependent pricing in controlling usage incentives in wireless data network.",
                    "Topology-aware content-centric networking."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2013hotplanet",
                "sub_name": "Proceedings of the 5th ACM workshop on Hot topics in planet-scale measurement, HotPlanet@SIGCOMM 2013, Hong Kong, China, August 12-16, 2013.",
                "count": 12,
                "papers": [
                    "The 5th ACM hotplanet workshop keynote speaker: smartphones, crowds, and the cloud: population guided sensing systems.",
                    "What's in a name?: decoding router interface names.",
                    "Trace selection for improved WLAN monitoring.",
                    "Internet atlas: a geographic database of the internet.",
                    "A framework for monitoring and measuring a large-scale distributed system in real time.",
                    "Efficient social network data query processing on MapReduce.",
                    "PIXS: programmable intelligence for cross-platform socialization.",
                    "Extrapolating sparse large-scale GPS traces for contact evaluation.",
                    "Metric convergence in social network sampling.",
                    "Lessons learned from the netsense smartphone study.",
                    "Information bazaar: a contextual evaluation.",
                    "It's tea time: do you know where your mug is?"
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2013srif",
                "sub_name": "Proceedings of the second workshop on Software radio implementation forum, SRIF@SIGCOMM 2013, Hong Kong, China, August 12-16, 2013.",
                "count": 13,
                "papers": [
                    "CODIPHY: composing on-demand intelligent physical layers.",
                    "An IEEE 802.11a/g/p OFDM receiver for GNU radio.",
                    "Evaluating dynamic OFDMA subchannel allocation for wireless mesh networks on SDRs.",
                    "USC SDR, an easy-to-program, high data rate, real time software radio platform.",
                    "Modular, open-source software transceiver for PHY/MAC research.",
                    "Exploring parallelization for medium access schemes on many-core software defined radio architecture.",
                    "Simplifying FPGA design with a novel network-on-chip architecture.",
                    "Software radio platform for network-assisted device-to-device (NA-D2D) concepts.",
                    "Practicing a record-and-replay system on USRP.",
                    "Inspecting GNU radio applications with controlport and performance counters.",
                    "Real-time implementation of physical-layer network coding.",
                    "Experimental implementation of asynchronous rendezvous protocols using microsoft sora.",
                    "Software defined radio implementation of signaling splitting in hyper-cellular network."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2013fhmn",
                "sub_name": "Proceedings of the 2013 ACM SIGCOMM workshop on Future human-centric multimedia networking, FhMN@SIGCOMM 2013, Hong Kong, China, August 16, 2013.",
                "count": 12,
                "papers": [
                    "Information centric networking for media distribution: will it blend?",
                    "Human-centric music medical therapy exploration system.",
                    "Downton abbey without the hiccups: buffer-based rate adaptation for HTTP video streaming.",
                    "Towards network-wide QoE fairness using openflow-assisted adaptive video streaming.",
                    "Experimental investigation of the google congestion control for real-time flows.",
                    "AdapComm: a bandwidth allocation methodology for multimedia applications in wireless networks.",
                    "A fixed-point model for QoE-based charging.",
                    "User cooperative mobility for better multimedia communication quality.",
                    "Towards human-centric personalized expertise ranking in community-based question answering.",
                    "How disorder impacts routing in human-centric disruption tolerant networks.",
                    "Empowering the creative user: personalized HTTP-based adaptive streaming of multi-path nonlinear video.",
                    "Outrageous opinion panel: do we really have to consider the human factor in networking?"
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "SIGCOMM 2012",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2012",
                "sub_name": "ACM SIGCOMM 2012 Conference, SIGCOMM '12, Helsinki, Finland - August 13 - 17, 2012.",
                "count": 72,
                "papers": [
                    "Multi-resource fair queueing for packet processing.",
                    "Making middleboxes someone else's problem: network processing as a cloud service.",
                    "HyperDex: a distributed, searchable key-value store.",
                    "Picasso: flexible RF and spectrum slicing.",
                    "Spinal codes.",
                    "Efficient and reliable low-power backscatter networks.",
                    "Network-aware service placement in a distributed cloud environment.",
                    "SP4: scalable programmable packet processing platform.",
                    "Distributed content storage for just-in-time streaming.",
                    "Blockmon: a high-performance composable network traffic measurement system.",
                    "PaDIS emulator: an emulator to evaluate CDN-ISP collaboration.",
                    "Signposts: end-to-end networking in a world of middleboxes.",
                    "Towards SmartFlow: case studies on enhanced programmable forwarding in OpenFlow switches.",
                    "An OpenFlow-based energy-efficient data center approach.",
                    "Reduction-based analysis of BGP systems with BGPVerif.",
                    "Route shepherd: stability hints for the control plane.",
                    "Efficiently migrating stateful middleboxes.",
                    "A demonstration of ultra-low-latency data center optical circuit switching.",
                    "AutoNetkit: simplifying large scale, open-source network experimentation.",
                    "Bulk of interest: performance measurement of content-centric routing.",
                    "User-level data center tomography.",
                    "Towards detecting BGP route hijacking using the RPKI.",
                    "Choice as a principle in network architecture.",
                    "A frequency adjustment architecture for energy efficient router.",
                    "Detecting third-party addresses in traceroute IP paths.",
                    "Reviving delay-based TCP for data centers.",
                    "FaaS: filtering IP spoofing traffic as a service.",
                    "Deadline-aware datacenter tcp (D2TCP).",
                    "Finishing flows quickly with preemptive scheduling.",
                    "DeTail: reducing the flow completion time tail in datacenter networks.",
                    "Inferring visibility: who's (not) talking to whom?",
                    "Anatomy of a large european IXP.",
                    "Measuring and fingerprinting click-spam in ad networks.",
                    "FairCloud: sharing the network in cloud computing.",
                    "The only constant is change: incorporating time-varying network reservations in data centers.",
                    "It's not easy being green.",
                    "Flashback: decoupled lightweight wireless control.",
                    "JMB: scaling wireless capacity with user demands.",
                    "TUBE: time-dependent pricing for mobile data.",
                    "CarSpeak: a content-centric network for autonomous driving.",
                    "Vitamin C for your smartphone: the SKIMS approach for cooperativeand lightweight security at mobiles.",
                    "Energino: energy saving tips for your wireless network.",
                    "MultiNet: usable and secure WiFi device association.",
                    "Demo: runtime MAC reconfiguration using a meta-compiler assisted toolchain.",
                    "Demo: programming enterprise WLANs with odin.",
                    "Supporting network evolution and incremental deployment with XIA.",
                    "Picasso: flexible RF and spectrum slicing.",
                    "Dismantling intrusion prevention systems.",
                    "namehelp: intelligent client-side DNS resolution.",
                    "Scalable software defined network controllers.",
                    "RaptorStream: boosting mobile peer-to-peer streaming with raptor codes.",
                    "Enabling dynamic network processing with clickOS.",
                    "Predicting location using mobile phone calls.",
                    "SmartDiet: offloading popular apps to save energy.",
                    "Revealing contact interval patterns in large scale urban vehicular ad hoc networks.",
                    "Fs-PGBR: a scalable and delay sensitive cloud routing protocol.",
                    "Accelerating last-mile web performance with popularity-based prefetching.",
                    "First insights from a mobile honeypot.",
                    "uvNIC: rapid prototyping network interface controller device drivers.",
                    "Policy transformation in software defined networks.",
                    "Perspectives on network calculus: no free lunch, but still good value.",
                    "Abstractions for network update.",
                    "A smart pre-classifier to reduce power consumption of TCAMs for multi-dimensional packet classification.",
                    "ShadowStream: performance evaluation as a capability in production internet live streaming networks.",
                    "A case for a coordinated internet video control plane.",
                    "Optimizing cost and performance for content multihoming.",
                    "Private and verifiable interdomain routing decisions.",
                    "LIFEGUARD: practical repair of persistent route failures.",
                    "On-chip networks from a networking perspective: congestion and scalability in many-core interconnects.",
                    "NetPilot: automating datacenter network failure mitigation.",
                    "Surviving failures in bandwidth-constrained datacenters.",
                    "Mirror mirror on the ceiling: flexible wireless links for data centers."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "SIGCOMM 2011",
        "info": "Toronto, ON, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2011",
                "sub_name": "Proceedings of the ACM SIGCOMM 2011 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Toronto, ON, Canada, August 15-19, 2011.",
                "count": 80,
                "papers": [
                    "They can hear your heartbeats: non-invasive security for implantable medical devices.",
                    "Let the market drive deployment: a strategy for transitioning to BGP security.",
                    "Finding protocol manipulation attacks.",
                    "Augmenting data center networks with multi-gigabit wireless links.",
                    "Better never than late: meeting deadlines in datacenter networks.",
                    "NetLord: a scalable multi-tenant network architecture for virtualized datacenters.",
                    "Inter-datacenter bulk transfers with netstitcher.",
                    "The power of prediction: cloud bandwidth and cost reduction.",
                    "Managing data transfers in computer clusters with orchestra.",
                    "On blind mice and the elephant: understanding the network impact of a large distributed system.",
                    "Predicting and tracking internet path changes.",
                    "Broadband internet performance: a view from the gateway.",
                    "Random access heterogeneous MIMO networks.",
                    "Strider: automatic rate adaptation and collision handling.",
                    "Clearing the RF smog: making 802.11n robust to cross-technology interference.",
                    "Design space analysis for modeling incentives in distributed systems.",
                    "How many tiers?: pricing in the internet transit market.",
                    "The evolution of layered protocol stacks leads to an hourglass-shaped architecture.",
                    "What's the difference?: efficient set reconciliation without prior context.",
                    "DOF: a local wireless information plane.",
                    "Towards predictable datacenter networks.",
                    "DevoFlow: scaling flow management for high-performance networks.",
                    "Improving datacenter performance and robustness with multipath TCP.",
                    "NetQuery: a knowledge plane for reasoning about network properties.",
                    "Debugging the data plane with anteater.",
                    "Demystifying configuration challenges and trade-offs in network-based ISP services.",
                    "Seamless network-wide IGP migrations.",
                    "A content propagation metric for efficient content distribution.",
                    "Insomnia in the access: or how to curb access network related energy consumption.",
                    "Understanding network failures in data centers: measurement, analysis, and implications.",
                    "Understanding the impact of video quality on user engagement.",
                    "An untold story of middleboxes in cellular networks.",
                    "Automatic inference of movements from contact histories.",
                    "Towards a fully distributed n-tuple store.",
                    "ASAP: a low-latency transport layer.",
                    "What can free money tell us on the virtual black market?",
                    "LoKI: location-based PKI for social networks.",
                    "\"Roto-Rooting\" your router: solution against new potential DoS attacks on modern routers.",
                    "Limiting large-scale crawls of social networking sites.",
                    "Designing a testbed for large-scale distributed systems.",
                    "Spider: improving mobile networking with concurrent wi-fi connections.",
                    "Covert channels in multiple access protocols.",
                    "Pomelo: accurate and decentralized shortest-path distance estimation in social graphs.",
                    "Dummy rate analysis of buffer constrained chaum mix.",
                    "Minimising cell transmit power: towards self-organized resource allocation in OFDMA femtocells.",
                    "Building virtual networks across multiple domains.",
                    "Multi-relational social networks in a large-scale MMORPG.",
                    "Taming power peaks in mapreduce clusters.",
                    "Towards scalable and realistic node models for network simulators.",
                    "Revisiting next-hop selection in multipath networks.",
                    "netmap: memory mapped access to network devices.",
                    "Detecting and assessing the hybrid IPv4/IPv6 as relationships.",
                    "CloudProphet: towards application performance prediction in cloud.",
                    "A novel approach for making energy efficient PON.",
                    "On the efficacy of fine-grained traffic splitting protocolsin data center networks.",
                    "Wide-area routing dynamics of malicious networks.",
                    "Online testing of federated and heterogeneous distributed systems.",
                    "Performance based traffic control with IDIPS.",
                    "Eco-Sign: a load-based traffic light control system for environmental protection with vehicular communications.",
                    "FSR: formal analysis and implementation toolkit for safe inter-domain routing.",
                    "PANDAA: a physical arrangement detection technique for networked devices through ambient-sound awareness.",
                    "Implementing ARP-path low latency bridges in NetFPGA.",
                    "LifeNet: a flexible ad hoc networking solution for transient environments.",
                    "A protocol for disaster data evacuation.",
                    "Towards energy-efficient streaming system for mobile hotspots.",
                    "MPLS-TE and MPLS VPNS with openflow.",
                    "Dasu - ISP characterization from the edge: a BitTorrent implementation.",
                    "WiFire: a firewall for wireless networks.",
                    "Demonstrating generalized virtual topologies in an openflow network.",
                    "Visualizing anomalies in sensor networks.",
                    "WiRE: a new rural connectivity paradigm.",
                    "Supporting novel home network management interfaces with openflow and NOX.",
                    "Using NetMagic to observe fine-grained per-flow latency measurements.",
                    "OSPF failure reconvergence through SRG inference and prediction of link state advertisements.",
                    "Communicating with caps: managing usage caps in home networks.",
                    "Cyber-physical handshake.",
                    "An online gaming testbed for peer-to-peer architectures.",
                    "Service hosting gateways: a platform for distributed service deployment in end user homes.",
                    "Optimizing a virtualized data center.",
                    "Efficient content dissemination in heterogeneous networks prone to episodic connectivity."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "SIGCOMM 2010",
        "info": "New Delhi, India",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2010",
                "sub_name": "Proceedings of the ACM SIGCOMM 2010 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, New Delhi, India, August 30 -September 3, 2010.",
                "count": 76,
                "papers": [
                    "Protocol design for effective communication among silicon or carbon-based nodes.",
                    "Efficient error estimating coding: feasibility and applications.",
                    "Design and implementation of an \"approximate\" communication system for wireless media applications.",
                    "Not all microseconds are equal: fine-grained per-flow measurements with reference latency interpolation.",
                    "Generic and automatic address configuration for data center networks.",
                    "Symbiotic routing in future data centers.",
                    "Data center TCP (DCTCP).",
                    "Internet inter-domain traffic.",
                    "How secure are secure interdomain routing protocols.",
                    "Understanding block-level address usage in the visible internet.",
                    "Privacy-preserving P2P data sharing with OneSwarm.",
                    "Differentially-private network trace analysis.",
                    "Encrypting the internet.",
                    "Fine-grained channel access in wireless LAN.",
                    "Predictable 802.11 packet delivery from wireless channel measurements.",
                    "SourceSync: a distributed wireless architecture for exploiting sender diversity.",
                    "SwitchBlade: a platform for rapid deployment of network protocols on programmable hardware.",
                    "PacketShader: a GPU-accelerated software router.",
                    "EffiCuts: optimizing packet classification for memory and throughput.",
                    "Theory and new primitives for safely connecting routing protocol instances.",
                    "DONAR: decentralized server selection for cloud services.",
                    "Cloudward bound: planning for beneficial migration of enterprise applications to the cloud.",
                    "NetFence: preventing internet denial of service from inside out.",
                    "ASTUTE: detecting a different class of traffic anomalies.",
                    "NetShield: massive semantics-based vulnerability signature matching for high-speed networks.",
                    "R3: resilient routing reconfiguration.",
                    "Detecting the performance impact of upgrades in large operational networks.",
                    "California fault lines: understanding the causes and impact of network failures.",
                    "c-Through: part-time optics in data centers.",
                    "Helios: a hybrid electrical/optical switch architecture for modular data centers.",
                    "Scalable flow-based networking with DIFANE.",
                    "An analysis of social network-based Sybil defenses.",
                    "The little engine(s) that could: scaling online social networks.",
                    "Crowdsourcing service-level network event monitoring.",
                    "SIP overload control: a backpressure-based approach.",
                    "Unbiased sampling in directed social graph.",
                    "Contrabass: concurrent transmissions without coordination.",
                    "Backpressure-based routing protocol for DTNs.",
                    "Fair bandwidth allocation in wireless network using max-flow.",
                    "Stochastic approximation algorithm for optimal throughput performance of wireless LANs.",
                    "Rethinking iBGP routing.",
                    "Passive IP traceback: capturing the origin of anonymous traffic through network telescopes.",
                    "SecureAngle: improving wireless security using angle-of-arrival information (poster abstract).",
                    "Autonomous traffic engineering with self-configuring topologies.",
                    "Fived: a service-based architecture implementation to innovate at the endpoints.",
                    "Accelerometer-assisted 802.11 rate adaptation on mass rapid transit system.",
                    "Vehicular wifi access and rate adaptation.",
                    "Mobile data offloading: how much can WiFi deliver?",
                    "Residual white space distribution-based opportunistic channel access for cognitive radio enabled devices.",
                    "Achieving O(1) IP lookup on GPU-based software routers.",
                    "Road traffic estimation using in-situ acoustic sensing.",
                    "Cone of silence: adaptively nulling interferers in wireless networks.",
                    "Empowering users against sidejacking attacks.",
                    "Accelerating SSL with GPUs.",
                    "An open router virtualization framework using a programmable forwarding plane.",
                    "QuagFlow: partnering Quagga with OpenFlow.",
                    "Experimenting with multipath TCP.",
                    "Caliper: a tool to generate precise and closed-loop traffic.",
                    "Multi-hop packet tracking for experimental facilities.",
                    "SoftCast: one-size-fits-all wireless video.",
                    "PixNet: LCD-camera pairs as communication links.",
                    "VMtorrent: virtual appliances on-demand.",
                    "Flexible multimedia content retrieval using InfoNames.",
                    "Ripcord: a modular platform for data center networking.",
                    "No more middlebox: integrate processing into network.",
                    "LokVaani: demonstrating interactive voice in Lo3.",
                    "Transit portal: BGP connectivity as a service.",
                    "Source flow: handling millions of flows on flow-based nodes.",
                    "Automating root-cause analysis of network anomalies using frequent itemset mining.",
                    "Experimenting software radio with the Sora platform.",
                    "Circumventing censorship with collage.",
                    "Twittering by cuckoo: decentralized and socio-aware online microblogging services.",
                    "MPAP: virtualization architecture for heterogenous wireless APs.",
                    "Stratus: energy-efficient mobile communication using cloud support.",
                    "A framework for low-power IPv6 routing simulation, experimentation, and evaluation.",
                    "CARMEN: resource management and abstraction in wireless heterogeneous mesh networks."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2010greennet",
                "sub_name": "Proceedings of the 1st ACM SIGCOMM Workshop on Green Networking 2010, New Delhi, India, August 30, 2010.",
                "count": 12,
                "papers": [
                    "Energy-aware routing in data center network.",
                    "Running servers around zero degrees.",
                    "NapSAC: design and implementation of a power-proportional web cluster.",
                    "To compress or not to compress - compute vs. IO tradeoffs for mapreduce energy efficiency.",
                    "Greening backbone networks: reducing energy consumption by shutting off cables in bundled links.",
                    "How internet concepts and technologies can help green and smarten the electrical grid.",
                    "Breathe to stay cool: adjusting cell sizes to reduce energy consumption.",
                    "Reducing energy consumption in IPTV networks by selective pre-joining of channels.",
                    "Energy proportionality of an enterprise network.",
                    "Shipping to streaming: is this shift green?",
                    "SpinThrift: saving energy in viral workloads.",
                    "How green is IP-telephony?"
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2010apsys",
                "sub_name": "Proceedings of the 1st ACM SIGCOMM Asia-Pacific Workshop on Systems, ApSys 2010, New Delhi, India, August 30, 2010.",
                "count": 10,
                "papers": [
                    "Topology-aware resource allocation for data-intensive workloads.",
                    "Architecture optimisation with Currawong.",
                    "DDE: dynamic data structure excavation.",
                    "The OKL4 microvisor: convergence point of microkernels and hypervisors.",
                    "The case for active device drivers.",
                    "capDL: a language for describing capability-based systems.",
                    "On-line consistent backup in transactional file systems.",
                    "Suppressing bot traffic with accurate human attestation.",
                    "Towards software-friendly networks.",
                    "Improving peer-to-peer file distribution: winner doesn't have to take all."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "SIGCOMM 2009",
        "info": "Barcelona, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2009",
                "sub_name": "Proceedings of the ACM SIGCOMM 2009 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Barcelona, Spain, August 16-21, 2009.",
                "count": 28,
                "papers": [
                    "The internet of ideas.",
                    "Cross-layer wireless bit rate adaptation.",
                    "SMACK: a SMart ACKnowledgment scheme for broadcast messages in wireless networks.",
                    "White space networking with wi-fi like connectivity.",
                    "PortLand: a scalable fault-tolerant layer 2 data center network fabric.",
                    "VL2: a scalable and flexible data center network.",
                    "BCube: a high performance, server-centric network architecture for modular data centers.",
                    "De-anonymizing the internet using unreliable IDs.",
                    "SmartRE: an architecture for coordinated network-wide redundancy elimination.",
                    "Practical, distributed channel assignment and routing in dual-radio mesh networks.",
                    "Pathlet routing.",
                    "Cutting the electric bill for internet-scale systems.",
                    "Persona: an online social network with user-defined privacy.",
                    "In defense of wireless carrier sense.",
                    "Interference alignment and cancellation.",
                    "DIRC: increasing indoor wireless capacity using directional antennas.",
                    "Stable and flexible iBGP.",
                    "LIPSIN: line speed publish/subscribe inter-networking.",
                    "PLUG: flexible lookup modules for rapid deployment of new protocols in high-speed routers.",
                    "Modeling and understanding end-to-end class of service policies in operational networks.",
                    "Towards automated performance diagnosis in a large IPTV network.",
                    "Detailed diagnosis in enterprise networks.",
                    "Every microsecond counts: tracking fine-grain latencies with a lossy difference aggregator.",
                    "Spatio-temporal compressive sensing and internet traffic matrices.",
                    "Passive aggressive measurement with MGRP.",
                    "ROAR: increasing the flexibility and performance of distributed search.",
                    "Safe and effective fine-grained TCP retransmissions for datacenter communication.",
                    "Matchmaking for online games and other latency-sensitive P2P systems."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/2009wren",
                "sub_name": "Proceedings of the 1st ACM SIGCOMM 2009 Workshop on Research on Enterprise Networking, WREN 2009, Barcelona, Spain, August 21, 2009.",
                "count": 13,
                "papers": [
                    "Practical declarative network management.",
                    "Resonance: dynamic access control for enterprise networks.",
                    "Delegating network security with more information.",
                    "Impact of IT monoculture on behavioral end host intrusion detection.",
                    "Hash, don't cache: fast packet forwarding for enterprise edge routers.",
                    "Crossbow: a vertically integrated QoS stack.",
                    "Multicast redux: a first look at enterprise multicast traffic.",
                    "Understanding data center traffic characteristics.",
                    "Understanding TCP incast throughput collapse in datacenter networks.",
                    "Change is hard: adapting dependency graph models for unified diagnosis in wired/wireless networks.",
                    "Remote network labs: an on-demand network cloud for configuration testing.",
                    "Diverter: a new approach to networking within virtualized infrastructures.",
                    "Why should we integrate services, servers, and networking in a data center?"
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "SIGCOMM 2008",
        "info": "Seattle, WA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2008",
                "sub_name": "Proceedings of the ACM SIGCOMM 2008 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Seattle, WA, USA, August 17-22, 2008.",
                "count": 37,
                "papers": [
                    "Modeling the internet is fun!: but can you make a living?",
                    "Floodless in seattle: a scalable ethernet architecture for large enterprises.",
                    "Xl: an efficient network routing algorithm.",
                    "Path splicing.",
                    "Shedding light on the glue logic of the internet routing architecture.",
                    "A policy-aware switching layer for data centers.",
                    "A scalable, commodity data center network architecture.",
                    "Dcell: a scalable and fault-tolerant network structure for data centers.",
                    "What's going on?: learning communication rules in edge networks.",
                    "Answering what-if deployment and configuration questions with wise.",
                    "Shadow configuration as a network management primitive.",
                    "Network exception handlers: host-network control in enterprise networks.",
                    "A case for adapting channel width in wireless networks.",
                    "Learning to share: narrowband-friendly wideband networks.",
                    "Zigzag decoding: combating hidden terminals in wireless networks.",
                    "Spamming botnets: signatures and characteristics.",
                    "Enriching network security analysis with time travel.",
                    "To filter or to authorize: network-layer DoS defense against multimillion-node botnets.",
                    "Deflating the big bang: fast and scalable deep packet inspection with extended finite automata.",
                    "Packet caches on routers: the implications of universal redundant traffic elimination.",
                    "Virtual routers on the move: live router migration as a network-management primitive.",
                    "Bittorrent is an auction: analyzing and improving bittorrent's incentives.",
                    "Rd network services: differentiation through performance incentives.",
                    "Rationality and traffic attraction: incentives for honest path announcements in bgp.",
                    "Unconstrained endpoint profiling (googling the internet).",
                    "Network discovery from passive measurements.",
                    "Discarte: a disjunctive internet cartographer.",
                    "Satellitelab: adding heterogeneity to planetary-scale network testbeds.",
                    "Ispy: detecting ip prefix hijacking on my own.",
                    "Accountable internet protocol (aip).",
                    "P4p: provider portal for applications.",
                    "Taming the torrent: a practical approach to reducing cross-isp traffic in peer-to-peer systems.",
                    "Challenges, design and analysis of a large-scale p2p-vod system.",
                    "Donnybrook: enabling large-scale, high-speed, peer-to-peer games.",
                    "Symbol-level network coding for wireless mesh networks.",
                    "Predictable performance optimization for wireless networks.",
                    "Interactive wifi connectivity for moving vehicles."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "SIGCOMM 2007",
        "info": "Kyoto, Japan",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2007",
                "sub_name": "Proceedings of the ACM SIGCOMM 2007 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Kyoto, Japan, August 27-31, 2007.",
                "count": 35,
                "papers": [
                    "Ethane: taking control of the enterprise.",
                    "Towards highly reliable enterprise network services via inference of multi-level dependencies.",
                    "Automating cross-layer diagnosis of enterprise wireless networks.",
                    "Revealing skype traffic: when randomness plays with you.",
                    "Bubblestorm: resilient, probabilistic, and exhaustive peer-to-peer search.",
                    "Securing internet coordinate embedding systems.",
                    "Reconciling performance and programmability in networking systems.",
                    "Supercharging planetlab: a high performance, multi-application, overlay network platform.",
                    "ProgME: towards programmable network measurement.",
                    "Accurate and efficient SLA compliance monitoring.",
                    "Lottery trees: motivational deployment of networked systems.",
                    "Can internet video-on-demand be profitable?",
                    "In search for an appropriate granularity to model routing policies.",
                    "Resolving inter-domain policy disputes.",
                    "Trading structure for randomness in wireless opportunistic routing.",
                    "A data-oriented (and beyond) network architecture.",
                    "An end-middle-end approach to connection establishment.",
                    "CONMan: a step towards network manageability.",
                    "An axiomatic basis for communication.",
                    "Reliability as an interdomain service.",
                    "Achieving convergence-free routing using failure-carrying packets.",
                    "Etherfuse: an ethernet watchdog.",
                    "A study of prefix hijacking and interception in the internet.",
                    "A light-weight distributed scheme for detecting ip prefix hijacks in real-time.",
                    "Portcullis: protecting connection setup from denial-of-capability attacks.",
                    "How dynamic are IP addresses?",
                    "Observing the evolution of internet as topology.",
                    "Orbis: rescaling degree correlations to generate annotated internet topologies.",
                    "Cloud control with distributed rate limiting.",
                    "Emulating AQM from end hosts.",
                    "Structured streams: a new transport abstraction.",
                    "DTN routing as a resource allocation problem.",
                    "Understanding and mitigating the impact of RF interference on 802.11 networks.",
                    "Embracing wireless interference: analog network coding.",
                    "PPR: partial packet recovery for wireless networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "SIGCOMM 2006",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2006",
                "sub_name": "Proceedings of the ACM SIGCOMM 2006 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Pisa, Italy, September 11-15, 2006.",
                "count": 38,
                "papers": [
                    "Humble beginnings, uncertain end: getting the internet to provide performance guarantees.",
                    "In VINI veritas: realistic and controlled network experimentation.",
                    "Revisiting IP multicast.",
                    "Designing DCCP: congestion control without reliability.",
                    "Jigsaw: solving the puzzle of enterprise 802.11 analysis.",
                    "Measurement-based models of delivery and interference in static wireless networks.",
                    "Interference-aware fair rate control in wireless sensor networks.",
                    "Analyzing the MAC-level behavior of wireless networks in the wild.",
                    "Capacity overprovisioning for networks with resilience requirements.",
                    "COPE: traffic engineering in dynamic networks.",
                    "Realistic and responsive network traffic generation.",
                    "A basic stochastic network calculus.",
                    "Systematic topology analysis and generation using degree correlations.",
                    "Minimizing churn in distributed systems.",
                    "Source selectable path diversity via routing deflections.",
                    "MIRO: multi-path interdomain routing.",
                    "Network monitors and contracting systems: competition and innovation.",
                    "Building an AS-topology model that captures route diversity.",
                    "The impact and implications of the growth in residential user-to-user traffic.",
                    "Towards unbiased end-to-end network diagnosis.",
                    "The role of PASTA in network measurement.",
                    "XORs in the air: practical wireless network coding.",
                    "Growth codes: maximizing sensor network data persistence.",
                    "SybilGuard: defending against sybil attacks via social networks.",
                    "Modeling adoptability of secure BGP protocol.",
                    "Understanding the network-level behavior of spammers.",
                    "DDoS defense by offense.",
                    "Beyond bloom filters: from approximate membership checks to approximate state machines.",
                    "Detecting evasion attacks at high speeds without reassembly.",
                    "Algorithms to accelerate multiple regular expressions matching for deep packet inspection.",
                    "Virtual ring routing: network routing inspired by DHTs.",
                    "ROFL: routing on flat labels.",
                    "A measurement study on the impact of routing events on end-to-end internet path performance.",
                    "Policy-based routing with non-strict preferences.",
                    "Quantifying Skype user satisfaction.",
                    "Enabling contribution awareness in an overlay broadcasting system.",
                    "Planet scale software updates.",
                    "Drafting behind Akamai (travelocity-based detouring)."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "SIGCOMM 2005",
        "info": "Philadelphia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2005",
                "sub_name": "Proceedings of the ACM SIGCOMM 2005 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communications, Philadelphia, Pennsylvania, USA, August 22-26, 2005.",
                "count": 28,
                "papers": [
                    "Metarouting.",
                    "HLP: a next generation inter-domain routing protocol.",
                    "Implications of autonomy for the expressiveness of policy routing.",
                    "One more bit is enough.",
                    "Limitations of equation-based congestion control.",
                    "The power of explicit congestion notification.",
                    "OpenDHT: a public DHT service and its uses.",
                    "Meridian: a lightweight network location service without virtual coordinates.",
                    "A case study in building layered DHT applications.",
                    "Using redundancy to cope with failures in a delay tolerant network.",
                    "Idle sense: an optimal access method for high throughput and fairness in rate diverse wireless LANs.",
                    "ExOR: opportunistic multi-hop routing for wireless networks.",
                    "On the predictability of large transfer TCP throughput.",
                    "Improving accuracy in end-to-end packet loss measurement.",
                    "Profiling internet backbone traffic: behavior models and applications.",
                    "Fast hash table lookup using extended bloom filter: an aid to network processing.",
                    "Algorithms for advanced packet classification with ternary CAMs.",
                    "Dynamic pipelining: making IP-lookup truly scalable.",
                    "Mining anomalies using traffic feature distributions.",
                    "BLINC: multilevel traffic classification in the dark.",
                    "A DoS-limiting network architecture.",
                    "Walking the tightrope: responsive yet stable traffic engineering.",
                    "Rigorous specification and conformance testing techniques for network protocols, as applied to TCP, UDP, and sockets.",
                    "Policing congestion response in an internetwork using re-feedback.",
                    "Declarative routing: extensible routing with declarative queries.",
                    "Towards a global IP anycast service.",
                    "Towards an evolvable internet architecture.",
                    "The internet and identifiers."
                ]
            }
        ]
    },
    {
        "year": "2004",
        "name": "SIGCOMM 2004",
        "info": "Portland, Oregon, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2004",
                "sub_name": "Proceedings of the ACM SIGCOMM 2004 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 30 - September 3, 2004, Portland, Oregon, USA.",
                "count": 32,
                "papers": [
                    "Back to the future part 4: the internet.",
                    "A first-principles approach to understanding the internet's router-level topology.",
                    "Vivaldi: a decentralized network coordinate system.",
                    "Routing design in operational networks: a look from the inside.",
                    "Locating internet bottlenecks: algorithms, measurements, and implications.",
                    "An algebraic approach to practical and scalable overlay network monitoring.",
                    "CapProbe: a simple and accurate capacity estimation technique.",
                    "Optimizing cost and performance for multihoming.",
                    "A comparison of overlay routing and multihoming route control.",
                    "The feasibility of supporting large-scale live streaming applications with dynamic application end-points.",
                    "Link-level measurements from an 802.11b mesh network.",
                    "Comparison of routing metrics for static multi-hop wireless networks.",
                    "Routing in a delay tolerant network.",
                    "Turning the postal system into a generic digital communication mechanism.",
                    "A system for authenticated policy-compliant routing.",
                    "SPV: secure path vector routing for securing BGP.",
                    "Shield: vulnerability-driven network filters for preventing known vulnerability exploits.",
                    "Locating internet routing instabilities.",
                    "Diagnosing network-wide traffic anomalies.",
                    "Network sensitivity to hot-potato disruptions.",
                    "Building a better NetFlow.",
                    "Work-conserving distributed schedulers for Terabit routers.",
                    "Exact GPS simulation with logarithmic complexity, and its application to an optimally fair scheduler.",
                    "Sizing router buffers.",
                    "A wavelet-based approach to detect shared congestion.",
                    "Delayed stability and performance of distributed congestion control.",
                    "Impact of configuration errors on DNS robustness.",
                    "The design and implementation of a next generation name service for the internet.",
                    "A layered naming architecture for the internet.",
                    "Mercury: supporting scalable multi-attribute range queries.",
                    "Modeling and performance analysis of BitTorrent-like peer-to-peer networks.",
                    "A scalable distributed information management system."
                ]
            }
        ]
    },
    {
        "year": "2003",
        "name": "SIGCOMM 2003",
        "info": "Karlsruhe, Germany",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2003",
                "sub_name": "Proceedings of the ACM SIGCOMM 2003 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 25-29, 2003, Karlsruhe, Germany.",
                "count": 34,
                "papers": [
                    "A knowledge plane for the internet.",
                    "A routing underlay for overlay networks.",
                    "Greening of the internet.",
                    "A delay-tolerant network architecture for challenged internets.",
                    "Routing using potentials: a dynamic traffic-aware routing algorithm.",
                    "Network routing with path vector protocols: theory and applications.",
                    "Design principles of policy languages for path vector protocols.",
                    "Low-rate TCP-targeted denial of service attacks: the shrew vs. the mice and elephants.",
                    "Robustness to inflated subscription in multicast congestion control.",
                    "A framework for classifying denial of service attacks.",
                    "The causes of path inflation.",
                    "The impact of address allocation and routing on the structure and implementation of routing tables.",
                    "Automatically inferring patterns of resource consumption in network traffic.",
                    "On selfish routing in internet-like environments.",
                    "Forwarding in a content-based network.",
                    "Peer-to-peer information retrieval using self-organizing semantic overlay networks.",
                    "Scaling internet routers using optics.",
                    "Longest prefix matching using bloom filters.",
                    "Packet classification using multidimensional cutting.",
                    "Quantum cryptography in practice.",
                    "Stratified round Robin: a low complexity packet scheduler with bandwidth fairness and bounded delay.",
                    "A comparison of hard-state and soft-state signaling protocols.",
                    "The effects of active queue management on web performance.",
                    "Design of a robust active queue management algorithm based on feedback compensation.",
                    "Persistent dropping: an efficient control of traffic aggregates.",
                    "An information-theoretic approach to traffic matrix estimation.",
                    "Making intra-domain routing robust to changing and uncertain traffic demands: understanding fundamental tradeoffs.",
                    "Estimating flow distributions from sampled flow statistics.",
                    "A high-level programming environment for packet trace anonymization and transformation.",
                    "A measurement-based analysis of multihoming.",
                    "Towards an accurate AS-level traceroute tool.",
                    "The impact of DHT routing geometry on resilience and proximity.",
                    "Graph-theoretic analysis of structured peer-to-peer systems: routing distances and fault resilience.",
                    "Making gnutella-like P2P systems scalable."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "SIGCOMM 2002",
        "info": "Pittsburgh, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2002",
                "sub_name": "Proceedings of the ACM SIGCOMM 2002 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 19-23, 2002, Pittsburgh, PA, USA.",
                "count": 25,
                "papers": [
                    "Understanding BGP misconfiguration.",
                    "On the correctness of IBGP configuration.",
                    "Realistic BGP traffic for test labs.",
                    "Informed content delivery across adaptive overlay networks.",
                    "SOS: secure overlay services.",
                    "Internet indirection infrastructure.",
                    "Congestion control for high bandwidth-delay product networks.",
                    "On the long-run behavior of equation-based rate control.",
                    "Selfish behavior and stability of the internet: a game-theoretic analysis of TCP.",
                    "Measuring ISP topologies with rocketfuel.",
                    "Network topology generators: degree-based vs. structural.",
                    "Traffic matrix estimation: existing techniques and new directions.",
                    "Replication strategies in unstructured peer-to-peer networks.",
                    "Wave and equation based rate control using multicast round trip time.",
                    "Scalable application layer multicast.",
                    "Route flap damping exacerbates internet routing convergence.",
                    "Route oscillations in I-BGP with route reflection.",
                    "Routers with a single stage of buffering.",
                    "Lightweight network support for scalable end-to-end services.",
                    "On fundamental tradeoffs between delay bounds and computational complexity in packet scheduling algorithms.",
                    "End-to-end available bandwidth: measurement methodology, dynamics, and relation with TCP throughput.",
                    "On the characteristics and origins of internet flow rates.",
                    "New directions in traffic measurement and accounting.",
                    "An end-to-end approach to globally scalable network storage.",
                    "Tussle in cyberspace: defining tomorrow's internet."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "SIGCOMM 2001",
        "info": "San Diego, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2001",
                "sub_name": "Proceedings of the ACM SIGCOMM 2001 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 27-31, 2001, San Diego, CA, USA.",
                "count": 23,
                "papers": [
                    "Hash-based IP traceback.",
                    "On the effectiveness of route-based packet filtering for distributed DoS attack prevention in power-law internets.",
                    "Reliable group rekeying: a performance analysis.",
                    "Aging through cascaded caches: performance issues in the distribution of web content.",
                    "Enabling conferencing applications on the internet using an overlay muilticast architecture.",
                    "IPNL: A NAT-extended internet architecture.",
                    "On the impact of policing and rate guarantees in DiffServ networks: a video streaming application perspective.",
                    "Scalable on-demand media streaming with packet loss recovery.",
                    "Statistical bandwidth sharing: a study of congestion at flow level.",
                    "Analysis and design of an adaptive virtual queue (AVQ) algorithm for active queue management.",
                    "Algorithms for provisioning virtual private networks in the hose model.",
                    "Chord: A scalable peer-to-peer lookup service for internet applications.",
                    "A scalable content-addressable network.",
                    "An investigation of geographic mapping techniques for internet hosts.",
                    "Fair queuing for aggregated multiple links.",
                    "Scalable packet classification.",
                    "SRR: An O(1) time complexity packet scheduler for flows in multi-service packet networks.",
                    "Stability issues in OSPF routing.",
                    "Topology discovery for large ethernet networks.",
                    "Hop by hop multicast routing protocol.",
                    "Dynamic behavior of slowly-responsive congestion control algorithms.",
                    "Extending equation-based congestion control to multicast applications.",
                    "On inferring TCP behavior."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "SIGCOMM 2000",
        "info": "Stockholm, Sweden",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/2000",
                "sub_name": "Proceedings of the ACM SIGCOMM 2000 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 28 - September 1, 2000, Stockholm, Sweden.",
                "count": 26,
                "papers": [
                    "A framework for scalable global IP-anycast (GIA).",
                    "pgmcc: a TCP-friendly single-rate multicast.",
                    "Fault isolation in multicast trees.",
                    "Equation-based congestion control for unicast applications.",
                    "Endpoint admission control: Architectural issues and performance.",
                    "Decoupling QoS control from core routers: A novel bandwidth broker architecture for scalable support of guaranteed services.",
                    "A protocol-independent technique for eliminating redundant network traffic.",
                    "On network-aware clustering of web clients.",
                    "The content and access dynamics of a busy web site: findings and implicatins.",
                    "Critical path analysis of TCP transactions.",
                    "Tuning RED for web traffic.",
                    "Fluid-based analysis of a network of AQM routers supporting TCP flows with an application to RED.",
                    "Routability stability in congested networks: experimentation and analysis.",
                    "Delayed internet routing convergence.",
                    "FIRE: Flexible intra-AS routing environment.",
                    "SmartBridge: A scalable bridge architecture.",
                    "TCP is max-plus linear: and what tells us on its throughput.",
                    "A stochastic model of TCP/IP with stationary random.",
                    "On the proagation of long-range dependence in the internet.",
                    "Deriving traffic demands for operational IP networks: methodology and experience.",
                    "Trajectory sampling for direct traffic observation.",
                    "Measuring link bandwidths using a deterministic model of packet delay.",
                    "Practical network support for IP traceback.",
                    "When the CRC and TCP checksum disagree.",
                    "Packet Types: Abstract specifications of network protocol messages.",
                    "Memory-efficient state lookups with fast updates."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "SIGCOMM 1999",
        "info": "Cambridge, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1999",
                "sub_name": "Proceedings of the ACM SIGCOMM 1999 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 30 - September 3, 1999, Cambridge, Massachusetts, USA.",
                "count": 24,
                "papers": [
                    "A Readable TCP in the Prolac Protocol Language.",
                    "A Model, Analysis, and Protocol Framework for Soft State-Based Communication.",
                    "The Impact of Multicast Layering on Network Fairness.",
                    "Scaling of Multicast Trees: Comments on the Chuang-Sirbu Scaling Law.",
                    "KHIP - A Scalable Protocol for Secure Multicast Routing.",
                    "IP Multicast Channels: EXPRESS Support for Large-scale Single-source Applications.",
                    "Providing Guaranteed Services without Per Flow Management.",
                    "A Flexible Model for Resource Management in Virtual Private Networks.",
                    "Proportional Differentiated Services: Delay Differentiation and Packet Scheduling.",
                    "BPF+: Exploiting Global Data-Flow Optimization in a Generalized Packet Filter Architecture.",
                    "Packet Classification Using Tuple Space Search.",
                    "Packet Classification on Multiple Fields.",
                    "A Scalable Web Cache Consistency Architecture.",
                    "An Integrated Congestion Management Architecture for Internet Hosts.",
                    "Quality Adaptation for Congestion Controlled Video Playback over the Internet.",
                    "Routing with a Clue.",
                    "Load-Sensitive Routing of Long-Lived IP Flows.",
                    "A Simple Approximation to Minimum-Delay Routing.",
                    "Using Pathchar to Estimate Internet Link Characteristics.",
                    "On Power-law Relationships of the Internet Topology.",
                    "On Estimating End-to-End Network Path Properties.",
                    "An Analysis of BGP Convergence Properties.",
                    "The End-to-End Effects of Internet Path Selection.",
                    "Dynamics of IP Traffic: A Study of the Role of Variability and the Impact of Control."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "SIGCOMM 1998",
        "info": "Vancouver, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1998",
                "sub_name": "Proceedings of the ACM SIGCOMM 1998 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, August 31 - September 4, 1998, Vancouver, B.C., Canada.",
                "count": 26,
                "papers": [
                    "Best-Effort versus Reservations: A Simple Comparative Analysis.",
                    "Quality of Service Based Routing: A Performance Perspective.",
                    "Scalable QoS Provision Through Buffer Management.",
                    "Data Networks as Cascades: Investigating the Multifractal Nature of Internet WAN Traffic.",
                    "A Digital Fountain Approach to Reliable Distribution of Bulk Data.",
                    "Secure Group Communications Using Key Graphs.",
                    "Achieving Bounded Fairness for Multicast and TCP Traffic in the Internet.",
                    "The MASC/BGMP Architecture for Inter-Domain Multicast Routing.",
                    "Session Directories and Scalable Internet Multicast Address Allocation.",
                    "Core-Stateless Fair Queueing: Achieving Approximately Fair Bandwidth Allocations in High Speed Networks.",
                    "Uniform versus Priority Dropping for Layered Video.",
                    "QoSMIC: Quality of Service Sensitive Multicast Internet Protocol.",
                    "Predictive and Adaptive Bandwidth Reservation for Hand-Offs in QoS-Sensitive Cellular Networks.",
                    "The Performance of Query Control Schemes for the Zone Routing Protocol.",
                    "An Active Service Framework and Its Application to Real-Time Multimedia Transcoding.",
                    "Fast and Scalable Layer Four Switching.",
                    "High-Speed Policy-Based Packet Forwarding Using Efficient Multi-Dimensional Range Matching.",
                    "An Extensible Probe Architecture for Network Protocol Performance Measurement.",
                    "Router Plugins: A Software Architecture for Next Generation Routers.",
                    "Improving End-to-End Performance of the Web Using Server Volumes and Proxy Filters.",
                    "Summary Cache: A Scalable Wide-Area Web Cache Sharing Protocol.",
                    "Accelerated Reliability Analysis for Self-Healing SONET Networks.",
                    "Scoped Hybrid Automatic Repeat reQuest with Forward Error Correction (SHARQFEC).",
                    "Error Control Techniques for Interactive Low-Bit Rate Video Transmission over the Internet.",
                    "Modeling TCP Throughput: A Simple Model and Its Empirical Validation.",
                    "Automatic TCP Buffer Tuning."
                ]
            }
        ]
    },
    {
        "year": "1997",
        "name": "SIGCOMM 1997",
        "info": "Cannes, France",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1997",
                "sub_name": "Proceedings of the ACM SIGCOMM 1997 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, September 14-18, 1997, Cannes, France.",
                "count": 24,
                "papers": [
                    "Small Forwarding Tables for Fast Routing Lookups.",
                    "A Simulation Study of IP Switching.",
                    "Scalable High Speed IP Routing Lookups.",
                    "Solutions to Hidden Terminal Problems in Wireless Networks.",
                    "Trace-Based Mobile Network Emulation.",
                    "Fair Scheduling in Wireless Packet Networks.",
                    "Fast Restoration of Real-Time Communication Service from Component Failures in Multi-Hop Networks.",
                    "Skyscraper Broadcasting: A New Broadcasting Scheme for Metropolitan Video-on-Demand Systems.",
                    "Active Bridging.",
                    "Internet Routing Instability.",
                    "Dynamics of Random Early Detection.",
                    "End-to-end Internet Packet Dynamics.",
                    "Network Performance Effects of HTTP/1.1, CSS1, and PNG.",
                    "Automated Packet Trace Analysis of TCP Implementations.",
                    "Potential Benefits of Delta Encoding and Data Compression for HTTP.",
                    "Network Text Editor (NTE): A Scalable Shared Text Editor for the MBone.",
                    "Consistent Overhead Byte Stuffing.",
                    "A Flow-Based Approach to Datagram Security.",
                    "A Framework for Robust Measurement-Based Admission Control.",
                    "A Hierarchical Fair Service Curve Algorithm for Link-Sharing, Real-Time and Priority Services.",
                    "Effective Bandwidths for a Class of Non Markovian Fluid Sources.",
                    "Iolus: A Framework for Scalable Secure Multicasting.",
                    "Parity-Based Loss Recovery for Reliable Multicast Transmission.",
                    "Scheduling of Multicast Traffic in Tunable-Receiver WDM Networks with Non-Negligible Tuning Latencies."
                ]
            }
        ]
    },
    {
        "year": "1996",
        "name": "SIGCOMM 1996",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1996",
                "sub_name": "Proceedings of the ACM SIGCOMM 1996 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, Stanford, CA, USA, August 26-30, 1996.",
                "count": 27,
                "papers": [
                    "The Importance of Long-Range Dependence of VBR Video Traffic in ATM Traffic Engineering: Myths and Realities.",
                    "On the Relevance of Long-Range Dependence in Network Traffic.",
                    "End-to-end Routing Behavior in the Internet.",
                    "ASHs: Application-Specific Handlers for High-Performance Messaging.",
                    "DPF: Fast, Flexible Message Demultiplexing Using Dynamic Code Generation.",
                    "Generating Efficient Protocol Code from an Abstract Specification.",
                    "Analysis of Techniques to Improve Protocol Processing Latency.",
                    "Speeding up Protocols for Small Messages.",
                    "Masking the Overhead of Protocol Layering.",
                    "Efficient Support of Delay and Rate Guarantees in an Internet.",
                    "Receiver-Driven Layered Multicast.",
                    "A Reliable and Scalable Striping Protocol.",
                    "Hierarchical Packet Fair Queueing Algorithms.",
                    "Start-Time Fair Queueing: A Scheduling Algorithm for Integrated Services Packet Switching Networks.",
                    "Phantom: A Simple and Effective Flow Control Scheme.",
                    "Multicasting Protocols for High-Speed, Wormhole-Routing Local Area Networks.",
                    "Simulation Study of the Capacity Effects of Dispersity Routing for Fault Tolerant Realtime Channels.",
                    "Routing High-Bandwidth Traffic in Max-Min Fair Share Networks.",
                    "A Channel Access Scheme for Large Dense Packet Radio Networks.",
                    "Adaptive Resource Management Algorithms for Indoor Mobile Computing Environments.",
                    "Measurement and Analysis of the Error Characteristics of an In-Building Wireless Network.",
                    "A Comparison of Mechanisms for Improving TCP Performance over Wireless Links.",
                    "Improving the Start-Up Behavior of a Congestion Control Scheme for TCP.",
                    "Forward Acknowledgement: Refining TCP Congestion Control.",
                    "Removal Policies in Network Caches for World-Wide Web Documents.",
                    "Measuring the Performance of Communication Middleware on High-Speed Networks.",
                    "Internet Mobility 4x4."
                ]
            }
        ]
    },
    {
        "year": "1995",
        "name": "SIGCOMM 1995",
        "info": "Cambridge, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1995",
                "sub_name": "Proceedings of the ACM SIGCOMM 1995 Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication, Cambridge, MA, USA, August 28 - September 1, 1995.",
                "count": 29,
                "papers": [
                    "A Measurement-Based Admission Control Algorithm for Integrated Services Packet Networks.",
                    "Two Issues in Reservation Establishment.",
                    "Design, Implementation, and Evaluation of a Software-Based Real-Time Ethernet Protocol.",
                    "Pipelined Memory Shared Buffer for VLSI Switches.",
                    "aItPm: A Strategy for Integrating IP with ATM.",
                    "Hierarchical Distance-Vector Multicast Routing for the MBone.",
                    "Performance of Checksums and CRCs over Real Data.",
                    "Performance Analysis of MD5.",
                    "Software Support for Outboard Buffering and Checksumming.",
                    "Self-Similarity Through High-Variability: Statistical Analysis of Ethernet LAN Traffic at the Source Level.",
                    "Modeling and Simulation of Self-Similar Variable Bit Rate Compressed Video: A Unified Approach.",
                    "Performance Bounds in Communication Networks with Variable-Rate Links.",
                    "A System for Constructing Configurable High-Level Protocols.",
                    "Protocol Implementation Using Integrated Layer Processing.",
                    "Trading Packet Headers for Packet Processing.",
                    "An Automatic Trace Analysis Tool Generator for Estelle Specifications.",
                    "Evaluation of TCP Vegas: Emulation and Experiment.",
                    "Leave-in-Time: A New Service Discipline for Real-Time Communications in a Packet-Switching Network.",
                    "RCBR: A Simple and Efficient Service for Multiple Time-Scale Traffic.",
                    "Efficient Fair Queueing Using Deficit Round Robin.",
                    "A Mobile User Location Update and Paging Mechanism Under Delay Constraints.",
                    "Authentication Protocols for Personal Communication Systems.",
                    "Floor Acquisition Multiple Access (FAMA) for Packet-Radio Networks.",
                    "The Conference Control Channel Protocol (CCCP): A Scalable Base for Building Conference Control Applications.",
                    "Locating Nearby Copies of Replicated Internet Servers.",
                    "The Case for Persistent-Connection HTTP.",
                    "Sharing the \"Cost\" of Multicast Trees: An Axiomatic Analysis.",
                    "Log-Based Receiver-Reliable Multicast for Distributed Interactive Simulation.",
                    "A Reliable Multicast Framework for Light-Weight Sessions and Application Level Framing."
                ]
            }
        ]
    },
    {
        "year": "1994",
        "name": "SIGCOMM 1994",
        "info": "London, UK",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1994",
                "sub_name": "Proceedings of the ACM SIGCOMM 1994 Conference on Communications Architectures, Protocols and Applications, London, UK, August 31 - September 2, 1994.",
                "count": 29,
                "papers": [
                    "Experiences with a High-Speed Network Adaptor: A Software Perspective.",
                    "User-Space Protocols Deliver High Performance to Applications on a Low-Cost Gb/s LAN.",
                    "TCP Vegas: New Techniques for Congestion Detection and Avoidance.",
                    "A Structured TCP in Standard ML.",
                    "Making Greed Work in Networks: A Game-Theoretic Analysis of Switch Service Disciplines.",
                    "Scalable Feedback Control for Multicast Video Distribution in the Internet.",
                    "Statistical Analysis of Generalized Processor Sharing Scheduling Discipline.",
                    "Dynamics of TCP Traffic Over ATM Networks.",
                    "Reliable and Efficient Hop-by-Hop Flow Control.",
                    "Credit-Based Flow Control for ATM Networks: Credit Update Protocol, Adaptive Credit Allocation and Statistical Multiplexing.",
                    "Flexible Routing and Addressing for a Next Generation IP.",
                    "An Architecture for Wide-Area Multicast Routing.",
                    "Distributed, Scalable Routing Based on Link-State Vectors.",
                    "Signaling and Operating System Support for Native-Mode ATM Applications.",
                    "Experiences of Building an ATM Switch for the Local Area.",
                    "Controlling Alternate Routing in General-Mesh Packet Flow Networks.",
                    "On Optimization of Polling Policy Represented by Neural Network.",
                    "Design and Implementation of a Prototype Optical Deflection Network.",
                    "Conflict-Free Channel Assignment for an Optical Cluster-Based Shuffle Network Configuration.",
                    "MACAW: A Media Access Protocol for Wireless LAN's.",
                    "Asymptotic Resource Consumption in Multicast Reservation Styles.",
                    "Highly Dynamic Destination-Sequenced Distance-Vector Routing (DSDV) for mobile computers.",
                    "A Methodology for Designing Communication Protocols.",
                    "Wide-Area Traffic: The Failure of Poisson Modeling.",
                    "Analysis, Modeling and Generation of Self-Similar VBR Video Traffic.",
                    "An Algorithm for Lossless Smoothing of MPEG Video.",
                    "USC: A Universal Stub Compiler.",
                    "An Object-Based Approach to Protocol Software Implementation.",
                    "Improved Algorithms for Synchronizing Computer Network Clocks."
                ]
            }
        ]
    },
    {
        "year": "1993",
        "name": "SIGCOMM 1993",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1993",
                "sub_name": "Proceedings of the ACM SIGCOMM 1993 Conference on Communications Architectures, Protocols and Applications, San Francisco, CA, USA, September 13-17, 1993.",
                "count": 28,
                "papers": [
                    "On Per-Session End-to-End Delay Distributions and the Call Admission Problem for Real-Time Applications with QOS Requirements.",
                    "Analysis of Burstiness and Jitter in Real-Time Communications.",
                    "An Adaptive Congestion Control Scheme for Real-Time Packet Video Transport.",
                    "The Synchronization of Periodic Routing Messages.",
                    "Dynamics of Internet Routing Information.",
                    "Open Shortest Path First (OSPF) Routing Protocol Simulation.",
                    "Implementing Network Protocols at User Level.",
                    "Locking Effects in Multiprocessor Implementations of Protocols.",
                    "Core Based Trees (CBT).",
                    "Routing Reserved Bandwith Multi-Point Connections.",
                    "Causal Ordering in Reliable Group Communications.",
                    "Optimizing File Transfer Response Time Using the Loss-Load Curve Congestion Control Mechanism.",
                    "An Adaptive Framework for Dynamic Access to Bandwith at High Speeds.",
                    "Warp Control: A Dynamically Stable Congestion Protocol and Its Analysis.",
                    "Control Handling in Real-Time Communication Protocols.",
                    "Structural Complexity and Execution Efficiency of Distributed Application Protocols.",
                    "A Data Labelling Technique for High-Performance Protocol Processing and Its Consequences.",
                    "On the Self-Similar Nature of Ethernet Traffic.",
                    "Application of Sampling Methodologies to Network Traffic Characterization.",
                    "ATM Scheduling with Queuing Delay Predictions.",
                    "HAP: A New Model for Packet Arrivals.",
                    "Management of Virtual Private Networks for Integrated Broadband Communication.",
                    "A Case for Caching File Objects Inside Internetworks.",
                    "Linear Recursive Networks and Their Applications in Topological Design and Data Routing.",
                    "The Importance of Non-Data Touching Processing Overheads in TCP/IP.",
                    "A Distributed Queueing Random Access Protocol for a Broadcast Channel.",
                    "Fault Detection in an Ethernet Network Using Anomaly Signature Matching.",
                    "End-to-End Packet Delay and Loss Behavior in the Internet."
                ]
            }
        ]
    },
    {
        "year": "1992",
        "name": "SIGCOMM 1992",
        "info": "Baltimore, Maryland, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1992",
                "sub_name": "Proceedings of the Conference on Communications Architecture & Protocols, SIGCOMM 1992, Baltimore, Maryland, USA, August 17-20, 1992.",
                "count": 27,
                "papers": [
                    "An Efficient Communication Protocol for High-Speed Packet-Switched Multichannel Networks.",
                    "Supporting Real-Time Applications in an Integrated Services Packet Network: Architecture and Mechanism.",
                    "A Language-Based Approach to Protocol Implementation.",
                    "Scalable Inter-Domain Routing Architecture.",
                    "Dynamic Multi-Path Routing and How It Compares With Other Dynamic Routing Algorithms for High Speed Wide Area Network.",
                    "Internet Routing Over Large Public Data Networks Using Shortcuts.",
                    "Architecture Design for Regulating and Scheduling User's Traffic in ATM Networks.",
                    "Continuous Media Communication with Dynamic QOS Control Using ARTS with an FDDI Network.",
                    "A Continuous Media Transport and Orchestration Service.",
                    "A Hop by Hop Rate-Based Congestion Control Scheme.",
                    "Dynamic Time Windows: Packet Admission control with Feedback.",
                    "Analysis of a Rate-Based Control Strategy with Delayed Feedback.",
                    "Performance Analysis of an Asynchronous Multi-Rate Crossbar with Bursty Traffic.",
                    "An Effective Scheme for Pre-Emptive Priorities in Dual Bus Metropolitan Area Networks.",
                    "A Labeling Algorithm for Just-in-Time Scheduling in TDMA Networks.",
                    "An Evaluation Framework for Multicast Ordering Protocols.",
                    "Reliability and Scaling Issues in Multicast Communication.",
                    "Analyzing Communication Latency Using the Nectar Communication Processor.",
                    "Scheduling Algorithms for Multi-Hop Radio Networks.",
                    "Joint Scheduling and Admission Control for ATS-Based Switching Nodes.",
                    "Pre-Allocation Media Access Control Protocols for Multiple Access WDM Photonic Networks.",
                    "Performance Evaluation of Forward Error Correction in ATM Networks.",
                    "Image Transfer: An End-to-End Design.",
                    "Efficient Demultiplexing of Incoming TCP Packets.",
                    "An Analysis of Wide-Area Name Server Traffic: A Study of the Internet Domain Name System.",
                    "Visualizing Packet Traces.",
                    "Observing TCP Dynamics in Real Networks."
                ]
            }
        ]
    },
    {
        "year": "1991",
        "name": "SIGCOMM 1991",
        "info": "Zürich, Switzerland",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1991",
                "sub_name": "Proceedings of the Conference on Communications Architecture & Protocols, SIGCOMM 1991, Zürich, Switzerland, September 3-6, 1991.",
                "count": 28,
                "papers": [
                    "A Control-Theoretic Approach to Flow Control.",
                    "Loss-Load Curves: Support for Rate-Based Congestion Control in High-Speed Datagram Networks.",
                    "Dynamics of Distributed Shortest-Path Routing Algorithms.",
                    "Finding Disjoint Paths in Networks.",
                    "Efficient and Robust Policy Routing Using Multiple Hierarchical Addresses.",
                    "GSPN Models of Random, Cyclic, and Optimal 1-Limited Multiserver Multiqueue Systems.",
                    "Queueing Analysis of a Statistical Multiplexer with Multiple Slow Terminals.",
                    "Efficient Gateway Synthesis from Formal Specifications.",
                    "Characteristics of Wide-Area TCP/IP Conversations.",
                    "Comparison of Rate-Based Service Disciplines.",
                    "A Study of Priority Pricing in Multiple Service Class Networks.",
                    "Observations on the Dynamics of a Congestion Control Algorithm: The Effects of Two-Way Traffic.",
                    "Performance Analysis of a Feedback Congestion Control Policy Under Non-Negligible Propagation Delay.",
                    "Analysis of Dynamic Congestion Control Protocols: A Fokker-Planck Approximation.",
                    "Design of an ATM-FDDI Gateway.",
                    "Nomenclator Descriptive Query Optimization for Large X.500 Environments.",
                    "Flexible Protocol Stacks.",
                    "A Network Architecture Providing Host Migration Transparency.",
                    "Concurrent Online Tracking of Mobile Users.",
                    "IP-Based Protocols for Mobile Internetworking.",
                    "The LAMS-DLC ARQ Protocol.",
                    "Hardware Flooding (preliminary version).",
                    "Network Locality at the Scale of Processes.",
                    "MARS: The Magnet II Real-Time Scheduling Algorithm.",
                    "About Maximum Transfer Rates for Fast Packet Switching Networks.",
                    "A Host-Network Interface Architecture for ATM.",
                    "A High-Performance Host Interface for ATM Networks.",
                    "Fairisle: An ATM Network for the Local Area."
                ]
            }
        ]
    },
    {
        "year": "1990",
        "name": "SIGCOMM 1990",
        "info": "Philadelpia, PA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1990",
                "sub_name": "Proceedings of the ACM Symposium on Communications Architectures & Protocols, SIGCOMM 1990, Philadelpia, PA, USA, September 24-27, 1990.",
                "count": 31,
                "papers": [
                    "Random Drop Congestion Control.",
                    "A Stop-and-Go Queueing Framework for Congestion Management.",
                    "Virtual Clock: A New Traffic Control Algorithm for Packet Switching Networks.",
                    "Dynamic Adaptive Windows for High Speed Data Networks: Theory and Simulations.",
                    "Efficient At-Most-Once Messages Based on Synchronized Clocks.",
                    "Uniform Access to Internet Directory Services.",
                    "A Data Processing Performance Model for the OSI Application Layer Protocols.",
                    "A Simple Multiple Access Protocol for Metropolitan Area Networks.",
                    "The DARPA Wideband Network Protocol.",
                    "Machnet: A Simple Access Protocol for High Speed or Long Haul Communications.",
                    "Mechanisms for Integrated Voice and Data Conferencing.",
                    "Link Access Blocking in Very Large Multi-Media Networks.",
                    "Protocol Conformance Test Generation Using Multiple UIO Sequences With Overlapping.",
                    "Gauss: A Simple High Performance Switch Architecture for ATM.",
                    "Protocol Implementation on the Nectar Communication Processor.",
                    "Pulsa: Non-Blocking Packet Switching with Shift-Register Rings.",
                    "A Theoretical Analysis of Feedback Flow Control.",
                    "Shortest Path First with Emergency Exits.",
                    "Shortest Paths and Loop-Free Routing in Dynamic Networks.",
                    "Transport Protocol Processing at GBPS Rates.",
                    "Architectural Considerations for a New Generation of Protocols.",
                    "Multiplexing Issues in Communication System Design.",
                    "Avoiding Name Resolution Loops and Duplications in Group Communications.",
                    "Design of Inter-Administrative Domain Routing Protocols.",
                    "Topology Distribution Cost vs. Efficient Routing in Large Networks.",
                    "Efficient Use of Workstations for Passive Monitoring of Local Area Networks.",
                    "Performance Analysis of FDDI Token Ring Networks: Effect of Parameters and Guidelines for Setting TTRT.",
                    "Frame Content Independent Stripping.",
                    "Fast Connection Establishment in High Speed Networks.",
                    "Reliable Broadband Communication Using a Burst Erasure Correcting Code.",
                    "An Inclusive Session Level Protocol for Distributed Applications."
                ]
            }
        ]
    },
    {
        "year": "1989",
        "name": "ACM SIGCOMM 1989",
        "info": "Austin, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1989",
                "sub_name": "Proceedings of the ACM Symposium on Communications Architectures & Protocols, SIGCOMM 1989, Austin, TX, USA, September 19-22, 1989.",
                "count": 29,
                "papers": [
                    "Analysis and Simulation of a Fair Queueing Algorithm.",
                    "Connection Caching of Traffic Adaptive Dynamic Virtual Circuits.",
                    "A Hierarchical Solution for Application Level Store-and-Forward Deadlock Prevention.",
                    "Specification and Verification of Network Managers for Large Internets.",
                    "The Revised ARPANET Routing Metric.",
                    "A Routing Architecture for Very Large Networks Undergoing Rapid Reconfiguration.",
                    "Descriptive names in X.500.",
                    "X-NET: A Dual Bus Fiber-Optic LAN Using Active Switches.",
                    "AMp: A Highly Parallel Atomic Multicast Protocol.",
                    "Traffic Placement Policies for Multi-Band Network.",
                    "REXDC - A Remote Execution Mechanism.",
                    "A Top Down Unification of Minimum Cost Spanning Tree Algorithms.",
                    "Block Acknowledgement: Redesigning the Window Protocol.",
                    "New Results on Deriving Protocol Specifications from Service Specifications.",
                    "A High Speed Transport Protocol for Datagram/Virtual Circuit Networks.",
                    "Sirpent: A High-Performance Internetworking Approach.",
                    "Group Communication in Multichannel Networks with Staircase Interconnection Topologies.",
                    "A Testbed for Wide Area ATM Research.",
                    "Flexible Aggregation of Channel Bandwidth in Primary Rate ISDN.",
                    "Dynamic Bandwidth Management of Primary Rate ISDN to Support ATM Access.",
                    "A Unified Approach to Loop-Free Routing Using Distance Vectors or Link States.",
                    "A Loop-Free Extended Bellman-Ford Routing Protocol Without Bouncing Effect.",
                    "A New Responsive Distributed Shortest-Path Rounting Algorithm.",
                    "Deriving a Protocol Converter: A Top-Down Method.",
                    "A Protocol Conversion Software Toolkit.",
                    "Internet Routing.",
                    "An Improved Protocol Test Generation Procedure Based on UIOS.",
                    "Probabilistic Testing of Protocols.",
                    "Protocol Validation in Complex Systems."
                ]
            }
        ]
    },
    {
        "year": "1988",
        "name": "ACM SIGCOMM 1988",
        "info": "Stanford, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1988",
                "sub_name": "Proceedings of the ACM Symposium on Communications Architectures and Protocols, SIGCOMM 1988, Stanford, CA, USA, August 16-18, 1988.",
                "count": 32,
                "papers": [
                    "Topological analysis of local-area internetworks.",
                    "Dynamic bandwidth allocation in a network.",
                    "Optical interconnection using ShuffleNet multihop networks in multi-connected ring topologies.",
                    "The landmark hierarchy: a new hierarchy for routing in very large networks.",
                    "Pitfalls in the design of distributed routing algorithms.",
                    "Multicast routing in internetworks and extended LANs.",
                    "Design of the x-kernel.",
                    "Exploiting recursion to simplify RPC communication architectures.",
                    "Service specification and protocol construction for the transport layer.",
                    "A network management language for OSI networks.",
                    "The design philosophy of the DARPA internet protocols.",
                    "The fuzzball.",
                    "Development of the domain name system.",
                    "Optimizing bulk data transfer performance: a packet train model.",
                    "A mesh/token ring hybrid-architecture LAN.",
                    "Tree LANs with collision avoidance: protocol, switch architecture, and simulated performance.",
                    "An analysis of Memnet - an experiment in high-speed shared-memory local networking.",
                    "The VMP network adapter board (NAB): high-performance network communication for multiprocessors.",
                    "Circuit switching in multi-hop lightwave networks.",
                    "A pseudo-machine for packet monitoring and statistics.",
                    "Knowledge-based monitoring and control: an approach to understanding behavior of TCP/IP network protocols.",
                    "Measured capacity of an Ethernet: myths and reality.",
                    "Distributed testing and measurement across the Atlantic packet satellite network(SATNET).",
                    "A multicast transport protocol.",
                    "Experience with test generation for real protocols.",
                    "Performance models for Noahnet.",
                    "A high performance broadcast file transfer protocol.",
                    "Specification and verification of collusion-free broadcast networks.",
                    "Delivery and discrimination: the Seine protocol.",
                    "A binary feedback scheme for congestion avoidance in computer networks with a connectionless network layer.",
                    "Congestion avoidance and control.",
                    "A protocol to maintain a minimum spanning tree in a dynamic topology."
                ]
            }
        ]
    },
    {
        "year": "1986",
        "name": "ACM SIGCOMM 1986",
        "info": "Stowe, Vermont, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1986",
                "sub_name": "Proceedings of the ACM SIGCOMM conference on Communications architectures & protocols, SIGCOMM 1986, Stowe, Vermont, United States, August 5-7, 1986.",
                "count": 45,
                "papers": [
                    "The current status of MAP.",
                    "The state of the art in protocol engineering.",
                    "Protocol conversion - correctness problems.",
                    "A formal protocol conversion method.",
                    "A model for evaluating demand assignment protocols with arbitrary workloads.",
                    "Implementing priorities in multiaccess protocols for optical fiber-based local area netorks.",
                    "Real-time voice communications over a token-passing ring local area network.",
                    "A comparison of two token-passing bus protocols.",
                    "Command execution in a heterogeneous environment.",
                    "Prediction of transport protocol performance through simulation.",
                    "A verified sliding window protocol with variable flow control.",
                    "Modeling a transport layer protocol using first-order logic.",
                    "Voice transmission in a priority CSMA/AC LAN: an efficient protocol using hybrid switching.",
                    "A framed movable-boundry protocol for integrated voice/data in a LAN.",
                    "Voice and data performance measurements in L-express net.",
                    "An architecture for a multimedia teleconferencing system.",
                    "Tier automation representation of communication protocols.",
                    "Deriving protocol specifications from service specifications.",
                    "A petri net reduction algorithm for protocol analysis.",
                    "Structure of a LOTOS interpreter.",
                    "Frequency-time controlled (FTC) networks for high speed communication.",
                    "Performance analysis of a satellite communications backchannel architecture.",
                    "The butterfly satellite IMP for the wideband packet satellite network.",
                    "A closer look at Noahnet.",
                    "Conformity analysis for communication protocols.",
                    "Synthesis of two-party error-recoverable protocols.",
                    "Formal specification-based conformance testing.",
                    "Inter-organization networks: implications of access control: requirements for interconnection protocol.",
                    "Extending a capability based system into a network environment.",
                    "Communication services under EMCON.",
                    "Access control for network directory systems.",
                    "A selective repeat ARQ scheme for point-to-multipoint communications and its throughput analysis.",
                    "Control procedures for slotted Aloha systems that achieve stability.",
                    "A two-bit contention-based TDMA technique for data transmissions.",
                    "A reliable datagram protocol on local area networks.",
                    "A message-based fault diagnosis procedure.",
                    "A model of file server performance for a heterogeneous distributed system.",
                    "A study of dynamic load balancing in a distributed system.",
                    "A resilient distributed protocol for network synchronization.",
                    "A tuneable protocol for symmetric surveillance in distributed systems.",
                    "Local distributed deadlock detection by knot detection.",
                    "Distributed system V IPC in LOCUS: a design and implementation retrospective.",
                    "Why TCP timers don't work well.",
                    "VMTP: a transport protocol for the next generation of communication systems.",
                    "An interactive test sequence generator."
                ]
            }
        ]
    },
    {
        "year": "1985",
        "name": "9th ACM SIGCOMM 1985",
        "info": "Whistler Moutain, BC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1985",
                "sub_name": "Proceedings of the Ninth Symposium on Data Communications, SIGCOMM 1985, Whistler Moutain, British Columbia, Canada, September 10-12, 1985.",
                "count": 38,
                "papers": [
                    "Development of a TCP/IP for the IBM/370.",
                    "Performance improvements for ISO transport.",
                    "An internodal protocol for packet switched data networks.",
                    "Protocols for large data transfers over local networks.",
                    "Ku-Band earth stations for data communications (panel session - title only).",
                    "A new technique for generating protocol test.",
                    "An algorithm for distributed computation of a spanningtree in an extended LAN.",
                    "Modeling physical layer protocols using communicating finite state machines.",
                    "A grammar-based methodology for protocol specification and implementation.",
                    "DARPA interdomain addressing (panel session, title only).",
                    "Domain names: hierarchy in need of organization (panel session, abstract only).",
                    "Domain names: more questions than answers (panel session, abstract only).",
                    "Operational experience with packet switching networks (panel session, title only).",
                    "Chairman's remarks (panel session, abstract only).",
                    "Datapac (panel session, abstract only).",
                    "Line operations network growth issues (panel session, abstract only).",
                    "Technology for managing large packet switching networks (panel session, abstract only).",
                    "Operations considerations in a large privated packet switching network.",
                    "Solving growth problems in a rapidly expanding PDN (panel session, abstract only).",
                    "Window selection in flow controlled networks.",
                    "Strategies for optimal capacity allocations in DAMA satellite communication systems.",
                    "Integrating satellite links into a land-based packet network.",
                    "Directory services/IBM versus CCITT (panel session, title only).",
                    "An integrated test center for SL-10 packet networks.",
                    "A new method for topological design in large, traffic laden packet switched networks.",
                    "Design of an integrated services packet network.",
                    "Mixing traffic in a buffered banyan network.",
                    "A resilient communication structure for local area netowrks.",
                    "ALPHA transport.",
                    "Remote procedure calls varsus problem-orinted protocols (panel session, title only).",
                    "Issues in using DARPA domain names for computer mail.",
                    "A path-oriented routing strategy for packet switching networks with end-to-end protocols.",
                    "Host groups: a multicast extension for datagram internetworks.",
                    "Integrated services digital network (ISDN, panel).",
                    "An approach for interconnecting SNA and XNS Networks.",
                    "CNMGRAF--graphic presentation services for network management.",
                    "End user applications (panel session, title only).",
                    "ISDN architecture: a basis for new services."
                ]
            }
        ]
    },
    {
        "year": "1984",
        "name": "ACM SIGCOMM 1984",
        "info": "Montréal, Quebec, Canada",
        "venues": [
            {
                "sub_name_abbr": "",
                "sub_name": "Proccedings published in: Computer Communication Review 14(2)",
                "count": 40,
                "papers": [
                    "The architecture of the universe network.",
                    "Managed file distribution on the universe network.",
                    "The satellite transmission protocol of the universe project.",
                    "Serial link protocol design: A critique of the X.25 standard, level 2.",
                    "A methodology for protocol design and specification based on an extended state transition model.",
                    "An exercise in constructing multi-phase communication protocols.",
                    "The use of broadcast techniques on the universe network.",
                    "Datagram routing for internet multicasting.",
                    "One-to-many interprocess communication in the V-system.",
                    "Petri nets are good for protocols.",
                    "Formal specification and validation of ISO transport protocol components, using petri nets.",
                    "Interactive verification of communication software on the basis of CIL.",
                    "A method of automatic proof for the specification and verification of protocols.",
                    "A temporal ordering specification of some session services.",
                    "Factors affecting the performance of distributed applications.",
                    "A performance model for hardware/software issues in computer-aided design of protocol systems.",
                    "Automatic update of replicated topology data bases.",
                    "Automated testing of protocol specifications and their implementations.",
                    "Some operational tools in a OSI protocols study environment.",
                    "Analysis of channel access schemes for high-speed LANs.",
                    "Performance analysis of an access method suitable for the integration of voice and data.",
                    "Twentenet: A LAN with message priorities, design and performance considerations.",
                    "Some critical considerations on the ISO/OSI RM from a network implementation point of view.",
                    "A minimal duplex connection capability in the top three layers of the OSI reference model.",
                    "Communication primitives supporting the execution of atomic actions at remote sites.",
                    "The derivation of performance expressions for communication protocols from timed petri net models.",
                    "An analysis of naming conventions for distributed computer systems.",
                    "Analytic solution of an integrated performance model of a computer communication network with window flow control.",
                    "On the performance of slotted ALOHA in a spread spectrum environment.",
                    "A class of tree algorithms with variable message length.",
                    "An adaptive timeout algorithm for retransmission across a packet switching network.",
                    "Protocol testing methdology development at NBS.",
                    "Some issues in protocol implementation testing.",
                    "Physically dispersing an operating system.",
                    "Multiprocessors and computer networks.",
                    "Encoding CCITT X.409 presentation transfer syntax.",
                    "Congestion control in IP/TCP internetworks.",
                    "The ISO connectionless transport standards.",
                    "Protocol for providing the connectionless-mode transport service utilizing the connectionless-mode network service or the connection oriented network service.",
                    "Computer communication standards."
                ]
            }
        ]
    },
    {
        "year": "1983",
        "name": "8th ACM SIGCOMM 1983",
        "info": "North Falmouth, MA, USA",
        "venues": []
    },
    {
        "year": "1983",
        "name": "ACM SIGCOMM 1983",
        "info": "Austin, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1983",
                "sub_name": "Proceedings of the Eighth Symposium on Data Communications, SIGCOMM 1983, North Falmouth, Massachusetts, USA, October 3-6, 1983.",
                "count": 34,
                "papers": [
                    "Internetting between VAX and Apollo ring network.",
                    "Local networking and internetworking in the V-system.",
                    "Architecture and protocols of STELLA: A European experiment on satellite interconnection of local area networks.",
                    "Interconnection of broadband local area networks.",
                    "Office information and telecommunications.",
                    "Beyond videotex: The library of congress pilot project in page image retrieval and transmission digital optical disk.",
                    "Real-time packet video over satellite channels.",
                    "Identification in computer networks.",
                    "Implementing the ISO-OSI reference model.",
                    "Exception handling in communication protocols.",
                    "Controlling window protocols for time-constrained communication in a multiple access environment.",
                    "Incorporation of multiaccess links into a routing protocol.",
                    "Theoretical performance analysis of sliding window link level flow control for a local area network.",
                    "A message handling system for public networks.",
                    "Novanet communications network for a control system.",
                    "Access and communication controls in an accounting information system.",
                    "Commercial network security - does anyone care?",
                    "Network security considerations in BLN.",
                    "A methodology for the design of reliable communication networks in distributed processing systems.",
                    "Verification of a methodology for designing reliable communication protocols.",
                    "Analysis of reliable multicast algorithms for local networks.",
                    "Analysis of reliable broadcast in local-area networks.",
                    "A decomposition method for the analysis and design of finite state protocols.",
                    "Dynamic selection of a performance-effective transmission sequence for token-passing networks with mobile nodes.",
                    "Graceful preemption for multi-link link layer protocols.",
                    "Panel on multimedia computer mail - technical issues and future standards.",
                    "Establishment communication systems: LAN's or PABX's - which is better?",
                    "A function oriented corporate network.",
                    "Filing and printing services on a local-area network.",
                    "Resource management in a distributed system.",
                    "Interfaces between protocol layers on a multiprocessor system.",
                    "Prioritizing packet transmission in local multiaccess networks.",
                    "Performance potential of communications interface processors.",
                    "Optical storage of page images and pictorial data - opportunities and needed advances in information retrieval."
                ]
            },
            {
                "sub_name_abbr": "conf/sigcomm/1983a",
                "sub_name": "Proceedings of the symposium on Communications Architectures & Protocols, SIGCOMM 1983, Austin, Texas, USA, March 8-9, 1983.",
                "count": 40,
                "papers": [
                    "ISO open systems interconnection standardization status report.",
                    "Development of the DoD protocol reference model.",
                    "Evolution of Xerox's network systems architecture.",
                    "Higher-level protocols are not necessary end-to-end.",
                    "Analysis of routing table update activity after resource failure in a distributed computer network.",
                    "Path assignment for virtual circuit routing.",
                    "Optimal routing in closed queueing networks.",
                    "Mechanical verification of a data transport protocol.",
                    "Specification and verification of an HDLC protocol with arm connection management and full-duplex data transfer.",
                    "Reachability analysis of protocols with FIFO channels.",
                    "X.25 implementation the untold story.",
                    "A layered architecture for a programmable data network.",
                    "Maximal progress state exploration.",
                    "A methodology for verifying request processing protocols.",
                    "Proving safety properties for a general communication protocol.",
                    "Staged circuit switching for network computers.",
                    "A distributed routing scheme with mobility handling in stationless multi-hop packet radio networks.",
                    "Mechanisms that enforce bounds on packet lifetimes.",
                    "Description, simulation and implementation of communication protocols using PDIL.",
                    "Synchronization issues in protocol testing.",
                    "Relationship between performance parameters for transport and network services.",
                    "History and overview of CSNET.",
                    "Architecture of the CSNET name server.",
                    "CSNET protocol software: the IP-to-X.25 interface.",
                    "Dynamic route selection algorithms for session based communication networks.",
                    "Simulation studies of the behavior of multihop broadcast networks.",
                    "Packet-voice communication on an ethernet local computer network: an experimental study.",
                    "Distributed co-operating processes and transactions.",
                    "Interprocess communication system of the MT35 digital exchange.",
                    "An interprocess communication model for a distributed software testbed.",
                    "Asynchronous multiple access tree algorithms.",
                    "An improved access protocol for data communication bus networks with control wire.",
                    "Acknowledging DSMA with priority scheduling for local area networks.",
                    "A gateway for linking local area networks and X.25 networks.",
                    "Portable implementation of network architecture layers.",
                    "X.25 interface to MARKLINK® terminal.",
                    "A distributed approach to the interconnection of heterogeneous computer networks.",
                    "A bang-bang principle for real-time transport protocols.",
                    "Lookahead network priority protocols.",
                    "Character delays in simple X.3 PAD devices."
                ]
            }
        ]
    },
    {
        "year": "1981",
        "name": "7th ACM SIGCOMM 1981",
        "info": "Mexico City, Mexico",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1981",
                "sub_name": "Proceedings of the seventh symposium on Data communications, SIGCOMM 1981, Mexico City, Mexico, October 27-29, 1981.",
                "count": 30,
                "papers": [
                    "Description of a planned federal information processing standard for transport protocol.",
                    "Formal specification and verification of a connection establishment protocol.",
                    "Design issues of protocols for computer mail.",
                    "Digital signature schemes for computer communication networks.",
                    "SNATCH opens manufacturers' networks through gateways.",
                    "Insights into the implementation and application of heterogeneous local area networks.",
                    "The great debate over telematics and employment.",
                    "Some cryptographic principles of authentication in electronic funds transfer systems.",
                    "A heuristic method for optimizing an intercity data transmission network.",
                    "Modeling and analysis of flow controlled packet switching networks.",
                    "A study of protocol analysis for packet switched network.",
                    "A versatile queueing model for data switching.",
                    "An analysis of link level protocols for error prone links.",
                    "Demand assigned multiple access systems using collision type request channels: Priority messages.",
                    "Bidirectional token flow system.",
                    "A theoretical performance analysis of polling and carrier sense collision detection communication systems.",
                    "A virtual circuit switch as the basis for distributed systems.",
                    "TORNET: A local area network.",
                    "The cost of data replication.",
                    "Local area networks for the automated office - a survey.",
                    "Incorporation of service classes into a network architecture.",
                    "Why a ring?",
                    "Optimal loop topologies for distributed systems.",
                    "An overview of BLN: A bell laboratories computing network.",
                    "X.75 internetworking of Datapac and Telenet.",
                    "48-bit absolute internet and Ethernet host numbers.",
                    "Impact of satellite technology on transport flow control.",
                    "An experiment on high speed file transfer using satellite links.",
                    "HDLC reliability and the FRBS method to improve it.",
                    "Isolated word recognition based upon source coding techniques."
                ]
            }
        ]
    },
    {
        "year": "1979",
        "name": "6th ACM SIGCOMM 1979",
        "info": "Pacific Grove, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1979",
                "sub_name": "Proceedings of the sixth symposium on Data communications, SIGCOMM 1979, Pacific Grove, California, USA, November 27-29, 1979.",
                "count": 32,
                "papers": [
                    "An internetwork message structure.",
                    "Functional distribution of Computer Based Messaging Systems.",
                    "An internetwork memo distribution capability - MMDF.",
                    "Design for integration of a DBMS into a network environment.",
                    "A hierarchical structure for concurrency control in a distributed database system.",
                    "A reliable distributed control algorithm for updating replicated databases.",
                    "Services provided to users of SNA networks.",
                    "An overview of the new routing algorithm for the ARPANET.",
                    "A virtual circuit based transaction service.",
                    "On protocol multiplexing.",
                    "Evaluation of collision control algorithms in Ethernets.",
                    "Analysis of concentrated ALOHA satellite links.",
                    "Capacity degradation of packet radio fading channels.",
                    "Dimensioning of message-switched computer-communication networks with end-to-end window flow-control.",
                    "Design principles for network interconnection.",
                    "Alternatives for interconnection of public packet switching data networks.",
                    "A performance study of a Network Front End.",
                    "A cable-bus protocol architecture.",
                    "The data access and transfer support in a local heterogeneous network (HMINET).",
                    "Interconnecting local networks via the Packet Radio Network.",
                    "Integrated services data switching network.",
                    "Delay related issues in integrated voice and data transmission: A review and some experimental work.",
                    "Sensitivity of integrated voice and data networks to traffic and design variables.",
                    "Panel on Electronic Funds Transfer.",
                    "EFTS related file recovery and integrity problems.",
                    "Wholesale EFTS: A communications strategy.",
                    "The CMX network.",
                    "Packet-switched data network of the Netherlands administration.",
                    "Data transmission services and network developments in the United Kingdom.",
                    "Data communications activities in the Federal Republic of Germany.",
                    "Panel on military data networks: Present plans and future requirements.",
                    "Panel on future directions in network services."
                ]
            }
        ]
    },
    {
        "year": "1977",
        "name": "5th ACM SIGCOMM 1977",
        "info": "Snowbird, UT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/sigcomm/1977",
                "sub_name": "Proceedings of the fifth symposium on Data communications, SIGCOMM 1977, Snowbird, Utah, USA, September 27-29, 1977.",
                "count": 26,
                "papers": [
                    "Defense data networks - common-user or dedicated?",
                    "Communication requirements for a computing network for higher education.",
                    "Economies of scale versus specialization - parameters of choice.",
                    "Closed loop stability controls for s-aloha satellite communications.",
                    "A new technique for satellite broadcast channel communication.",
                    "Multibeam antennas for data communications satellites.",
                    "Economic trends in data transmission by satellite.",
                    "Cpoda - a demand assignment protocol for satnet.",
                    "TYMNET - maintenance considerations in a very large Network.",
                    "Delay analysis for Datapac - a packet switched network with two priority classes.",
                    "A maintenance system architecture for data network services.",
                    "Reliability problems in data communications systems.",
                    "A server host system on the ARPANET.",
                    "The arpanet telnet protocol: Its purpose, principles, implementation, and impact on host operating system design.",
                    "Operating system design with computer network communication protocols.",
                    "International standards for data communications: A status report.",
                    "An approach to describing a data link level protocol with a formal language.",
                    "Datapac X.25 service characteristics.",
                    "Reliable host-to-host protocols: Problems and techniques.",
                    "The future of optical fibers for data communications.",
                    "Dual-Mode Slotted TDMA Digital Bus.",
                    "Local congestion control in computer-communication networks with random routing.",
                    "Encryption-based protection for interactive user/computer communication.",
                    "Issues in transnet packetized voice communication.",
                    "Issues in message technology.",
                    "Statistical multiplexing of data and encoded voice in a transparent intelligent network."
                ]
            }
        ]
    }
]