[
    {
        "name": "TMC",
        "year": "2022",
        "info": "Volume 21, 2022",
        "count": 105,
        "papers": [
            "A Framework for Proactive Indoor Positioning in Densely Deployed WiFi Networks.",
            "A Multi-Modal Neural Embeddings Approach for Detecting Mobile Counterfeit Apps: A Case Study on Google Play Store.",
            "An Energy-Efficient Framework for Internet of Things Underlaying Heterogeneous Small Cell Networks.",
            "An Incentive Mechanism Based on Behavioural Economics in Location-Based Crowdsensing Considering an Uneven Distribution of Participants.",
            "Coloring-Based Channel Allocation for Multiple Coexisting Wireless Body Area Networks: A Game-Theoretic Approach.",
            "Don't Just BYOD, Bring-Your-Own-App Too! Protection via Virtual Micro Security Perimeters.",
            "Downlink MU-MIMO LTE-LAA for Coexistence With Asymmetric Hidden Wi-Fi APs.",
            "Dynamic Backlight Scaling Considering Ambient Luminance for Mobile Videos on LCD Displays.",
            "Eclipse: Preserving Differential Location Privacy Against Long-Term Observation Attacks.",
            "Fully and Partially Distributed Incentive Mechanism for a Mobile Edge Computing Network.",
            "Joint Transceiver Beamforming Design for Hybrid Full-Duplex and Half-Duplex Ad-Hoc Networks.",
            "LibRoad: Rapid, Online, and Accurate Detection of TPLs on Android.",
            "Memory-Aware Active Learning in Mobile Sensing Systems.",
            "Mobility-Aware and Delay-Sensitive Service Provisioning in Mobile Edge-Cloud Networks.",
            "Multi-Hop Deflection Routing Algorithm Based on Reinforcement Learning for Energy-Harvesting Nanonetworks.",
            "$\\mathsf{NCF}$NCF: A Neural Context Fusion Approach to Raw Mobility Annotation.",
            "Objective-Variable Tour Planning for Mobile Data Collection in Partitioned Sensor Networks.",
            "Passenger Demand Prediction With Cellular Footprints.",
            "Prediction of Traffic Flow via Connected Vehicles.",
            "QoS Driven Task Offloading With Statistical Guarantee in Mobile Edge Computing.",
            "Queuing Over Ever-Changing Communication Scenarios in Tactical Networks.",
            "Reinforcement Learning-Based Collision Avoidance and Optimal Trajectory Planning in UAV Communication Networks.",
            "Resource-Aware Feature Extraction in Mobile Edge Computing.",
            "Statistical Properties of Transmissions Subject to Rayleigh Fading and Ornstein-Uhlenbeck Mobility.",
            "Timestamp Scheme to Mitigate Replay Attacks in Secure ZigBee Networks.",
            "Towards Personalized Privacy-Preserving Incentive for Truth Discovery in Mobile Crowdsensing Systems.",
            "User Existence-Aware BLE Beacon Firmware for Maximized Battery Lifetime.",
            "WiFace: Facial Expression Recognition Using Wi-Fi Signals.",
            "A Fingertip Profiled RF Identifier.",
            "An Approach for Multi-Level Visibility Scoping of IoT Services in Enterprise Environments.",
            "An Edge Computing-Based Photo Crowdsourcing Framework for Real-Time 3D Reconstruction.",
            "ARSpy: Breaking Location-Based Multi-Player Augmented Reality Application for User Location Tracking.",
            "Astute Video Transmission for Geographically Dispersed Devices in Visual IoT Systems.",
            "Attention-Based Gait Recognition and Walking Direction Estimation in Wi-Fi Networks.",
            "Cooperative Sweep Coverage Problem With Mobile Sensors.",
            "Deployment of Unmanned Aerial Vehicles for Anisotropic Monitoring Tasks.",
            "Distributed Energy Efficient Channel Allocation in Underlay Multicast D2D Communications.",
            "Efficient Forwarding and Data Acquisition in NDN-Based MANET.",
            "Environment-Robust Device-Free Human Activity Recognition With Channel-State-Information Enhancement and One-Shot Learning.",
            "EspialCog: General, Efficient and Robust Mobile User Implicit Authentication in Noisy Environment.",
            "Fast Globally Optimal Transmit Antenna Selection and Resource Allocation Scheme in mmWave D2D Networks.",
            "Health-Radio: Towards Contactless Myocardial Infarction Detection Using Radio Signals.",
            "Imitation Learning Enabled Task Scheduling for Online Vehicular Edge Computing.",
            "In-Band Secret-Free Pairing for COTS Wireless Devices.",
            "Location-Flexible Mobile Data Service in Overseas Market.",
            "Millimeter-Wave Base Stations in the Sky: An Experimental Study of UAV-to-Ground Communications.",
            "Say No to Price Discrimination: Decentralized and Automated Incentives for Price Auditing in Ride-Hailing Services.",
            "Smartphone Based Indoor Path Estimation and Localization Without Human Intervention.",
            "Throughput Maximization in Cloud-Radio Access Networks Using Cross-Layer Network Coding.",
            "Timestamp-Free Clock Syntonization for IoT Using Carrier Frequency Offset.",
            "Which App is Going to Die? A Framework for App Survival Prediction With Multitask Learning.",
            "Wi-Fi RTT Ranging Performance Characterization and Positioning System Design.",
            "WiHF: Gesture and User Recognition With WiFi.",
            "A Comprehensive and Reproducible Comparison of Clustering and Optimization Rules in Wi-Fi Fingerprinting.",
            "A Novel Framework for the Coverage Problem in Battery-Free Wireless Sensor Networks.",
            "A Sensors Based Deep Learning Model for Unseen Locomotion Mode Identification using Multiple Semantic Matrices.",
            "A Trust Update Mechanism Based on Reinforcement Learning in Underwater Acoustic Sensor Networks.",
            "Accurate Angular Inference for 802.11ad Devices Using Beam-Specific Measurements.",
            "Arbitrator2.0: Preventing Unauthorized Access on Passive Tags.",
            "Boundary Tracking of Continuous Objects Based on Binary Tree Structured SVM for Industrial Wireless Sensor Networks.",
            "Context-Aware and Energy-Aware Video Streaming on Smartphones.",
            "CrowdOS: A Ubiquitous Operating System for Crowdsourcing and Mobile Crowd Sensing.",
            "DaRe: Data Recovery Through Application Layer Coding for LoRaWAN.",
            "Decoupled Uplink-Downlink Association in Full-Duplex Cellular Networks: A Contract-Theory Approach.",
            "Dynamic Buffer Sizing and Pacing as Enablers of 5G Low-Latency Services.",
            "Dynamic Scheduling for Stochastic Edge-Cloud Computing Environments Using A3C Learning and Residual Recurrent Neural Networks.",
            "Enabling Optimal Control Under Demand Elasticity for Electric Vehicle Charging Systems.",
            "Evolving Bipartite Model Reveals the Bounded Weights in Mobile Social Networks.",
            "Flipping Free Conditions and Their Application in Sparse Network Localization.",
            "Impact of Cell Association on Energy-Efficiency and Hit Rate of Femto-Caching.",
            "Leveraging Acoustic Signals for Fine-Grained Breathing Monitoring in Driving Environments.",
            "Monitoring Browsing Behavior of Customers in Retail Stores via RFID Imaging.",
            "Resource Allocation in Full-Duplex UAV Enabled Multismall Cell Networks.",
            "RF-Dial: Rigid Motion Tracking and Touch Gesture Detection for Interaction via RFID Tags.",
            "Spatial-Temporal Inventory Rebalancing for Bike Sharing Systems With Worker Recruitment.",
            "Systematic Analysis of Fine-Grained Mobility Prediction With On-Device Contextual Data.",
            "TARA: An Efficient Random Access Mechanism for NB-IoT by Exploiting TA Value Difference in Collided Preambles.",
            "The Coverage Overlapping Problem of Serving Arbitrary Crowds in 3D Drone Cellular Networks.",
            "To Predict or to Relay: Tracking Neighbors via Beaconing in Heterogeneous Vehicle Conditions.",
            "A Nonlinearity-Based Secure Face-to-Face Device Authentication for Mobile Devices.",
            "A Virtual Emotion Detection Architecture With Two-Way Enabled Delay Bound toward Evolutional Emotion-Based IoT Services.",
            "Capture-Aware Identification of Mobile RFID Tags With Unreliable Channels.",
            "Compressive RF Fingerprint Acquisition and Broadcasting for Dense BLE Networks.",
            "Context-Aware Telco Outdoor Localization.",
            "Coordinated Framework for Spectrum Allocation and User Association in 5G HetNets With mmWave.",
            "Graph Attention Spatial-Temporal Network With Collaborative Global-Local Learning for Citywide Mobile Traffic Prediction.",
            "IoT vs. Human: A Comparison of Mobility.",
            "Joint Charging and Relocation Recommendation for E-Taxi Drivers via Multi-Agent Mean Field Hierarchical Reinforcement Learning.",
            "Measurement Errors in Range-Based Localization Algorithms for UAVs: Analysis and Experimentation.",
            "Optimizing Mobile Crowdsensing Platforms for Boundedly Rational Users.",
            "Partial Computation Offloading and Adaptive Task Scheduling for 5G-Enabled Vehicular Networks.",
            "Performance Analysis and Optimization of Cache-Assisted CoMP for Clustered D2D Networks.",
            "Pricing and Resource Allocation Optimization for IoT Fog Computing and NFV: An EPEC and Matching Based Perspective.",
            "PRIME: An Optimal Pricing Scheme for Mobile Sensors-as-a-Service.",
            "Revenue-Optimal Auction For Resource Allocation in Wireless Virtualization: A Deep Learning Approach.",
            "Robust Fuzzy Learning for Partially Overlapping Channels Allocation in UAV Communication Networks.",
            "SchrodinText: Strong Protection of Sensitive Textual Content of Mobile Applications.",
            "Secure Voice Input on Augmented Reality Headsets.",
            "Strategic Network Slicing Management in Radio Access Networks.",
            "Surveillance of Uneven Surface With Self-Organizing Unmanned Aerial Vehicles.",
            "Throughput Analysis of NOMA-ALOHA.",
            "Time Efficient Tag Searching in Large-Scale RFID Systems: A Compact Exclusive Validation Method.",
            "To What Extent We Repeat Ourselves? Discovering Daily Activity Patterns Across Mobile App Usage.",
            "Toward a Realistic Approach for the Deployment of 3D Wireless Sensor Networks.",
            "Tuft: Tree Based Heuristic Data Dissemination for Mobile Sink Wireless Sensor Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2021",
        "info": "Volume 20, 2021",
        "count": 238,
        "papers": [
            "A Message From the Editor-in-Chief.",
            "A Link-Layer Synchronization and Medium Access Control Protocol for Terahertz-Band Communication Networks.",
            "A Novel Mobile Edge Network Architecture with Joint Caching-Delivering and Horizontal Cooperation.",
            "A Reassessment on Friendly Jamming Efficiency.",
            "A Utility Model for Photo Selection in Mobile Crowdsensing.",
            "An Incentive-Aware Job Offloading Control Framework for Multi-Access Edge Computing.",
            "An Inter-Data Encoding Technique that Exploits Synchronized Data for Network Applications.",
            "Analysis of Drone Assisted Network Coded Cooperation for Next Generation Wireless Network.",
            "CollabLoc: Privacy-Preserving Multi-Modal Collaborative Mobile Phone Localization.",
            "Compressed Beam Alignment with Out-of-Band Assistance in Millimeter Wave Cellular Networks.",
            "Distributed and Energy-Efficient Mobile Crowdsensing with Charging Stations by Deep Reinforcement Learning.",
            "Distributed Deep Learning Optimized System over the Cloud and Smart Phone Devices.",
            "Heterogeneous V2V Communications in Multi-Link and Multi-RAT Vehicular Networks.",
            "Improving the Performance of Online Bitrate Adaptation with Multi-Step Prediction Over Cellular Networks.",
            "MobileCopy: Improving Data Availability and File Search Efficiency in Delay Tolerant Networks against Correlated Node Failure.",
            "Networking Support for Bidirectional Cross-Technology Communication.",
            "SMARS: Sleep Monitoring via Ambient Radio Signals.",
            "Throughput-Optimal Broadcast in Wireless Networks with Point-to-Multipoint Transmissions.",
            "Tracking and Behavior Augmented Activity Recognition for Multiple Inhabitants.",
            "Wireless-Assisted Key Establishment Leveraging Channel Manipulation.",
            "Wireless Power Transfer with Information Asymmetry: A Public Goods Perspective.",
            "A Cloud-Guided Feature Extraction Approach for Image Retrieval in Mobile Edge Computing.",
            "Adversarial Deep Learning for Over-the-Air Spectrum Poisoning Attacks.",
            "An Adaptive Sensor Fusion Framework for Pedestrian Indoor Navigation in Dynamic Environments.",
            "An Indirect Eavesdropping Attack of Keystrokes on Touch Screen through Acoustic Sensing.",
            "Augur: Modeling the Resource Requirements of ConvNets on Mobile Devices.",
            "Becoming Smarter at Characterizing Potholes and Speed Bumps from Smartphone Data - Introducing a Second-Generation Inference Problem.",
            "Collaborative Service Placement for Edge Computing in Dense Small Cell Networks.",
            "Cooperative Caching in Vehicular Content Centric Network Based on Social Attributes and Mobility.",
            "Cost-Fair Task Allocation in Mobile Crowd Sensing With Probabilistic Users.",
            "Cyclic Three-Sided Matching Game Inspired Wireless Network Virtualization.",
            "DeepWiFi: Cognitive WiFi with Deep Learning.",
            "Delay-Aware Virtual Network Function Placement and Routing in Edge Clouds.",
            "Dynamic Service Entity Placement for Latency Sensitive Applications in Transportation Systems.",
            "Energy-Efficient Resource Allocation in C-RANs with Capacity-Limited Fronthaul.",
            "ezNavi: An Easy-to-Operate Indoor Navigation System Based on Pedestrian Dead Reckoning and Crowdsourced User Trajectories.",
            "Fully Distributed Packet Scheduling Framework for Handling Disturbances in Lossy Real-Time Wireless Networks.",
            "Incentivizing Crowdsensing-Based Noise Monitoring with Differentially-Private Locations.",
            "Integrating Fronthaul and Backhaul Networks: Transport Challenges and Feasibility Results.",
            "IoTorch: Reliable LED-to-Camera Communication Against Inter-Frame Gaps and Frame Drops.",
            "JointDNN: An Efficient Training and Inference Engine for Intelligent Mobile Cloud Computing Services.",
            "Low-Overhead Wireless Uplink Scheduling for Large-Scale Internet-of-Things.",
            "$M^3$M3: Multipath Assisted Wi-Fi Localization with a Single Access Point.",
            "Maximizing Fairness for Resource Allocation in Heterogeneous 5G Networks.",
            "No More than What I Post: Preventing Linkage Attacks on Check-in Services.",
            "OmniTrack: Orientation-Aware RFID Tracking With Centimeter-Level Accuracy.",
            "On the Data Quality in Privacy-Preserving Mobile Crowdsensing Systems with Untruthful Reporting.",
            "Optimal ADMM-Based Spectrum and Power Allocation for Heterogeneous Small-Cell Networks with Hybrid Energy Supplies.",
            "Optimal Multicasting Strategies in Underwater Acoustic Networks.",
            "Portfolio Optimization in Traffic Offloading: Concept, Model, and Algorithms.",
            "Radio Resource Sharing and Edge Caching with Latency Constraint for Local 5G Operator: Geometric Programming Meets Stackelberg Game.",
            "RF-3DScan: RFID-based 3D Reconstruction on Tagged Packages.",
            "Simultaneous Material Identification and Target Imaging with Commodity RFID Devices.",
            "Vernier: Accurate and Fast Acoustic Motion Tracking Using Mobile Devices.",
            "SWIM: Speed-Aware WiFi-Based Passive Indoor Localization for Mobile Ship Environment.",
            "A Novel Bayesian Filter for RSS-Based Device-Free Localization and Tracking.",
            "Anonymization and De-Anonymization of Mobility Trajectories: Dissecting the Gaps Between Theory and Practice.",
            "ARPAP: A Novel Antenna-Radiation-Pattern-Aware Power-Based Positioning in RF System.",
            "Backbone-Assisted Wireless Local Area Network.",
            "BuSAR: Bluetooth Slot Availability Randomization for Better Coexistence With Dense Wi-Fi Networks.",
            "ChromaCode: A Fully Imperceptible Screen-Camera Communication System.",
            "Collaboratively Replicating Encoded Content on RSUs to Enhance Video Services for Vehicles.",
            "Computer Vision-Assisted 3D Object Localization via COTS RFID Devices and a Monocular Camera.",
            "Connectivity-Constrained Placement of Wireless Chargers.",
            "Cost-Efficient Mobile Crowdsensing With Spatial-Temporal Awareness.",
            "Delay-Aware Microservice Coordination in Mobile Edge Computing: A Reinforcement Learning Approach.",
            "Enabling 3D Ambient Light Positioning with Mobile Phones and Battery-Free Chips.",
            "Energy Efficient Collaborative Beamforming for Reducing Sidelobe in Wireless Sensor Networks.",
            "Energy-Efficient Resource Allocation for Ultra-Dense Licensed and Unlicensed Dual-Access Small Cell Networks.",
            "Expertise-Aware Truth Analysis and Task Allocation in Mobile Crowdsourcing.",
            "Fast Admission Control and Power Optimization With Adaptive Rates for Communication Fairness in Wireless Networks.",
            "FastGraph Enhanced: High Accuracy Automatic Indoor Navigation and Mapping.",
            "How Much Benefit Can Dynamic Frequency Scaling Bring to WiFi?",
            "Interaction-Oriented Service Entity Placement in Edge Computing.",
            "Joint Resource Allocation for Device-to-Device Communication Assisted Fog Computing.",
            "Learning-Based Mobile Edge Computing Resource Management to Support Public Blockchain Networks.",
            "LEDGE: Leveraging Edge Computing for Resilient Access Management of Mobile IoT.",
            "Localization of Acoustically Tagged Marine Animals in Under-Ranked Conditions.",
            "MAdLens: Investigating Into Android In-App Ad Practice at API Granularity.",
            "Messages Classification and Dynamic Batch Verification Scheme for VANETs.",
            "Minimizing the Age of Information in Wireless Networks with Stochastic Arrivals.",
            "Optimal Scheduling for Unmanned Aerial Vehicle Networks With Flow-Level Dynamics.",
            "SatProbe: Low-Energy and Fast Indoor/Outdoor Detection via Satellite Existence Sensing.",
            "Software-Defined Cooperative Data Sharing in Edge Computing Assisted 5G-VANET.",
            "Strategic Learning Approach for Deploying UAV-Provided Wireless Services.",
            "WiFi based Multi-User Gesture Recognition.",
            "A Near-Optimal Protocol for the Grouping Problem in RFID Systems.",
            "Accurate Localization of Tagged Objects Using Mobile RFID-Augmented Robots.",
            "AdSherlock: Efficient and Deployable Click Fraud Detection for Mobile Applications.",
            "An Application Placement Technique for Concurrent IoT Applications in Edge and Fog Computing Environments.",
            "Autonomous UAV Trajectory for Localizing Ground Objects: A Reinforcement Learning Approach.",
            "Characterizing Delay and Control Traffic of the Cellular MME With IoT Support.",
            "Coding for Distributed Fog Computing in Internet of Mobile Things.",
            "Deep Neural Network Based Inertial Odometry Using Low-Cost Inertial Measurement Units.",
            "Dynamic Model for Network Selection in Next Generation HetNets With Memory-Affecting Rational Users.",
            "Edge-Enabled V2X Service Placement for Intelligent Transportation Systems.",
            "Enhancing Dynamic-Viewport Mobile Applications with Screen Scrolling.",
            "Fair Configuration Scheme for Random Access in NB-IoT with Multiple Coverage Enhancement Levels.",
            "GazMon: Eye Gazing Enabled Driving Behavior Monitoring and Prediction.",
            "IoT and HIP's Opportunistic Mode.",
            "Joint Scheduling and Incentive Mechanism for Spatio-Temporal Vehicular Crowd Sensing.",
            "Kollector: Detecting Fraudulent Activities on Mobile Devices Using Deep Learning.",
            "Load Management, Power and Admission Control in Downlink Cellular OFDMA Networks.",
            "Multi-Task Allocation Under Time Constraints in Mobile Crowdsensing.",
            "Novel Wake-up Scheme for Energy-Efficient Low-Latency Mobile Devices in 5G Networks.",
            "Pedestrian Flow Estimation Through Passive WiFi Sensing.",
            "Performance and Pitfalls of 60 GHz WLANs Based on Consumer-Grade Hardware.",
            "Performance Modeling of Softwarized Network Services Based on Queuing Theory With Experimental Validation.",
            "PicSys: Energy-Efficient Fast Image Search on Distributed Mobile Networks.",
            "RED: RFID-Based Eccentricity Detection for High-Speed Rotating Machinery.",
            "Relay Node Placement in Wireless Sensor Networks: From Theory to Practice.",
            "RFID Harmonic for Vibration Sensing.",
            "Slow Beam Steering and NOMA for Indoor Multi-User Visible Light Communications.",
            "Spatio-Temporal Correlation of Interference in MANET Under Spatially Correlated Shadowing Environment.",
            "Stealing Your Android Patterns via Acoustic Signals.",
            "The Design of Dynamic Probabilistic Caching with Time-Varying Content Popularity.",
            "Towards Low-Cost Sign Language Gesture Recognition Leveraging Wearables.",
            "Ultra-Dense Networks: A Holistic Analysis of Multi-Piece Path Loss, Antenna Heights, Finite Users and BS Idle Modes.",
            "Video Stabilization for Camera Shoot in Mobile Devices via Inertial-Visual State Tracking.",
            "WiTrace: Centimeter-Level Passive Gesture Tracking Using OFDM Signals.",
            "Corrections to \"HMO: Ordering RFID Tags With Static Devices in Mobile Environments\".",
            "A Fault-Tolerant Early Classification Approach for Human Activities Using Multivariate Time Series.",
            "CoSafe: Securing Mobile Devices through Mutual Mobility Consistency Verification.",
            "Data-Driven C-RAN Optimization Exploiting Traffic and Mobility Dynamics of Mobile Users.",
            "EchoWrite: An Acoustic-Based Finger Input System Without Training.",
            "Economic Analysis of Unmanned Aerial Vehicle (UAV) Provided Mobile Services.",
            "Efficient Tag Grouping via Collision Reconciliation and Data Compression.",
            "Implementing The Abstract MAC Layer in Dynamic Networks.",
            "Minimizing the Maximum Charging Delay of Multiple Mobile Chargers Under the Multi-Node Energy Charging Scheme.",
            "Motion-Fi$^+$+: Recognizing and Counting Repetitive Motions With Wireless Backscattering.",
            "Multimodal Named Data Discovery With Interest Broadcast Suppression for Vehicular CPS.",
            "NFV-Enabled IoT Service Provisioning in Mobile Edge Clouds.",
            "Optimal Application Deployment in Resource Constrained Distributed Edges.",
            "PACE: Privacy-Preserving and Quality-Aware Incentive Mechanism for Mobile Crowdsensing.",
            "Performance Analysis of Indoor mmWave Networks With Ceiling-Mounted Access Points.",
            "Privacy-Preserving Media Sharing with Scalable Access Control and Secure Deduplication in Mobile Cloud Computing.",
            "Protecting Your Shopping Preference With Differential Privacy.",
            "Pushing the Data Rate of Practical VLC via Combinatorial Light Emission.",
            "Resilient Routing for Wireless Sensor Networks on High Genus Surfaces.",
            "Revitalizing Ultrasonic Positioning Systems for Ultrasound-Incapable Smart Devices.",
            "Robust Computation Offloading and Resource Scheduling in Cloudlet-Based Mobile Cloud Computing.",
            "Secure Information Fusion using Local Posterior for Distributed Cyber-Physical Systems.",
            "SocialRecruiter: Dynamic Incentive Mechanism for Mobile Crowdsourcing Worker Recruitment With Social Networks.",
            "SST: Software Sonic Thermometer on Acoustic-Enabled IoT Devices.",
            "Towards Personalized Task-Oriented Worker Recruitment in Mobile Crowdsensing.",
            "Transfer Learning-Based Outdoor Position Recovery With Cellular Data.",
            "A Framework to Maximize the Capacity of 5G Systems for Ultra-Reliable Low-Latency Communications.",
            "A Personalized Preference Learning Framework for Caching in Mobile Networks.",
            "A Usable and Robust Continuous Authentication Framework Using Wearables.",
            "BuildSenSys: Reusing Building Sensing Data for Traffic Prediction With Cross-Domain Learning.",
            "Distributed Time-Sensitive Task Selection in Mobile Crowdsensing.",
            "GaitWay: Monitoring and Recognizing Gait Speed Through the Walls.",
            "High-Throughput Visual MIMO Systems for Screen-Camera Communications.",
            "Interference Management and Duplex Mode Selection in In-Band Full Duplex D2D Communications: A Stochastic Geometry Approach.",
            "Multi-Adversarial In-Car Activity Recognition Using RFIDs.",
            "NOMA-Based Scalable Video Multicast in Mobile Networks With Statistical Channels.",
            "On the Capacity of Fractal D2D Social Networks with Hierarchical Communications.",
            "Optimizing Information Freshness in Wireless Networks: A Stochastic Geometry Approach.",
            "Power Saving and Secure Text Input for Commodity Smart Watches.",
            "PROTECT: Efficient Password-Based Threshold Single-Sign-On Authentication for Mobile Users against Perpetual Leakage.",
            "Unobtrusive Stress Assessment Using Smartphones.",
            "Channel Condition Based Dynamic Beacon Interval for Faster Formation of 6TiSCH Network.",
            "EPASS360: QoE-Aware 360-Degree Video Streaming Over Mobile Devices.",
            "Exploiting Interference Fingerprints for Predictable Wireless Concurrency.",
            "Fine-Grained Frequency Reuse in Centralized Small Cell Networks.",
            "Generalized Lottery Trees: Budget-Balanced Incentive Tree Mechanisms for Crowdsourcing.",
            "Joint Modeling of TDD and Decoupled Uplink/Downlink Access in 5G HetNets With Multiple Small Cells Deployment.",
            "Low-Latency Data Aggregation Scheduling for Cognitive Radio Networks With Non-Predetermined Structure.",
            "Multi-Area Throughput and Energy Optimization of UAV-Aided Cellular Networks Powered by Solar Panels and Grid.",
            "Outage in Motorway Multi-Lane VANETs With Hardcore Headway Distance Using Synthetic Traces.",
            "Predictability and Prediction of Human Mobility Based on Application-Collected Location Data.",
            "Scalable & Resilient Vehicle-Centric Certificate Revocation List Distribution in Vehicular Communication Systems.",
            "SmartSO: Chinese Character and Stroke Order Recognition With Smartwatch.",
            "UniLoc: A Unified Mobile Localization Framework Exploiting Scheme Diversity.",
            "Adaptive Predictive Power Management for Mobile LTE Devices.",
            "An Approximation Algorithm for Bounded Task Assignment Problem in Spatial Crowdsourcing.",
            "Distributed Online Learning of Cooperative Caching in Edge Cloud.",
            "DynamicSLAM: Leveraging Human Anchors for Ubiquitous Low-Overhead Indoor Localization.",
            "Exploiting Multi-Dimensional Task Diversity in Distributed Auctions for Mobile Crowdsensing.",
            "How Can IoT Services Pose New Security Threats In Operational Cellular Networks?",
            "LeaD: Large-Scale Edge Cache Deployment Based on Spatio-Temporal WiFi Traffic Statistics.",
            "Lifecycle-Aware Online Video Caching.",
            "Profit-Oriented Task Allocation for Mobile Crowdsensing With Worker Dynamics: Cooperative Offline Solution and Predictive Online Solution.",
            "RAMOS: A Resource-Aware Multi-Objective System for Edge Computing.",
            "Real-Time Detection for Drowsy Driving via Acoustic Sensing on Smartphones.",
            "Statistical Performance Modeling of Solar and Wind-Powered UAV Communications.",
            "Towards Fine-Grained Access Control in Enterprise-Scale Internet-of-Things.",
            "A Fuzzy Logic-Based On-Demand Charging Algorithm for Wireless Rechargeable Sensor Networks With Multiple Chargers.",
            "A Truthful and Near-Optimal Mechanism for Colocation Emergency Demand Response.",
            "Computation Offloading in Multi-Access Edge Computing: A Multi-Task Learning Approach.",
            "Contract Design in Hierarchical Game for Sponsored Content Service Market.",
            "Differentially Private Unknown Worker Recruitment for Mobile Crowdsensing Using Multi-Armed Bandits.",
            "Energy Optimization of Wireless Visual Sensor Networks With the Consideration of the Desired Target Coverage.",
            "Energy-Aware Tracking of Mobile Targets by Bacterial Nanonetworks.",
            "Fly-Navi: A Novel Indoor Navigation System With On-the-Fly Map Generation.",
            "Leveraging UAVs for Coverage in Cell-Free Vehicular Networks: A Deep Reinforcement Learning Approach.",
            "Non-Uniform Time-Step Deep Q-Network for Carrier-Sense Multiple Access in Heterogeneous Wireless Networks.",
            "Power-Constrained Quality Optimization for Mobile Video Chatting With Coding-Transmission Adaptation.",
            "Practical Privacy-Preserving Indoor Localization Based on Secure Two-Party Computation.",
            "Time-Efficient Target Tags Information Collection in Large-Scale RFID Systems.",
            "A Simple Model of MTC Flows Applied to Smart Factories.",
            "BOOST: A User Association and Scheduling Framework for Beamforming mmWave Networks.",
            "Distributed and Adaptive Reservation MAC Protocol for Beaconing in Vehicular Networks.",
            "Distributed Device-to-Device Offloading System: Design and Performance Optimization.",
            "Fine-Grained User Profiling for Personalized Task Matching in Mobile Crowdsensing.",
            "Interference Characterization in Underlay Cognitive Networks With Intra-Network and Inter-Network Dependence.",
            "Multi-Objective Computation Sharing in Energy and Delay Constrained Mobile Edge Computing Environments.",
            "Privacy Preservation in Location-Based Services: A Novel Metric and Attack Model.",
            "Stochastic Channel Access in Underwater Networks With Statistical Interference Modeling.",
            "Toward an Automated Auction Framework for Wireless Federated Learning Services Market.",
            "Towards a Compressive-Sensing-Based Lightweight Encryption Scheme for the Internet of Things.",
            "Towards Automatic Detection of Nonfunctional Sensitive Transmissions in Mobile Applications.",
            "Uplink Scheduling in Multi-Cell OFDMA Networks: A Comprehensive Study.",
            "A Multi-Trip Task Assignment for Early Target Inspection in Squads of Aerial Drones.",
            "Operation State Scheduling Towards Optimal Network Utility in RF-Powered Internet of Things.",
            "The Untold Secrets of WiFi-Calling Services: Vulnerabilities, Attacks, and Countermeasures.",
            "Continuous Authentication Through Finger Gesture Interaction for Smart Homes Using WiFi.",
            "Charging Task Scheduling for Directional Wireless Charger Networks.",
            "Fog Computing Empowered Data Dissemination in Software Defined Heterogeneous VANETs.",
            "QoS-Based Budget Constrained Stable Task Assignment in Mobile Crowdsensing.",
            "On Heterogeneous Sensing Capability for Distributed Rendezvous in Cognitive Radio Networks.",
            "RF-Pen: Practical Real-Time RFID Tracking in the Air.",
            "The Paintbrush Coverage Problem.",
            "Robust Video Broadcast for Users With Heterogeneous Resolution in Mobile Networks.",
            "Low-Complexity Learning for Dynamic Spectrum Access in Multi-User Multi-Channel Networks.",
            "AdaDeep: A Usage-Driven, Automated Deep Model Compression Framework for Enabling Ubiquitous Intelligent Mobiles.",
            "BaG: Behavior-Aware Group Detection in Crowded Urban Spaces Using WiFi Probes.",
            "DEFT: Multipath TCP for High Speed Low Latency Communications in 5G Networks.",
            "Device vs Edge Computing for Mobile Services: Delay-Aware Decision Making to Minimize Power Consumption.",
            "Hybrid OFDMA Random Access With Resource Unit Sensing for Next-Gen 802.11ax WLANs.",
            "iTAM: Bilateral Privacy-Preserving Task Assignment for Mobile Crowdsensing.",
            "Machine Learning at the Edge: A Data-Driven Architecture With Applications to 5G Cellular Networks.",
            "Multi-Band Time of Arrival Estimation for Long Term Evolution (LTE) Signals.",
            "QoE Based Revenue Maximizing Dynamic Resource Allocation and Pricing for Fog-Enabled Mission-Critical IoT Applications.",
            "Service Provisioning Framework for RAN Slicing: User Admissibility, Slice Association and Bandwidth Allocation.",
            "Spatial and Temporal Contextual Multi-Armed Bandit Handovers in Ultra-Dense mmWave Cellular Networks.",
            "Stable Task Assignment for Mobile Crowdsensing With Budget Constraint.",
            "STEP: A Spatio-Temporal Fine-Granular User Traffic Prediction System for Cellular Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2020",
        "info": "Volume 19, 2020",
        "count": 203,
        "papers": [
            "A Complete LTE Mathematical Framework for the Network Slice Planning of the EPC.",
            "A Distributed Game Methodology for Crowdsensing in Uncertain Wireless Scenario.",
            "A Multi-User Mobile Computation Offloading and Transmission Scheduling Mechanism for Delay-Sensitive Applications.",
            "CHASE: Charging and Scheduling Scheme for Stochastic Event Capture in Wireless Rechargeable Sensor Networks.",
            "Computational Offloading for Energy Constrained Devices in Multi-Hop Cooperative Networks.",
            "HMO: Ordering RFID Tags with Static Devices in Mobile Environments.",
            "Identifying Mobile Inter-App Communication Risks.",
            "Incentive Mechanism for Resource Allocation in Wireless Virtualized Networks with Multiple Infrastructure Providers.",
            "Inter-Femtocell Interference Identification and Resource Management.",
            "Missing Tag Identification in COTS RFID Systems: Bridging the Gap between Theory and Practice.",
            "MPWiFi: Synergizing MPTCP Based Simultaneous Multipath Access and WiFi Network Performance.",
            "Optimized Preference-Aware Multi-Path Video Streaming with Scalable Video Coding.",
            "Popularity-Aware Caching Increases the Capacity of Wireless Networks.",
            "Posted Pricing for Chance Constrained Robust Crowdsensing.",
            "QnQ: Quality and Quantity Based Unified Approach for Secure and Trustworthy Mobile Crowdsensing.",
            "Towards Scalable Indoor Map Construction and Refinement using Acoustics on Smartphones.",
            "Traffic Flow Control in Vehicular Multi-Hop Networks with Data Caching.",
            "A Context-Aware Framework for Detecting Sensor-Based Threats on Smart Devices.",
            "A Pragmatic Approach to Clear Channel Assessment Threshold Adaptation and Transmission Power Control for Performance Gain in CSMA/CA WLANs.",
            "Cellular Fronthaul Offloading Using Device Fogs, Caching, and Network Coding.",
            "Cooperative Caching for Multiple Bitrate Videos in Small Cell Edges.",
            "Deep CNN-Based Real-Time Traffic Light Detector for Self-Driving Vehicles.",
            "DeepWear: Adaptive Local Offloading for On-Wearable Deep Learning.",
            "Fairness and Transmission-Aware Caching and Delivery Policies in OFDMA-Based HetNets.",
            "Hidden-Node Problem in Full-Duplex Enabled CSMA Networks.",
            "Location-Aware Crowdsensing: Dynamic Task Assignment and Truth Inference.",
            "Low Complexity Online Radio Access Technology Selection Algorithm in LTE-WiFi HetNet.",
            "Nanosatellite-5G Integration in the Millimeter Wave Domain: A Full Top-Down Approach.",
            "Probabilistic Spatially-Divided Multiple Access in Underwater Acoustic Sparse Networks.",
            "Recommending Mobile Services with Trustworthy QoS and Dynamic User Preferences via FAHP and Ordinal Utility Function.",
            "Revealing Your Mobile Password via WiFi Signals: Attacks and Countermeasures.",
            "RF Fingerprints Prediction for Cellular Network Positioning: A Subspace Identification Approach.",
            "RiskCog: Unobtrusive Real-Time User Authentication on Mobile Devices in the Wild.",
            "Severity-Based Prioritized Processing of Packets with Application in VANETs.",
            "A Machine Learning Approach to 5G Infrastructure Market Optimization.",
            "A Signal-Level Transfer Learning Framework for Autonomous Reconfiguration of Wearable Systems.",
            "Composite Amplitude-Shift Keying for Effective LED-Camera VLC.",
            "Decentralized Asynchronous Coded Caching Design and Performance Analysis in Fog Radio Access Networks.",
            "DPavatar: A Real-Time Location Protection Framework for Incumbent Users in Cognitive Radio Networks.",
            "Energy- and Mobility-Aware Scheduling for Perpetual Trajectory Tracking.",
            "Hardware-Assisted, Low-Cost Video Transcoding Solution in Wireless Networks.",
            "HyTasker: Hybrid Task Allocation in Mobile Crowd Sensing.",
            "Interactive Context for Mobile OS Resource Management.",
            "LaSR: A Supple Multi-Connectivity Scheduler for Multi-RAT OFDMA Systems.",
            "Offloading Computations to Mobile Devices and Cloudlets via an Upgraded NFC Communication Protocol.",
            "On the Interaction of Charging-Aware Mobility and Wireless Capacity.",
            "Real-Time Crowd Monitoring Using Seamless Indoor-Outdoor Localization.",
            "RSS Models for Respiration Rate Monitoring.",
            "Security Properties of Gait for Mobile Device Pairing.",
            "Shortest-Latency Opportunistic Routing in Asynchronous Wireless Sensor Networks with Independent Duty-Cycling.",
            "Signature Verification Using Critical Segments for Securing Mobile Transactions.",
            "Supervisory Performance Control of Concurrent Mobile Apps for Energy Efficiency.",
            "A Signature Scheme with Unlinkable-yet-Accountable Pseudonymity for Privacy-Preserving Crowdsensing.",
            "ARETE: On Designing Joint Online Pricing and Reward Sharing Mechanisms for Mobile Data Markets.",
            "Bird-MAC: Energy-Efficient MAC for Quasi-Periodic IoT Applications by Avoiding Early Wake-up.",
            "Channel Access Optimization with Adaptive Congestion Pricing for Cognitive Vehicular Networks: An Evolutionary Game Approach.",
            "Dynamic Channel Bonding in Spatially Distributed High-Density WLANs.",
            "Enabling Real-Time Indoor Tracking of IoT Devices Through Visible Light Retroreflection.",
            "Fair and Efficient Caching Algorithms and Strategies for Peer Data Sharing in Pervasive Edge Computing Environments.",
            "Leveraging Acoustic Signals for Vehicle Steering Tracking with Smartphones.",
            "Near-Optimal and Truthful Online Auction for Computation Offloading in Green Edge-Computing Systems.",
            "Never Use Labels: Signal Strength-Based Bayesian Device-Free Localization in Changing Environments.",
            "On Detecting Hidden Wireless Cameras: A Traffic Pattern-based Approach.",
            "Optimizing Social Welfare of Live Video Streaming Services in Mobile Edge Computing.",
            "Performance Analysis of Scheduled Access Mode of the IEEE 802.15.6 MAC Protocol under Non-Ideal Channel Conditions.",
            "Spatial and Temporal Management of Cellular HetNets with Multiple Solar Powered Drones.",
            "TagBreathe: Monitor Breathing with Commodity RFID Systems.",
            "Unraveling Impact of Critical Sensing Range on Mobile Camera Sensor Networks.",
            "A Cost-Driven Approach to Caching-as-a-Service in Cloud-Based 5G Mobile Networks.",
            "A High-Availability Data Collection Scheme based on Multi-AUVs for Underwater Sensor Networks.",
            "A Secure Shuffling Mechanism for White-Box Attack-Resistant Unmanned Vehicles.",
            "Auction-Based Data Transaction in Mobile Networks: Data Allocation Design and Performance Analysis.",
            "Catch Me If You Can: Rogue Access Point Detection Using Intentional Channel Interference.",
            "Clustered Virtualized Network Functions Resource Allocation based on Context-Aware Grouping in 5G Edge Networks.",
            "Coexistence Performance and Limits of Frame-Based Listen-Before-Talk.",
            "Habit2vec: Trajectory Semantic Embedding for Living Pattern Recognition in Population.",
            "Image and WLAN Bimodal Integration for Indoor User Localization.",
            "Label Coloring Based Beaconing Schedule in Duty-Cycled Multihop Wireless Networks.",
            "Machine Learning Based Network Analysis Using Millimeter-Wave Narrow-Band Energy Traces.",
            "Optimization Model for Cross-Domain Network Slices in 5G Networks.",
            "Per-Flow Radio Resource Management to Mitigate Interference in Dense IEEE 802.11 Wireless LANs.",
            "Privacy Risk Analysis and Mitigation of Analytics Libraries in the Android Ecosystem.",
            "Probing into the Physical Layer: Moving Tag Detection for Large-Scale RFID Systems.",
            "Reliability-Optimal Cooperative Communication and Computing in Connected Vehicle Systems.",
            "Theoretical Framework for Estimating Target-Object Shape by Using Location-Unknown Mobile Distance Sensors.",
            "A Socially-Aware Hybrid Computation Offloading Framework for Multi-Access Edge Computing.",
            "ARREST: A RSSI Based Approach for Mobile Sensing and Tracking of a Moving Object.",
            "Distributed Energy-Efficient Multi-UAV Navigation for Long-Term Communication Coverage by Deep Reinforcement Learning.",
            "Duopoly Competition for Mobile Data Plans with Time Flexibility.",
            "Efficient Spectrum Slicing in 5G Networks: An Overlapping Coalition Formation Approach.",
            "Enabling Strong Privacy Preservation and Accurate Task Allocation for Mobile Crowdsensing.",
            "Energy Efficient Scheduling Algorithms for Sweep Coverage in Mobile Sensor Networks.",
            "Ensemble Adaptive Streaming - A New Paradigm to Generate Streaming Algorithms via Specializations.",
            "Joint Communication, Computation, Caching, and Control in Big Data Multi-Access Edge Computing.",
            "Mitigating NDN-Based Fake Content Dissemination in Opportunistic Mobile Networks.",
            "Optimized Neighbor Discovery for Opportunistic Networks of Energy Constrained IoT Devices.",
            "Optimizing TCP Loss Recovery Performance Over Mobile Data Networks.",
            "Pricing for Collaboration between Online Apps and Offline Venues.",
            "PrOS: Light-Weight Privatized Se cure OSes in ARM TrustZone.",
            "Scalable Power Impact Prediction of Mobile Sensing Applications at Pre-Installation Time.",
            "Uncoordinated Pseudonym Changes for Privacy Preserving in Distributed Networks.",
            "ViFi: Virtual Fingerprinting WiFi-Based Indoor Positioning via Multi-Wall Multi-Floor Propagation Model.",
            "An Application-Specific Approach to Energy Optimization on Android Mobile Devices.",
            "Autocorrelation and Coherence Time of Interference in Poisson Networks.",
            "Beamforming Oriented Topology Control for mmWave Networks.",
            "BioTouchPass: Handwritten Passwords for Touchscreen Biometrics.",
            "Collisions Are Preferred: RFID-Based Stocktaking with a High Missing Rate.",
            "Cost Effective Directional Barrier Construction Based on Zooming and United Probabilistic Detection.",
            "Data Transmissions Using Hub Nodes in Vehicular Social Networks.",
            "Furion: Engineering High-Quality Immersive Virtual Reality on Today's Mobile Devices.",
            "High Speed LED-to-Camera Communication using Color Shift Keying with Flicker Mitigation.",
            "Incentive Mechanism for Multiple Cooperative Tasks with Compatible Users in Mobile Crowd Sensing via Online Communities.",
            "Minimizing Wireless Delay with a High-Throughput Side Channel.",
            "Mobile Devices based Eavesdropping of Handwriting.",
            "On Efficiently Monitoring Continuous Aggregate k Nearest Neighbors in Road Networks.",
            "On Interference Dynamics in Matérn Networks.",
            "Optimizing Design and Performance of Underwater Acoustic Sensor Networks with 3D Topology.",
            "Razor: Scaling Backend Capacity for Mobile Applications.",
            "Towards Influence of Chunk Size Variation on Video Streaming in Wireless Networks.",
            "Traffic-Aware Backscatter Communications in Wireless-Powered Heterogeneous Networks.",
            "A Seamless Mobility Management Protocol in 5G Locator Identificator Split Dense Small Cells.",
            "A Self-Evolving WiFi-based Indoor Navigation System Using Smartphones.",
            "aLeak: Context-Free Side-Channel from Your Smart Watch Leaks Your Typing Privacy.",
            "An Analysis of Service Bundles of Mobile Network Operators with Free Services Included.",
            "Exploring the Social Learning of Taxi Drivers in Latent Vehicle-to-Vehicle Networks.",
            "FamilyLog: Monitoring Family Mealtime Activities by Mobile Devices.",
            "iLOCuS: Incentivizing Vehicle Mobility to Optimize Sensing Distribution in Crowd Sensing.",
            "Implementation of Differential Tag Sampling for COTS RFID Systems.",
            "Learning-Based Tracking Area List Management in 4G and 5G Networks.",
            "Max-Min Fair Resource Allocation in Millimetre-Wave Backhauls.",
            "Possibility-Based Trust for Mobile Wireless Networks.",
            "Practical Heterogeneous Wireless Charger Placement with Obstacles.",
            "Profit Maximization for Sponsored Data in Wireless Video Transmission Systems.",
            "SCsec: A Secure Near Field Communication System via Screen Camera Communication.",
            "SmartVLC: Co-Designing Smart Lighting and Communication for Visible Light Networks.",
            "Take the Field from Your Smartphone: Leveraging UAVs for Event Filming.",
            "Versatile Access Control for Massive IoT: Throughput, Latency, and Energy Efficiency.",
            "Capacity and Delay Scaling for Broadcast Transmission in Highly Mobile Wireless Networks.",
            "CDN Slicing over a Multi-Domain Edge Cloud.",
            "CEDAR: A Cost-Effective Crowdsensing System for Detecting and Localizing Drones.",
            "Coverage Performance in MIMO-ZFBF Dense HetNets with Multiplexing and LOS/NLOS Path-Loss Attenuation.",
            "Delay-Sensitive Multi-Period Computation Offloading with Reliability Guarantees in Fog Networks.",
            "DRAG: Deep Reinforcement Learning Based Base Station Activation in Heterogeneous Networks.",
            "Economic Analysis of Rollover and Shared Data Plans.",
            "Efficient Indoor Localization via Switched-Beam Antennas.",
            "FullStop: A Camera-Assisted System for Characterizing Unsafe Bus Stopping.",
            "Joint Optimization of Path Planning and Resource Allocation in Mobile Edge Computing.",
            "Multi-Cap Optimization for Wireless Data Plans with Time Flexibility.",
            "Optimal Mobile Computation Offloading with Hard Deadline Constraints.",
            "Quality of Experience-Aware Mobile Edge Caching through a Vehicular Cloud.",
            "Recycling Random Access Opportunities with Secondary Access Class Barring.",
            "ROD-Revenue: Seeking Strategies Analysis and Revenue Prediction in Ride-on-Demand Service Using Multi-Source Urban Data.",
            "Spatially-Consistent Human Body Blockage Modeling: A State Generation Procedure.",
            "Target Detection and Localization Methods Using Compartmental Model for Internet of Things.",
            "Adaptive Compressive Video Coding for Embedded Camera Sensors: Compressed Domain Motion and Measurements Estimation.",
            "Collusion-Resistant Jamming for Securing Legacy Clients in Wireless Networks.",
            "Coverage Optimization with a Dynamic Network of Drone Relays.",
            "FlexVi: PHY Aided Flexible Multicast for Video Streaming over IEEE 802.11 WLANs.",
            "Free Market of Multi-Leader Multi-Follower Mobile Crowdsensing: An Incentive Mechanism Design by Deep Reinforcement Learning.",
            "Frequency-Angle Spectrum Hole Detection with Taylor Expansion Based Focusing Transformation.",
            "Geographical Correlation-Based Data Collection for Sensor-Augmented RFID Systems.",
            "Joint Recommendations in Multilayer Mobile Social Networks.",
            "Jointly-Optimized Searching and Tracking with Random Finite Sets.",
            "LoSeRO: A Locality Sensitive Routing Protocol in Opportunistic Networks with Contact Profiles.",
            "Optimizing mmWave Wireless Backhaul Scheduling.",
            "Passive Crowd Speed Estimation in Adjacent Regions With Minimal WiFi Sensing.",
            "Profit Maximization in 5G+ Networks with Heterogeneous Aerial and Ground Base Stations.",
            "Towards Fast and Reliable Multihop Routing in VANETs.",
            "Turning Waste into Wealth: Free Control Message Transmissions in Indoor WiFi Networks.",
            "A Caching Strategy Towards Maximal D2D Assisted Offloading Gain.",
            "A Control Theoretic Approach to ABR Video Streaming: A Fresh Look at PID-Based Rate Adaptation.",
            "A Low Latency On-Body Typing System through Single Vibration Sensor.",
            "Adaptive and Blind Regression for Mobile Crowd Sensing.",
            "Analysis of Different Approaches to Distributed Multiuser MIMO in the 802.11ac.",
            "Blockage Aware Fair Scheduling with Differentiated Service Support in mmWave WPANs/WLANs.",
            "Deep Reinforcement Learning for Online Computation Offloading in Wireless Powered Mobile-Edge Computing Networks.",
            "Dynamic Resource Provisioning of a Scalable E2E Network Slicing Orchestration System.",
            "Economics of Fog Computing: Interplay Among Infrastructure and Service Providers, Users, and Edge Resource Owners.",
            "FRCA: A Novel Flexible Routing Computing Approach for Wireless Sensor Networks.",
            "Learning to Coordinate in a Decentralized Cognitive Radio Network in Presence of Jammers.",
            "PASS: Reducing Redundant Notifications between a Smartphone and a Smartwatch for Energy Saving.",
            "Personalized Mobile App Recommendation by Learning User's Interest from Social Media.",
            "PPtaxi: Non-Stop Package Delivery via Multi-Hop Ridesharing.",
            "Reliability-Aware Virtualized Network Function Services Provisioning in Mobile Edge Computing.",
            "Your Eyes Reveal Your Secrets: An Eye Movement Based Password Inference on Smartphone.",
            "Adaptive Admission Control for IoT Applications in Home WiFi Networks.",
            "Coflow-Like Online Data Acquisition from Low-Earth-Orbit Datacenters.",
            "Distributed Learning in Noisy-Potential Games for Resource Allocation in D2D Networks.",
            "Exploring a Brain-Based Cancelable Biometrics for Smart Headwear: Concept, Implementation, and Evaluation.",
            "Fast-Convergent Learning-Aided Control in Energy Harvesting Networks.",
            "Improving Urban Crowd Flow Prediction on Flexible Region Partition.",
            "Joint Client Association and Random Access Control for MU-MIMO WLANs.",
            "Learning-Aided Computation Offloading for Trusted Collaborative Mobile Edge Computing.",
            "Multi-Seed Group Labeling in RFID Systems.",
            "Practical Splitting Algorithm for Multi-Channel Slotted Random Access Systems.",
            "Preserving Honest/Dishonest Users' Operational Privacy with Blind Interference Calculation in Spectrum Sharing System.",
            "Residual Carrier Frequency Offset Estimation and Compensation for Commodity WiFi.",
            "Scheduling Algorithms for Minimizing Age of Information in Wireless Broadcast Networks with Random Arrivals.",
            "Secure TDD MIMO Networks Against Training Sequence Based Eavesdropping Attack.",
            "SmartPI: Understanding Permission Implications of Android Apps from User Reviews.",
            "Tainting-Assisted and Context-Migrated Symbolic Execution of Android Framework for Vulnerability Discovery and Exploit Generation.",
            "Towards A Personal Mobile Cloud via Generic Device Interconnections.",
            "Volcano Routing: A Multi-Pipe High-Throughput Routing Protocol with Hole Avoidance for Multi-Beam Directional Mesh Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2019",
        "info": "Volume 18, 2019",
        "count": 214,
        "papers": [
            "A Concurrent Transmission Based Broadcast Scheme for Urban VANETs.",
            "A Data Parasitizing Scheme for Effective Health Monitoring in Wireless Body Area Networks.",
            "A Non-Stationary Service Curve Model for Estimation of Cellular Sleep Scheduling.",
            "An Evolutionary Self-Cooperative Trust Scheme Against Routing Disruptions in MANETs.",
            "Anchor Free IP Mobility.",
            "Finding Decomposable Models for Efficient Distributed Inference over Sensor Networks.",
            "Heterogeneous Multi-Task Assignment in Mobile Crowdsensing Using Spatiotemporal Correlation.",
            "Improving Network Formation in 6TiSCH Networks.",
            "Integrating Social Links into Wireless Networks: Modeling, Routing, Analysis, and Evaluation.",
            "Jointly Optimizing Content Caching and Recommendations in Small Cell Networks.",
            "KEH-Gait: Using Kinetic Energy Harvesting for Gait-based User Authentication Systems.",
            "Learning-Constrained Enhancement of Cellular Networks Capacity.",
            "Mobile Display Power Reduction for Video Using Standardized Metadata.",
            "Multipath Cooperative Routing with Efficient Acknowledgement for LEO Satellite Networks.",
            "Primary User-Aware Optimal Discovery Routing for Cognitive Radio Networks.",
            "Selfish Decentralized Computation Offloading for Mobile Cloud Computing in Dense Wireless Networks.",
            "Third-Party Cellular Congestion Detection and Augmentation.",
            "Unlicensed LTE Pricing for Tiered Content Delivery and Heterogeneous User Access.",
            "A Robust Load Balancing and Routing Protocol for Intra-Car Hybrid Wired/Wireless Networks.",
            "Coded Caching Clusters with Device-to-Device Communications.",
            "DRX over LAA-LTE-A New Design and Analysis Based on Semi-Markov Model.",
            "Efficient Locality Classification for Indoor Fingerprint-Based Systems.",
            "Energy Efficiency of Secure Cognitive Radio Networks with Cooperative Spectrum Sharing.",
            "Energy-Efficient Dynamic Computation Offloading and Cooperative Task Scheduling in Mobile Cloud Computing.",
            "Energy-Efficient Traffic Regulation and Scheduling for Video Streaming Services Over LTE-A Networks.",
            "Mobile Data Offloading with Uniform Pricing and Overlaps.",
            "Multi-Channel Based Sybil Attack Detection in Vehicular Ad Hoc Networks Using RSSI.",
            "Multi-User Cooperative Mobile Video Streaming: Performance Analysis and Online Mechanism Design.",
            "On the Strength of Privacy Metrics for Vehicular Communication.",
            "Performance Evaluation and Delay-Power Trade-off Analysis of ZigBee Protocol.",
            "Proximity-Aware Location Based Collaborative Sensing for Energy-Efficient Mobile Devices.",
            "PTrack: Enhancing the Applicability of Pedestrian Tracking with Wearables.",
            "Sensor-Based Proximity Detection in the Face of Active Adversaries.",
            "Streaming High-Definition Real-Time Video to Mobile Devices with Partially Reliable Transfer.",
            "Writing in the Air with WiFi Signals for Virtual Reality Devices.",
            "A Reverse Bearings Only Target Motion Analysis for Autonomous Underwater Vehicle Navigation.",
            "An Investigation of Using Loop-Back Mechanism for Channel Reciprocity Enhancement in Secret Key Generation.",
            "Backup Battery Analysis and Allocation against Power Outage for Cellular Base Stations.",
            "Bloom Hopping: Bloom Filter Based 2-Hop Neighbor Management in VANETs.",
            "Dandelion: A Unified Code Offloading System for Wearable Computing.",
            "Dolphin: Real-Time Hidden Acoustic Signal Capture with Smartphones.",
            "Fair Coexistence of Regular and Multipath TCP over Wireless Last-Miles.",
            "Fast Deployment of UAV Networks for Optimal Wireless Coverage.",
            "Maxlifd: Joint Maximum Likelihood Localization Fusing Fingerprints and Mutual Distances.",
            "Power Allocation and 3-D Placement for Floating Relay Supporting Indoor Communications.",
            "Signal Processing of Multimodal Mobile Lifelogging Data Towards Detecting Stress in Real-World Driving.",
            "TCP Closure Optimization for Enhanced Battery Life in Smart Devices.",
            "Toward Ultra-Low-Power Remote Health Monitoring: An Optimal and Adaptive Compressed Sensing Framework for Activity Recognition.",
            "Traffic-Aware Sensor Grouping for IEEE 802.11ah Networks: Regression Based Analysis and Design.",
            "Virtual Safe: Unauthorized Walking Behavior Detection for Mobile Devices.",
            "Vision-Based Mobile Indoor Assistive Navigation Aid for Blind People.",
            "Polarization-Based Visible Light Positioning.",
            "Zone Probabilistic Routing for Wireless Sensor Networks.",
            "An Efficient Content Delivery System for 5G CRAN Employing Realistic Human Mobility.",
            "Distributed Caching Algorithms in the Realm of Layered Video Streaming.",
            "Dynamic Computation Offloading for Mobile Cloud Computing: A Stochastic Game-Theoretic Approach.",
            "Edge Computing Assisted Adaptive Mobile Video Streaming.",
            "Efficiency Network Construction of Advanced Metering Infrastructure Using Zigbee.",
            "Efficient Indoor Positioning with Visual Experiences via Lifelong Learning.",
            "E-Fi: Evasive Wi-Fi Measures for Surviving LTE within 5 GHz Unlicensed Band.",
            "Flexible and Efficient Authenticated Key Agreement Scheme for BANs Based on Physiological Features.",
            "HuMAn: Complex Activity Recognition with Multi-Modal Multi-Positional Body Sensing.",
            "Improving Energy Efficiency of Android Devices by Preventing Redundant Frame Generation.",
            "Joint Transmitter and Receiver Design for Pattern Division Multiple Access.",
            "Learning-Based Outdoor Localization Exploiting Crowd-Labeled WiFi Hotspots.",
            "Moth and Ant Inspired Routing in Hierarchical Airborne Networks with Multi-Beam Antennas.",
            "On Dynamic Spectrum Allocation in Geo-Location Spectrum Sharing Systems.",
            "Differentially Private Mechanisms for Budget Limited Mobile Crowdsourcing.",
            "Reconstructing What You Said: Text Inference Using Smartphone Motion.",
            "Resource Allocation for Real-Time D2D Communications Underlaying Cellular Networks.",
            "Reward or Penalty: Aligning Incentives of Stakeholders in Crowdsourcing.",
            "A Novel Mobile Data Contract Design with Time Flexibility.",
            "A Renewal Theory Based Analytical Model for Multi-Channel Random Access in IEEE 802.11ac/ax.",
            "BeamRaster: A Practical Fast Massive MU-MIMO System With Pre-Computed Precoders.",
            "Co-Location Social Networks: Linking the Physical World and Cyberspace.",
            "Contract-Based Small-Cell Caching for Data Disseminations in Ultra-Dense Cellular Networks.",
            "Counting Human Objects Using Backscattered Radio Frequency Signals.",
            "Data Collection with Accuracy-Aware Congestion Control in Sensor Networks.",
            "Fast and Resilient Indoor Floor Plan Construction with a Single User.",
            "How Expensive is Consistency? Performance Analysis of Consistent Rate Provisioning to Mobile Users in Cellular Networks.",
            "Maximum Likelihood Joint Angle and Delay Estimation from Multipath and Multicarrier Transmissions with Application to Indoor Localization over IEEE 802.11ac Radio.",
            "Online Adaptive Transmission Strategy for Buffer-Aided Cooperative NOMA Systems.",
            "Optimal Rate Sampling in 802.11 Systems: Theory, Design, and Implementation.",
            "Pricing Data Tampering in Automated Fare Collection with NFC-Equipped Smartphones.",
            "Reducing Event Latency and Power Consumption in Mobile Devices by Using a Kernel-Level Display Server.",
            "TaggedAR: An RFID-Based Approach for Recognition of Multiple Tagged Objects in Augmented Reality Systems.",
            "Throughput-Optimal Broadcast in Wireless Networks with Dynamic Topology.",
            "Verifiable Smart Packaging with Passive RFID.",
            "Android Malware Detection Using Complex-Flows.",
            "Cross-Layer Energy Efficient Resource Allocation in PD-NOMA Based H-CRANs: Implementation via GPU.",
            "Enhanced Mathematical Modeling of Aggregation-Enabled WLANs with Compressed BlockACK.",
            "Fair Scheduling for Data Collection in Mobile Sensor Networks with Energy Harvesting.",
            "FooDNet: Toward an Optimized Food Delivery Network Based on Spatial Crowdsourcing.",
            "Low Cost Video Streaming through Mobile Edge Caching: Modelling and Optimization.",
            "Network Coding Based Evolutionary Network Formation for Dynamic Wireless Networks.",
            "Personalized Privacy-Preserving Task Allocation for Mobile Crowdsensing.",
            "Precise Power Delay Profiling with Commodity Wi-Fi.",
            "Privacy-Preserving Crowd-Sourced Statistical Data Publishing with An Untrusted Server.",
            "Radio over Cloud (RoC): Cloud-Assisted Distributed Beamforming for Multi-Class Traffic.",
            "RoArray: Towards More Robust Indoor Localization Using Sparse Recovery with Commodity WiFi.",
            "Seamless Resource Sharing in Wearable Networks by Application Function Virtualization.",
            "Server-Side Traffic Analysis Reveals Mobile Location Information over the Internet.",
            "Strategic Social Team Crowdsourcing: Forming a Team of Truthful Workers for Crowdsourcing in Social Networks.",
            "Trading Routing Diversity for Better Network Performance.",
            "uStash: A Novel Mobile Content Delivery System for Improving User QoE in Public Transport.",
            "ViNav: A Vision-Based Indoor Navigation System for Smartphones.",
            "Cache Replacement Schemes Based on Adaptive Time Window for Video on Demand Services in Femtocell Networks.",
            "Complex Activity Recognition Using Acceleration, Vital Sign, and Location Data.",
            "Computational Load Balancing on the Edge in Absence of Cloud and Fog.",
            "CrowdVision: A Computing Platform for Video Crowdprocessing Using Deep Learning.",
            "Efficient Path Planning for a Mobile Sink to Reliably Gather Data from Sensors with Diverse Sensing Rates and Limited Buffers.",
            "Energy-Efficient Machine-to-Machine (M2M) Communications in Virtualized Cellular Networks with Mobile Edge Computing (MEC).",
            "Guidepost: Scalable MU-MIMO User Selection via Indirect Channel Orthogonality Evaluation.",
            "IncentMe: Effective Mechanism Design to Stimulate Crowdsensing Participants with Uncertain Mobility.",
            "Joint Optimization of Scheduling and Power Control in Wireless Networks: Multi-Dimensional Modeling and Decomposition.",
            "LORA: Load-Balanced Opportunistic Routing for Asynchronous Duty-Cycled WSN.",
            "Persistent Traffic Measurement through Vehicle-to-Infrastructure Communications in Cyber-Physical Road Systems.",
            "Revisiting Reading Rate with Mobility: Rate-Adaptive Reading of COTS RFID Systems.",
            "Seamless Dynamic Adaptive Streaming in LTE/Wi-Fi Integrated Network under Smartphone Resource Constraints.",
            "Social-Network-Assisted Worker Recruitment in Mobile Crowd Sensing.",
            "StrLight: An Imperceptible Visible Light Communication System with String Lights.",
            "Taming Cross-Layer Attacks in Wireless Networks: A Bayesian Learning Approach.",
            "UE-TV: User-Centric Energy-Efficient HDTV Broadcast over LTE and Wi-Fi.",
            "A Localization Method Avoiding Flip Ambiguities for Micro-UAVs with Bounded Distance Measurement Errors.",
            "Algorithms and Position Optimization for a Decentralized Localization Platform Based on Resource-Constrained Devices.",
            "Classifying IoT Devices in Smart Environments Using Network Traffic Characteristics.",
            "CompetitiveBike: Competitive Analysis and Popularity Prediction of Bike-Sharing Apps Using Multi-Source Data.",
            "Design and Experimental Evaluation of a Cross-Layer Deadline-Based Joint Routing and Spectrum Allocation Algorithm.",
            "iBlink: A Wearable Device Facilitating Facial Paralysis Patients to Blink.",
            "Location Aware Opportunistic Bandwidth Sharing between Static and Mobile Users with Stochastic Learning in Cellular Networks.",
            "Lower Bound on Bandwidth and Channel Assignment Algorithm for Multimedia Communication in Cellular Networks.",
            "Mobi-Flow: Mobility-Aware Adaptive Flow-Rule Placement in Software-Defined Access Network.",
            "MOERA: Mobility-Agnostic Online Resource Allocation for Edge Computing.",
            "Network Coding-Based Flooding with a Mobile Sink in Low-Duty-Cycle Wireless Sensor Networks.",
            "Performance Analysis of Wi-Fi Indoor Localization with Channel State Information.",
            "Practical and Dynamic Buffer Sizing Using LearnQueue.",
            "Rate Aware Network Codes for Cloud Radio Access Networks.",
            "Recognizing Textures with Mobile Cameras for Pedestrian Safety Applications.",
            "Robust Design of Spectrum-Sharing Networks.",
            "Social Community-Aware Content Placement in Wireless Device-to-Device Communication Networks.",
            "Thanos: Incentive Mechanism with Quality Awareness for Mobile Crowd Sensing.",
            "Adaptive Bitrate Video Caching and Processing in Mobile-Edge Computing Networks.",
            "Allocating Heterogeneous Tasks in Participatory Sensing with Diverse Participant-Side Factors.",
            "Byzantine Attacker Identification in Collaborative Spectrum Sensing: A Robust Defense Framework.",
            "Cooperative Base Station Caching and X2 Link Traffic Offloading System for Video Streaming Over SDN-Enabled 5G Networks.",
            "Efficient Live Migration of Edge Services Leveraging Container Layered Storage.",
            "Estimation of Static and Dynamic Urban Populations with Mobile Network Metadata.",
            "Exploring Time Flexibility in Wireless Data Plans.",
            "File Fragmentation in Mobile Devices: Measurement, Evaluation, and Treatment.",
            "FineLoc: A Fine-Grained Self-Calibrating Wireless Indoor Localization System.",
            "Interference Management in D2D-Enabled Heterogeneous Cellular Networks Using Matching Theory.",
            "Janus: A Multi-TCP Framework for Application-Aware Optimization in Mobile Networks.",
            "Mobile Ad Prefetching and Energy Optimization via Tail Energy Accounting.",
            "On Designing Distributed Auction Mechanisms for Wireless Spectrum Allocation.",
            "On the Synchronization of Computational RFIDs.",
            "Privacy Preserving Utility-Aware Mechanism for Data Uploading Phase in Participatory Sensing.",
            "QoE-Aware Computation Offloading to Capture Energy-Latency-Pricing Tradeoff in Mobile Clouds.",
            "Spatio-Temporal Analysis and Prediction of Cellular Traffic in Metropolis.",
            "Vbargain: A Market-Driven Quality Oriented Incentive for Mobile Video Offloading.",
            "60 GHz Networking: Mobility, Beamforming, and Frame Level Operation from Theory to Practice.",
            "A Tractable Approach to Joint Transmission in Multiuser Visible Light Communication Networks.",
            "Accurate Corruption Estimation in ZigBee under Cross-Technology Interference.",
            "Algorithm Design and Analysis for Wireless Relay Network Deployment Problem.",
            "ARMOR: A Secure Combinatorial Auction for Heterogeneous Spectrum.",
            "Close-Proximity Detection for Hand Approaching Using Backscatter Communication.",
            "Collision Avoidance Energy Efficient Multi-Channel MAC Protocol for UnderWater Acoustic Sensor Networks.",
            "Differentially Private and Utility Preserving Publication of Trajectory Data.",
            "Directional Discontinuous Reception (DDRX) for mmWave Enabled 5G Communications.",
            "Extending Bluetooth LE Protocol for Mutual Discovery in Massive and Dynamic Encounters.",
            "JustWalk: A Crowdsourcing Approach for the Automatic Construction of Indoor Floorplans.",
            "Multi-Stream Opportunistic Network Decoupling: Relay Selection and Interference Management.",
            "Network Virtualization with Energy Efficiency Optimization for Wireless Heterogeneous Networks.",
            "New Theoretical Limit Analysis of LoS and RSS Based Positioning Methods for Ricean Fading Channel in RF Systems.",
            "Regular Topology Formation Based on Artificial Forces for Distributed Mobile Robotic Networks.",
            "Static and Mobile Target kk-Coverage in Wireless Rechargeable Sensor Networks.",
            "Think Like A Graph: Real-Time Traffic Estimation at City-Scale.",
            "A Prediction-Based User Selection Framework for Heterogeneous Mobile CrowdSensing.",
            "A Ubiquitous WiFi-Based Fine-Grained Gesture Recognition System.",
            "Cloak of Invisibility: Privacy-Friendly Photo Capturing and Sharing System.",
            "Distributed Dynamic Packet Scheduling Framework for Handling Disturbances in Real-Time Wireless Networks.",
            "EGO: Optimized Sensor Selection for Multi-Context Aware Applications with an Ontology for Recognition Models.",
            "Energy-Aware CPU Frequency Scaling for Mobile Video Streaming.",
            "Experimental QoE Evaluation of Multicast Video Delivery over IEEE 802.11aa WLANs.",
            "Improving Multipath TCP Performance over WiFi and Cellular Networks: An Analytical Approach.",
            "On Mutual Interference Analysis in Hybrid Interweave-Underlay Cognitive Communications.",
            "Online Quality-Aware Incentive Mechanism for Mobile Crowd Sensing with Extra Bonus.",
            "Performance Analysis of Connectivity and Localization in Multi-Hop Underwater Optical Wireless Sensor Networks.",
            "Performance Analysis of Adaptive Multicast Streaming Services in Wireless Cellular Networks.",
            "Robust Light-Weight Magnetic-Based Door Event Detection with Smartphones.",
            "Robust Spinning Sensing with Dual-RFID-Tags in Noisy Settings.",
            "Spatial Multiplexing for Non-Line-of-Sight Light-to-Camera Communications.",
            "Task Offloading with Network Function Requirements in a Mobile Edge-Cloud Network.",
            "TSFS: An Integrated Approach for Event Segmentation and ADL Detection in IoT Enabled Smarthomes.",
            "When Urban Safety Index Inference Meets Location-Based Data.",
            "WiFi CSI Based Passive Human Activity Recognition Using Attention Based BLSTM.",
            "A Framework for Evaluating Physical-Layer Network Coding Gains in Multi-Hop Wireless Networks.",
            "A Super-Resolution-Assisted Fingerprinting Method Based on Channel Impulse Response Measurement for Indoor Positioning.",
            "Android Malware Detection via Graphlet Sampling.",
            "Automated Hybrid Analysis of Android Malware through Augmenting Fuzzing with Forced Execution.",
            "Beef Up the Edge: Spectrum-Aware Placement of Edge Computing Services for the Internet of Things.",
            "Cost Efficiency Optimization of 5G Wireless Backhaul Networks.",
            "CVCG: Cooperative V2V-Aided Transmission Scheme Based on Coalitional Game for Popular Content Distribution in Vehicular Ad-Hoc Networks.",
            "Distributed Stable Routing with Adaptive Power Control for Multi-Flow and Multi-Hop Mobile Cognitive Networks.",
            "Dynamic Participant Selection for Large-Scale Mobile Crowd Sensing.",
            "GroupSense: A Lightweight Framework for Group Identification.",
            "Hierarchical Cooperation Improves Delay in Cognitive Radio Networks with Heterogeneous Mobile Secondary Nodes.",
            "Line-of-Sight Discovery in 3D Using Highly Directional Transceivers.",
            "Multi-Timescale Online Optimization of Network Function Virtualization for Service Chaining.",
            "Nocturnal Epileptic Seizures Detection Using Inertial and Muscular Sensors.",
            "On Anonymous Routing in Delay Tolerant Networks.",
            "Optimizing User Satisfaction of Mobile Workloads Subject to Various Sources of Uncertainties.",
            "Robust Sensor Localization against Known Sensor Position Attacks.",
            "Visible Light Localization Using Conventional Light Fixtures and Smartphones.",
            "Wearables Clock Synchronization Using Skin Electric Potentials."
        ]
    },
    {
        "name": "TMC",
        "year": "2018",
        "info": "Volume 17, 2018",
        "count": 212,
        "papers": [
            "Adaptive Relay Selection and Power Allocation for OFDM Cooperative Underwater Acoustic Systems.",
            "An Efficient Prediction-Based User Recruitment for Mobile Crowdsensing.",
            "BRPL: Backpressure RPL for High-Throughput and Mobile IoTs.",
            "Construction and Mitigation of User-Behavior-Based Covert Channels on Smartphones.",
            "Detector Based Radio Tomographic Imaging.",
            "EABS: An Event-Aware Backpressure Scheduling Scheme for Emergency Internet of Things.",
            "Efficient Multi-View 3D Video Multicast with Depth-Image-Based Rendering in LTE-Advanced Networks with Carrier Aggregation.",
            "Exploring Flexibility of DRX in LTE/LTE-A: Design of Dynamic and Adjustable DRX.",
            "Improve Accuracy of Fingerprinting Localization with Temporal Correlation of the RSS.",
            "Max-Min Fairness Rate Control in Wireless Networks: Optimality and Algorithms by Perron-Frobenius Theory.",
            "MPiLoc: Self-Calibrating Multi-Floor Indoor Localization Exploiting Participatory Sensing.",
            "On Uplink Virtual MIMO with Device Relaying Cooperation Enforcement in 5G Networks.",
            "Reliable Safety Message Dissemination in NLOS Intersections Using TV White Spectrum.",
            "Sender-Jump Receiver-Wait: A Simple Blind Rendezvous Algorithm for Distributed Cognitive Radio Networks.",
            "Sensor-Assisted Multi-View Face Recognition System on Smart Glass.",
            "TSCA: A Temporal-Spatial Real-Time Charging Scheduling Algorithm for On-Demand Architecture in Wireless Rechargeable Sensor Networks.",
            "VCAMS: Viterbi-Based Context Aware Mobile Sensing to Trade-Off Energy and Delay.",
            "Authenticating Users Through Fine-Grained Channel Information.",
            "Automatic Identification of Driver's Smartphone Exploiting Common Vehicle-Riding Actions.",
            "Characterizing Privacy Risks of Mobile Apps with Sensitivity Analysis.",
            "Compressive Representation for Device-Free Activity Recognition with Passive RFID Signal Strength.",
            "Data Quality Guided Incentive Mechanism Design for Crowdsensing.",
            "DCAP: Improving the Capacity of WiFi Networks with Distributed Cooperative Access Points.",
            "Distributed Clustering-Task Scheduling for Wireless Sensor Networks Using Dynamic Hyper Round Policy.",
            "Distributed Event Localization via Alternating Direction Method of Multipliers.",
            "Enabling a Nationwide Radio Frequency Inventory Using the Spectrum Observatory.",
            "Energy-Efficient and Distributed Network Management Cost Minimization in Opportunistic Wireless Body Area Networks.",
            "Optimization of Fingerprints Reporting Strategy for WLAN Indoor Localization.",
            "Path Finding for Maximum Value of Information in Multi-Modal Underwater Wireless Sensor Networks.",
            "Post-CCA and Reinforcement Learning Based Bandwidth Adaptation in 802.11ac Networks.",
            "Reliable and Energy-Efficient Hybrid Screen Mirroring Multicast System.",
            "Spatio-Temporal Linkage over Location-Enhanced Services.",
            "Stochastic Analysis of Delayed Mobile Offloading in Heterogeneous Networks.",
            "Temporal Correlation of Interference and Outage in Mobile Networks over One-Dimensional Finite Regions.",
            "Unambiguous Association of Crowd-Sourced Radio Maps to Floor Plans for Indoor Localization.",
            "An Efficient Bit-Detecting Protocol for Continuous Tag Recognition in Mobile RFID Systems.",
            "Automatic Radio Map Adaptation for Indoor Localization Using Smartphones.",
            "Cellular Network Traces Towards 5G: Usage, Analysis and Generation.",
            "Characterizing Data Deliverability of Greedy Routing in Wireless Sensor Networks.",
            "Combining Solar Energy Harvesting with Wireless Charging for Hybrid Wireless Sensor Networks.",
            "Joint Carrier Matching and Power Allocation for Wireless Video with General Distortion Measure.",
            "Low-Overhead WiFi Fingerprinting.",
            "Multi-Dimensional Incentive Mechanism in Mobile Crowdsourcing with Moral Hazard.",
            "Neighbor Discovery Latency in BLE-Like Protocols.",
            "Optimal Dropbox Deployment Algorithm for Data Dissemination in Vehicular Networks.",
            "Personal PIN Leakage from Wearable Devices.",
            "Relay Selection for Heterogeneous Cellular Networks with Renewable Green Energy Sources.",
            "Resource Scheduling and Delay Analysis for Workflow in Wireless Small Cloud.",
            "Secure Physical Layer Voting.",
            "SERvICE: A Software Defined Framework for Integrated Space-Terrestrial Satellite Communication.",
            "Toward Accurate Network Delay Measurement on Android Phones.",
            "Traffic-Aware Optimal Spectral Access in Wireless Powered Cognitive Radio Networks.",
            "A Joint Framework for QoS and QoE for Video Transmission over Wireless Multimedia Sensor Networks.",
            "A Predictive Model for User Motivation and Utility Implications of Privacy-Protection Mechanisms in Location Check-Ins.",
            "ALLYS: All You can Send for Energy Harvesting Networks.",
            "An Incentive Mechanism Integrating Joint Power, Channel and Link Management for Social-Aware D2D Content Sharing and Proactive Caching.",
            "Analysis of Practical Aspects of Multi-Plane Routing-Based Load Balancing Approach for Future Link-State Convergent All-IP Access Networks.",
            "Clustering Weekly Patterns of Human Mobility Through Mobile Phone Data.",
            "Distributed Faulty Node Detection in Delay Tolerant Networks: Design and Analysis.",
            "Method and Analysis of Spectrally Compressed Radio Images for Mobile-Centric Indoor Localization.",
            "Pricing for Past Channel State Information in Multi-Channel Cognitive Radio Networks.",
            "Quantized Kalman Filter Tracking in Directional Sensor Networks.",
            "Recognition of Group Mobility Level and Group Structure with Mobile Devices.",
            "Scalable Mobile Crowdsensing via Peer-to-Peer Data Sharing.",
            "Scheduled Sequential Compressed Spectrum Sensing for Wideband Cognitive Radios.",
            "Secure Seamless Bluetooth Low Energy Connection Migration for Unmodified IoT Devices.",
            "Smartphone Sensing Meets Transport Data: A Collaborative Framework for Transportation Service Analytics.",
            "Wireless Resource Scheduling in Virtualized Radio Access Networks Using Stochastic Learning.",
            "Witals: AP-Centric Health Diagnosis of WiFi Networks.",
            "A Tale of Two Fashions: An Empirical Study on the Performance of Native Apps and Web Apps on Android.",
            "Asynchronous Stochastic Approximation Based Learning Algorithms for As-You-Go Deployment of Wireless Relay Networks Along a Line.",
            "Cell Association in Dense Heterogeneous Cellular Networks.",
            "Demographic Information Inference through Meta-Data Analysis of Wi-Fi Traffic.",
            "Fast Content Delivery via Distributed Caching and Small Cell Cooperation.",
            "FlopCoin: A Cryptocurrency for Computation Offloading.",
            "Full-Duplex or Half-Duplex: A Bayesian Game for Wireless Networks with Heterogeneous Self-Interference Cancellation Capabilities.",
            "Game-Theoretic Scalable Offloading for Video Streaming Services over LTE and WiFi Networks.",
            "Measurement-Driven Modeling for Connection Density and Traffic Distribution in Large-Scale Urban Mobile Networks.",
            "Mercury: An Infrastructure-Free System for Network Localization and Navigation.",
            "Mobile Cloud Performance Evaluation Using Stochastic Models.",
            "Performance Analysis of Network Coding with IEEE 802.11 DCF in Multi-Hop Wireless Networks.",
            "Performance Assessment of IEEE 802.11p with an Open Source SDR-Based Prototype.",
            "SLAC: Calibration-Free Pedometer-Fingerprint Fusion for Indoor Localization.",
            "SLIDE: A Straight Line Conflict Detection and Alerting Algorithm for Multiple Unmanned Aerial Vehicles.",
            "Intelligent Spectrum Management Based on Transfer Actor-Critic Learning for Rateless Transmissions in Cognitive Radio Networks.",
            "The Target-Barrier Coverage Problem in Wireless Sensor Networks.",
            "Aggressive Voltage and Temperature Control for Power Saving in Mobile Application Processors.",
            "An Energy-Efficient and Distributed Cooperation Mechanism for k-Coverage Hole Detection and Healing in WSNs.",
            "Centralized Cooperative Directional Spectrum Sensing for Cognitive Radio Networks.",
            "Data-Centric Mobile Crowdsensing.",
            "DELTA: Data Extraction and Logging Tool for Android.",
            "Distributed Coverage Control of Mobile Sensor Networks in Unknown Environment Using Game Theory: Algorithms and Experiments.",
            "Distributed Social Welfare Maximization in Urban Vehicular Participatory Sensing Systems.",
            "Dynamic Deployment and Cost-Sensitive Provisioning for Elastic Mobile Cloud Services.",
            "Energy-Aware Dual-Path Geographic Routing to Bypass Routing Holes in Wireless Sensor Networks.",
            "HARKE: Human Activity Recognition from Kinetic Energy Harvesting Data in Wearable Devices.",
            "High Resolution Beacon-Based Proximity Detection for Dense Deployment.",
            "Improved Vehicle Steering Pattern Recognition by Using Selected Sensor Data.",
            "QLDS: A Novel Design Scheme for Trajectory Privacy Protection with Utility Guarantee in Participatory Sensing.",
            "QoS-Aware Energy and Jitter-Efficient Downlink Predictive Scheduler for Heterogeneous Traffic LTE Networks.",
            "Robot Control Strategies for Task Allocation with Connectivity Constraints in Wireless Sensor and Robot Networks.",
            "SaW: Video Analysis in Social Media with Web-Based Mobile Grid Computing.",
            "The SMART Handoff Policy for Millimeter Wave Heterogeneous Cellular Networks.",
            "Use of Phone Sensors to Enhance Distracted Pedestrians' Safety.",
            "Wireless Charger Placement and Power Allocation for Maximizing Charging Quality.",
            "CLEVER: A Cooperative and Cross-Layer Approach to Video Streaming in HetNets.",
            "Dynamic SON-Enabled Location Management in LTE Networks.",
            "Energy Efficiency Maximization in Mobile Wireless Energy Harvesting Sensor Networks.",
            "Fast Cell Discovery in mm-Wave 5G Networks with Context Information.",
            "Leveraging Audio Signals for Early Recognition of Inattentive Driving with Smartphones.",
            "Leveraging Intelligence from Network CDR Data for Interference Aware Energy Consumption Minimization.",
            "LinkForecast: Cellular Link Bandwidth Prediction in LTE Networks.",
            "Low Cost and High Accuracy Data Gathering in WSNs with Matrix Completion.",
            "MiLift: Efficient Smartwatch-Based Workout Tracking Using Automatic Segmentation.",
            "Motivating Human-Enabled Mobile Participation for Data Offloading.",
            "Multi-Objective Optimization Based Allocation of Heterogeneous Spatial Crowdsourcing Tasks.",
            "Protocol Function Block Mapping of Software Defined Protocol for 5G Mobile Networks.",
            "Recurring Contacts between Groups of Devices: Analysis and Application.",
            "RF Energy Harvesting and Transfer for Spectrum Sharing Cellular IoT Communications in 5G Systems.",
            "Routing to Multi-Instantiated Destinations: Principles, Practice, and Applications.",
            "Stochastic Programming Methods for Workload Assignment in an Ad Hoc Mobile Cloud.",
            "Two-Hop Distance-Bounding Protocols: Keep Your Friends Close.",
            "A Truthful Online Mechanism for Location-Aware Tasks in Mobile Crowd Sensing.",
            "An Acoustic-Based Encounter Profiling System.",
            "Autonomous Training of Activity Recognition Algorithms in Mobile Sensors: A Transfer Learning Approach in Context-Invariant Views.",
            "Bandwidth-Satisfied and Coding-Aware Multicast Protocol in MANETs.",
            "Cooperative Edge Caching in User-Centric Clustered Mobile Networks.",
            "Economic-Robust Transmission Opportunity Auction for D2D Communications in Cognitive Mesh Assisted Cellular Networks.",
            "Enabling Phased Array Signal Processing for Mobile WiFi Devices.",
            "Evidence-Aware Mobile Computational Offloading.",
            "Frameworks for Privacy-Preserving Mobile Crowdsensing Incentive Mechanisms.",
            "Hierarchical Cooperative Discovery of Personal Places from Location Traces.",
            "Leveraging Information Asymmetry to Transform Android Apps into Self-Defending Code Against Repackaging Attacks.",
            "Leveraging Smartphones for Vehicle Lane-Level Localization on Highways.",
            "Mobile Lattice-Coded Physical-Layer Network Coding with Practical Channel Alignment.",
            "Multi-Client File Download Time Reduction from Cloud/Fog Storage Servers.",
            "Node-Based Service-Balanced Scheduling for Provably Guaranteed Throughput and Evacuation Time Performance.",
            "Semi-Automated Signal Surveying Using Smartphones and Floorplans.",
            "Social Learning Based Inference for Crowdsensing in Mobile Social Networks.",
            "A Multi-Radio Rendezvous Algorithm Based on Chinese Remainder Theorem in Heterogeneous Cognitive Radio Networks.",
            "Bi-View Semi-Supervised Learning Based Semantic Human Activity Recognition Using Accelerometers.",
            "Channel Quality Estimation for Improving Awareness of Communication Situation in the 2.4 GHz ISM Band.",
            "Cost Minimization for Cooperative Traffic Relaying Between Primary and Secondary Networks.",
            "Ensuring Minimum Spectrum Requirement in Matching-Based Spectrum Allocation.",
            "Fast Identification of Blocked RFID Tags.",
            "Identifying On-Site Users for Social Events: Mobility, Content, and Social Relationship.",
            "Incentive Compatible Overlay D2D System: A Group-Based Framework without CQI Feedback.",
            "Making Sense of Doppler Effect for Multi-Modal Hand Motion Detection.",
            "Multi-Task Allocation in Mobile Crowd Sensing with Individual Task Quality Assurance.",
            "Optimal Information Centric Caching in 5G Device-to-Device Communications.",
            "Paco: A System-Level Abstraction for On-Loading Contextual Data to Mobile Devices.",
            "Performance Analysis of License Assisted Access LTE with Asymmetric Hidden Terminals.",
            "π-Splicer: Perceiving Accurate CSI Phases with Commodity WiFi Devices.",
            "Position and Velocity Estimation of a Non-Cooperative Source From Asynchronous Packet Arrival Time Measurements.",
            "Side-Channel Inference Attacks on Mobile Keypads Using Smartwatches.",
            "Stability and Dynamic Control of Underlay Mobile Edge Networks.",
            "Transmission Management of Delay-Sensitive Medical Packets in Beyond Wireless Body Area Networks: A Queueing Game Approach.",
            "Accurate and Efficient Measurements of IP Level Performance to Drive Interface Selection in Heterogeneous Wireless Networks.",
            "CamK: Camera-Based Keystroke Detection and Localization for Small Mobile Devices.",
            "Data-Driven Evaluation of Anticipatory Networking in LTE Networks.",
            "Discovering Periodic Patterns for Large Scale Mobile Traffic Data: Method and Applications.",
            "DrinkSense: Characterizing Youth Drinking Behavior Using Smartphones.",
            "If WiFi APs Could Move: A Measurement Study.",
            "iGuard: A Real-Time Anti-Theft System for Smartphones.",
            "mSync: Physical Layer Frame Synchronization without Preamble Symbols.",
            "Non-Cooperative Game Theory Based Rate Adaptation for Dynamic Video Streaming over HTTP.",
            "Optimal Resource Allocations for Mobile Data Offloading via Dual-Connectivity.",
            "Peeking Over the Cellular Walled Gardens - A Method for Closed Network Diagnosis -.",
            "RCFD: A Novel Channel Access Scheme for Full-Duplex Wireless Networks Based on Contention in Time and Frequency Domains.",
            "Resource Sharing in Dual-Stack Devices: Opportunistic Bluetooth Transmissions in WLAN Busy Periods.",
            "Selecting Individual and Population Models for Predicting Human Mobility.",
            "Sophisticated Online Learning Scheme for Green Resource Allocation in 5G Heterogeneous Cloud Radio Access Networks.",
            "Tagspin: High Accuracy Spatial Calibration of RFID Antennas via Spinning Tags.",
            "WizHaul: On the Centralization Degree of Cloud RAN Next Generation Fronthaul.",
            "Correction to \"High Resolution Beacon-Based Proximity Detection for Dense Deployment\".",
            "A Comparison of Stateless Position-based Packet Routing Algorithms for FANETs.",
            "A Decentralized Optimization Framework for Energy Harvesting Devices.",
            "A Framework of Loose Travelling Companion Discovery from Human Trajectories.",
            "Attacker-Centric View of a Detection Game against Advanced Persistent Threats.",
            "Blind Filtering at Third Parties: An Efficient Privacy-Preserving Framework for Location-Based Services.",
            "CrowdDBS: A Crowdsourced Brightness Scaling Optimization for Display Energy Reduction in Mobile Video.",
            "Low Human-Effort, Device-Free Localization with Fine-Grained Subcarrier Information.",
            "Maximizing Sensor Lifetime with the Minimal Service Cost of a Mobile Charger in Wireless Sensor Networks.",
            "Mobile Match-on-Card Authentication Using Offline-Simplified Models with Gait and Face Biometrics.",
            "Optimal Power Allocation and Scheduling for Non-Orthogonal Multiple Access Relay-Assisted Networks.",
            "Resonance-Based Secure Pairing for Wearables.",
            "RPPM: A Request Pre-Processing Method for Real-Time On-Demand Data Broadcast Scheduling.",
            "SenseVault: A Three-tier Framework for Securing Mobile Underwater Sensor Networks.",
            "SISE: Self-Updating of Indoor Semantic Floorplans for General Entities.",
            "ULOOF: A User Level Online Offloading Framework for Mobile Edge Computing.",
            "Understanding In-App Ads and Detecting Hidden Attacks through the Mobile App-Web Interface.",
            "Viola: Trustworthy Sensor Notifications for Enhanced Privacy on Mobile Systems.",
            "Wireless Scheduling with Delayed CSI: When Distributed Outperforms Centralized.",
            "ARBITER+: Adaptive Rate-Based InTElligent HTTP StReaming Algorithm for Mobile Networks.",
            "Cooperative Hierarchical Caching and Request Scheduling in a Cloud Radio Access Network.",
            "Delay Guaranteed Network Association for Mobile Machines in Heterogeneous Cloud Radio Access Network.",
            "Delay-Sensitive Mobile Crowdsensing: Algorithm Design and Economics.",
            "Dynamic Connectivity Establishment and Cooperative Scheduling for QoS-Aware Wireless Body Area Networks.",
            "Energy Efficient Scheduling for Concurrent Transmission in Millimeter Wave WPANs.",
            "Infrastructure Sharing for Mobile Network Operators: Analysis of Trade-Offs and Market.",
            "Joint Scheduling and Buffer Management Policies for DTN Applications of Different Traffic Classes.",
            "Optimal Packet Aggregation Scheduling in Wireless Networks.",
            "Performance Optimization on Dynamic Adaptive Streaming over HTTP in Multi-User MIMO LTE Networks.",
            "Resource Sharing of a Computing Access Point for Multi-User Mobile Cloud Offloading with Delay Constraints.",
            "Scheduling Advertisement Delivery in Vehicular Networks.",
            "Service Provisioning in Mobile Environments through Opportunistic Computing.",
            "SNP: A 1-Manifold Skeleton-Based Navigation Protocol in 3D Sensor Networks.",
            "SpecGuard: Spectrum Misuse Detection in Dynamic Spectrum Access Systems.",
            "Surveillance-Aware Uplink Scheduling for Cellular Networks.",
            "Towards Optimal Network Planning for Software-Defined Networks.",
            "Traffic-Aware Efficient Mapping of Wireless Body Area Networks to Health Cloud Service Providers in Critical Emergency Situations.",
            "Truthful Incentive Mechanism for Nondeterministic Crowdsensing with Vehicles."
        ]
    },
    {
        "name": "TMC",
        "year": "2017",
        "info": "Volume 16, 2017",
        "count": 258,
        "papers": [
            "Farewell Editorial.",
            "Beyond Overlay: Reaping Mutual Benefits for Primary and Secondary Networks Through Node-Level Cooperation.",
            "CarrierMix: How Much Can User-side Carrier Mixing Help?",
            "Collaborative Smartphone Sensing Using Overlapping Coalition Formation Games.",
            "Cross-Device Wi-Fi Map Fusion with Gaussian Processes.",
            "DIVERT: A Distributed Vehicular Traffic Re-Routing System for Congestion Avoidance.",
            "Drive Now, Text Later: Nonintrusive Texting-While-Driving Detection Using Smartphones.",
            "Energy Aware Offloading for Competing Users on a Shared Communication Channel.",
            "Energy-Aware Cooperative Traffic Offloading via Device-to-Device Cooperations: An Analytical Approach.",
            "Experimental Evaluation of WiFi Active Power/Energy Consumption Models for Smartphones.",
            "Geometrical Characterization of Offloading through Wireless LANs.",
            "GreenCoMP: Energy-Aware Cooperation for Green Cellular Networks.",
            "Impact of Full Duplex Scheduling on End-to-End Throughput in Multi-Hop Wireless Networks.",
            "Intra-MARIO: A Fast Mobility Management Protocol for 6LoWPAN.",
            "Online Throughput Maximization for Energy Harvesting Communication Systems with Battery Overflow.",
            "Receiver-Initiated Spectrum Management for Underwater Cognitive Acoustic Network.",
            "TCP Download Performance in Dense WiFi Scenarios: Analysis and Solution.",
            "Toward a Wearable RFID System for Real-Time Activity Recognition Using Radio Patterns.",
            "Wideband Spectrum Adaptation Without Coordination.",
            "Wireless Network Inference and Optimization: Algorithm Design and Implementation.",
            "A Weighted Crowdsourcing Approach for Network Quality Measurement in Cellular Data Networks.",
            "Apprenticeship Learning Based Spectrum Decision in Multi-Channel Wireless Mesh Networks with Multi-Beam Antennas.",
            "ARM: Anonymous Rating Mechanism for Discrete Power Control.",
            "Deploy-As-You-Go Wireless Relay Placement: An Optimal Sequential Decision Approach Using the Multi-Relay Channel Model.",
            "Effective Static and Adaptive Carrier Sensing for Dense Wireless CSMA Networks.",
            "Experimental Evaluation of Impulsive Ultrasonic Intra-Body Communications for Implantable Biomedical Devices.",
            "GRfid: A Device-Free RFID-Based Gesture Recognition System.",
            "InfraSee: An Unobtrusive Alertness System for Pedestrian Mobile Phone Users.",
            "Maximum Link Activation with Cooperative Transmission and Interference Cancellation in Wireless Networks.",
            "Medium Access Control for Wireless Body Area Networks with QoS Provisioning and Energy Efficient Design.",
            "NoPSM: A Concurrent MAC Protocol over Low-Data-Rate Low-Power Wireless Channel without PRR-SINR Model.",
            "On the Design of a Reward-Based Incentive Mechanism for Delay Tolerant Networks.",
            "Pallas: Self-Bootstrapping Fine-Grained Passive Indoor Localization Using WiFi Monitors.",
            "Performance Analysis of Mobile Data Offloading in Heterogeneous Networks.",
            "Robotic Message Ferrying for Wireless Networks Using Coarse-Grained Backpressure Control.",
            "RT-Fall: A Real-Time and Contactless Fall Detection System with Commodity WiFi Devices.",
            "Soft Hint Enabled Adaptive Visible Light Communication over Screen-Camera Links.",
            "Two-Sided Matching Based Cooperative Spectrum Sharing.",
            "Understanding Smartphone Sensor and App Data for Enhancing the Security of Secret Questions.",
            "Virtual Multipath Attack and Defense for Location Distinction in Wireless Networks.",
            "WiFall: Device-Free Fall Detection by Wireless Networks.",
            "A Game-Theoretical Analysis of Wireless Markets Using Network Aggregation.",
            "A Novel Framework of Multi-Hop Wireless Charging for Sensor Networks Using Resonant Repeaters.",
            "Analytical Evaluation of Saturation Throughput of a Cognitive WLAN Overlaid on a Time-Scheduled OFDMA Network.",
            "Anti-Jamming Rendezvous Scheme for Cognitive Radio Networks.",
            "ART: Adaptive fRequency-Temporal Co-Existing of ZigBee and WiFi.",
            "Code, Cache and Deliver on the Move: A Novel Caching Paradigm in Hyper-Dense Small-Cell Networks.",
            "Color Scheme Adaptation to Enhance User Experience on Smartphone Displays Leveraging Ambient Light.",
            "Design and Analysis of an Efficient Friend-to-Friend Content Dissemination System.",
            "E-HIPA: An Energy-Efficient Framework for High-Precision Multi-Target-Adaptive Device-Free Localization.",
            "Engage Others or Leave it to the Source? On Optimal Message Replication in DTNs Under Imperfect Cooperation.",
            "Enhanced Deployment Algorithms for Heterogeneous Directional Mobile Sensors in a Bounded Monitoring Area.",
            "GDVAN: A New Greedy Behavior Attack Detection Algorithm for VANETs.",
            "Mobile Demand Profiling for Cellular Cognitive Networking.",
            "On Improving Wireless Channel Utilization: A Collision Tolerance-Based Approach.",
            "ORBIT: A Platform for Smartphone-Based Data-Intensive Sensing Applications.",
            "Overcoming IoT Language Barriers Using Smartphone SDRs.",
            "Quantifying Interdependent Privacy Risks with Location Data.",
            "Route or Carry: Motion-Driven Packet Forwarding in Micro Aerial Vehicle Networks.",
            "Traffic Decorrelation Techniques for Countering a Global Eavesdropper in WSNs.",
            "Ubii: Physical World Interaction Through Augmented Reality.",
            "UM Paging: Unified M2M Paging with Optimal DRX Cycle.",
            "A Game-Theoretic Framework for Network Coding Based Device-to-Device Communications.",
            "Analysis of Multi-Hop Probabilistic Forwarding for Vehicular Safety Applications on Highways.",
            "Differentially Private Location Protection for Worker Datasets in Spatial Crowdsourcing.",
            "Empowering Device-to-Device Networks with Cross-Link Interference Management.",
            "Load Balancing Under Heavy Traffic in RPL Routing Protocol for Low Power and Lossy Networks.",
            "Localizability Judgment in UWSNs Based on Skeleton and Rigidity Theory.",
            "Maximizing Charging Satisfaction of Smartphone Users via Wireless Energy Transfer.",
            "Minimizing Context Migration in Mobile Code Offload.",
            "Montage: Combine Frames with Movement Continuity for Realtime Multi-User Tracking.",
            "Multi-Channel Medium Access without Control Channels: A Full Duplex MAC Design.",
            "Network Coding as a Performance Booster for Concurrent Multi-Path Transfer of Data in Multi-Hop Wireless Networks.",
            "Optimized Upload Strategies for Live Scalable Video Transmission from Mobile Devices.",
            "Performance-Aware Energy Optimization on Mobile Devices in Cellular Network.",
            "Priority-Aware FEC Coding for High-Definition Mobile Video Delivery Using TCP.",
            "Propagation- and Mobility-Aware D2D Social Content Replication.",
            "RSS-Based Ranging by Leveraging Frequency Diversity to Distinguish the Multiple Radio Paths.",
            "Securing the Backpressure Algorithm for Wireless Networks.",
            "SEND: A Situation-Aware Emergency Navigation Algorithm with Sensor Networks.",
            "ShakeUnlock: Securely Transfer Authentication States Between Mobile Devices.",
            "Spectrum-Aware Anypath Routing in Multi-Hop Cognitive Radio Networks.",
            "Utility Maximization for Multimedia Data Dissemination in Large-Scale VANETs.",
            "Editorial: A Message from the Incoming Editor-in-Chief.",
            "A Fine-Grained Indoor Location-Based Social Network.",
            "A New Zigzag-Decodable Code with Efficient Repair in Wireless Distributed Storage.",
            "A Reliable and Efficient Distributed Service Composition Approach in Pervasive Environments.",
            "An RFID Based Smartphone Proximity Absence Alert System.",
            "Channel Selection Algorithm for Cognitive Radio Networks with Heavy-Tailed Idle Times.",
            "Characterizing the Instantaneous Connectivity of Large-Scale Urban Vehicular Networks.",
            "Cooperative Source Node Tracking in Non-Line-of-Sight Environments.",
            "Exploring Tag Distribution in Multi-Reader RFID Systems.",
            "Harnessing Encrypted Data in Cloud for Secure and Efficient Mobile Image Sharing.",
            "Measuring and Understanding RRC State Machine Optimization in Light of Recent Advancements.",
            "Mobility Aware Virtual Network Embedding.",
            "MoZo: A Moving Zone Based Routing Protocol Using Pure V2V Communication in VANETs.",
            "On Missing Tag Detection in Multiple-Group Multiple-Region RFID Systems.",
            "Optimal Cooperative Content Caching and Delivery Policy for Heterogeneous Cellular Networks.",
            "Optimal Sleep-Wake Scheduling for Energy Harvesting Smart Mobile Devices.",
            "Pothole in the Dark: Perceiving Pothole Profiles with Participatory Urban Vehicles.",
            "Practical Opportunistic Data Collection in Wireless Sensor Networks with Mobile Sinks.",
            "Recover Corrupted Data in Sensor Networks: A Matrix Completion Solution.",
            "Spectrum-Energy Efficiency Optimization for Downlink LTE-A for Heterogeneous Networks.",
            "Stability Analysis of Frame Slotted Aloha Protocol.",
            "ZapDroid: Managing Infrequently Used Applications on Smartphones.",
            "A Distributed Learning Automata Scheme for Spectrum Management in Self-Organized Cognitive Radio Network.",
            "An Adaptive Bayesian System for Context-Aware Data Fusion in Smart Environments.",
            "AT-MAC: Adaptive MAC-Frame Payload Tuning for Reliable Communication in Wireless Body Area Networks.",
            "Batch Identification Game Model for Invalid Signatures in Wireless Mobile Networks.",
            "Battery-Aware Mobile Data Service.",
            "Cooperative Wi-Fi Deployment: A One-to-Many Bargaining Framework.",
            "Cost-Effective Mapping between Wireless Body Area Networks and Cloud Service Providers Based on Multi-Stage Bargaining.",
            "Data Analytics for Diagnosing the RF Condition in Self-Organizing Networks.",
            "Efficient 3G/4G Budget Utilization in Mobile Sensing Applications.",
            "Feedback-Free Binning Design for Mobile Wyner-Ziv Video Coding: An Operational Duality between Source Distortion and Channel Capacity.",
            "FRESH: Push the Limit of D2D Communication Underlaying Cellular Networks.",
            "GPS-Free Maintenance of A Free-Space-Optical Link Between Two Autonomous Mobiles.",
            "How to Download More Data from Neighbors? A Metric for D2D Data Offloading Opportunity.",
            "INTRI: Contour-Based Trilateration for Indoor Fingerprint-Based Localization.",
            "Latency Aware IPv6 Packet Delivery Scheme over IEEE 802.15.4 Based Battery-Free Wireless Sensor Networks.",
            "Learn to Recognise: Exploring Priors of Sparse Face Recognition on Smartphones.",
            "Near Optimal Data Gathering in Rechargeable Sensor Networks with a Mobile Sink.",
            "Robust Large-Scale Spectrum Auctions against False-Name Bids.",
            "There and Back Again: Detecting Regularity in Human Encounter Communities.",
            "TSRA: An Adaptive Mechanism for Switching between Communication Modes in Full-Duplex Opportunistic Spectrum Access Systems.",
            "Whom to Blame? Automatic Diagnosis of Performance Bottlenecks on Smartphones.",
            "Comments on the Paper \"Personal Mobile Radars with Millimeter-Wave Massive Arrays for Indoor Mapping\".",
            "A Study on Application-Aware Scheduling in Wireless Networks.",
            "Activity Probability-Based Performance Analysis and Contention Control for IEEE 802.11 WLANs.",
            "Adaptive Optimal Stochastic Control of Delay-Tolerant Networks.",
            "Delay Analysis and Routing for Two-Dimensional VANETs Using Carry-and-Forward Mechanism.",
            "Dual-Scheduler Design for C/U-Plane Decoupled Railway Wireless Networks.",
            "Economic Analysis of Crowdsourced Wireless Community Networks.",
            "E-MICE: Energy-Efficient Concurrent Exploitation of Multiple Wi-Fi Radios.",
            "General Framework for Network Throughput Maximization in Sink-Based Energy Harvesting Wireless Sensor Networks.",
            "Indoor Localization and Automatic Fingerprint Update with Altered AP Signals.",
            "It Can Drain Out Your Energy: An Energy-Saving Mechanism Against Packet Overhearing in High Traffic Wireless LANs.",
            "Joint Cell Zooming and Channel Allocation Using C-SAP for Large Action Sets.",
            "Load-Balanced Opportunistic Routing for Duty-Cycled Wireless Sensor Networks.",
            "Maximum Lifetime Combined Barrier-Coverage of Weak Static Sensors and Strong Mobile Sensors.",
            "Neighbor Discovery and Rendezvous Maintenance with Extended Quorum Systems for Mobile Applications.",
            "On the Competition Among Small Cell Wireless Operators with Large Scale Deployments.",
            "Optimal Device-Aware Caching.",
            "Rapid, User-Transparent, and Trustworthy Device Pairing for D2D-Enabled Mobile Crowdsourcing.",
            "Smartphone-Based Real Time Vehicle Tracking in Indoor Parking Structures.",
            "Sparsity Based Efficient Cross-Correlation Techniques in Sensor Networks.",
            "THEMIS: Collusion-Resistant and Fair Pricing Spectrum Auction Under Dynamic Supply.",
            "Using Wireless Link Dynamics to Extract a Secret Key in Vehicular Scenarios.",
            "A Joint Indoor WLAN Localization and Outlier Detection Scheme Using LASSO and Elastic-Net Optimization Techniques.",
            "A Mean Field Analysis of CSMA/CA Throughput.",
            "A Proxy-Based Collaboration System to Minimize Content Download Time and Energy Consumption.",
            "Analysis of Dynamic Channel Bonding in Dense Networks of WLANs.",
            "CBS: Community-Based Bus System as Routing Backbone for Vehicular Ad Hoc Networks.",
            "Content-Aware Network Coding Over Device-to-Device Networks.",
            "Context-Aware System Design for Remote Health Monitoring: An Application to Continuous Edema Assessment.",
            "Contradiction Based Gray-Hole Attack Minimization for Ad-Hoc Networks.",
            "Detecting Mobile Malicious Webpages in Real Time.",
            "Fine-Grained Abnormal Driving Behaviors Detection and Identification with Smartphones.",
            "Low-Cost Collaborative Mobile Charging for Large-Scale Wireless Sensor Networks.",
            "Modeling Buffer Starvations of Video Streaming in Cellular Networks with Large-Scale Measurement of User Behavior.",
            "Network-Assisted Outband D2D-Clustering in 5G Cellular Networks: Theory and Practice.",
            "Novel Design on Multiple Channel Sensing for Partially Observable Cognitive Radio Networks.",
            "Offloading in HetNet: A Coordination of Interference Mitigation, User Association, and Resource Allocation.",
            "On Timing Reacquisition and Enhanced Primary Synchronization Signal (ePSS) Design for Energy Efficient 3GPP LTE MTC.",
            "Online Task Assignment for Crowdsensing in Predictable Mobile Social Networks.",
            "Opportunistic Network Decoupling with Virtual Full-Duplex Operation in Multi-Source Interfering Relay Networks.",
            "Reliable Physical-Layer Network Coding Supporting Real Applications.",
            "Tracking People in Highly Dynamic Industrial Environments.",
            "Wi-Fi Seeker: A link and Load Aware AP Selection Algorithm.",
            "Worker-Contributed Data Utility Measurement for Visual Crowdsensing Systems.",
            "A Budget Feasible Incentive Mechanism for Weighted Coverage Maximization in Mobile Crowdsensing.",
            "A Framework for Packet Delay Analysis of Point-to-Multipoint Underlay Cognitive Radio Networks.",
            "A Priority-Aware Truthful Mechanism for Supporting Multi-Class Delay-Sensitive Medical Packet Transmissions in E-Health Networks.",
            "Analysis of Coverage Under Border Effects in Three-Dimensional Mobile Sensor Networks.",
            "Concurrently Wireless Charging Sensor Networks with Efficient Scheduling.",
            "Delay Analysis of Epidemic Schemes in Sparse and Dense Heterogeneous Contact Networks.",
            "Drone Path Planning for Secure Positioning and Secure Position Verification.",
            "DV-maxHop: A Fast and Accurate Range-Free Localization Algorithm for Anisotropic Wireless Networks.",
            "Dynamic, Privacy-Preserving Decentralized Reputation Systems.",
            "Embracing Corruption Burstiness: Fast Error Recovery for ZigBee under Wi-Fi Interference.",
            "Gazelle: Energy-Efficient Wearable Analysis for Running.",
            "HiQuadLoc: A RSS Fingerprinting Based Indoor Localization System for Quadrotors.",
            "Locating Rogue Access Point Using Fine-Grained Channel Information.",
            "On Low-Overhead and Stable Data Transmission between Channel-Hopping Cognitive Radios.",
            "PLP: Protecting Location Privacy Against Correlation Analyze Attack in Crowdsensing.",
            "POLYPHONY: Scheduling-Free Cooperative Signal Recovery in Enterprise Wireless Networks.",
            "Private Retrieval of POI Details in Top-K Queries.",
            "ReWAP: Reducing Redundant Transfers for Mobile Web Browsing via App-Specific Resource Packaging.",
            "Smart Base Station-Assisted Partial-Flow Device-to-Device Offloading System for Video Streaming Services.",
            "Supermodular Game-Based Distributed Joint Uplink Power and Rate Allocation in Two-Tier Femtocell Networks.",
            "Survivability in Time-Varying Networks.",
            "A Tale of Ten Cities: Characterizing Signatures of Mobile Traffic in Urban Areas.",
            "A Two-Level Game Theory Approach for Joint Relay Selection and Resource Allocation in Network Coding Assisted D2D Communications.",
            "Automatic Rich Map Semantics Identification Through Smartphone-Based Crowd-Sensing.",
            "Behavior Based Human Authentication on Touch Screen Devices Using Gestures and Signatures.",
            "Cloud-Based Malware Detection Game for Mobile Devices with Offloading.",
            "Context-Aware Architecture for Probabilistic Voting-based Filtering Scheme in Sensor Networks.",
            "Crowdsourcing Sensing to Smartphones: A Randomized Auction Approach.",
            "Decoupled Uplink-Downlink User Association in Multi-Tier Full-Duplex Cellular Networks: A Two-Sided Matching Game.",
            "Minimal Perfect Hashing-Based Information Collection Protocol for RFID Systems.",
            "Minimum-Cost Crowdsourcing with Coverage Guarantee in Mobile Opportunistic D2D Networks.",
            "Network Utility Aware Traffic Load Balancing in Backhaul-Constrained Cache-Enabled Small Cell Networks with Hybrid Power Supplies.",
            "Optimizing Itinerary Selection and Charging Association for Mobile Chargers.",
            "Performance Analysis of RSS Fingerprinting Based Indoor Localization.",
            "QoS-Aware Adaptive A-MPDU Aggregation Scheduler for Voice Traffic in Aggregation-Enabled High Throughput WLANs.",
            "SeeR: Simulated Annealing-Based Routing in Opportunistic Mobile Networks.",
            "Sensor-Based Change Detection for Timely Solicitation of User Engagement.",
            "ShakeIn: Secure User Authentication of Smartphones with Single-Handed Shakes.",
            "ShuffleDog: Characterizing and Adapting User-Perceived Latency of Android Apps.",
            "SUPERMAN: Security Using Pre-Existing Routing for Mobile Ad hoc Networks.",
            "SWAROVsky: Optimizing Resource Loading for Mobile Web Browsing.",
            "Variational Inference-Based Positioning with Nondeterministic Measurement Accuracies and Reference Location Errors.",
            "Video On-Demand Service via Wireless Broadcasting.",
            "An Incentive Framework for Mobile Data Offloading Market Under Price Competition.",
            "Assuring Spatio-Temporal Integrity on Mobile Devices with Minimum Location Disclosure.",
            "Coverage and Rate Analysis for Facilitating Machine-to-Machine Communication in LTE-A Networks Using Device-to-Device Communication.",
            "Fatigue-Aware Management of Cellular Networks Infrastructure with Sleep Modes.",
            "Full Charge Capacity and Charging Diagnosis of Smartphone Batteries.",
            "Hermes: Latency Optimal Task Assignment for Resource-constrained Mobile Computing.",
            "Improving Throughput and Fairness of Convergecast in Vehicular Networks.",
            "Incentive Mechanisms for Data Dissemination in Autonomous Mobile Social Networks.",
            "Low Delay Random Linear Coding and Scheduling Over Multiple Interfaces.",
            "MALM: Mobility-Aware Location Management Scheme in Femto/Macrocell Networks.",
            "Mode Selection and Resource Allocation in Device-to-Device Communications: A Matching Game Approach.",
            "Multicast Scheduling for Relay-Based Heterogeneous Networks Using Rateless Codes.",
            "On Theoretical Trajectory Planning of Multiple Drones To Minimize Latency in Search-and-Reconnaissance Operations.",
            "Optimal Scheduling for Interference Mitigation by Range Information.",
            "Quality-Aware Traffic Offloading in Wireless Networks.",
            "Security Semantics Modeling with Progressive Distillation.",
            "Smartphone-Based Gait Recognition: From Authentication to Imitation.",
            "Towards Secure Data Distribution Systems in Mobile Cloud Computing.",
            "TRAMP Real-Time Application Mobility Platform.",
            "Video Liveness for Citizen Journalism: Attacks and Defenses.",
            "Virtual Occupancy Sensing: Using Smart Meters to Indicate Your Presence.",
            "Erratum to \"Low-Cost Collaborative Mobile Charging for Large-Scale Wireless Sensor Networks\".",
            "A Platform for Free-Weight Exercise Monitoring with Passive Tags.",
            "Analysis and Design of Low-Duty Protocol for Smartphone Neighbor Discovery.",
            "CeilingTalk: Lightweight Indoor Broadcast Through LED-Camera Communication.",
            "Efficient Approximation Algorithms for Multi-Antennae Largest Weight Data Retrieval.",
            "Elastic Routing in Ad Hoc Networks with Directional Antennas.",
            "Enhanced Co-Primary Spectrum Sharing Method for Multi-Operator Networks.",
            "Exploring Vision-Based Techniques for Outdoor Positioning Systems: A Feasibility Study.",
            "Improving VANET Simulation with Calibrated Vehicular Mobility Traces.",
            "Minimum-Cost Network-Wide Broadcast over Reliable MAC-Layer Multicast.",
            "Mobile Contextual Recommender System for Online Social Media.",
            "Multi-Lane Pothole Detection from Crowdsourced Undersampled Vehicle Sensor Data.",
            "Multi-Source Video Multicast in Internet-Connected Wireless Mesh Networks.",
            "mw-HierBack: A Cost-Effective and Robust Millimeter Wave Hierarchical Backhaul Solution for HetNets.",
            "Overlapping Coalition Formation Game for Resource Allocation in Network Coding Aided D2D Communications.",
            "Performance and Security Analyses of Onion-Based Anonymous Routing for Delay Tolerant Networks.",
            "Post-Streaming Rate Analysis - A New Approach to Mobile Video Streaming with Predictable Performance.",
            "Providing Guaranteed Protection in Multi-Hop Wireless Networks with Interference Constraints.",
            "QuickSync: Improving Synchronization Efficiency for Mobile Cloud Storage Services.",
            "SecureMAC: Securing Wireless Medium Access Control Against Insider Denial-of-Service Attacks.",
            "Spectrum Reuse Ratio in 5G Cellular Networks: A Matrix Graph Approach.",
            "TeamPhone: Networking SmartPhones for Disaster Recovery.",
            "Why 6 Mbps is Not (Always) the Optimum Data Rate for Beaconing in Vehicular Networks.",
            "WMSP: Bringing the Wisdom of the Crowd to WiFi Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2016",
        "info": "Volume 15, 2016",
        "count": 224,
        "papers": [
            "A Kautz-Based Wireless Sensor and Actuator Network for Real-Time, Fault-Tolerant and Energy-Efficient Transmission.",
            "An Analytical Model for Interference Alignment in Multi-Hop MIMO Networks.",
            "Analytic Performance Model for State-Based MAC Layer Cooperative Retransmission Protocols.",
            "ANC-ERA: Random Access for Analog Network Coding in Wireless Networks.",
            "Collaborative Recognition of Queuing Behavior on Mobile Phones.",
            "Comprehensive Performance Analysis and Sleep Window Determination for IEEE 802.16 Broadband Wireless Networks.",
            "Delay Analysis of Multichannel Opportunistic Spectrum Access MAC Protocols.",
            "Distance-Based Location Management Utilizing Initial Position for Mobile Communication Networks.",
            "DSearching: Using Floating Mobility Information for Distributed Node Searching in DTNs.",
            "EPC Gen2v2 RFID Standard Authentication and Ownership Management Protocol.",
            "Exploiting Heterogeneity for Improving Forwarding Performance in Mobile Opportunistic Networks: An Analytic Approach.",
            "Mitigating Denial of Service Attacks in OLSR Protocol Using Fictitious Nodes.",
            "Opportunistic Channel Selection by Cognitive Wireless Nodes Under Imperfect Observations and Limited Memory: A Repeated Game Model.",
            "Road Network-Aware Spatial Alarms.",
            "The Impact of Network Size and Mobility on Information Delivery in Cognitive Radio Networks.",
            "A Scheduling Algorithm for MIMO DoF Allocation in Multi-Hop Networks.",
            "Accuracy-Aware Interference Modeling and Measurement in Wireless Sensor Networks.",
            "Assessing Performance Gains Through Global Resource Control of Heterogeneous Wireless Networks.",
            "Contact-Aware Data Replication in Roadside Unit Aided Vehicular Delay Tolerant Networks.",
            "D2D: Delay-Aware Distributed Dynamic Adaptation of Contention Window in Wireless Networks.",
            "Discovering Mobile Applications in Cellular Device-to-Device Communications: Hash Function and Bloom Filter-Based Approach.",
            "Downlink Power Control in Self-Organizing Dense Small Cells Underlaying Macrocells: A Mean Field Game.",
            "Energy and Throughput Trade-Offs in Cellular Networks Using Base Station Switching.",
            "Impact of Playout Buffering on Mobile TV Performance.",
            "Intra and Inter-Cell Resource Management in Full-Duplex Heterogeneous Cellular Networks.",
            "Real-Time and Robust Compressive Background Subtraction for Embedded Camera Networks.",
            "Robust Ergodic Uplink Resource Allocation in Underlay OFDMA Cognitive Radio Networks.",
            "SBVLC: Secure Barcode-Based Visible Light Communication for Smartphones.",
            "Secure Management of Low Power Fitness Trackers.",
            "Sextant: Towards Ubiquitous Indoor Localization Service by Photo-Taking of the Environment.",
            "Simultaneous Query for Wireless Sensor Networks: A Power Based Solution.",
            "The FINS Framework: Design and Implementation of the Flexible Internetwork Stack (FINS) Framework.",
            "Throughput Modeling of Distributed Reservation Protocol.",
            "Timer-Based Bloom Filter Aggregation for Reducing Signaling Overhead in Distributed Mobility Management.",
            "A Joint Time Synchronization and Localization Design for Mobile Underwater Sensor Networks.",
            "A Personalized Network Activity-Aware Approach to Reducing Radio Energy Consumption of Smartphones.",
            "A Rule-based Service Customization Strategy for Smart Home Context-Aware Automation.",
            "Adaptive Intelligent Middleware Architecture for Mobile Real-Time Communications.",
            "BackPos: High Accuracy Backscatter Positioning System.",
            "Cognitive and Opportunistic Relay for QoS Guarantees in Machine-to-Machine Communications.",
            "DaGCM: A Concurrent Data Uploading Framework for Mobile Data Gathering in Wireless Sensor Networks.",
            "Delay-Constrained Caching in Cognitive Radio Networks.",
            "Delay-Constrained High Definition Video Transmission in Heterogeneous Wireless Networks with Multi-Homed Terminals.",
            "Enlighten Wearable Physiological Monitoring Systems: On-Body RF Characteristics Based Human Motion Classification Using a Support Vector Machine.",
            "Experiences with GreenGPS - Fuel-Efficient Navigation Using Participatory Sensing.",
            "Maximizing Data Collection Throughput on a Path in Energy Harvesting Sensor Networks Using a Mobile Sink.",
            "Opportunistic Finite Horizon Multicasting of Erasure-Coded Data.",
            "Privacy-Aware High-Quality Map Generation with Participatory Sensing.",
            "Secondary VoIP Capacity in Opportunistic Spectrum Access Networks with Friendly Scheduling.",
            "TiM: Fine-Grained Rate Adaptation in WLANs.",
            "Toward Robust Relay Placement in 60 GHz mmWave Wireless Personal Area Networks with Directional Antenna.",
            "Weakest-Link Coalition: Further Investigation on Cooperative Interference-Aware Spectrum Sensing and Access.",
            "Alterdroid: Differential Fault Analysis of Obfuscated Smartphone Malware.",
            "Contact Duration Aware Data Replication in DTNs with Licensed and Unlicensed Spectrum.",
            "Distributed Heuristically Accelerated Q-Learning for Robust Cognitive Spectrum Management in LTE Cellular Systems.",
            "Efficient and Transparent Wi-Fi Offloading for HTTP(S) POSTs.",
            "Flexible and Time-Efficient Tag Scanning with Handheld Readers.",
            "HTTPDissect: Detailed Performance Analysis of HTTP Web Browsing Traffic in TDMA Mesh Networks.",
            "Improving the Accuracy of Environment-Specific Channel Modeling.",
            "Local Anchor Based Location Management Schemes for Small Cells in HetNets.",
            "Minimizing Peak Load from Information Cascades: Social Networks Meet Cellular Networks.",
            "On Stochastic Confidence of Information Spread in Opportunistic Networks.",
            "Passive RFID for Object and Use Detection during Trauma Resuscitation.",
            "Practical Secret Key Agreement for Full-Duplex Near Field Communications.",
            "Rate, Energy, and Delay Tradeoffs in Wireless Multicast: Network Coding versus Routing.",
            "Resource Allocation for Multiple-Sources Single-Relay Cooperative Communication OFDMA Systems.",
            "Robust Acoustic Self-Localization of Mobile Devices.",
            "Semi-Structure Routing and Analytical Frameworks for Cognitive Radio Networks.",
            "Taming Cross-Technology Interference for Wi-Fi and ZigBee Coexistence Networks.",
            "The Optimal Placement Pattern for Confident Information Coverage in Wireless Sensor Networks.",
            "Visual Mobile Computing for Mobile End-Users.",
            "A Contract-Ruled Economic Model for QoS Guarantee in Mobile Peer-to-Peer Streaming Services.",
            "AMUSE: Empowering Users for Cost-Aware Offloading with Throughput-Delay Tradeoffs.",
            "CANS: Towards Congestion-Adaptive and Small Stretch Emergency Navigation with Wireless Sensor Networks.",
            "Characterization and Optimization of Delay Guarantees for Real-Time Multimedia Traffic Flows in IEEE 802.11 WLANs.",
            "Delay-Constrained Capacity of the IEEE 802.11 DCF in Wireless Multihop Networks.",
            "Detecting Colluding Blackhole and Greyhole Attacks in Delay Tolerant Networks.",
            "Energy and Memory Efficient Clone Detection in Wireless Sensor Networks.",
            "Guoguo: Enabling Fine-Grained Smartphone Localization via Acoustic Anchors.",
            "Improving Access Point Association Protocols Through Channel Utilization and Adaptive Probing.",
            "Less Transmissions, More Throughput: Bringing Carpool to Public WLANs.",
            "Local Anchor Schemes for Seamless and Low-Cost Handover in Coordinated Small Cells.",
            "Movee: Video Liveness Verification for Mobile Devices Using Built-In Motion Sensors.",
            "Multiplexing-Diversity Medium Access for Multi-User MIMO Networks.",
            "Performance Analysis of Service Periods (SP) of the IEEE 802.11ad Hybrid MAC Protocol.",
            "Performance Analysis of Large Multi-Interface Wireless Mesh Networks with Multi-Different Bandwidth Channel.",
            "SmartPhoto: A Resource-Aware Crowdsourcing Approach for Image Sensing with Smartphones.",
            "Swift Jamming Attack on Frequency Offset Estimation: The Achilles' Heel of OFDM Systems.",
            "TCP Performance over Wi-Fi: Joint Impact of Buffer and Channel Losses.",
            "Towards Information Diffusion in Mobile Social Networks.",
            "A Systematic Approach to Jointly Optimize Rate and Power Consumption for OFDM Systems.",
            "ACMI: FM-Based Indoor Localization via Autonomous Fingerprinting.",
            "An Energy Efficiency Perspective on Rate Adaptation for 802.11n NIC.",
            "CO-GPS: Energy Efficient GPS Sensing with Cloud Offloading.",
            "Diffusion Adaptation over Multi-Agent Networks with Wireless Link Impairments.",
            "Energy-Efficient Cooperative Relaying for Unmanned Aerial Vehicles.",
            "Inference of Conversation Partners by Cooperative Acoustic Sensing in Smartphone Networks.",
            "Mobility Management in Energy Constrained Self-Organizing Delay Tolerant Networks: An Autonomic Scheme Based on Game Theory.",
            "Monitoring Aquatic Debris Using Smartphone-Based Robots.",
            "Multi-Story Indoor Floor Plan Reconstruction via Mobile Crowdsensing.",
            "On User-Centric Modular QoE Prediction for VoIP Based on Machine-Learning Algorithms.",
            "Performance Analysis of CSMA/CA based Medium Access in Full Duplex Wireless Communications.",
            "Personal Mobile Radars with Millimeter-Wave Massive Arrays for Indoor Mapping.",
            "Providing Privacy-Aware Incentives in Mobile Sensing Systems.",
            "Shared Relay Assignment (SRA) for Many-to-One Traffic in Cooperative Networks.",
            "Sleep Hunter: Towards Fine Grained Sleep Stage Tracking with Smartphones.",
            "Social-Aware Video Multicast Based on Device-to-Device Communications.",
            "SPA: Almost Optimal Accessing of Nonstochastic Channels in Cognitive Radio Networks.",
            "Tilejunction: Mitigating Signal Noise for Fingerprint-Based Indoor Localization.",
            "To Relay or Not to Relay: Learning Device-to-Device Relaying Strategies in Cellular Networks.",
            "A Street-Centric Opportunistic Routing Protocol Based on Link Correlation for Urban VANETs.",
            "A Traffic Adaptive Multi-Channel MAC Protocol with Dynamic Slot Allocation for WSNs.",
            "ARQ for Physical-Layer Network Coding.",
            "Compact Conformal Map for Greedy Routing in Wireless Mobile Sensor Networks.",
            "Detecting Node Failures in Mobile Wireless Networks: A Probabilistic Approach.",
            "Distributed Workload Dissemination for Makespan Minimization in Disruption Tolerant Networks.",
            "Enabling Situation Awareness at Intersections for IVC Congestion Control Mechanisms.",
            "Impact of Duty Cycling on Opportunistic Communication.",
            "Near-Optimal Velocity Control for Mobile Charging in Wireless Rechargeable Sensor Networks.",
            "Optimizing Video Request Routing in Mobile Networks with Built-in Content Caching.",
            "Policing 802.11 MAC Misbehaviours.",
            "Predictive Distributed Visual Analysis for Video in Wireless Sensor Networks.",
            "Scalable Wireless Traffic Capture Through Community Detection and Trace Similarity.",
            "SemanticSLAM: Using Environment Landmarks for Unsupervised Indoor Localization.",
            "TCP-Aware Backpressure Routing and Scheduling.",
            "The Minimum k-Storage Problem: Complexity, Approximation, and Experimental Analysis.",
            "The Sleepy Bird Catches More Worms: Revisiting Energy Efficient Neighbor Discovery.",
            "Toward Optimal Distributed Monitoring of Multi-Channel Wireless Networks.",
            "Two-Phase Multicast DRX Scheduling for 3GPP LTE-Advanced Networks.",
            "A Predictive Cross-Layered Interference Management in a Multichannel MAC with Reactive Routing in VANET.",
            "A Provably Efficient Online Collaborative Caching Algorithm for Multicell-Coordinated Systems.",
            "A Reliability-Augmented Particle Filter for Magnetic Fingerprinting Based Indoor Localization on Smartphone.",
            "AMD: Audit-Based Misbehavior Detection in Wireless Ad Hoc Networks.",
            "CoMon+: A Cooperative Context Monitoring System for Multi-Device Personal Sensing Environments.",
            "Content-Centric Energy Management of Mobile Displays.",
            "Delay Minimization for Data Dissemination in Large-Scale VANETs with Buses and Taxis.",
            "Design, Implementation, and Fundamental Limits of Image and RF Based Wireless Capsule Endoscopy Hybrid Localization.",
            "Determining Driver Phone Use by Exploiting Smartphone Integrated Sensors.",
            "Evaluation of Two WiFi Positioning Systems Based on Autonomous Crowdsourcing of Handheld Devices for Indoor Navigation.",
            "Group-Based Neighbor Discovery in Low-Duty-Cycle Mobile Sensor Networks.",
            "iCrowd: Near-Optimal Task Allocation for Piggyback Crowdsensing.",
            "Maximal Independent Sets in Heterogeneous Wireless Ad Hoc Networks.",
            "On Eliminating the Exposed Terminal Problem Using Signature Detection.",
            "Principles of the Complete Voronoi Diagram Localization.",
            "Profit Maximization through Online Advertising Scheduling for a Wireless Video Broadcast Network.",
            "Receiver-Side TCP Countermeasure to Bufferbloat in Wireless Access Networks.",
            "Robust Cooperative Spectrum Sensing Scheduling Optimization in Multi-Channel Dynamic Spectrum Access Networks.",
            "SecureRun: Cheat-Proof and Private Summaries for Location-Based Activities.",
            "Trading Off Accuracy, Timeliness, and Uplink Usage in Online GPS Tracking.",
            "A Fair and Efficient Resource Allocation Scheme for Multi-Server Distributed Systems and Networks.",
            "An Automated Dynamic Offset for Network Selection in Heterogeneous Networks.",
            "An SDN-Assisted Framework for Optimal Deployment of MapReduce Functions in WSNs.",
            "Beam Configuration and Client Association for Access Points with Switched Beam Antennas.",
            "Delay Models for Static and Adaptive Persistent Resource Allocations in Wireless Systems.",
            "Demystifying the Imperfect Client-Side Cache Performance of Mobile Web Browsing.",
            "Event-to-Sink Spectrum-Aware Clustering in Mobile Cognitive Radio Sensor Networks.",
            "Incentive Mechanism Design for Heterogeneous Crowdsourcing Using All-Pay Contests.",
            "Joint Adaptation of Frequency Hopping and Transmission Rate for Anti-Jamming Wireless Systems.",
            "Joint Multicell Beamforming and Client Association in OFDMA Small-Cell Networks.",
            "Low-Complexity Optimal Scheduling over Time-Correlated Fading Channels with ARQ Feedback.",
            "On the Capacity Gain from Full Duplex Communications in a Large Scale Wireless Network.",
            "On the Evolution and Impact of Mobile Botnets in Wireless Networks.",
            "Pitfalls in Ultralightweight Authentication Protocol Designs.",
            "Secure Overlay Routing Using Key Pre-Distribution: A Linear Distance Optimization Approach.",
            "Streaming High-Quality Mobile Video with Multipath TCP in Heterogeneous Wireless Networks.",
            "The Case for Efficient and Robust RF-Based Device-Free Localization.",
            "Uplink Energy-Delay Trade-Off under Optimized Relay Placement in Cellular Networks.",
            "User-Centric Power Management for Embedded CPUs Using CPU Bandwidth Control.",
            "Adaptive Multi-Resource Allocation for Cloudlet-Based Mobile Cloud Computing System.",
            "Adaptive Sampling of RF Fingerprints for Fine-Grained Indoor Localization.",
            "An Incentive-Compatible Mechanism for Transmission Scheduling of Delay-Sensitive Medical Packets in E-Health Networks.",
            "Artemisa: A Personal Driving Assistant for Fuel Saving.",
            "Bayesian Mechanisms and Detection Methods for Wireless Network with Malicious Users.",
            "Contactless Respiration Monitoring Via Off-the-Shelf WiFi Devices.",
            "Driving Factors Toward Accurate Mobile Opportunistic Sensing in Urban Environments.",
            "Low-Cost and Accurate 3D Road Modeling Using Mobile Phone.",
            "Novel Design of Optimal Spectrum Sharing for Cognitive Radio-Enabled LTE-A Multi-Cell Networks.",
            "On Improving TCP Performance over Mobile Data Networks.",
            "Operator Collusion and Market Regulation Policies for Wireless Spectrum Management.",
            "Participatory Sensing Meets Opportunistic Sharing: Automatic Phone-to-Phone Communication in Vehicles.",
            "RTDroid: A Design for Real-Time Android.",
            "RTI Goes Wild: Radio Tomographic Imaging for Outdoor People Detection and Localization.",
            "Time and Location Aware Mobile Data Pricing.",
            "TRUMP: Efficient and Flexible Realization of Medium Access Control Protocols for Wireless Networks.",
            "Unified Opportunistic Scheduling for Layered Multicast over Cognitive Radio Networks.",
            "Virtualization of 5G Cellular Networks as a Hierarchical Combinatorial Auction.",
            "A Novel Graph-Based Descriptor for the Detection of Billing-Related Anomalies in Cellular Mobile Networks.",
            "CARM: Crowd-Sensing Accurate Outdoor RSS Maps with Error-Prone Smartphone Measurements.",
            "Chance Constrained Robust Downlink Beamforming in Multicell Networks.",
            "C-RAM: Breaking Mobile Device Memory Barriers Using the Cloud.",
            "DiSIF: A Distance-Based Silencing Technique for Multi-Hop Broadcast Communications in Pedestrian Ad-Hoc Networks.",
            "DRWA: A Receiver-Centric Solution to Bufferbloat in Cellular Networks.",
            "Dynamic Frequency Resource Allocation in Heterogeneous Cellular Networks.",
            "Fair and Efficient Coexistence of Heterogeneous Channel Widths in Next-Generation Wireless LANs.",
            "Flow-Level QoE of Video Streaming in Wireless Networks.",
            "Hybrid Spectrum Sharing through Adaptive Spectrum Handoff and Selection.",
            "Indoor Localization and Radio Map Estimation Using Unsupervised Manifold Alignment with Geometry Perturbation.",
            "Pattern Prediction and Passive Bandwidth Management for Hand-over Optimization in QoS Cellular Networks with Vehicular Mobility.",
            "PIS: A Multi-Dimensional Routing Protocol for Socially-Aware Networking.",
            "Resource Allocation for an OFDMA Cloud-RAN of Small Cells Underlaying a Macrocell.",
            "Service Usage Classification with Encrypted Internet Traffic in Mobile Messaging Apps.",
            "SmartScanner: Know More in Walls with Your Smartphone!",
            "Transparently Exploiting Device-Reserved Memory for Application Performance in Mobile Systems.",
            "Unsupervised Learning for Crowdsourced Indoor Localization in Wireless Networks.",
            "We Can Hear You with Wi-Fi!",
            "A Downlink Scheduler for Multicasting Wireless Video-on-Demand.",
            "A Superprocess with Upper Confidence Bounds for Cooperative Spectrum Sharing.",
            "Accurate and Efficient Modeling of 802.15.4 Unslotted CSMA/CA through Event Chains Computation.",
            "An Optimization Framework for Mobile Data Collection in Energy-Harvesting Wireless Sensor Networks.",
            "Competition-Based Participant Recruitment for Delay-Sensitive Crowdsourcing Applications in D2D Networks.",
            "Compress-then-Analyze versus Analyze-then-Compress: What Is Best in Visual Sensor Networks?",
            "Concurrent Packet Recovery for Distributed Uplink Multiuser MIMO Networks.",
            "Distributed and Fair Beaconing Rate Adaptation for Congestion Control in Vehicular Networks.",
            "Dynamic Channel Bonding: Enabling Flexible Spectrum Aggregation.",
            "eDSA: Energy-Efficient Dynamic Spectrum Access Protocols for Cognitive Radio Networks.",
            "Minimizing Radio Resource Usage for Machine-to-Machine Communications through Data-Centric Clustering.",
            "Modelling Multi-Operator Base Station Deployment Patterns in Cellular Networks.",
            "Motion-MiX DHT for Wireless Mobile Networks.",
            "On the Vulnerabilities of Voronoi-Based Approaches to Mobile Sensor Deployment.",
            "Relay-Assisted Device-to-Device Communication: A Stochastic Analysis of Energy Saving.",
            "Resource Block Allocation with Carrier-Aggregation: A Strategy-Proof Auction Design.",
            "Structural Vulnerability Assessment of Community-Based Routing in Opportunistic Networks.",
            "Unlicensed Spectra Fusion and Interference Coordination for LTE Systems.",
            "What Am I Looking At? Low-Power Radio-Optical Beacons for In-View Recognition on Smart-Glass."
        ]
    },
    {
        "name": "TMC",
        "year": "2015",
        "info": "Volume 14, 2015",
        "count": 186,
        "papers": [
            "A Distributed Multi-Channel MAC Protocol for Ad Hoc Wireless Networks.",
            "A Television Channel Real-Time Detector using Smartphones.",
            "Adaptive Sub-Carrier Level Power Allocation in OFDMA Networks.",
            "An Agile and Efficient MAC for Wireless Access over TV Whitespaces.",
            "Discovering Phase Timing Information of Traffic Light Systems by Stop-Go Shockwaves.",
            "GRaTIS: Free Bits in the Network.",
            "Joint Scheduling of Tasks and Messages for Energy Minimization in Interference-Aware Real-Time Sensor Networks.",
            "Mitigating Unfairness Due to Physical Layer Capture in Practical 802.11 Mesh Networks.",
            "On Multi-Layer Modeling and Analysis of Wireless Access Markets.",
            "Opportunistic Spectrum Access with Two Channel Sensing in Cognitive Radio Networks.",
            "Optimal Scheduling for Multi-Radio Multi-Channel Multi-Hop Cognitive Cellular Networks.",
            "Proportional Sharing in Distributed Dynamic Spectrum Access-Based Networks.",
            "SmartCut: Mitigating 3G Radio Tail Effect on Smartphones.",
            "The Stability Region of the Delay in Pareto Opportunistic Networks.",
            "Utilize Signal Traces from Others? A Crowdsourcing Perspective of Energy Saving in Cellular Data Communication.",
            "State of the Journal Editorial.",
            "A P2P-Based Market-Guided Distributed Routing Mechanism for High-Throughput Hybrid Wireless Networks.",
            "ACE: An Accurate and Efficient Multi-Entity Device-Free WLAN Localization System.",
            "An Evolutionary Game for Distributed Resource Allocation in Self-Organizing Small Cells.",
            "Cognitive Radio-Aware Transport Protocol for Mobile Ad Hoc Networks.",
            "Cooperative Pseudo-Bayesian Backoff Algorithms for Unsaturated CSMA Systems with Multi-Packet Reception.",
            "Designing Truthful Spectrum Auctions for Multi-hop Secondary Networks.",
            "Dynamic Routing for Data Integrity and Delay Differentiated Services in Wireless Sensor Networks.",
            "Efficient Resource Allocation of Mobile Multi-View 3D Videos with Depth-Image-Based Rendering.",
            "Energy Consumption Optimization for Multihop Cognitive Cellular Networks.",
            "Feasibility of Secondary Networks: Analysis Methodology and Quantitative Study of Cellular and Wi-Fi-Like TVWS Deployments.",
            "GROPING: Geomagnetism and cROwdsensing Powered Indoor NaviGation.",
            "Raptor Code-Aware Link Adaptation for Spectrally Efficient Unicast Video Streaming over Mobile Broadband Networks.",
            "Road-Network Aware Trajectory Clustering: Integrating Locality, Flow, and Density.",
            "Robust and Energy-Efficient Trajectory Tracking for Mobile Devices.",
            "Smartphones Based Crowdsourcing for Indoor Localization.",
            "A Channel Allocation Algorithm for Reducing the Channel Sensing/Reserving Asymmetry in 802.11ac Networks.",
            "Achieving Congestion Diversity in Multi-Hop Wireless Mesh Networks.",
            "An Exponential-Rayleigh Model for RSS-Based Device-Free Localization and Tracking.",
            "Attack-Resilient Mix-zones over Road Networks: Architecture and Algorithms.",
            "BRACER: A Distributed Broadcast Protocol in Multi-Hop Cognitive Radio Ad Hoc Networks with Collision Avoidance.",
            "Frequency Diversity-Aware Wi-Fi Using OFDM-Based Bloom Filters.",
            "Friendbook: A Semantic-Based Friend Recommendation System for Social Networks.",
            "Greening Residential Wi-Fi Networks under Centralized Control.",
            "MAC Layer Channel Access and Forwarding in a Directional Multi-Interface Mesh Network.",
            "Managing Contention with Medley.",
            "Max Contribution: An Online Approximation of Optimal Resource Allocation in Delay Tolerant Networks.",
            "On Availability-Performability Tradeoff in Wireless Mesh Networks.",
            "On Managing Quality of Experience of Multiple Video Streams in Wireless Networks.",
            "Optimizing Data Forwarding from Body Area Networks in the Presence of Body Shadowing with Dual Wireless Technology Nodes.",
            "Spatial Spectrum Access Game.",
            "Wormhole Attack Detection Algorithms in Wireless Network Coding Systems.",
            "An Operations Research Game Approach for Resource and Power Allocation in Cooperative Femtocell Networks.",
            "Distortion-Aware Concurrent Multipath Transfer for Mobile Video Streaming in Heterogeneous Wireless Networks.",
            "Exact and Approximation Algorithms for Optimal Equipment Selection in Deploying In-Building Distributed Antenna Systems.",
            "Forwarding Redundancy in Opportunistic Mobile Networks: Investigation, Elimination and Exploitation.",
            "High-Throughput Reliable Multicast in Multi-Hop Wireless Mesh Networks.",
            "Interference-Based Topology Control Algorithm for Delay-Constrained Mobile Ad Hoc Networks.",
            "Towards Maximizing Timely Content Delivery in Delay Tolerant Networks.",
            "Mobile Data Gathering with Load Balanced Clustering and Dual Data Uploading in Wireless Sensor Networks.",
            "On the Energy Efficiency of Device Discovery in Mobile Opportunistic Networks: A Systematic Approach.",
            "Power-Aware Computing in Wearable Sensor Networks: An Optimal Feature Selection.",
            "Privacy-Preserving and Truthful Detection of Packet Dropping Attacks in Wireless Ad Hoc Networks.",
            "Quality of Contributed Service and Market Equilibrium for Participatory Sensing.",
            "Self-Organizing Resource Management Framework in OFDMA Femtocells.",
            "To Stay or To Switch: Multiuser Multi-Channel Dynamic Access.",
            "Toward Practical MAC Design for Underwater Acoustic Networks.",
            "EIC Editorial.",
            "An Empirical Evaluation of Security Indicators in Mobile Web Browsers.",
            "Analysis of Smart Mobile Applications for Healthcare under Dynamic Context Changes.",
            "Context-Aware QoE Modelling, Measurement, and Prediction in Mobile Computing Systems.",
            "Cooperation without Synchronization: Practical Cooperative Relaying for Wireless Networks.",
            "Cooperative Load Balancing and Dynamic Channel Allocation for Cluster-BasedMobile Ad Hoc Networks.",
            "Delay Bounds for Random Linear Coding in Parallel Relay Networks.",
            "Economic Analysis of 4G Upgrade Timing.",
            "Game-Theoretic Topology Controlfor Opportunistic Localizationin Sparse Underwater Sensor Networks.",
            "Impact of Location Popularity on Throughput and Delay in Mobile Ad Hoc Networks.",
            "Incentive Mechanism Design for Heterogeneous Peer-to-Peer Networks: A StackelbergGame Approach.",
            "Joint Indoor Localization and Radio Map Construction with Limited Deployment Load.",
            "Unlocking Smart Phone through Handwaving Biometrics.",
            "Pricing for Local and Global Wi-Fi Markets.",
            "Semi-Distributed Backoff: Collision-Aware Migration from Random to Deterministic Backoff.",
            "SWIMMING: Seamless and Efficient WiFi-Based Internet Access from Moving Vehicles.",
            "Throughput-Optimal Queue Length Based CSMA/CA Algorithm for Cognitive Radio Networks.",
            "A Historical-Beacon-Aided Localization Algorithm for Mobile Sensor Networks.",
            "A Strategy-Proof Combinatorial Heterogeneous Channel Auction Framework in Noncooperative Wireless Networks.",
            "An Adaptive Framework Coping with Dynamic Target Speed for Device-Free Passive Localization.",
            "Boosting Mobile Apps under Imbalanced Sensing Data.",
            "CoCoWa: A Collaborative Contact-Based Watchdog for Detecting Selfish Nodes.",
            "Distributed Channel Probing for Efficient Transmission Scheduling in Wireless Networks.",
            "Imitation-Based Social Spectrum Sharing.",
            "MAC-Layer Selfish Misbehavior in IEEE 802.11 Ad Hoc Networks: Detection and Defense.",
            "Minimizing Transmission Cost for Third-Party Information Exchange with Network Coding.",
            "MRI: Model-Based Radio Interpolation for Indoor War-Walking.",
            "Optimal Resource Allocation in Random Access Cooperative Cognitive Radio Networks.",
            "Parameter Estimation Method for Time-Variant Target Object Using Randomly Deployed Sensors and Its Application to Participatory Sensing.",
            "Performance Comparison of Routing Protocols for Cognitive Radio Networks.",
            "Privacy and Quality Preserving Multimedia Data Aggregation for Participatory Sensing Systems.",
            "Reliable Topology Design in Time-Evolving Delay-Tolerant Networks with Unreliable Links.",
            "Truthful Auction Mechanisms with Performance Guarantee in Secondary Spectrum Markets.",
            "Accuracy Estimation for Sensor Systems.",
            "Capacity Augmentation in Wireless Mesh Networks.",
            "EMC3: Energy-Efficient Data Transfer in Mobile Crowdsensing under Full Coverage Constraint.",
            "Geospatial and Temporal Dynamics of Application Usage in Cellular Data Networks.",
            "Global Sensor Deployment and Local Coverage-Aware Recovery Schemes for Smart Environments.",
            "HORA: A Distributed Coverage Hole Repair Algorithm for Wireless Sensor Networks.",
            "How Shadowing Hurts Vehicular Communications and How Dynamic Beaconing Can Help.",
            "Joint Spectral Efficiency and Power Allocation Optimization in IEEE 802.16m.",
            "Minimum Energy Routing and Jamming to Thwart Wireless Network Eavesdroppers.",
            "Multicast Rendezvous in Fast-Varying DSA Networks.",
            "Prioritized Optimal Channel Allocation Schemes for Multi-Channel Vehicular Networks.",
            "Resource Allocation for Dynamic Intra-Cell Subcarrier Reuse in Cooperative OFDMA Wireless Networks.",
            "ROFF: RObust and Fast Forwarding in Vehicular Ad-Hoc Networks.",
            "Scheduling in Wireless Networks with Rayleigh-Fading Interference.",
            "Temporal Starvation in CSMA Wireless Networks.",
            "Towards Optimal Broadcast in Wireless Networks.",
            "A New Multiple Service Key Management Scheme for Secure Wireless Mobile Multicast.",
            "A Privacy-Preserving Framework for Managing Mobile Ad Requests and Billing Information.",
            "An Efficient Auction-based Mechanism for Mobile Data Offloading.",
            "CWC: A Distributed Computing Infrastructure Using Smartphones.",
            "Exploiting Error Estimating Codes for Packet Length Adaptation in Low-Power Wireless Networks.",
            "Link Capacity-Energy Aware WDC for Network Lifetime Maximization.",
            "Performance Analysis of TCP NewReno over a Cellular Last-Mile: Buffer and Channel Losses.",
            "Performance Modeling and Analysis of IEEE 802.11 IBSS PSM in Different Traffic Conditions.",
            "Profit Improvement in Wireless Video Broadcasting System: A Marginal Principle Approach.",
            "QoS-Aware Power-Efficient Scheduler for LTE Uplink.",
            "Restricted Epidemic Routing in Multi-Community Delay Tolerant Networks.",
            "Sensing Human-Screen Interaction for Energy-Efficient Frame Rate Adaptation on Smartphones.",
            "Simplicial Homology for Future Cellular Networks.",
            "Single-Hop Transport Throughput of Secondary Networks in Spectrum Sharing Systems.",
            "Tracking Message Spread in Mobile Delay Tolerant Networks.",
            "WiScape: A Framework for Measuring the Performance of Wide-Area Wireless Networks.",
            "A New Measure of Wireless Network Connectivity.",
            "Capacity Considerations for Secondary Networks in TV White Space.",
            "Data-Driven Channel Modeling Using Spectrum Measurement.",
            "Efficient Authentication of Continuously Moving k NN Queries.",
            "Efficient Cluster-Based Tracking Mechanisms for Camera-Based Wireless Sensor Networks.",
            "Energy-Adaptive Downlink Resource Allocation in Wireless Cellular Systems.",
            "EPICS: Fair Opportunistic Multi-Content Dissemination.",
            "Evaluating the On-Demand Mobile Charging in Wireless Sensor Networks.",
            "Exploiting Client-Side Collected Measurements to Perform QoS Assessment of IaaS.",
            "Message in a Sealed Bottle: Privacy Preserving Friending in Mobile Social Networks.",
            "MPMTP: Multipath Multimedia Transport Protocol using Systematic Raptor Codes over Wireless Networks.",
            "Multiple Radios for Fast Rendezvous in Cognitive Radio Networks.",
            "Practical Context Awareness: Measuring and Utilizing the Context Dependency of Mobile Usage.",
            "Ring Routing: An Energy-Efficient Routing Protocol for Wireless Sensor Networks with a Mobile Sink.",
            "User Verification Leveraging Gait Recognition for Smartphone Enabled Mobile Healthcare Systems.",
            "A Distributed Three-Hop Routing Protocol to Increase the Capacity of Hybrid Wireless Networks.",
            "A Network Coding Based Energy Efficient Data Backup in Survivability-Heterogeneous Sensor Networks.",
            "AnDarwin: Scalable Detection of Android Application Clones Based on Semantics.",
            "FlierMeet: A Mobile Crowdsensing System for Cross-Space Public Information Reposting, Tagging, and Sharing.",
            "Joint Spectrum and Power Allocation for Multi-Node Cooperative Wireless Systems.",
            "LineKing: Coffee Shop Wait-Time Monitoring Using Smartphones.",
            "Mantis: Efficient Predictions of Execution Time, Energy Usage, Memory Usage and Network Usage on Smart Mobile Devices.",
            "Network Layer Support for Gigabit TCP Flows in Wireless Mesh Networks.",
            "On Oscillation-Free Emergency Navigation via Wireless Sensor Networks.",
            "Recommendation Based Trust Model with an Effective Defence Scheme for MANETs.",
            "Robust Estimators for Variance-Based Device-Free Localization and Tracking.",
            "ROCS: Exploiting FM Radio Data System for Clock Calibration in Sensor Networks.",
            "Swadloon: Direction Finding and Indoor Localization Using Acoustic Signal by Shaking Smartphones.",
            "User-Defined Privacy Grid System for Continuous Location-Based Services.",
            "Worm Epidemics in Vehicular Networks.",
            "Accurate and Efficient Object Tracking Based on Passive RFID.",
            "Cooperative Energy-Efficient Management of Federated WiFi Networks.",
            "Decentralized and Parallel Constructionsfor Optimally Rigid Graphs in $\\mathbb{R}^2$.",
            "Distributed Service Level Flow Control and Fairness in Wireless Mesh Networks.",
            "Efficient Multi-Channel Signal Strength Based Localization via Matrix Completion and Bayesian Sparse Learning.",
            "Enhanced Distance and Location Estimation for Broadband Wireless Networks.",
            "Exploring the Gap between Ideal and Reality: An Experimental Study on Continuous Scanning with Mobile Reader in RFID Systems.",
            "Indoor Tracking Using Undirected Graphical Models.",
            "Low-Overhead Control Channels in Wireless Networks.",
            "Modelling and Analysis of Communication Traffic Heterogeneity in Opportunistic Networks.",
            "On the Design of MAC Protocols for Multi-Packet Communication in IEEE 802.11 Heterogeneous Networks Using Adaptive Antenna Arrays.",
            "Online War-Driving by Compressive Sensing.",
            "Perceiving the Slightest Tag Motion beyond Localization.",
            "The Mason Test: A Defense Against Sybil Attacks in Wireless Networks Without Trusted Authorities.",
            "Thwarting Intelligent Malicious Behaviors in Cooperative Spectrum Sensing.",
            "A Mobility Model of Theme Park Visitors.",
            "A Novel Scheduling Algorithm for Supporting Periodic Queries in Broadcast Environments.",
            "A Predictive Resource Allocation Algorithm in the LTE Uplink for Event Based M2M Applications.",
            "An Attack-Resistant Trust Model Based on Multidimensional Trust Metrics in Underwater Acoustic Sensor Network.",
            "Balancing Income and User Utility in Spectrum Allocation.",
            "Energy Consumption Analysis and Minimization in Multi-Layer Heterogeneous Wireless Systems.",
            "Exploiting Subcarrier Agility to Alleviate Active Jamming Attacks in Wireless Networks.",
            "Fault Tolerant Complex Event Detection in WSNs: A Case Study in Structural Health Monitoring.",
            "Offloading in Mobile Cloudlet Systems with Intermittent Connectivity.",
            "Opportunistic Sampling for Joint Population Size and Density Estimation.",
            "Optimal and Maximized Configurable Power Saving Protocols for Corona-Based Wireless Sensor Networks.",
            "Urban Resolution: New Metric for Measuring the Quality of Urban Sensing.",
            "Virtual Servers Co-Migration for Mobile Accesses: Online versus Off-Line.",
            "WizBee: Wise ZigBee Coexistence via Interference Cancellation with Single Antenna."
        ]
    },
    {
        "name": "TMC",
        "year": "2014",
        "info": "Volume 13, 2014",
        "count": 214,
        "papers": [
            "Editorial: A Message from the Outgoing Editor-in-Chief and Associate Editor-in-Chief.",
            "Guest Editorial: Special section on outstanding papers from MobiCom 2012.",
            "Capacitive Touch Communication: A Technique to Input Data through Devices' Touch Screen.",
            "Fast Spectrum Shaping for Next-Generation Wireless Networks.",
            "Rate Adaptation for 802.11 Multiuser MIMO Networks.",
            "Class-Based Shared Resource Allocation for Cell-Edge Users in OFDMA Networks.",
            "TagSense: Leveraging Smartphones for Automatic Image Tagging.",
            "Designing Truthful Spectrum Double Auctions with Local Markets.",
            "Joint Interference Coordination and Load Balancing for OFDMA Multihop Cellular Networks.",
            "Bounds on the Benefit of Network Coding for Wireless Multicast and Unicast.",
            "Large-Scale Synthetic Social Mobile Networks with SWIM.",
            "Multiuser Scheduling in the 3GPP LTE Cellular Uplink.",
            "Real-Time Misbehavior Detection in IEEE 802.11-Based Wireless Networks: An Analytical Approach.",
            "Preserving Location Privacy in Geosocial Applications.",
            "Cooperative Spectrum Sharing: A Contract-Based Approach.",
            "Design and Implementation of Efficient Integrity Protection for Open Mobile Platforms.",
            "Energy-Efficient Relaying via Store-Carry and Forward within the Cell.",
            "From MAP to DIST: The Evolution of a Large-Scale WLAN Monitoring System.",
            "Leveraging Social Networks for P2P Content-Based File Sharing in Disconnected MANETs.",
            "TurfCast: A Service for Controlling Information Dissemination in Wireless Networks.",
            "RBTP: Low-Power Mobile Discovery Protocol through Recursive Binary Time Partitioning.",
            "Video Dissemination over Hybrid Cellular and Ad Hoc Networks.",
            "HAWK: An Unmanned Mini-Helicopter-Based Aerial Wireless Kit for Localization.",
            "Evaluation of a Multihop Airborne IP Backbone with Heterogeneous Radio Technologies.",
            "LOS and NLOS Classification for Underwater Acoustic Localization.",
            "New Directions into the Stochastic Geometry Analysis of Dense CSMA Networks.",
            "Interference and Outage in Mobile Random Networks: Expectation, Distribution, and Correlation.",
            "Cooperative Self-Navigation in a Mixed LOS and NLOS Environment.",
            "Autonomous Mobile Mesh Networks.",
            "Optimal Distributed Malware Defense in Mobile Networks with Heterogeneous Devices.",
            "Implementation-Based Evaluation of a Full-Fledged Multihop TDMA-MAC for WiFi Mesh Networks.",
            "Novel Channel-Hopping Schemes for Cognitive Radio Networks.",
            "Energy-Aware Resource Allocation Strategies for LTE Uplink with Synchronous HARQ Constraints.",
            "Energy-Efficient Reliable Routing Considering Residual Energy in Wireless Ad Hoc Networks.",
            "Harnessing the High Bandwidth of Multiradio Multichannel 802.11n Mesh Networks.",
            "Security Analysis of Handover Key Management in 4G LTE/SAE Networks.",
            "Efficient Authentication for Mobile and Pervasive Computing.",
            "Achieving Maximum Throughput in Random Access Protocols with Multipacket Reception.",
            "SmartDC: Mobility Prediction-Based Adaptive Duty Cycling for Everyday Location Monitoring.",
            "Dynamic Profit Maximization of Cognitive Mobile Virtual Network Operator.",
            "An Incentive Framework for Cellular Traffic Offloading.",
            "Enabling Spectrum Sharing in Secondary Market Auctions.",
            "Spectrum Bonding and Aggregation with Guard-Band Awareness in Cognitive Radio Networks.",
            "DA-Sync: A Doppler-Assisted Time-Synchronization Scheme for Mobile Underwater Sensor Networks.",
            "An Active Resource Orchestration Framework for PAN-Scale, Sensor-Rich Environments.",
            "Cooperative Caching for Efficient Data Access in Disruption Tolerant Networks.",
            "Snapshot and Continuous Data Collection in Probabilistic Wireless Sensor Networks.",
            "The Places of Our Lives: Visiting Patterns and Automatic Labeling from Longitudinal Smartphone Data.",
            "Two-Tier HetNets with Cognitive Femtocells: Downlink Performance Modeling and Analysis in a Multichannel Environment.",
            "On Quality of Monitoring for Multichannel Wireless Infrastructure Networks.",
            "Seamless TCP Migration on Smartphones without Network Support.",
            "A QoS-Oriented Distributed Routing Protocol for Hybrid Wireless Networks.",
            "A Two-Phase Dispatch Heuristic to Schedulethe Movement of Multi-Attribute MobileSensors in a Hybrid Wireless Sensor Network.",
            "An Automatic, Robust, and EfficientMulti-User Breadcrumb Systemfor Emergency Response Applications.",
            "Calibrating Indoor Positioning Systemswith Low Efforts.",
            "Data Retrieval Scheduling for Multi-Item Requests in Multi-Channel WirelessBroadcast Environments.",
            "DOTS: A Propagation Delay-AwareOpportunistic MAC Protocol for MobileUnderwater Networks.",
            "Efficient Rekeying Framework for SecureMulticast with Diverse-Subscription-Period Mobile Users.",
            "Evaluating Service Disciplines forOn-Demand Mobile Data Collectionin Sensor Networks.",
            "Face-to-Face Proximity EstimationUsing Bluetooth On Smartphones.",
            "Investigating the Privacy versus Forwarding Accuracy Tradeoff in OpportunisticInterest-Casting.",
            "Minimum Latency Multiple Data MULETrajectory Planning in Wireless Sensor Networks.",
            "Opportunistic Channel Sharingin Cognitive Radio Networks.",
            "Optimizing Spatial and Temporal Reuse inWireless Networks by Decentralized Partially Observable Markov Decision Processes.",
            "Profiling Aquatic Diffusion Process UsingRobotic Sensor Networks.",
            "Radio Resource Allocation and GreenOperation for Mobile Access Networks Basedon Radio-over-Fiber.",
            "RF-Sensing of Activities from Non-Cooperative Subjects in Device-Free Recognition Systems Using Ambient and Local Signals.",
            "WhiteRate: A Context-Aware Approachto Wireless Rate Adaptation.",
            "A Study on False Channel Condition Reporting Attacks in Wireless Networks.",
            "A System for Automatic Notification and Severity Estimation of Automotive Accidents.",
            "Adaptive Scheduling in MIMO-Based Heterogeneous Ad Hoc Networks.",
            "An Optimization Framework for XOR-Assisted Cooperative Relaying in Cellular Networks.",
            "Analysis of an Instantaneous Packet Loss Based Vertical Handover Algorithm for Heterogeneous Wireless Networks.",
            "Content Download in Vehicular Networks in Presence of Noisy Mobility Prediction.",
            "Detection of PUE Attacks in Cognitive Radio Networks Based on Signal Activity Pattern.",
            "Distributed Algorithms for Energy-Efficient Even Self-Deployment in Mobile Sensor Networks.",
            "Fully Distributed Algorithms for Minimum Delay Routing Under Heavy Traffic.",
            "Generation and Analysis of a Large-Scale Urban Vehicular Mobility Dataset.",
            "Iterative Group Splitting Algorithm for Opportunistic Scheduling Systems.",
            "\\(K\\) NN Query Processing Methods in Mobile Ad Hoc Networks.",
            "Optimal Multicast Capacity and DelayTradeoffs in MANETs.",
            "TVR - Tall Vehicle Relayingin Vehicular Networks.",
            "Uplink Scheduling in Wireless Networks with Successive Interference Cancellation.",
            "WiCop: Engineering WiFi Temporal White-Spaces for Safe Operations of Wireless Personal Area Networks in Medical Applications.",
            "A Fade Level-Based Spatial Model for Radio Tomographic Imaging.",
            "Adaptive Context Dissemination in Heterogeneous Environments.",
            "E2D Wi-Fi: A Mechanism to Achieve Energy Efficient Discovery in Wi-Fi.",
            "Energy-Optimum Throughput and Carrier Sensing Rate in CSMA-Based Wireless Networks.",
            "Fault Tolerant Localization and Tracking of Multiple Sources in WSNs Using Binary Data.",
            "How Long to Wait? Predicting Bus Arrival Time With Mobile Phone Based Participatory Sensing.",
            "Intelligent Channel Bonding in 802.11n WLANs.",
            "Maximum Stable Throughput of Network-Coded Multiple Broadcast Sessions for WirelessTandem Random Access Networks.",
            "Mobility and Intruder Prior Information Improving the Barrier Coverage of Sparse Sensor Networks.",
            "NETWRAP: An NDN Based Real-TimeWireless Recharging Framework for Wireless Sensor Networks.",
            "On Queue Length and Link Buffer Size Estimation in 3G/4G Mobile Data Networks.",
            "Optimizing Content Dissemination in Vehicular Networks with Radio Heterogeneity.",
            "SEAMLOC: Seamless Indoor Localization Based on Reduced Number of Calibration Points.",
            "The K-hop Cooperative Video Streaming Protocol Using H.264/SVC Over the Hybrid Vehicular Networks.",
            "Token-MAC: A Fair MAC Protocol for Passive RFID Systems.",
            "Uplink Soft Frequency Reuse for Self-Coexistence of Cognitive Radio Networks.",
            "WizSync: Exploiting Wi-Fi Infrastructure for Clock Synchronization in Wireless Sensor Networks.",
            "EIC Editorial.",
            "A DoF-Based Link Layer Model for Multi-Hop MIMO Networks.",
            "A Novel Approach to Trust Management in Unattended Wireless Sensor Networks.",
            "A Scalable Bandwidth-Efficient Hybrid Adaptive Service Discovery Protocol for Vehicular Networks with Infrastructure Support.",
            "Achieving k-Barrier Coverage in Hybrid Directional Sensor Networks.",
            "Distributed Scheduling in MIMO Empowered Cognitive Radio Ad Hoc Networks.",
            "Efficient Privacy-Preserving Authentication in Wireless Mobile Networks.",
            "Exploiting Rateless Codes and Belief Propagation to Infer Identity of Polluters in MANET.",
            "FLIGHT: Clock Calibration and Context Recognition Using Fluorescent Lighting.",
            "Hidden Markov Estimation of Bistatic Range From Cluttered Ultra-Wideband Impulse Responses.",
            "Joint Optimization of User-Experience and Energy-Efficiency in Wireless Multimedia Broadcast.",
            "Leveraging the Tail Time for Saving Energy in Cellular Networks.",
            "Mobile App Classification with Enriched Contextual Information.",
            "Mobile Node Localization Focusing on Stop-and-Go Behavior of Indoor Pedestrians.",
            "Multiple Mobile Data Offloading Through Disruption Tolerant Networks.",
            "Opportunistic Communication and Human Mobility.",
            "Spectrum-Efficient Multi-Channel Design for Coexisting IEEE 802.15.4 Networks: A Stochastic Geometry Approach.",
            "Stochastic Model Based Opportunistic Channel Access in Dynamic Spectrum Access Networks.",
            "VoIPiggy: Analysis and Implementation of a Mechanism to Boost Capacity in IEEE 802.11 WLANs Carrying VoIP Traffic.",
            "A Novel Unified Analytical Model for Broadcast Protocols in Multi-Hop Cognitive Radio Ad Hoc Networks.",
            "A Session-Based Mobile Socket Layer for Disruption Tolerance on the Internet.",
            "Adaptive and Energy Efficient Context Representation Framework in Mobile Sensing.",
            "Adaptive Duty Cycling for Place-Centric Mobility Monitoring using Zero-Cost Information in Smartphone.",
            "ARC: Adaptive Reputation based Clustering Against Spectrum Sensing Data Falsification Attacks.",
            "Context-Aware Energy Enhancements for Smart Mobile Devices.",
            "IVC in Cities: Signal Attenuation by Buildings and How Parked Cars Can Improve the Situation.",
            "Modeling, Evaluation and Detection of Jamming Attacks in Time-Critical Wireless Applications.",
            "Modeling Energy Consumption of Data Transmission Over Wi-Fi.",
            "Monitoring Breathing via Signal Strength in Wireless Networks.",
            "Multiple Target Tracking with RF Sensor Networks.",
            "Optimizing Small Cell Deployment in Arbitrary Wireless Networks with Minimum Service Rate Constraints.",
            "Performance Modeling of Delay-Tolerant Network Routing via Queueing Petri Nets.",
            "Power Efficient Ultra Wide Band Based Wireless Body Area Networks with Narrowband Feedback Path.",
            "Pricing, Spectrum Sharing, and Service Selection in Two-Tier Small Cell Networks: A Hierarchical Dynamic Game Approach.",
            "Real-Time Scheduling for Xen-ARM Virtual Machines.",
            "Reducing the Positional Error of Connectivity-Based Positioning Algorithms Through Cooperation Between Neighbors.",
            "Throughput Optimization in Wireless Networks Under Stability and Packet Loss Constraints.",
            "Work-Conserving In-Sequence Striping in Multi-Band Wireless Backhaul Systems.",
            "A Markov Jump Process Model for Urban Vehicular Mobility: Modeling and Applications.",
            "A Privacy-Preserving Attribute-Based Authentication System for Mobile Health Networks.",
            "Analysis and Optimization of a Protocol for Mobile Element Discovery in Sensor Networks.",
            "Coverage and Load Balancing in Heterogeneous Cellular Networks with Minimum Cell Separation.",
            "Decentralized Throughput Maximization in Cognitive Radio Wireless Mesh Networks.",
            "Design, Realization, and Evaluation of uDirect-An Approach for Pervasive Observation of User Facing Direction on Mobile Phones.",
            "Direction Finding of a Compromised Node in a Wireless Network.",
            "Distributed Resource Allocation for Multi-Cell Relay-Aided OFDMA Systems.",
            "Distributed Storage Codes Reduce Latency in Vehicular Networks.",
            "Joint Optimization of Session Grouping and Relay Node Selection for Network-Coded Cooperative Communications.",
            "Medium Access with Adaptive Relay Selection in Cooperative Wireless Networks.",
            "MobiTribe: Cost Efficient Distributed User Generated Content Sharing on Smartphones.",
            "Optimal Design of the Spectrum Sensing Parameters in the Overlay Spectrum Sharing.",
            "Optimal Peer-to-Peer Schedulingfor Mobile Wireless Networkswith Redundantly Distributed Data.",
            "Optimizing Spectrum-Energy Efficiency in Downlink Cellular Networks.",
            "QoS Provisioning for Wireless LANs With Multi-Beam Access Point.",
            "Reputation and User Requirement Based Price Modeling for Dynamic Spectrum Access.",
            "Sensing-Transmission Edifice Using Bayesian Nonparametric Traffic Clustering in Cognitive Radio Networks.",
            "Traffic Signature-Based Mobile Device Location Authentication.",
            "A Fast Blind Rendezvous Method byAlternate Hop-and-Wait Channel Hoppingin Cognitive Radio Networks.",
            "A New Distributed Application and Network Layer Protocol for VoIP in Mobile Ad Hoc Networks.",
            "Accurate WiFi Based Localization for Smartphones Using Peer Assistance.",
            "Almost Optimal Dynamically-Ordered Channel Sensing and Accessing for Cognitive Networks.",
            "An Efficient Downlink Radio ResourceAllocation with Carrier Aggregationin LTE-Advanced Networks.",
            "An ID/Locator Separation-Based Mobility Management Architecture for WSNs.",
            "ATLAS: Adaptive Topology- andLoad-Aware Scheduling.",
            "Distributed Stochastic Cross-Layer Optimization for Multi-Hop Wireless Networks With Cooperative Communications.",
            "Dynamic Scheduling and Pricing in Wireless Cloud Computing.",
            "Localization and Tracking of Objects Using Cross-Correlation of Shadow Fading Noise.",
            "Mobile Tracking Based on Fractional Integration.",
            "Motivating Smartphone Collaboration in Data Acquisition and Distributed Computing.",
            "On Joint Privacy and Reputation Assurance for Vehicular Ad Hoc Networks.",
            "On Queue-Aware Power Control in Interfering Wireless Links: Heavy Traffic AsymptoticModelling and Application in QoS Provisioning.",
            "Optimal Probabilistic Policy for Dynamic Resource Activation Using Markov Decision Process in Green Wireless Networks.",
            "PHY-Supported Frame Aggregation for Wireless Local Area Networks.",
            "Private Badges for Geosocial Networks.",
            "Untraceability Model for RFID.",
            "UWB Positioning with GeneralizedGaussian Mixture Filters.",
            "Verification and Inference of Positions in Vehicular Networks throughAnonymous Beaconing.",
            "A Feasibility Study and Development Framework Design for Realizing Smartphone-Based Vehicular Networking Systems.",
            "A Location-Privacy Threat Stemmingfrom the Use of Shared Public IP Addresses.",
            "A New Approach to the Directed Connectivity in Two-Dimensional Lattice Networks.",
            "Adometer: Push the Limit of Pedestrian Indoor Localization through Cooperation.",
            "Analytic Evaluation and Experimental Validation of a Network-Based IPv6 Distributed Mobility Management Solution.",
            "Co-Evolution of Content Spread and Popularityin Mobile Opportunistic Networks.",
            "Concurrent Multipath Transfer Using SCTP: Modelling and Congestion Window Management.",
            "Direction of Encounter (DoE): A Mobility-Based Location Method for Wireless Networks.",
            "GreenBSN: Enabling Energy-Proportional Cellular Base Station Networks.",
            "Interaction Engineering: Achieving Perfect CSMA Handshakes in Wireless Networks.",
            "Keylogging-Resistant Visual Authentication Protocols.",
            "On Optimal Cell Activation for Coverage Preservation in Green Cellular Networks.",
            "On the Vulnerabilities of the Virtual Force Approach to Mobile Sensor Deployment.",
            "PBS: A Portable Billing Scheme with Fine-Grained Access Control for Service-Oriented Vehicular Networks.",
            "Reliable and Fast Hand-Offs in Low-Power Wireless Networks.",
            "Robust Topology Control in Multi-Hop Cognitive Radio Networks.",
            "Techniques to Minimize State Transfer Costs for Dynamic Execution Offloading in Mobile Cloud Computing.",
            "The Impact of Rate Adaptation on Capacity-Delay Tradeoffs in Mobile Ad Hoc Networks.",
            "ZiFi: Exploiting Cross-Technology Interference Signatures for Wireless LAN Discovery.",
            "A Framework of Joint Mobile Energy Replenishment and Data Gathering in Wireless Rechargeable Sensor Networks.",
            "A Random Road Network Model and Its Effects on Topological Characteristics of Mobile Delay-Tolerant Networks.",
            "An Experimental Study of Routing Metrics in 802.11n Wireless Mesh Networks.",
            "Analytical QoE Models for Bit-Rate Switching in Dynamic Adaptive Streaming Systems.",
            "Contention Based Multichannel MAC Protocol for Distributed Cognitive Radio Networks.",
            "Eliminating Reconciliation Cost in Secret Key Generation for Body-Worn Health Monitoring Devices.",
            "Enabling Reputation and Trust in Privacy-Preserving Mobile Sensing.",
            "Enhancing Voice over WLAN via Rate Adaptation and Retry Scheduling.",
            "Exploiting ZigBee in Reducing WiFi Power Consumption for Mobile Devices.",
            "Group Secret Key Generation via Received Signal Strength: Protocols, Achievable Rates, and Implementation.",
            "Joint Mobile Data Gathering and Energy Provisioning in Wireless Rechargeable Sensor Networks.",
            "Network-Coded Multiple Access.",
            "On Energy Efficiency of IEEE 802.16m Interframe Scheduling for Scalable Video Multicast.",
            "Proper RFID Privacy: Model and Protocols.",
            "PSaD: A Privacy-Preserving Social-Assisted Content Dissemination Scheme in DTNs.",
            "Video Multicasting With Channel Diversity in Wireless OFDMA Networks.",
            "ZigBee-Assisted Power Saving Management for Mobile Devices."
        ]
    },
    {
        "name": "TMC",
        "year": "2013",
        "info": "Volume 12, 2013",
        "count": 192,
        "papers": [
            "Editorial and changes to the Editorial Board.",
            "Delay-Optimal Broadcast for Multihop Wireless Networks Using Self-Interference Cancellation.",
            "Quality-Differentiated Video Multicast in Multirate Wireless Networks.",
            "Pulse Switching: Toward a Packet-Less Protocol Paradigm for Event Sensing.",
            "Toward Privacy Preserving and Collusion Resistance in a Location Proof Updating System.",
            "SSD: A Robust RF Location Fingerprint Addressing Mobile Devices' Heterogeneity.",
            "EMAP: Expedite Message Authentication Protocol for Vehicular Ad Hoc Networks.",
            "A Resource Allocation Scheme for Scalable Video Multicast in WiMAX Relay Networks.",
            "Evaluating Temporal Robustness of Mobile Networks.",
            "Channel Assignment for Throughput Optimization in Multichannel Multiradio Wireless Mesh Networks Using Network Coding.",
            "Capacity of Hybrid Wireless Mesh Networks with Random APs.",
            "On Exploiting Transient Social Contact Patterns for Data Forwarding in Delay-Tolerant Networks.",
            "An Investigation on LTE Mobility Management.",
            "Target Tracking and Mobile Sensor Navigation in Wireless Sensor Networks.",
            "On the Real-Time Hardware Implementation Feasibility of Joint Radio Resource Management Policies for Heterogeneous Wireless Networks.",
            "Channel Allocation and Routing in Hybrid Multichannel Multiradio Wireless Mesh Networks.",
            "Model-Based Analysis of Wireless System Architectures for Real-Time Applications.",
            "On Centralized and Localized Approximation Algorithms for Interference-Aware Broadcast Scheduling.",
            "Toward a Statistical Framework for Source Anonymity in Sensor Networks.",
            "Mobile Relay Configuration in Data-Intensive Wireless Sensor Networks.",
            "Autonomous Sensing Order Selection Strategies Exploiting Channel Access Information.",
            "Discovery and Verification of Neighbor Positions in Mobile Ad Hoc Networks.",
            "Group-Based Medium Access Control for IEEE 802.11n Wireless LANs.",
            "Vampire Attacks: Draining Life from Wireless Ad Hoc Sensor Networks.",
            "Noninteractive Localization of Wireless Camera Sensors with Mobile Beacon.",
            "Successive Interference Cancellation: Carving Out MAC Layer Opportunities.",
            "Secure Communication Based on Ambient Audio.",
            "Coalition-Based Cooperative Packet Delivery under Uncertainty: A Dynamic Bayesian Coalitional Game.",
            "A Scalable Server Architecture for Mobile Presence Services in Social Network Applications.",
            "Hearing Is Believing: Detecting Wireless Microphone Emulation Attacks in White Space.",
            "Video On-Demand Streaming in Cognitive Wireless Mesh Networks.",
            "A Neighbor Coverage-Based Probabilistic Rebroadcast for Reducing Routing Overhead in Mobile Ad Hoc Networks.",
            "Passive Measurement of Interference in WiFi Networks with Application in Misbehavior Detection.",
            "Analytical Framework for WLAN-Cellular Voice Handover Evaluation.",
            "On Using Interference-Aware Spectrum Sensing for Dynamic Spectrum Access in Cognitive Radio Networks.",
            "Relay Selection for Geographical Forwarding in Sleep-Wake Cycling Wireless Sensor Networks.",
            "Adaptive Position Update for Geographic Routing in Mobile Ad Hoc Networks.",
            "Toward History-Aware Robust 802.11 Rate Adaptation.",
            "Bounded-Hop Energy-Efficient Liveness of Flocking Swarms.",
            "Modeling and Restraining Mobile Virus Propagation.",
            "Contention-Based Estimation of Neighbor Cardinality.",
            "Novel Design and Analysis of Aggregated ARQ Protocols for IEEE 802.11n Networks.",
            "Low-Complexity Class-Based Scheduling Algorithm for Scheduled Automatic Power-Save Delivery for Wireless LANs.",
            "Content Sharing over Smartphone-Based Delay-Tolerant Networks.",
            "Distributed Cooperation and Diversity for Hybrid Wireless Networks.",
            "Robust Distributed Power Control in Cognitive Radio Networks.",
            "A MAC Sensing Protocol Design for Data Transmission with More Protection to Primary Users.",
            "Estimation of Task Persistence Parameters from Pervasive Medical Systems with Censored Data.",
            "On Random Access Scheduling for Multimedia Traffic in Multihop Wireless Networks with Fading Channels.",
            "Uplink Power Control via Adaptive Hidden-Markov-Model-Based Pathloss Estimation.",
            "Scheduling Partition for Order Optimal Capacity in Large-Scale Wireless Networks.",
            "DCIM: Distributed Cache Invalidation Method for Maintaining Cache Consistency in Wireless Mobile Networks.",
            "Joint Physical-Layer and System-Level Power Management for Delay-Sensitive Wireless Communications.",
            "UACAP: A Unified Auxiliary Channel Authentication Protocol.",
            "Spatial Distribution and Channel Quality Adaptive Protocol for Multihop Wireless Broadcast Routing in VANET.",
            "Probability-Based Prediction and Sleep Scheduling for Energy-Efficient Target Tracking in Sensor Networks.",
            "Effective Carrier Sensing in CSMA Networks under Cumulative Interference.",
            "Cross-Layer Minimum-Delay Scheduling and Maximum-Throughput Resource Allocation for Multiuser Cognitive Networks.",
            "Geometry-Assisted Localization Algorithms for Wireless Networks.",
            "TCP CRAHN: A Transport Control Protocol for Cognitive Radio Ad Hoc Networks.",
            "Tula: Balancing Energy for Sensing and Communication in a Perpetual Mobile System.",
            "Cooperative Wireless-Based Obstacle/Object Mapping and See-Through Capabilities in Robotic Networks.",
            "Mutual Distance Bounding Protocols.",
            "Cooperative Packet Delivery in Hybrid Wireless Mobile Networks: A Coalitional Game Approach.",
            "Evaluating Implementation Strategies for Location-Based Multicast Addressing.",
            "A General Performance Evaluation Framework for Network Selection Strategies in 3G-WLAN Interworking Networks.",
            "A Strategy-Proof Radio Spectrum Auction Mechanism in Noncooperative Wireless Networks.",
            "VAPR: Void-Aware Pressure Routing for Underwater Sensor Networks.",
            "Minimum CDS in Multihop Wireless Networks with Disparate Communication Ranges.",
            "Secret Key Extraction from Wireless Signal Strength in Real Environments.",
            "Efficient Objective Functions for Coordinated Learning in Large-Scale Distributed OSA Systems.",
            "A Probabilistic Place Extraction Algorithm Based on a Superstate Model.",
            "Resource Allocation with Flexible Channel Cooperation in Cognitive Radio Networks.",
            "Fine-Grained Location-Free Planarization in Wireless Sensor Networks.",
            "Effective Video Multicast Using SVC with Heterogeneous User Demands over TDMA-Based Wireless Mesh Networks.",
            "Dynamic Control of Receiver Buffers in Mobile Video Streaming Systems.",
            "UPL: Opportunistic Localization in Urban Districts.",
            "Distributed MAC Protocol Supporting Physical-Layer Network Coding.",
            "Distributed Cooperative Caching in Social Wireless Networks.",
            "An Efficient Time-Bound Collision Prevention Scheme for RFID Re-Entering Tags.",
            "Network-Assisted Mobile Computing with Optimal Uplink Query Processing.",
            "ALERT: An Anonymous Location-Based Efficient Routing Protocol in MANETs.",
            "Toward Accurate Mobile Sensor Network Localization in Noisy Environments.",
            "On the Forwarding Performance under Heterogeneous Contact Dynamics in Mobile Opportunistic Networks.",
            "DSS: Distributed SINR-Based Scheduling Algorithm for Multihop Wireless Networks.",
            "Path Selection under Budget Constraints in Multihop Cognitive Radio Networks.",
            "Proteus: Multiflow Diversity Routing for Wireless Networks with Cooperative Transmissions.",
            "Measurement-Based Design of Roadside Content Delivery Systems.",
            "Predictable Mobile Routing for Spacecraft Networks.",
            "Deployment of a Connected Reinforced Backbone Network with a Limited Number of Backbone Nodes.",
            "Modeling Beacon Period Length of the UWB and 60-GHz mmWave WPANs Based on ECMA-368 and ECMA-387 Standards.",
            "Adaptive Duty Cycle Control with Queue Management in Wireless Sensor Networks.",
            "Localization of RFID Tags Using Stochastic Tunneling.",
            "Predicting Human Movement Based on Telecom's Handoff in Mobile Networks.",
            "Understanding the Information Propagation Speed in Multihop Cognitive Radio Networks.",
            "Underwater Localization with Time-Synchronization and Propagation Speed Uncertainties.",
            "A Spectrum Switching Delay-Aware Scheduling Algorithm for Centralized Cognitive Radio Networks.",
            "Evolutionarily Stable Spectrum Access.",
            "Maximizing Rendezvous Diversity in Rendezvous Protocols for Decentralized Cognitive Radio Networks.",
            "A Progressive Approach to Reducing Data Collection Latency in Wireless Sensor Networks with Mobile Elements.",
            "Nuzzer: A Large-Scale Device-Free Passive Localization System for Wireless Environments.",
            "A Traffic-Aware Channel and Rate Reassignment Algorithm for Wireless Mesh Networks.",
            "Optimal Online Sensing Sequence in Multichannel Cognitive Radio Networks.",
            "On Power and Throughput Tradeoffs of WiFi and Bluetooth in Smartphones.",
            "Optimal Content Downloading in Vehicular Networks.",
            "A Robust Indoor Pedestrian Tracking System with Sparse Infrastructure Support.",
            "Bridging the Gap between Protocol and Physical Models for Wireless Networks.",
            "Studying Smartphone Usage: Lessons from a Four-Month Field Study.",
            "Variable-Width Channel Allocation for Access Points: A Game-Theoretic Perspective.",
            "Cell Selection in 4G Cellular Networks.",
            "United We Stand: Intrusion Resilience in Mobile Unattended WSNs.",
            "Editorial: Reviewer Appreciation Program.",
            "Guest Editorial: Special Section on Outstanding Papers from MobiSys 2012.",
            "ACE: Exploiting Correlation for Energy-Efficient and Continuous Context Sensing.",
            "Mobile Motion Gaming: Enabling a New Class of Phone-to-Phone Action Games on Commodity Phones.",
            "Indoor Localization Using FM Signals.",
            "Asymptotic Minimum Coverage Using Macroscopic Diversity.",
            "Joint Optimal Sensor Selection and Scheduling in Dynamic Spectrum Access Networks.",
            "HAPPE: Human and Application-Driven Frequency Scaling for Processor Power Efficiency.",
            "A Unified Analysis of IEEE 802.11 DCF Networks: Stability, Throughput, and Delay.",
            "Symbiotic Coding for High-Density Wireless LANs.",
            "Reducing Signaling Overhead for Femtocell/Macrocell Networks.",
            "Topological Persistence for Medium Access Control.",
            "Game-Based Broadcast over Reliable and Unreliable Wireless Links in Wireless Multihop Networks.",
            "Understanding the Scheduling Performance in Wireless Networks with Successive Interference Cancellation.",
            "Enhanced Least-Squares Positioning Algorithm for Indoor Positioning.",
            "Design and Analysis of Adaptive Receiver Transmission Protocols for Receiver Blocking Problem in Wireless Ad Hoc Networks.",
            "Efficient Spread Spectrum Communication without Preshared Secrets.",
            "Impact of the Connection Admission Process on the Direct Retry Load Balancing Algorithm in Cellular Networks.",
            "Decentralized Bargain: A Two-Tier Market for Efficient and Flexible Dynamic Spectrum Access.",
            "Key Management for Multiple Multicast Groups in Wireless Networks.",
            "VeMAC: A TDMA-Based MAC Protocol for Reliable Broadcast in VANETs.",
            "On the MDP-Based Cost Minimization for Video-on-Demand Services in a Heterogeneous Wireless Network with Multihomed Terminals.",
            "Routing-Toward-Primary-User Attack and Belief Propagation-Based Defense in Cognitive Radio Networks.",
            "Estimating Performance of Mobile Services from Comparative Output-Input Analysis of End-to-End Throughput.",
            "Dynamic Online-Calibrated Radio Maps for Indoor Positioning in Wireless Local Area Networks.",
            "Adaptive Channel Recommendation for Opportunistic Spectrum Access.",
            "Fast and Accurate Cooperative Tracking in Wireless Networks.",
            "A New Approach to Fast Near-Optimal Channel Assignment in Cellular Mobile Networks.",
            "Mobile Autonomous Router System for Dynamic (Re)formation of Wireless Relay Networks.",
            "Adaptive Wireless Channel Probing for Shared Key Generation Based on PID Controller.",
            "Networking Low-Power Energy Harvesting Devices: Measurements and Algorithms.",
            "Bicriteria Optimization in Multihop Wireless Networks: Characterizing the Throughput-Energy Envelope.",
            "Maximizing Transmission Opportunities in Wireless Multihop Networks.",
            "MAP: Multiconstrained Anypath Routing in Wireless Mesh Networks.",
            "Distributed Algorithm for Lifetime Maximization in a Delay-Tolerant Wireless Sensor Network with a Mobile Sink.",
            "Energy Provisioning in Wireless Rechargeable Sensor Networks.",
            "Achieving User-Level Fairness in Open-Access Femtocell-Based Architecture.",
            "Outage Performance of the Primary Service in Spectrum Sharing Networks.",
            "Optimized Asynchronous Multichannel Discovery of IEEE 802.15.4-Based Wireless Personal Area Networks.",
            "Intercontact Routing for Energy Constrained Disaster Response Networks.",
            "Spectrum Sharing through Contracts for Cognitive Radios.",
            "Efficient Rostering of Mobile Nodes in Intermittently Connected Passive RFID Networks.",
            "Quality Prediction-Based Dynamic Content Adaptation Framework Applied to Collaborative Mobile Presentations.",
            "Privacy-Friendly Authentication in RFID Systems: On Sublinear Protocols Based on Symmetric-Key Cryptography.",
            "Indoor Tracking and Navigation Using Received Signal Strength and Compressive Sensing on a Mobile Device.",
            "A Novel Query Tree Protocol with Bit Tracking in RFID Tag Identification.",
            "Service Differentiation without Prioritization in IEEE 802.11 WLANs.",
            "Cooperative Positioning when Using Local Position Information: Theoretical Framework and Error Analysis.",
            "SpiderRadio: A Cognitive Radio Implementation Using IEEE 802.11 Components.",
            "Grammatical Inference for Modeling Mobility Patterns in Networks.",
            "Multidimensional Routing Protocol in Human-Associated Delay-Tolerant Networks.",
            "A Nucleolus-Based Approach for Resource Allocation in OFDMA Wireless Mesh Networks.",
            "Stochastic Power Adaptation with Multiagent Reinforcement Learning for Cognitive Wireless Mesh Networks.",
            "Efficient In-Network Computing with Noisy Wireless Channels.",
            "Joint Routing and Scheduling in WMNs with Variable-Width Spectrum Allocation.",
            "CMT-QA: Quality-Aware Adaptive Concurrent Multipath Data Transfer in Heterogeneous Wireless Networks.",
            "DragonNet: A Robust Mobile Internet Service System for Long-Distance Trains.",
            "Epidemic Attacks in Network-Coding-Enabled Wireless Mesh Networks: Detection, Identification, and Evaluation.",
            "Interference Alignment for Cooperative Femtocell Networks: A Game-Theoretic Approach.",
            "Congestion-Aware Spatial Routing in Hybrid High-Mobility Wireless Multihop Networks.",
            "Economics of Femtocell Service Provision.",
            "Optimal Routing and Traffic Scheduling for Multihop Cellular Networks Using Genetic Algorithm.",
            "A Compressive Sensing Approach to Urban Traffic Estimation with Probe Vehicles.",
            "Esense: Energy Sensing-Based Cross-Technology Communication.",
            "Editorial and Changes to the Editorial Board.",
            "Radio-Frequency Tomography for Passive Indoor Multitarget Tracking.",
            "hJam: Attachment Transmission in WLANs.",
            "Utilizing Massive Spatiotemporal Samples for Efficient and Accurate Trajectory Prediction.",
            "Local Differential Perturbations: Location Privacy under Approximate Knowledge Attackers.",
            "A Tracking System for Wireless Embedded Nodes Using Time-of-Flight Ranging.",
            "Background Subtraction for Online Calibration of Baseline RSS in RF Sensing Networks.",
            "GMTC: A Generalized Commit Approach for Hybrid Mobile Environments.",
            "Frequency Domain Packet Scheduling with Stability Analysis for 3GPP LTE Uplink.",
            "Network Selection and Resource Allocation Games for Wireless Access Networks.",
            "Byzantine Fault-Tolerant Consensus in Wireless Ad Hoc Networks.",
            "A Scalable and Accurate Nonsaturated IEEE 802.11e EDCA Model for an Arbitrary Buffer Size.",
            "Throughput Optimal Switching in Multichannel WLANs.",
            "Analysis of Individual Pair and Aggregate Intercontact Times in Heterogeneous Opportunistic Networks.",
            "Threshold Constraints on Symmetric Key Extraction from Rician Fading Estimates.",
            "Unilateral Wakeup for Mobile Ad Hoc Networks with Group Mobility.",
            "Efficient Aggregation Scheduling in Multihop Wireless Sensor Networks with SINR Constraints."
        ]
    },
    {
        "name": "TMC",
        "year": "2012",
        "info": "Volume 11, 2012",
        "count": 161,
        "papers": [
            "Design and Analysis of the Gateway Relocation and Admission Control Algorithm in Mobile WiMAX Networks.",
            "Measurement-Based Bandwidth Scavenging in Wireless Networks.",
            "Acknowledgment-Based Broadcast Protocol for Reliable and Efficient Data Dissemination in Vehicular Ad Hoc Networks.",
            "Efficient Rendezvous Algorithms for Mobility-Enabled Wireless Sensor Networks.",
            "Link Positions Matter: A Noncommutative Routing Metric for Wireless Mesh Networks.",
            "Who, When, Where: Timeslot Assignment to Mobile Clients.",
            "Fast Data Collection in Tree-Based Wireless Sensor Networks.",
            "Principal Component Localization in Indoor WLAN Environments.",
            "Toward Reliable Data Delivery for Highly Dynamic Mobile Ad Hoc Networks.",
            "Estimating Parameters of Multiple Heterogeneous Target Objects Using Composite Sensor Nodes.",
            "Handling Triple Hidden Terminal Problems for Multichannel MAC in Long-Delay Underwater Sensor Networks.",
            "Heuristic Burst Construction Algorithm for Improving Downlink Capacity in IEEE 802.16 OFDMA Systems.",
            "Guest Editorial: Special Section on Outstanding Papers from DySPAN 2011.",
            "TV White Space in Europe.",
            "SenseLess: A Database-Driven White Spaces Network.",
            "On the Origins of Heavy-Tailed Delay in Dynamic Spectrum Access Networks.",
            "Resource-Optimized Quality-Assured Ambiguous Context Mediation Framework in Pervasive Environments.",
            "Relay-Assisted Transmission with Fairness Constraint for Cellular Networks.",
            "Stateless Multicast Protocol for Ad Hoc Networks.",
            "Geometry and Motion-Based Positioning Algorithms for Mobile Tracking in NLOS Environments.",
            "Hop-by-Hop Routing in Wireless Mesh Networks with Bandwidth Guarantees.",
            "Handling Selfishness in Replica Allocation over a Mobile Ad Hoc Network.",
            "Differentiated Protection of Video Layers to Improve Perceived Quality.",
            "MAC in Motion: Impact of Mobility on the MAC of Drive-Thru Internet.",
            "Protecting Location Privacy in Sensor Networks against a Global Eavesdropper.",
            "Secure Initialization of Multiple Constrained Wireless Devices for an Unaided User.",
            "Mobile Ad Hoc Nanonetworks with Collision-Based Molecular Communication.",
            "Shaping Throughput Profiles in Multihop Wireless Networks: A Resource-Biasing Approach.",
            "The Digital Marauder's Map: A WiFi Forensic Positioning Tool.",
            "Jointly Optimal Source-Flow, Transmit-Power, and Sending-Rate Control for Maximum-Throughput Delivery of VBR Traffic over Faded Links.",
            "Local Broadcast Algorithms in Wireless Ad Hoc Networks: Reducing the Number of Transmissions.",
            "Local Greedy Approximation for Scheduling in Multihop Wireless Networks.",
            "Smooth Trade-Offs between Throughput and Delay in Mobile Ad Hoc Networks.",
            "Fault Localization Using Passive End-to-End Measurements and Sequential Testing for Wireless Sensor Networks.",
            "OLM: Opportunistic Layered Multicasting for Scalable IPTV over Mobile WiMAX.",
            "RAM: Rate Adaptation in Mobile Environments.",
            "Soft-TDMAC: A Software-Based 802.11 Overlay TDMA MAC with Microsecond Synchronization.",
            "Robust Topology Engineering in Multiradio Multichannel Wireless Networks.",
            "Network Connectivity with a Family of Group Mobility Models.",
            "Fast Capture - Recapture Approach for Mitigating the Problem of Missing RFID Tags.",
            "Spectrum-Aware Mobility Management in Cognitive Radio Cellular Networks.",
            "Chip Error Pattern Analysis in IEEE 802.15.4.",
            "Energy-Efficient Strategies for Cooperative Multichannel MAC Protocols.",
            "Target Tracking in Wireless Sensor Networks Based on the Combination of KF and MLE Using Distance Measurements.",
            "Distributed Throughput Maximization in Wireless Networks via Random Power Allocation.",
            "Maximum Entropy Principle-Based Algorithm for Simultaneous Resource Location and Multihop Routing in Multiagent Networks.",
            "Improving QoS in High-Speed Mobility Using Bandwidth Maps.",
            "A Statistical Mechanics-Based Framework to Analyze Ad Hoc Networks with Random Access.",
            "Coverage Verification without Location Information.",
            "Scalable Activity-Travel Pattern Monitoring Framework for Large-Scale City Environment.",
            "Cooperative Download in Vehicular Environments.",
            "Understanding the Interaction between Packet Forwarding and Channel Access in Multihop Wireless Networks.",
            "Risk-Aware Distributed Beacon Scheduling for Tree-Based ZigBee Wireless Networks.",
            "Correction to \"Geometry and Motion-Based Positioning Algorithms for Mobile Tracking in NLOS Environments\".",
            "Guest Editorial: Special Section on Outstanding Papers from MobiSys 2011.",
            "Leveraging Smartphone Cameras for Collaborative Road Advisories.",
            "Chameleon: A Color-Adaptive Web Browser for Mobile OLED Displays.",
            "Avoiding the Rush Hours: WiFi Energy Management via Traffic Isolation.",
            "FESCIM: Fair, Efficient, and Secure Cooperation Incentive Mechanism for Multihop Cellular Networks.",
            "On Reliable Broadcast in Low Duty-Cycle Wireless Sensor Networks.",
            "Design of Efficient Multicast Protocol for IEEE 802.11n WLANs and Cross-Layer Optimization for Scalable Video Streaming.",
            "A Trigger Identification Service for Defending Reactive Jammers in WSN.",
            "Radio Resource Management of Composite Wireless Networks: Predictive and Reactive Approaches.",
            "Mobile Data Offloading through Opportunistic Communications and Social Participation.",
            "Distributed and Online Fair Resource Management in Video Surveillance Sensor Networks.",
            "Enhancing Privacy and Accuracy in Probe Vehicle-Based Traffic Monitoring via Virtual Trip Lines.",
            "Directed by Directionality: Benefiting from the Gain Pattern of Active RFID Badges.",
            "Resource-Aware Video Multicasting via Access Gateways in Wireless Mesh Networks.",
            "Low Power Consumption Solutions for Mobile Instant Messaging.",
            "Modeling and Performance Analysis for Duty-Cycled MAC Protocols with Applications to S-MAC and X-MAC.",
            "A Novel MAC Scheme for Multichannel Cognitive Radio Ad Hoc Networks.",
            "Robust Relative Location Estimation in Wireless Sensor Networks with Inexact Position Problems.",
            "A Fade-Level Skew-Laplace Signal Strength Model for Device-Free Localization with Wireless Networks.",
            "Error Resilient Estimation and Adaptive Binary Selection for Fast and Reliable Identification of RFID Tags in Error-Prone Channel.",
            "Converge Cast: On the Capacity and Delay Tradeoffs.",
            "Characterizing the Security Implications of Third-Party Emergency Alert Systems over Cellular Text Messaging Services.",
            "On the Cost of Knowledge of Mobility in Dynamic Networks: An Information-Theoretic Approach.",
            "Moderated Group Authoring System for Campus-Wide Workgroups.",
            "Positional Accuracy Measurement and Error Modeling for Mobile Tracking.",
            "Mining Spectrum Usage Data: A Large-Scale Spectrum Measurement Study.",
            "Investigation of Context Prediction Accuracy for Different Context Abstraction Levels.",
            "Compressed-Sensing-Enabled Video Streaming for Wireless Multimedia Sensor Networks.",
            "Network Coding in Cooperative Communications: Friend or Foe?",
            "Detection of Selfish Manipulation of Carrier Sensing in 802.11 Networks.",
            "Efficient Virtual Backbone Construction with Routing Cost Constraint in Wireless Networks Using Directional Antennas.",
            "The Boomerang Protocol: Tying Data to Geographic Locations in Mobile Disconnected Networks.",
            "ProSpect: A Proactive Spectrum Handoff Framework for Cognitive Radio Ad Hoc Networks without Common Control Channel.",
            "Local Construction of Spanners in the 3D Space.",
            "An MIMO Configuration Mode and MCS Level Selection Scheme by Fuzzy Q-Learning for HSPA⁺ Systems.",
            "Leveraging the Algebraic Connectivity of a Cognitive Network for Routing Design.",
            "OMAN: A Mobile Ad Hoc Network Design System.",
            "A Cost Analysis Framework for NEMO Prefix Delegation-Based Schemes.",
            "Nature-Inspired Self-Organization, Control, and Optimization in Heterogeneous Wireless Networks.",
            "Energy-Efficient Cooperative Video Distribution with Statistical QoS Provisions over Wireless Networks.",
            "Approximation Algorithms for Data Broadcast in Wireless Networks.",
            "Understanding Node Localizability of Wireless Ad Hoc and Sensor Networks.",
            "Controlled Mobility Sensor Networks for Target Tracking Using Ant Colony Optimization.",
            "Fast Release/Capture Sampling in Large-Scale Sensor Networks.",
            "Game-Theoretic Analysis of Cooperation Incentive Strategies in Mobile Ad Hoc Networks.",
            "Channel Estimation for Opportunistic Spectrum Access: Uniform and Random Sensing.",
            "Side Channel: Bits over Interference.",
            "Modeling and Performance Evaluation of Backoff Misbehaving Nodes in CSMA/CA Networks.",
            "STORM: A Framework for Integrated Routing, Scheduling, and Traffic Management in Ad Hoc Networks.",
            "Using Rotatable and Directional (R&D) Sensors to Achieve Temporal Coverage of Objects and Its Surveillance Application.",
            "Efficient and Fair Bandwidth Allocation in Multichannel Cognitive Radio Networks.",
            "On the Vulnerabilities of CSI in MIMO Wireless Communication Systems.",
            "Two-Tiered Constrained Relay Node Placement in Wireless Sensor Networks: Computational Complexity and Efficient Approximations.",
            "Delay Optimal Scheduling for Cognitive Radios with Cooperative Beamforming: A Structured Matrix-Geometric Method.",
            "Sensing Driver Phone Use with Acoustic Ranging through Car Speakers.",
            "E-MiLi: Energy-Minimizing Idle Listening in Wireless Networks.",
            "FLUID: Improving Throughputs in Enterprise Wireless LANs through Flexible Channelization.",
            "Message Drop and Scheduling in DTNs: Theory and Practice.",
            "Adaptive In-Network Processing for Bandwidth and Energy Constrained Mission-Oriented Multihop Wireless Networks.",
            "Modeling and Analysis for Spectrum Handoffs in Cognitive Radio Networks.",
            "An Iterative Algorithm for Trust Management and Adversary Detection for Delay-Tolerant Networks.",
            "Optimal Pipeline Paging Load Balancing for Hierarchical Cellular Networks.",
            "Thwarting Control-Channel Jamming Attacks from Inside Jammers.",
            "Modeling and Optimization of Medium Access in CSMA Wireless Networks with Topology Asymmetry.",
            "Self-Adaptive On-Demand Geographic Routing for Mobile Ad Hoc Networks.",
            "Power Modeling and Optimization for OLED Displays.",
            "Connectivity Analysis of One-Dimensional Ad Hoc Networks with Arbitrary Spatial Distribution for Variable and Fixed Number of Nodes.",
            "Cluster-Based Control Channel Allocation in Opportunistic Cognitive Radio Networks.",
            "Two Couple-Resolution Blocking Protocols on Adaptive Query Splitting for RFID Tag Identification.",
            "Optimization-Based Distributed Algorithms for Mobile Data Gathering in Wireless Sensor Networks.",
            "Collaborative and Distributed Search System with Mobile Devices.",
            "Stochastic Vector Mobility Model for Mobile and Vehicular Ad Hoc Network Simulation.",
            "Energy-Efficient Video Multicast in 4G Wireless Systems.",
            "Trajectory-Based Statistical Forwarding for Multihop Infrastructure-to-Vehicle Data Delivery.",
            "Tight Performance Bounds of Multihop Fair Access for MAC Protocols in Wireless Sensor Networks and Underwater Sensor Networks.",
            "Elevator-Assisted Sensor Data Collection for Structural Health Monitoring.",
            "Design and Analysis of Transmission Strategies in Channel-Hopping Cognitive Radio Networks.",
            "IMeX: Intergateway Cross-Layer Handoffs in Internet-Based Infrastructure Wireless Mesh Networks.",
            "Optimal Hop Distance and Power Control for a Single Cell, Dense, Ad Hoc Wireless Network.",
            "Indoor Location Estimation with Reduced Calibration Exploiting Unlabeled Data via Hybrid Generative/Discriminative Learning.",
            "Multicast Capacity Scaling Laws for Multihop Cognitive Networks.",
            "Enhanced Fast Base Station Switching.",
            "Exploiting Spatial, Frequency, and Multiuser Diversity in 3GPP LTE Cellular Networks.",
            "Admission and Eviction Control of Cognitive Radio Users at Wi-Fi 2.0 Hotspots.",
            "Cross-Layer Optimization of Correlated Data Gathering in Wireless Sensor Networks.",
            "WiMAX/OFDMA Burst Scheduling Algorithm to Maximize Scheduled Data.",
            "Duopoly Competition in Dynamic Spectrum Leasing and Pricing.",
            "Using Partially Overlapping Channels to Improve Throughput in Wireless Mesh Networks.",
            "Structural Analysis of User Association Patterns in University Campus Wireless LANs.",
            "Spectrum: Lightweight Hybrid Address Autoconfiguration Protocol Based on Virtual Coordinates for 6LoWPAN.",
            "PET: Probabilistic Estimating Tree for Large-Scale RFID Estimation.",
            "A Comment on \"MABS: Multicast Authentication Based on Batch Signature\".",
            "Opportunistic Retransmission in WLANs.",
            "Position and Movement Detection of Wireless Sensor Network Devices Relative to a Landmark Graph.",
            "Received-Signal-Strength-Based Indoor Positioning Using Compressive Sensing.",
            "Distributed Fault-Tolerance for Event Detection Using Heterogeneous Wireless Sensor Networks.",
            "Dual Decomposition for Computational Optimization of Minimum-Power Shared Broadcast Tree in Wireless Networks.",
            "Exploiting Spectrum Heterogeneity in Dynamic Spectrum Market.",
            "Handover Incentives for Self-Interested WLANs with Overlapping Coverage.",
            "Omnidirectional Mobile NLOS Identification and Localization via Multiple Cooperative Nodes.",
            "A 6LoWPAN Sensor Node Mobility Scheme Based on Proxy Mobile IPv6.",
            "On the Throughput Capacity of Heterogeneous Wireless Networks.",
            "Efficient Distributed Algorithms for Dynamic Access to Shared Multiuser Channels in SINR-Constrained Wireless Networks.",
            "CapEst: A Measurement-Based Approach to Estimating Link Capacity in Wireless Networks.",
            "Temporal Correlation of Interference in Wireless Networks with Rayleigh Block Fading.",
            "Sum Rate Increase via Variable Interference Protection.",
            "The X Loss: Band-Mix Selection for Opportunistic Spectrum Accessing with Uncertain Spectrum Supply from Primary Service Providers."
        ]
    },
    {
        "name": "TMC",
        "year": "2011",
        "info": "Volume 10, 2011",
        "count": 131,
        "papers": [
            "Editorial: Farewell and Introduction to the New Editor-in-Chief.",
            "Editorial: A Message from the New Editor-in-Chief.",
            "Bidirectionally Coupled Network and Road Traffic Simulation for Improved IVC Analysis.",
            "Secure Multihop Network Programming with Multiple One-Way Key Chains.",
            "Mobility Tracking Based on Autoregressive Models.",
            "Localization of Mobile Nodes in Wireless Networks with Correlated in Time Measurement Noise.",
            "Context-Based Network Estimation for Energy-Efficient Ubiquitous Wireless Connectivity.",
            "Distributed Multi-Interface Multichannel Random Access Using Convex Optimization.",
            "Explicit Congestion Control Algorithms for Time Varying Capacity Media.",
            "A Privacy-Preserving Location Monitoring System for Wireless Sensor Networks.",
            "Channel-Aware Routing in MANETs with Route Handoff.",
            "Performance of Cognitive Radio-Based Wireless Mesh Networks.",
            "Type-Aware Error Control for Robust Interactive Video Services over Time-Varying Wireless Channels.",
            "In-Network Computation in Random Wireless Networks: A PAC Approach to Constant Refresh Rates with Lower Energy Costs.",
            "A Spectrum Decision Framework for Cognitive Radio Networks.",
            "Distributed Fault-Tolerant Quality of Wireless Networks.",
            "A Medium Access Control Scheme for Wireless LANs with Constant-Time Contention.",
            "Secret Key Establishment Using Temporally and Spatially Correlated Wireless Channel Coefficients.",
            "Rendezvous for Cognitive Radios.",
            "OFDM-Based Common Control Channel Design for Cognitive Radio Ad Hoc Networks.",
            "Cognitive Medium Access: Exploration, Exploitation, and Competition.",
            "An Improved Geocast for Mobile Ad Hoc Networks.",
            "Anticollision Protocols for Single-Reader RFID Systems: Temporal Analysis and Optimization.",
            "Security Games for Vehicular Networks.",
            "Discriminant Minimization Search for Large-Scale RF-Based Localization Systems.",
            "On the Design of Opportunistic MAC Protocols for Multihop Wireless ; Networks with Beamforming Antennas.",
            "Processing Continuous Range Queries with Spatiotemporal Tolerance.",
            "Scalable Localization with Mobility Prediction for Underwater Sensor Networks.",
            "Design and Performance Analysis of Mobility Management Schemes Based on Pointer Forwarding for Wireless Mesh Networks.",
            "Adaptive Location-Oriented Content Delivery in Delay-Sensitive Pervasive Applications.",
            "Efficient Location Training Protocols for Heterogeneous Sensor and Actor Networks.",
            "Scalable Network Synchronization with Pulse-Coupled Oscillators.",
            "Flexible Broadcasting of Scalable Video Streams to Heterogeneous Mobile Devices.",
            "Throughput-Lifetime Trade-Offs in Multihop Wireless Networks under an SINR-Based Interference Model.",
            "Expected Routing Overhead for Location Service in MANETs under Flat Geographic Routing.",
            "Temporal Link Signature Measurements for Location Distinction.",
            "Spatial-Temporal Coverage Optimization in Wireless Sensor Networks.",
            "Minimum Bandwidth Reservations for Periodic Streams in Wireless Real-Time Systems.",
            "A Cooperative Clustering Protocol for Energy Saving of Mobile Devices with WLAN and Bluetooth Interfaces.",
            "A Distributed and Scalable Time Slot Allocation Protocol for Wireless Sensor Networks.",
            "On the Information Flow Required for Tracking Control in Networks of Mobile Sensing Agents.",
            "Dynamic Time Slot Partitioning for Multimedia Transmission in Two-Hop Cellular Networks.",
            "Supporting Efficient and Scalable Multicasting over Mobile Ad Hoc Networks.",
            "Throughput Optimization in Mobile Backbone Networks.",
            "Optimal Channel Access Management with QoS Support for Cognitive Vehicular Networks.",
            "Efficient Data Collection in Wireless Sensor Networks with Path-Constrained Mobile Sinks.",
            "Changes to TMC and its Editorial Board.",
            "See-Through Walls: Motion Tracking Using Variance-Based Radio Tomography Networks.",
            "QoS-Aware Routing and Admission Control in Shadow-Fading Environments for Multirate MANETs.",
            "Optimal Stochastic Location Updates in Mobile Ad Hoc Networks.",
            "Secure High-Throughput Multicast Routing in Wireless Mesh Networks.",
            "Design and Performance of an Optimal Inertial Power Harvester for Human-Powered Devices.",
            "Endpoint-Based Call Admission Control and Resource Management for VoWLAN.",
            "MAC Layer Throughput Estimation in Impulse-Radio UWB Networks.",
            "Interference-Aware Routing in Wireless Multihop Networks.",
            "Dynamic Conflict-Free Transmission Scheduling for Sensor Network Queries.",
            "Correction to \"Scalable Network Synchronization with Pulse-Coupled Oscillators\".",
            "Autonomous Deployment of Heterogeneous Mobile Sensors.",
            "Fast Detection of Mobile Replica Node Attacks in Wireless Sensor Networks Using Sequential Hypothesis Testing.",
            "The HIDENETS Holistic Approach for the Analysis of Large Critical Mobile Systems.",
            "Traffic-Differentiation-Based Modular QoS Localized Routing for Wireless Sensor Networks.",
            "Cross-Layer Optimization for Multimedia Transport over Multicode CDMA Networks.",
            "Breath: An Adaptive Protocol for Industrial Control Applications Using Wireless Sensor Networks.",
            "Multicast Throughput for Hybrid Wireless Networks under Gaussian Channel Model.",
            "Effective Scheduling in Infrastructure-Based Cognitive Radio Networks.",
            "Data Delivery Properties of Human Contact Networks.",
            "Mobile Sampling of Sensor Field Data Using Controlled Broadcast.",
            "A Control-Theoretic Approach to Distributed Optimal Configuration of 802.11 WLANs.",
            "Time-Space Sampling and Mobile Device Calibration for WiFi Indoor Location Systems.",
            "Energy-Balanced Transmission Policies for Wireless Sensor Networks.",
            "Performance Characteristics of an Operational WiMAX Network.",
            "Maximizing Capacity in Multihop Cognitive Radio Networks under the SINR Model.",
            "MODELZ: Monitoring, Detection, and Analysis of Energy-Greedy Anomalies in Mobile Handsets.",
            "A Distributed Spatial-Temporal Similarity Data Storage Scheme in Wireless Sensor Networks.",
            "ESIP: Secure Incentive Protocol with Limited Use of Public-Key Cryptography for Multihop Wireless Networks.",
            "Performance of Joint Spectrum Sensing and MAC Algorithms for Multichannel Opportunistic Spectrum Access Ad Hoc Networks.",
            "Hierarchical Deployment Optimization for Wireless Sensor Networks.",
            "Joint Spectrum Allocation and Power Control for Multihop Cognitive Radio Networks.",
            "Modeling and Improving TCP Performance over Cellular Link with Variable Bandwidth.",
            "Analysis of Best Channel Feedback and Its Adaptive Algorithms for Multicarrier Wireless Data Systems.",
            "Towards Zero Retransmission Overhead: A Symbol Level Network Coding Approach to Retransmission.",
            "Stealthy Attacks in Wireless Ad Hoc Networks: Detection and Countermeasure.",
            "Secure Network Mobility (SeNEMO) for Real-Time Applications.",
            "Integration Gain of Heterogeneous WiFi/WiMAX Networks.",
            "MAP: Multiauctioneer Progressive Auction for Dynamic Spectrum Access.",
            "On the Effectiveness of Monitoring for Intrusion Detection in Mobile Ad Hoc Networks.",
            "Optimal and Efficient Graph-Based Resource Allocation Algorithms for Multiservice Frame-Based OFDMA Networks.",
            "Compatibility between Three Well-Known Broadcast Tree Construction Algorithms and Various Metrics.",
            "Common Radio Resource Management Algorithms for Multimedia Heterogeneous Wireless Networks.",
            "Exploiting Virtual Coordinates for Improved Routing Performance in Sensor Networks.",
            "ConverSS: A Hybrid MAC/Routing Solution for Small-Scale, Convergecast Wireless Networks.",
            "Managing Power Saving Classes in IEEE 802.16 Wireless MANs: A Fold-and-Demultiplex Method.",
            "Modeling Nonsaturated IEEE 802.11 DCF Networks Utilizing an Arbitrary Buffer Size.",
            "A Set-Theoretic Approach to Collaborative Position Location for Wireless Networks.",
            "Reduced Complexity Semidefinite Relaxation Algorithms for Source Localization Based on Time Difference of Arrival.",
            "Adaptive Asynchronous Sleep Scheduling Protocols for Delay Tolerant Networks.",
            "Design of Novel Node Distribution Strategies in Corona-Based Wireless Sensor Networks.",
            "Verifiable Privacy-Preserving Sensor Network Storage for Range Query.",
            "Hedonic Coalition Formation for Distributed Task Allocation among Wireless Agents.",
            "ALARM: Anonymous Location-Aided Routing in Suspicious MANETs.",
            "An Analysis of IEEE 802.11 DCF and Its Application to Energy-Efficient Relaying in Multihop Wireless Networks.",
            "The Capacity of Wireless Ad Hoc Networks Using Directional Antennas.",
            "Timer-Based CDS Construction in Wireless Ad Hoc Networks.",
            "A Lightweight and Density-Aware Reprogramming Protocol for Wireless Sensor Networks.",
            "Wireless Fountain Coding with IEEE 802.11e Block ACK for Media Streaming in Wireline-cum-WiFi Networks: A Performance Study.",
            "Secure Cooperative Sensing in IEEE 802.22 WRANs Using Shadow Fading Correlation.",
            "Lifetime Analysis of Random Event-Driven Clustered Wireless Sensor Networks.",
            "Data Compression by Temporal and Spatial Correlations in a Body-Area Sensor Network: A Case Study in Pilates Motion Recognition.",
            "On Efficient and Scalable Support of Continuous Queries in Mobile Peer-to-Peer Environments.",
            "When In-Network Processing Meets Time: Complexity and Effects of Joint Optimization in Wireless Sensor Networks.",
            "On the Throughput of MIMO-Empowered Multihop Cognitive Radio Networks.",
            "Strictly Localized Sensor Self-Deployment for Optimal Focused Coverage.",
            "Sweep Coverage with Mobile Sensors.",
            "Model and Protocol for Energy-Efficient Routing over Mobile Ad Hoc Networks.",
            "Optimal Resource Allocation for Pervasive Health Monitoring Systems with Body Sensor Networks.",
            "BUBBLE Rap: Social-Based Forwarding in Delay-Tolerant Networks.",
            "Investment and Pricing with Spectrum Uncertainty: A Cognitive Operator's Perspective.",
            "Feedback-Based Closed-Loop Carrier Synchronization: A Sharp Asymptotic Bound, an Asymptotically Optimal Approach, Simulations, and Experiments.",
            "Recognizing Multiuser Activities Using Wireless Body Sensor Networks.",
            "Gossip-Enabled Stochastic Channel Negotiation for Cognitive Radio Ad Hoc Networks.",
            "Photo Retrieval Based on Spatial Layout with Hardware Acceleration for Mobile Devices.",
            "Editorial.",
            "Cooperating with Smartness: Using Heterogeneous Smart Antennas in Multihop Wireless Networks.",
            "A Lightweight Passive Online Detection Method for Pinpointing Misbehavior in WLANs.",
            "MUSTER: Adaptive Energy-Aware Multisink Routing in Wireless Sensor Networks.",
            "Information Dissemination between Mobile Nodes for Collaborative Context Awareness.",
            "Deterministic Backoff: Toward Efficient Polling for IEEE 802.11e HCCA in Wireless Home Networks.",
            "Dynamic Switching-Based Data Forwarding for Low-Duty-Cycle Wireless Sensor Networks.",
            "Density-Aware Routing in Highly Dynamic DTNs: The RollerNet Case.",
            "Compressive Cooperative Sensing and Mapping in Mobile Networks.",
            "QoS-Based Adaptive Contention/Reservation Medium Access Control Protocols for Wireless Local Area Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2010",
        "info": "Volume 9, 2010",
        "count": 130,
        "papers": [
            "State of the Transactions.",
            "Robust Multilayer Control for Enhanced Wireless Telemedical Video Streaming.",
            "High-Rate Uncorrelated Bit Extraction for Shared Secret Key Generation from Channel Measurements.",
            "Juggler: Virtual Networks for Fun and Profit.",
            "Energy-Aware Tag Anticollision Protocols for RFID Systems.",
            "Reliable Anchor-Based Sensor Localization in Irregular Areas.",
            "Distributed Energy Optimization for Target Tracking in Wireless Sensor Networks.",
            "Adaptive Physical Carrier Sense in Topology-Controlled Wireless Networks.",
            "An Asymmetric and Asynchronous Energy Conservation Protocol for Vehicular Networks.",
            "Beacon-Assisted Spectrum Access with Cooperative Cognitive Transmitter and Receiver.",
            "Optimal Speed Control of Mobile Node for Data Collection in Sensor Networks.",
            "Relay Node Deployment Strategies in Heterogeneous Wireless Sensor Networks.",
            "Handling Mobility in Wireless Sensor and Actor Networks.",
            "Multiple RFID Tags Access Algorithm.",
            "Handoff Performance in Wireless Mobile Networks with Unreliable Fading Channel.",
            "A Multichannel Scheduler for High-Speed Wireless Backhaul Links with Packet Concatenation.",
            "Cost Analysis of Short Message Retransmissions.",
            "MAC for Networks with Multipacket Reception Capability and Spatially Distributed Nodes.",
            "Quantifying Impact of Mobility on Data Availability in Mobile Ad Hoc Networks.",
            "Optimal Relay Station Placement in Broadband Wireless Access Networks.",
            "Asymptotic Distortion Performance of Source-Channel Diversity over Multihop and Relay Channels.",
            "Superdiffusive Behavior of Mobile Nodes and Its Impact on Routing Protocol Performance.",
            "Stochastic Traffic Engineering in Multihop Cognitive Wireless Mesh Networks.",
            "Exploiting Reactive Mobility for Collaborative Target Detection in Wireless Sensor Networks.",
            "Enabling Efficient Peer-to-Peer Resource Sharing in Wireless Mesh Networks.",
            "Power Control and Channel Allocation in Cognitive Radio Networks with Primary Users' Cooperation.",
            "Efficient and Robust Local Mutual Exclusion in Mobile Ad Hoc Networks.",
            "A Metric for DISH Networks: Analysis, Implications, and Applications.",
            "Activity-Based Proactive Data Management in Mobile Environments.",
            "Intelligent Dynamic Radio Tracking in Indoor Wireless Local Area Networks.",
            "Dealing with Selfishness and Moral Hazard in Noncooperative Wireless Networks.",
            "Optimal Patterns for Four-Connectivity and Full Coverage in Wireless Sensor Networks.",
            "On Fast and Accurate Detection of Unauthorized Wireless Access Points Using Clock Skews.",
            "Extended Knowledge-Based Reasoning Approach to Spectrum Sensing for Cognitive Radio.",
            "An Edge-Constrained Localized Delaunay Graph for Geographic Routing in Mobile Ad Hoc and Sensor Networks.",
            "Local Barrier Coverage in Wireless Sensor Networks.",
            "Distributed Relay-Assignment Protocols for Coverage Expansion in Cooperative Wireless Networks.",
            "Distributed Localization Scheme for Mobile Sensor Networks.",
            "Energy-Optimal Scheduling with Dynamic Channel Acquisition in Wireless Downlinks.",
            "On Multihop Distances in Wireless Sensor Networks with Random Node Locations.",
            "Joint Routing, Channel Assignment, and Scheduling for Throughput Maximization in General Interference Models.",
            "Energy-Efficient VoIP over Wireless LANs.",
            "Rules of Designing Routing Metrics for Greedy, Face, and Combined Greedy-Face Routing.",
            "DCAR: Distributed Coding-Aware Routing in Wireless Networks.",
            "Exploiting and Defending Opportunistic Scheduling in Cellular Data Networks.",
            "Radio Tomographic Imaging with Wireless Networks.",
            "A Mixed-Norm Approach Using Simulated Annealing with Changeable Neighborhood for Mobile Location Estimation.",
            "Fault-Tolerant Relay Node Placement in Heterogeneous Wireless Sensor Networks.",
            "Modeling Power Saving Protocols for Multicast Services in 802.11 Wireless LANs.",
            "Schedule Adaptation of Low-Power-Listening Protocols for Wireless Sensor Networks.",
            "A Scalable and Energy-Efficient Context Monitoring Framework for Mobile Personal Sensor Networks.",
            "Energy-Efficient Reprogramming of a Swarm of Mobile Sensors.",
            "Emergent Slot Synchronization in Wireless Networks.",
            "SIP-Based IMS Signaling Analysis for WiMax-3G Interworking Architectures.",
            "Threshold-Based Media Streaming Optimization for Heterogeneous Wireless Networks.",
            "Achievable Capacity in Hybrid DS-CDMA/OFDM Spectrum-Sharing.",
            "SSUM: Smart Server Update Mechanism for Maintaining Cache Consistency in Mobile Environments.",
            "QELAR: A Machine-Learning-Based Adaptive Routing Protocol for Energy-Efficient and Lifetime-Extended Underwater Sensor Networks.",
            "Secure Distance-Based Localization in the Presence of Cheating Beacon Nodes.",
            "Combined Authentication-Based Multilevel Access Control in Mobile Application for DailyLifeService.",
            "Maximum Achievable Throughput in Multiband Multiantenna Wireless Mesh Networks.",
            "A Coverage Inference Protocol for Wireless Sensor Networks.",
            "Optimal Accounting Policies for AAA Systems in Mobile Telecommunications Networks.",
            "Modeling and Optimizing IEEE 802.11 DCF for Long-Distance Links.",
            "Accurate and Energy-Efficient Range-Free Localization for Mobile Sensor Networks.",
            "Localized Multicast: Efficient and Distributed Replica Detection in Large-Scale Sensor Networks.",
            "TDMA Scheduling with Optimized Energy Efficiency and Minimum Delay in Clustered Wireless Sensor Networks.",
            "Secure Data Collection in Wireless Sensor Networks Using Randomized Dispersive Routes.",
            "Radio Sleep Mode Optimization in Wireless Sensor Networks.",
            "Optimal Cooperative Relaying Schemes in IR-UWB Networks.",
            "MABS: Multicast Authentication Based on Batch Signature.",
            "VEBEK: Virtual Energy-Based Encryption and Keying for Wireless Sensor Networks.",
            "Reducing Power Consumption with QoS Constraints in IEEE 802.16e Wireless Networks.",
            "Channel Assignment for Multihop Cellular Networks: Minimum Delay.",
            "Uncertainty Modeling and Reduction in MANETs.",
            "A Distributed Contention Vector Division Multiple Access (D-CVDMA) Protocol for Wireless Networks.",
            "Providing Service Guarantees in 802.11e EDCA WLANs with Legacy Stations.",
            "SAMAC: A Cross-Layer Communication Protocol for Sensor Networks with Sectored Antennas.",
            "Achieving Guaranteed Anonymity in GPS Traces via Uncertainty-Aware Path Cloaking.",
            "A Better Approximation Algorithm for Computing Connected Dominating Sets in Unit Ball Graphs.",
            "Optimal Jamming Attack Strategies and Network Defense Policies in Wireless Sensor Networks.",
            "On the Performance Bounds of Practical Wireless Network Coding.",
            "Controlled Wi-Fi Sharing in Cities: A Decentralized Approach Relying on Indirect Reciprocity.",
            "Maximizing the Lifetime of a Barrier of Wireless Sensors.",
            "Decentralized QoS-Aware Checkpointing Arrangement in Mobile Grid Computing.",
            "Maximizing Rewards in Wireless Networks with Energy and Timing Constraints for Periodic Data Streams.",
            "Distributional Convergence of Intermeeting Times under the Generalized Hybrid Random Walk Mobility Model.",
            "Unwanted Link Layer Traffic in Large IEEE 802.11 Wireless Networks.",
            "Sustainable Throughput of Wireless LANs with Multipacket Reception Capability under Bounded Delay-Moment Requirements.",
            "A Belief Evaluation Framework in Autonomous MANETs under Noisy and Imperfect Observation: Vulnerability Analysis and Cooperation Enforcement.",
            "Distributed Multilevel Hierarchic Strategy for Broadcast Collaborative Mobile Networks.",
            "Interference Management and Rate Adaptation in OFDM-Based UWB Networks.",
            "A Novel Dual-Index Design to Efficiently Support Snapshot Location-Based Query Processing in Mobile Environments.",
            "Efficient Load-Aware Routing Scheme for Wireless Mesh Networks.",
            "Maximizing the Lifetime of Wireless Sensor Networks with Mobile Sink in Delay-Tolerant Applications.",
            "Back-of-the-Envelope Computation of Throughput Distributions in CSMA Wireless Networks.",
            "Detection and Tracking Using Particle-Filter-Based Wireless Sensor Networks.",
            "Efficient Coverage Maintenance Based on Probabilistic Distributed Detection.",
            "Economy of Spectrum Access in Time Varying Multichannel Networks.",
            "Power Law and Exponential Decay of Intercontact Times between Mobile Devices.",
            "A Stable Online Algorithm for Energy-Efficient Multiuser Scheduling.",
            "DGRAM: A Delay Guaranteed Routing and MAC Protocol for Wireless Sensor Networks.",
            "Mobile Location Estimation Using Fuzzy-Based IMM and Data Fusion.",
            "Optimize Storage Placement in Sensor Networks.",
            "Bandwidth Recycling in IEEE 802.16 Networks.",
            "Decentralized Variational Filtering for Target Tracking in Binary Sensor Networks.",
            "Cross-Layer Quality Assessment of Scalable Video Services on Mobile Embedded Systems.",
            "An Interlaced Extended Information Filter for Self-Localization in Sensor Networks.",
            "Editorial: Inttroduction of New Associate Editors.",
            "Duty Cycle Control for Low-Power-Listening MAC Protocols.",
            "Exploiting Microscopic Spectrum Opportunities in Cognitive Radio Networks via Coordinated Channel Access.",
            "Rate Adaptation in Congested Wireless Networks through Real-Time Measurements.",
            "Accuracy Performance Analysis between War Driving and War Walking in Metropolitan Wi-Fi Localization.",
            "On Nodal Encounter Patterns in Wireless LAN Traces.",
            "XLP: A Cross-Layer Protocol for Efficient Communication in Wireless Sensor Networks.",
            "Multihop Range-Free Localization in Anisotropic Wireless Sensor Networks: A Pattern-Driven Scheme.",
            "Integrity Regions: Authentication through Presence in Wireless Networks.",
            "Cross-Layer Sleep Scheduling Design in Service-Oriented Wireless Sensor Networks.",
            "Comparison of Data-Driven Link Estimation Methods in Low-Power Wireless Networks.",
            "A Biased Random Walk Routing Protocol for Wireless Sensor Networks: The Lukewarm Potato Protocol.",
            "Guest Editorial: Special Section on Papers from MobiSys 2009.",
            "SPATE: Small-Group PKI-Less Authenticated Trust Establishment.",
            "Design, Realization, and Evaluation of xShare for Impromptu Sharing of Mobile Phones.",
            "Fidelity-Aware Replication for Mobile Devices.",
            "Wifi-Reports: Improving Wireless Network Selection with Collaboration.",
            "Approximation Algorithms for a Link Scheduling Problem in Wireless Relay Networks with QoS Guarantee.",
            "SYNAPSE++: Code Dissemination in Wireless Sensor Networks Using Fountain Codes.",
            "In-Band Spectrum Sensing in IEEE 802.22 WRANs for Incumbent Protection.",
            "Access Strategies for Spectrum Sharing in Fading Environment: Overlay, Underlay, and Mixed.",
            "CA-TSL: Energy Adaptation for Targeted System Lifetime in Sparse Mobile Ad Hoc Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2009",
        "info": "Volume 8, 2009",
        "count": 120,
        "papers": [
            "Distributed Algorithm for En Route Aggregation Decision in Wireless Sensor Networks.",
            "TCP-Aware Channel Allocation in CDMA Networks.",
            "Energy-Efficient Boundary Detection for RF-Based Localization Systems.",
            "Robust Rate Control for Heterogeneous Network Access in Multihomed Environments.",
            "Multicasting with Localized Control in Wireless Ad Hoc Networks.",
            "A Cross-Layer Framework for Association Control in Wireless Mesh Networks.",
            "Utility-Based Rate-Controlled Parallel Wireless Transmission of Multimedia Streams with Multiple Importance Levels.",
            "Handoff with DSP Support: Enabling Seamless Voice Communications across Heterogeneous Telephony Systems on Dual-Mode Mobile Devices.",
            "Data Broadcast with Adaptive Network Coding in Heterogeneous Wireless Networks.",
            "A Scheduling Algorithm with Dynamic Priority Assignment for WCDMA Systems.",
            "Contention-Aware Performance Analysis of Mobility-Assisted Routing.",
            "Optimal Radio Resource Partition for Joint Contention- and Connection-Oriented Multichannel Access in OFDMA Systems.",
            "Headlight Prefetching and Dynamic Chaining for Cooperative Media Streaming in Mobile Environments.",
            "Hop Constrained Energy-Efficient Broadcasting: Insights from Massively Dense Ad Hoc Networks.",
            "Minimizing Recovery State in Geographic Ad Hoc Routing.",
            "Using Local Geometry for Tunable Topology Control in Sensor Networks.",
            "Efficient Broadcasting in Mobile Ad Hoc Networks.",
            "CAR: Context-Aware Adaptive Routing for Delay-Tolerant Mobile Networks.",
            "An Access Delay Model for IEEE 802.11e EDCA.",
            "Distance Reduction in Mobile Wireless Communication: Lower Bound Analysis and Practical Attainment.",
            "Information Density Estimation for Content Retrieval in MANETs.",
            "A Flexible Privacy-Enhanced Location-Based Services System Framework and Practice.",
            "Cost- and Collision-Minimizing Forwarding Schemes for Wireless Sensor Networks: Design, Analysis and Experimental Validation.",
            "Cooperative Asynchronous Multichannel MAC: Design, Analysis, and Implementation.",
            "Modeling Propagation Dynamics of Bluetooth Worms (Extended Version).",
            "Overlapped Carrier-Sense Multiple Access (OCSMA) in Wireless Ad Hoc Networks.",
            "Exploiting In-Zone Broadcasts for Cache Sharing in Mobile Ad Hoc Networks.",
            "Passive Online Detection of 802.11 Traffic Using Sequential Hypothesis Testing with TCP ACK-Pairs.",
            "An Epidemic Theoretic Framework for Vulnerability Analysis of Broadcast Protocols in Wireless Sensor Networks.",
            "A Tabu Search Algorithm for Cluster Building in Wireless Sensor Networks.",
            "BSMR: Byzantine-Resilient Secure Multicast Routing in Multihop Wireless Networks.",
            "Local Construction of Near-Optimal Power Spanners for Wireless Ad Hoc Networks.",
            "Maximizing Unavailability Interval for Energy Saving in IEEE 802.16e Wireless MANs.",
            "Rotation of CDS via Connected Domatic Partition in Ad Hoc Sensor Networks.",
            "Biased Random Walks in Uniform Wireless Networks.",
            "Many-to-One Throughput Capacity of IEEE 802.11 Multihop Wireless Networks.",
            "Model-Based Techniques for Data Reliability in Wireless Sensor Networks.",
            "Probabilistic Discovery of Semantically Diverse Content in MANETs.",
            "Fast Intra-Network and Cross-Layer Handover (FINCH) for WiMAX and Mobile Internet.",
            "Effects of Location Awareness on Concurrent Transmissions for Cognitive Ad Hoc Networks Overlaying Infrastructure-Based Systems.",
            "Topology Management in Directional Antenna-Equipped Ad Hoc Networks.",
            "Social Network Analysis for Information Flow in Disconnected Delay-Tolerant MANETs.",
            "Energy-Efficient Map Interpolation for Sensor Fields Using Kriging.",
            "Wardrop Routing in Wireless Networks.",
            "Link Estimation and Routing in Sensor Network Backbones: Beacon-Based or Data-Driven?",
            "Energy-Efficient SINR-Based Routing for Multihop Wireless Networks.",
            "Analysis of Cross-Layer Interaction in Multirate 802.11 WLANs.",
            "On Channel Allocation for Heterogeneous Data Broadcasting.",
            "An Integrated Approach to Sensor Role Selection.",
            "Fair Class-Based Downlink Scheduling with Revenue Considerations in Next Generation Broadband Wireless Access Systems.",
            "Cell Breathing Techniques for Load Balancing in Wireless LANs.",
            "A Mobility-Prediction-Based Relay Deployment Framework for Conserving Power in MANETs.",
            "Opportunistic Scheduling with Reliability Guarantees in Cognitive Radio Networks.",
            "Energy Maps for Mobile Wireless Networks: Coherence Time versus Spreading Period.",
            "Shake Well Before Use: Intuitive and Secure Pairing of Mobile Devices.",
            "Maximum-Rate Node Selection for Power-Limited Multiantenna Relay Backbones.",
            "Large Connectivity for Dynamic Random Geometric Graphs.",
            "Connectivity-Guaranteed and Obstacle-Adaptive Deployment Schemes for Mobile Sensor Networks.",
            "TMSP: Terminal Mobility Support Protocol.",
            "Performance Evaluation of Impulse Radio UWB Networks Using Common or Private Acquisition Preambles.",
            "Design of Fair Scheduling Schemes for the QoS-Oriented Wireless LAN.",
            "Joint Throughput Optimization for Wireless Mesh Networks.",
            "Greedy Routing with Anti-Void Traversal for Wireless Sensor Networks.",
            "How Does Multiple-Packet Reception Capability Scale the Performance of Wireless Local Area Networks?",
            "On the Phase Transition Width of K-Connectivity in Wireless Multihop Networks.",
            "Consistency Management Strategies for Data Replication in Mobile Ad Hoc Networks.",
            "Message Authentication in Computationally Constrained Environments.",
            "Distributed Relay Selection and Power Control for Multiuser Cooperative Communication Networks Using Stackelberg Game.",
            "Signaling for Multimedia Conferencing in Stand-Alone Mobile Ad Hoc Networks.",
            "Dynamics of Multiple-Seller and Multiple-Buyer Spectrum Trading in Cognitive Radio Networks: A Game-Theoretic Modeling Approach.",
            "pDCS: Security and Privacy Support for Data-Centric Sensor Networks.",
            "RandomCast: An Energy-Efficient Communication Scheme for Mobile Ad Hoc Networks.",
            "A Gen2-Based RFID Authentication Protocol for Security and Privacy.",
            "Performance of VoIP over Multiple Co-Located IEEE 802.11 Wireless LANs.",
            "On the Planning of Wireless Sensor Networks: Energy-Efficient Clustering under the Joint Routing and Coverage Constraint.",
            "Paired Measurement Localization: A Robust Approach for Wireless Localization.",
            "Information Content-Based Sensor Selection and Transmission Power Adjustment for Collaborative Target Tracking.",
            "Existence of Data and Multiuser Diversities in Noncooperative Mobile Infostation Networks.",
            "Routing in Delay-Tolerant Networks Comprising Heterogeneous Node Populations.",
            "Dynamic versus Static Traffic Policing: A New Approach for Videoconference Traffic over Wireless Cellular Networks.",
            "Route Stability in MANETs under the Random Direction Mobility Model.",
            "On the Security of Route Discovery in MANETs.",
            "Joint Task Migration and Power Management in Wireless Computing.",
            "Dynamic Multiresolution Data Dissemination in Wireless Sensor Networks.",
            "Mitigation of Control Channel Jamming under Node Capture Attacks.",
            "Efficient Uplink Bandwidth Request with Delay Regulation for Real-Time Service in Mobile WiMAX Networks.",
            "Nonparametric Model Comparison and Uncertainty Evaluation for Signal Strength Indoor Location.",
            "Measurement and Analysis of the VoIP Capacity in IEEE 802.11 WLAN.",
            "Application-Aware Acceleration for Wireless Data Networks: Design Elements and Prototype Implementation.",
            "Continuous Monitoring of Spatial Queries in Wireless Broadcast Environments.",
            "Mobility Management Approaches for Mobile IP Networks: Performance Comparison and Use Recommendations.",
            "The Beacon Movement Detection Problem in Wireless Sensor Networks for Localization Applications.",
            "MAC Protocol for Opportunistic Cognitive Radio Networks with Soft Guarantees.",
            "Analysis of Enhanced Collision Avoidance Scheme Proposed for IEEE 802.11e-Enhanced Distributed Channel Access Protocol.",
            "A Novel Scheduled Power Saving Mechanism for 802.11 Wireless LANs.",
            "DRAND: Distributed Randomized TDMA Scheduling for Wireless Ad Hoc Networks.",
            "Exploiting Contact Spatial Dependency for Opportunistic Message Forwarding.",
            "MDPF: Minimum Distance Packet Forwarding for Search Applications in Mobile Ad Hoc Networks.",
            "On the Relevance of Node Isolation to the K-Connectivity of Wireless Optical Sensor Networks.",
            "A Maximum-Residual Multicast Protocol for Large-Scale Mobile Ad Hoc Networks.",
            "Multiradio Channel Allocation in Multihop Wireless Networks.",
            "Fuzzy Q-Learning Admission Control for WCDMA/WLAN Heterogeneous Networks with Multimedia Traffic.",
            "Throughput Behavior in Multihop Multiantenna Wireless Networks.",
            "A Real-Time Intelligent Wireless Mobile Station Location Estimator with Application to TETRA Network.",
            "Minimum Latency Broadcasting in Multiradio, Multichannel, Multirate Wireless Meshes.",
            "Optimal Selective Transmission under Energy Constraints in Sensor Networks.",
            "A Simple and Approximate Model for Nonsaturated IEEE 802.11 DCF.",
            "Route Optimization in Nested NEMO: Classification, Evaluation, and Analysis from NEMO Fringe Stub Perspective.",
            "The Orphan Problem in ZigBee Wireless Networks.",
            "Impacts of Topology and Traffic Pattern on Capacity of Hybrid Wireless Networks.",
            "Improving Spectral and Temporal Efficiency of Collocated IEEE 802.15.4 LR-WPANs.",
            "3D Underwater Sensor Network Localization.",
            "SOAR: Simple Opportunistic Adaptive Routing Protocol for Wireless Mesh Networks.",
            "Optimal Transmission Strategies for Dynamic Spectrum Access in Cognitive Radio Networks.",
            "Matching and Fairness in Threat-Based Mobile Sensor Coverage.",
            "DECODE: Exploiting Shadow Fading to DEtect COMoving Wireless DEvices.",
            "Wireless Location Tracking Algorithms for Environments with Insufficient Signal Sources.",
            "A Lightweight Collaborative Fault Tolerant Target Localization System for Wireless Sensor Networks.",
            "Robust Routing and Scheduling in Wireless Mesh Networks under Dynamic Traffic Conditions.",
            "Repeatable and Realistic Experimentation in Mobile Wireless Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2008",
        "info": "Volume 7, 2008",
        "count": 111,
        "papers": [
            "Protecting Location Privacy with Personalized k-Anonymity: Architecture and Algorithms.",
            "The COMMIT Protocol for Truthful and Cost-Efficient Routing in Ad Hoc Networks with Selfish Nodes.",
            "Improving Throughput and Fairness by Reducing Exposed and Hidden Nodes in 802.11 Networks.",
            "Comparison of Multichannel MAC Protocols.",
            "On Localized Application-Driven Topology Control for Energy-Efficient Wireless Peer-to-Peer File Sharing.",
            "Sequence-Based Localization in Wireless Sensor Networks.",
            "A New Call Admission Control Mechanism for Multimedia Traffic over Next-Generation Wireless Cellular Networks.",
            "Study of Beaconing in Multihop Wireless PAN with Distributed Control.",
            "Boundary Mapping and Boundary-State Routing (BSR) in Ad Hoc Networks.",
            "CDR-MAC: A Protocol for Full Exploitation of Directional Antennas in Ad Hoc Wireless Networks.",
            "Toward In-Band Self-Organization in Energy-Efficient MAC Protocols for Sensor Networks.",
            "Throughput Analysis and Measurements in IEEE 802.11 WLANs with TCP and UDP Traffic Flows.",
            "WiQoSM: An Integrated QoS-Aware Mobility and User Behavior Model for Wireless Data Networks.",
            "GALE: An Enhanced Geometry-Assisted Location Estimation Algorithm for NLOS Environments.",
            "GARUDA: Achieving Effective Reliability for Downstream Communication in Wireless Sensor Networks.",
            "Active Queue Management for Fair Resource Allocation in Wireless Networks.",
            "Trust-Based Fast Authentication for Multiowner Wireless Networks.",
            "Efficient Placement and Dispatch of Sensors in a Wireless Sensor Network.",
            "Bandwidth Efficient Video Multicasting in Multiradio Multicellular Wireless Networks.",
            "Benefit-Based Data Caching in Ad Hoc Networks.",
            "SELECT: Self-Learning Collision Avoidance for Wireless Networks.",
            "Fault-Tolerant Topology Control for All-to-One and One-to-All Communication in Wireles Networks.",
            "A Noncooperative Game-Theoretic Framework for Radio Resource Management in 4G Heterogeneous Wireless Access Networks.",
            "On the Trade-Off between Energy and Multicast Efficiency in 802.16e-Like Mobile Networks.",
            "Message Complexity Analysis of Mobile Ad Hoc Network Address Autoconfiguration Protocols.",
            "Performance Improvements Provided by Route Diversity in Multihop Wireless Networks.",
            "Editorial: EIC Farewell and New EIC Introduction.",
            "Editorial: A Message from the New Editor-in-Chief.",
            "Efficient Resource Allocation for Wireless Multicast.",
            "SICC: Source-Initiated Context Construction in Mobile Ad Hoc Networks.",
            "Robust QoS Control for Single Carrier PMP Mode IEEE 802.16 Systems.",
            "Improving TCP/IP Performance over Third-Generation Wireless Networks.",
            "Distributed Algorithm for Efficient Construction and Maintenance of Connected k-Hop Dominating Sets in Mobile Ad Hoc Networks.",
            "Cross-Layer Interaction of TCP and Ad Hoc Routing Protocols in Multihop IEEE 802.11 Networks.",
            "Secure Location Verification with Hidden and Mobile Base Stations.",
            "General Network Lifetime and Cost Models for Evaluating Sensor Network Deployment Strategies.",
            "Joint Transmitter Power Control and Mobile Cache Management in Wireless Computing.",
            "Airtime Fairness for IEEE 802.11 Multirate Networks.",
            "EIC Editorial.",
            "Efficient Discovery of Spectrum Opportunities with MAC-Layer Sensing in Cognitive Radio Networks.",
            "Design and Performance Study for a Mobility Management Mechanism (WMM) Using Location Cache for Wireless Mesh Networks.",
            "A Hybrid Token-CDMA MAC Protocol for Wireless Ad Hoc Networks.",
            "Lightning: A Hard Real-Time, Fast, and Lightweight Low-End Wireless Sensor Election Protocol for Acoustic Event Localization.",
            "LEDS: Providing Location-Aware End-to-End Data Security in Wireless Sensor Networks.",
            "Topology-Independent Link Activation Scheduling Schemes for Mobile CDMA Ad Hoc Networks.",
            "Time and Energy Complexity of Distributed Computation of a Class of Functions in Wireless Sensor Networks.",
            "A Mutual Network Synchronization Method for Wireless Ad Hoc and Sensor Networks.",
            "Non-Line-of-Sight Localization in Multipath Environments.",
            "Localized Sensor Area Coverage with Low Communication Overhead.",
            "Continuous versus Discrete Model in Autodiagnosis Systems for Wireless Networks.",
            "Mitigating Performance Degradation in Congested Sensor Networks.",
            "Intrusion Detection in Homogeneous and Heterogeneous Wireless Sensor Networks.",
            "Bandwidth-Satisfied Multicast Trees in MANETs.",
            "Understanding the Impact of Interference on Collaborative Relays.",
            "An Empirical Study on the Capacity and Performance of 3G Networks.",
            "QoS-, Queue-, and Channel-Aware Packet Scheduling for Multimedia Services in Multiuser SDMA/TDMA Wireless Systems.",
            "Cross-Layer Optimization for Data Rate Utility Problem in UWB-Based Ad Hoc Networks.",
            "Location-Based Spatial Query Processing in Wireless Broadcast Environments.",
            "Coupons: A Multilevel Incentive Scheme for Information Dissemination in Mobile Networks.",
            "Throughput and Energy-Efficiency-Aware Protocol for Ultrawideband Communication in Wireless Sensor Networks: A Cross-Layer Approach.",
            "Revisiting the Hidden Terminal Problem in a CSMA/CA Wireless Network.",
            "Analysis and Design of Warning Delivery Service in Intervehicular Networks.",
            "Performance Analysis and Optimization of Handoff Algorithms in Heterogeneous Wireless Networks.",
            "SBK: A Self-Configuring Framework for Bootstrapping Keys in Sensor Networks.",
            "Learning Adaptive Temporal Radio Maps for Signal-Strength-Based Location Estimation.",
            "Adaptive Cluster-Based Data Collection in Sensor Networks with Direct Sink Access.",
            "A Cross-Layer Approach for Per-Station Fairness in TCP over WLANs.",
            "EIC Editorial.",
            "OS-MAC: An Efficient MAC Protocol for Spectrum-Agile Wireless Networks.",
            "A Swarm-Intelligence-Based Protocol for Data Acquisition in Networks with Mobile Sinks.",
            "A Self-Repairing Tree Topology Enabling Content-Based Routing in Mobile Ad Hoc Networks.",
            "COACS: A Cooperative and Adaptive Caching System for MANETs.",
            "Toward Reliable and Efficient Reporting in Wireless Sensor Networks.",
            "Chameleon: Application-Level Power Management.",
            "Asymptotic Capacity of Infrastructure Wireless Mesh Networks.",
            "Tandem Queue Models with Applications to QoS Routing in Multihop Wireless Networks.",
            "Mobility Modeling and Performance Evaluation of Heterogeneous Wireless Networks.",
            "Effect of Selfish Node Behavior on Efficient Topology Design.",
            "Searching for Multiple Mobile Users.",
            "Sensor Position Determination with Flying Anchors in Three-Dimensional Wireless Sensor Networks.",
            "On Construction of Virtual Backbone in Wireless Ad Hoc Networks with Unidirectional Links.",
            "A Distributed Localization Scheme for Wireless Sensor Networks with Improved Grid-Scan and Vector-Based Refinement.",
            "Interference-Minimized Multipath Routing with Congestion Control in Wireless Sensor Network for High-Rate Streaming.",
            "Security and QoS Self-Optimization in Mobile Ad Hoc Networks.",
            "Enhancing Situation-Aware Systems through Imprecise Reasoning.",
            "Power Control for Distributed MAC Protocols in Wireless Ad Hoc Networks.",
            "Adaptive FEC-Based Packet Loss Resilience Scheme for Supporting Voice Communication over Ad hoc Wireless Networks.",
            "Understanding and Improving the Spatial Reuse in Multihop Wireless Networks.",
            "An Asymmetric Access Point for Solving the Unfairness Problem in WLANs.",
            "Bandwidth Estimation for IEEE 802.11-Based Ad Hoc Networks.",
            "A Mobile-Directory Approach to Service Discovery in Wireless Ad Hoc Networks.",
            "A Markovian Approach to Radio Access Technology Selection in Heterogeneous Multiaccess/Multiservice Wireless Networks.",
            "Dynamic Forwarding over Tree-on-DAG for Scalable Data Aggregation in Sensor Networks.",
            "DTPA: A Reliable Datagram Transport Protocol over Ad Hoc Networks.",
            "SIP Multicast-Based Mobile Quality-of-Service Support over Heterogeneous IP Multimedia Subsystems.",
            "Bandwidth Reallocation for Bandwidth Asymmetry Wireless Networks Based on Distributed Multiservice Admission Control.",
            "A Mixed Convex/Nonconvex Distributed Localization Approach for the Deployment of Indoor Positioning Services.",
            "Broadcast Scheduling in Interference Environment.",
            "Efficient and Resilient Backbones for Multihop Wireless Networks.",
            "Cross-Layer Design of Wireless Mesh Networks with Network Coding.",
            "Coverage in Hybrid Mobile Sensor Networks.",
            "EIC Editorial.",
            "A Bidding Algorithm for Optimized Utility-Based Resource Allocation in Ad Hoc Networks.",
            "Multiplexing Video on Multiuser Broadcast Channels.",
            "Rendezvous Planning in Wireless Sensor Networks with Mobile Elements.",
            "Coverage and Lifetime Optimization of Wireless Sensor Networks with Gaussian Distribution.",
            "Minimum Interference Channel Assignment in Multiradio Wireless Mesh Networks.",
            "An Equal-Spacing-Based Design for QoS Guarantee in IEEE 802.11e HCCA Wireless Networks.",
            "A New MAC Scheme Supporting Voice/Data Traffic in Wireless Ad Hoc Networks.",
            "The Mathematical Theory of Dynamic Load Balancing in Cellular Networks.",
            "Probability Models for the Splitting Algorithm in Wireless Access Networks with Multipacket Reception and Finite Nodes."
        ]
    },
    {
        "name": "TMC",
        "year": "2007",
        "info": "Volume 6, 2007",
        "count": 108,
        "papers": [
            "EIC Editorial: State of the Transactions.",
            "Online Data Gathering for Maximizing Network Lifetime in Sensor Networks.",
            "SoftMAC: Layer 2.5 Collaborative MAC for Multimedia Support in Multihop Wireless Networks.",
            "Performance Evaluation of the IEEE 802.16 MAC for QoS Support.",
            "Inner-Circle Consistency for Wireless Ad Hoc Networks.",
            "Route Reservation in Ad Hoc Wireless Networks.",
            "Bottom-Up Construction of Bluetooth Topology under a Traffic-Aware Scheduling Scheme.",
            "Variable-Range Transmission Power Control in Wireless Ad Hoc Networks.",
            "Wormhole-Based Antijamming Techniques in Sensor Networks.",
            "SyncWUF: An Ultra Low-Power MAC Protocol for Wireless Sensor Networks.",
            "Optimal Joint Session Admission Control in Integrated WLAN and CDMA Cellular Networks with Vertical Handoff.",
            "EIC Editorial.",
            "Toward Broadcast Reliability in Mobile Ad Hoc Networks with Double Coverage.",
            "Cell Breathing in Wireless LANs: Algorithms and Evaluation.",
            "Rate Allocation and Admission Control for Differentiated Services in CDMA Data Networks.",
            "A Smart TCP Acknowledgment Approach for Multihop Wireless Networks.",
            "Fair Coalitions for Power-Aware Routing in Wireless Networks.",
            "Sleep and Wakeup Strategies in Solar-Powered Wireless Sensor/Mesh Networks: Performance Analysis and Optimization.",
            "Correction to \"Exploring Mesh and Tree-Based Multicast Routing Protocols for MANETs\".",
            "Balancing Push and Pull for Efficient Information Discovery in Large-Scale Sensor Networks.",
            "Differentiated TCP User Perception over Downlink Packet Data Cellular Systems.",
            "Understanding and Exploiting the Trade-Offs between Broadcasting and Multicasting in Mobile Ad Hoc Networks.",
            "Aggregating Bandwidth for Multihomed Mobile Collaborative Communities.",
            "Cross-Layer Collaborative In-Network Processing in Multihop Wireless Sensor Networks.",
            "Location Estimation via Support Vector Regression.",
            "A Novel Analytical Framework for Integrated Cross-Layer Study of Call-Level and Packet-Level QoS in Wireless Mobile Multimedia Networks.",
            "Improving Quality of Service and Assuring Fairness in WLAN Access Networks.",
            "Multiband Media Access Control in Impulse-Based UWB Ad Hoc Networks.",
            "E-Textiles for Autonomous Location Awareness.",
            "Distributed and Energy-Aware MAC for Differentiated Services Wireless Packet Networks: A General Queuing Analytical Framework.",
            "Mobile Element Scheduling with Dynamic Deadlines.",
            "Layer 7 Multimedia Proxy Handoff Using Anycast/Multicast in Mobile Networks.",
            "Dynamic Spectrum Access with QoS and Interference Temperature Constraints.",
            "Integrated Cost-Based MAC and Routing Techniques for Hop Count Forwarding in Wireless Sensor Networks.",
            "Maximizing Communication Concurrency via Link-Layer Packet Salvaging in Mobile Ad Hoc Networks.",
            "Design and Performance of PRAN: A System for Physical Implementation of Ad Hoc Network Routing Protocols.",
            "Randomly Ranked Mini Slots for Fair and Efficient Medium Access Control in Ad Hoc Networks.",
            "On the Path Coverage Properties of Random Sensor Networks.",
            "Game Theoretic Analysis of Cooperation Stimulation and Security in Autonomous Mobile Ad Hoc Networks.",
            "Enhancing WLAN Capacity by Strategic Placement of Tetherless Relay Points.",
            "An Acknowledgment-Based Approach for the Detection of Routing Misbehavior in MANETs.",
            "OPHMR: An Optimized Polymorphic Hybrid Multicast Routing Protocol for MANET.",
            "Bidding Protocols for Deploying Mobile Sensors.",
            "Guest Editorial: Selected Papers on Wireless and Mobility from IEEE INFOCOM.",
            "A Cross-Layer Framework for Exploiting Virtual MISO Links in Mobile Ad Hoc Networks.",
            "Scheduling Efficiency of Distributed Greedy Scheduling Algorithms in Wireless Networks.",
            "Impact of Human Mobility on Opportunistic Forwarding Algorithms.",
            "Integrated Downlink Resource Management for Multiservice WiMAX Networks.",
            "Optimal and Approximate Mobility-Assisted Opportunistic Scheduling in Cellular Networks.",
            "Reducing the Calibration Effort for Probabilistic Indoor Location Estimation.",
            "Efficient Hybrid Security Mechanisms for Heterogeneous Sensor Networks.",
            "Optimal Dynamic Voltage Scaling in Energy-Limited Nonpreemptive Systems with Real-Time Constraints.",
            "Kernel-Based Positioning in Wireless Local Area Networks.",
            "Building Robust Wireless LAN for Industrial Control with the DSSS-CDMA Cell Phone Network Paradigm.",
            "Connected Dominating Sets in Wireless Networks with Different Transmission Ranges.",
            "Performance Analysis of Handoff Techniques Based on Mobile IP, TCP-Migrate, and SIP.",
            "On Searching Continuous k Nearest Neighbors in Wireless Data Broadcast Systems.",
            "Lexicographic Maxmin Fairness for Data Collection in Wireless Sensor Networks.",
            "Sprinkler: A Reliable and Energy Efficient Data Dissemination Service for Extreme Scale Wireless Networks of Embedded Devices.",
            "Mathematical Evaluation of Environmental Monitoring Estimation Error through Energy-Efficient Wireless Sensor Networks.",
            "Quality of Service and Capacity in Constrained Intermittent-Connectivity Networks.",
            "Bandwidth Sharing Schemes for Multimedia Traffic in the IEEE 802.11e Contention-Based WLANs.",
            "Data Dissemination with Ring-Based Index for Wireless Sensor Networks.",
            "A Framework for Transaction-Level Quality of Service for M-Commerce Applications.",
            "Broadcast Approach for UMTS Mobility Database Recovery.",
            "Distributed Mobility Management for Target Tracking in Mobile Sensor Networks.",
            "An Identity-Free and On-Demand Routing Scheme against Anonymity Threats in Mobile Ad Hoc Networks.",
            "Adaptive Route Optimization in Hierarchical Mobile IPv6 Networks.",
            "Nomadic Service Assignment.",
            "Structure-Free Data Aggregation in Sensor Networks.",
            "Practical Routing in Delay-Tolerant Networks.",
            "Resource Allocation and Outage Control for Solar-Powered WLAN Mesh Networks.",
            "A QoS-Aware and Energy-Conserving Transcoding Proxy Using On-Demand Data Broadcasting.",
            "Adaptive Low Power Listening for Wireless Sensor Networks.",
            "A Comment on \"Multibeam Antenna-Based Topology Control with Directional Power Intensity for Ad Hoc Networks\".",
            "A Two-Layer Key Establishment Scheme for Wireless Sensor Networks.",
            "Delay/Fault-Tolerant Mobile Sensor Network (DFT-MSN): A New Paradigm for Pervasive Information Gathering.",
            "Mobility Management for VoIP on Heterogeneous Networks: Evaluation of Adaptive Schemes.",
            "Energy-Aware Adaptive Routing for Large-Scale Ad Hoc Networks: Protocol and Performance Analysis.",
            "The Design and Evaluation of Unified Cellular and Ad Hoc Networks.",
            "Incorporating Data from Multiple Sensors for Localizing Nodes in Mobile Ad Hoc Networks.",
            "Hop ID: A Virtual Coordinate-Based Routing for Sparse Mobile Ad Hoc Networks.",
            "Minimization of Download Times for Large Files over Wireless Channels.",
            "Communication and Coordination in Wireless Sensor and Actor Networks.",
            "WiSE: Best-Path Selection in Wireless Multihoming Environments.",
            "Deploying Wireless Sensor Networks under Limited Mobility Constraints.",
            "Energy-Efficient Wireless Packet Scheduling with Quality of Service Control.",
            "Location-Aware IEEE 802.11 for Spatial Reuse Enhancement.",
            "Sensor Measurements for Wi-Fi Location with Emphasis on Time-of-Arrival Ranging.",
            "A Comment on \"Variable-Range Transmission Power Control in Wireless Ad Hoc Networks\".",
            "EIC Editorial.",
            "Analysis of Random Mobility Models with Partial Differential Equations.",
            "Stochastic Properties of Mobility Models in Mobile Ad Hoc Networks.",
            "A k-Round Elimination Contention Scheme for WLANs.",
            "Impact of Power Control on Performance of IEEE 802.11 Wireless Networks.",
            "Cross-Layer Design of Wireless Multihop Backhaul Networks With Multiantenna Beamforming.",
            "A Predictive Framework for Location-Aware Resource Management in Smart Homes.",
            "BeamStar: An Edge-Based Approach to Routing in Wireless Sensor Networks.",
            "PRISM: Improving the Performance of Inverse-Multiplexed TCP in Wireless Networks.",
            "Context-Aware Migratory Services in Ad Hoc Networks.",
            "TCP Performance in IEEE 802.11-Based Ad Hoc Networks with Multiple Wireless Lossy Links.",
            "Distortion-Driven Video Streaming over Multihop Wireless Networks with Path Diversity.",
            "A Wireless MAC Protocol with Collision Detection.",
            "Verifying Delivered QoS in Multihop Wireless Networks.",
            "Bandwidth Allocation with Half-Duplex Stations in IEEE 802.16 Wireless Networks.",
            "Modeling UMTS Power Saving with Bursty Packet Data Traffic.",
            "Downlink Wireless Packet Scheduling with Deadlines.",
            "Location Update versus Paging Trade-Off in Cellular Networks: An Approach Based on Vector Quantization."
        ]
    },
    {
        "name": "TMC",
        "year": "2006",
        "info": "Volume 5, 2006",
        "count": 130,
        "papers": [
            "EIC Editorial: State of the Transactions.",
            "A Distributed Protocol for Dynamic Address Assignment in Mobile Ad Hoc Networks.",
            "Analyses of Bounces on Power Distribution Networks Using an Unconditionally Stable Finite-Difference Time-Domain Method.",
            "Exploring Mesh and Tree-Based Multicast Routing Protocols for MANETs.",
            "Mobility Helps Peer-to-Peer Security.",
            "Mobility Patterns in Microcellular Wireless Networks.",
            "Performance Evaluation of Pipeline Paging under Paging Delay Constraint for Wireless Systems.",
            "Supporting Cooperative Caching in Ad Hoc Networks.",
            "Toward Distributed Service Discovery in Pervasive Computing Environments.",
            "Context-Aware Mobile Computing: Learning Context-Dependent Personal Preferences from a Wearable Sensor Array.",
            "A Study of the Energy Consumption Characteristics of Cryptographic Algorithms and Security Protocols.",
            "Power Saving Access Points for IEEE 802.11 Wireless Network Infrastructure.",
            "On the Effectiveness of Movement Prediction to Reduce Energy Consumption in Wireless Communication.",
            "Cellular CDMA Capacity with Out-of-Band Multihop Relaying.",
            "On Integrated Location and Service Management for Minimizing Network Cost in Personal Communication Systems.",
            "Call Admission Control for Voice/Data Integration in Broadband Wireless Networks.",
            "TCP Performance over Wireless MIMO Channels with ARQ and Packet Combining.",
            "Code Placement and Replacement Schemes for WCDMA Rotated-OVSF Code Tree Management.",
            "Split-Channel Pipelined Packet Scheduling for Wireless Networks.",
            "A Wireless MAC Protocol Using Implicit Pipelining.",
            "Dynamic Switching between One-to-Many Download Methods in \"All-IP\" Cellular Networks.",
            "Optimal Design of Hybrid FEC/ARQ Schemes for TCP over Wireless Links with Rayleigh Fading.",
            "Progressive Video Delivery over Wideband Wireless Channels Using Space-Time Differentially Coded OFDM Systems.",
            "Directional Broadcast for Mobile Ad Hoc Networks with Percolation Theory.",
            "Minimum-Energy Multicast in Wireless Ad Hoc Networks with Adaptive Antennas: MILP Formulations and Heuristic Algorithms.",
            "Optimal Resource Allocation in Wireless Ad Hoc Networks: A Price-Based Approach.",
            "Node Cooperation in Hybrid Ad Hoc Networks.",
            "Approximate Minimum-Energy Multicasting in Wireless Ad Hoc Networks.",
            "Bandwidth Aggregation for Real-Time Applications in Heterogeneous Wireless Networks.",
            "Mobile Telemedicine Sensor Networks with Low-Energy Data Query and Network Lifetime Considerations.",
            "A Private, Secure, and User-Centric Information Exposure Model for Service Discovery Protocols.",
            "Performance Modeling of Level Switching in Multitier Mobile Communication Systems.",
            "EIC Editorial.",
            "Downlink Queuing Model and Packet Scheduling for Providing Lossless Handoff and QoS in 4G Mobile Networks.",
            "Nash Equilibria of Packet Forwarding Strategies in Wireless Ad Hoc Networks.",
            "On Designing MAC Protocols for Wireless Networks Using Directional Antennas.",
            "On the Effect of Group Mobility to Data Replication in Ad Hoc Networks.",
            "Multibeam Antenna-Based Topology Control with Directional Power Intensity for Ad Hoc Networks.",
            "Information Collection Services for QoS-Aware Mobile Applications.",
            "Broadband Ultrasonic Location Systems for Improved Indoor Positioning.",
            "Reliable Packet Transmissions in Multipath Routed Wireless Networks.",
            "An Adaptive Quorum-Based Energy Conserving Protocol for IEEE 802.11 Ad Hoc Networks.",
            "Power-Aware Network Swapping for Wireless Palmtop PCs.",
            "Group Registration with Local Anchor for Location Tracking in Mobile Networks.",
            "Low-Cost Routing in Selfish and Rational Wireless Ad Hoc Networks.",
            "Distributed Cache Updating for the Dynamic Source Routing Protocol.",
            "Optimizing Protocol Interaction Using Response Surface Methodology.",
            "Movement-Assisted Sensor Deployment.",
            "Cluster Overlay Broadcast (COB): MANET Routing with Complexity Polynomial in Source-Destination Distance.",
            "Queue-Aware Uplink Bandwidth Allocation and Rate Control for Polling Service in IEEE 802.16 Broadband Wireless Networks.",
            "Spatial Node Distribution of the Random Waypoint Mobility Model with Applications.",
            "Performance Comparison of Trust-Based Reactive Routing Protocols.",
            "Topology Control in Ad Hoc Wireless Networks Using Cooperative Communication.",
            "Predictive Multicast Polling for Wireless Networks with Multipacket Reception and Queuing.",
            "MMSPEED: Multipath Multi-SPEED Protocol for QoS Guarantee of Reliability and Timeliness in Wireless Sensor Networks.",
            "Optimized Scalable Video Streaming over IEEE 802.11a/e HCCA Wireless Networks under Delay Constraints.",
            "Efficient OVSF Code Assignment and Reassignment Strategies in UMTS.",
            "Discovering the Architecture of Geo-Located Web Services for Next Generation Mobile Networks.",
            "GRACE-1: Cross-Layer Adaptation for Multimedia Quality and Battery Energy.",
            "PowerNap: An Efficient Power Management Scheme for Mobile Devices.",
            "Performance Impact of Interlayer Dependence in Infrastructure WLANs.",
            "Energy-Efficient Graphical User Interface Design.",
            "A General Framework to Construct Stationary Mobility Models for the Simulation of Mobile Networks.",
            "A Traffic-Aware Scheduling for Bluetooth Scatternets.",
            "Improved Genetic Algorithm for Channel Allocation with Channel Borrowing in Mobile Computing.",
            "Random Walk for Self-Stabilizing Group Communication in Ad Hoc Networks.",
            "Performance Enhancement of Multirate IEEE 802.11 WLANs with Geographically Scattered Stations.",
            "PEDAMACS: Power Efficient and Delay Aware Medium Access Protocol for Sensor Networks.",
            "Real-Time Processing of Range-Monitoring Queries in Heterogeneous Mobile Databases.",
            "A Comment on \"The Critical Transmitting Range for Connectivity in Sparse Wireless Ad Hoc Networks'.",
            "A Control-Theoretic Approach to Distributed Discrete-Valued Decision-Making in Networks of Sensing Agents.",
            "Controllably Mobile Infrastructure for Low Energy Embedded Networks.",
            "SOM: Dynamic Push-Pull Channel Allocation Framework for Mobile Data Broadcasting.",
            "Dynamic Adaptive Frequency Hopping for Mutually Interfering Wireless Personal Area Networks.",
            "ICAM: Integrated Cellular and Ad Hoc Multicast.",
            "Progressive Image Transmission over Space-Time Coded OFDM-Based MIMO Systems with Adaptive Modulation.",
            "Location-Dependent Queries in Mobile Contexts: Distributed Processing Using Mobile Agents.",
            "Efficient In-Network Moving Object Tracking in Wireless Sensor Networks.",
            "A Game Theoretic Approach to Power Aware Wireless Data Access.",
            "Quarantine Region Scheme to Mitigate Spam Attacks in Wireless Sensor Networks.",
            "Optimal Callback with Two-Level Adaptation for Wireless Data Access.",
            "Connectivity, Performance, and Resiliency of IP-Based CDMA Radio Access Networks.",
            "Optimization of SIP Session Setup Delay for VoIP in 3G Wireless Networks.",
            "Packet Design and Signal Processing for OFDM-Based Mobile Broadband Wireless Communication Systems.",
            "End-to-End Batch Transmission in a Multihop and Multirate Wireless Network: Latency, Reliability, and Throughput Analysis.",
            "Link Dynamics and Protocol Design in a Multihop Mobile Environment.",
            "Bluetooth Inquiry Time Characterization and Selection.",
            "Virtual Backbone Construction in MANETs Using Adjustable Transmission Ranges.",
            "rDCF: A Relay-Enabled Medium Access Control Protocol for Wireless Ad Hoc Networks.",
            "Online Multicasting for Network Capacity Maximization in Energy-Constrained Ad Hoc Networks.",
            "Optimal Block Design for Asynchronous Wake-Up Schedules and Its Applications in Multihop Wireless Networks.",
            "Survivable Monitoring in Dynamic Networks.",
            "Maximizing the Lifetime of Wireless Sensor Networks through Optimal Single-Session Flow Routing.",
            "The k-Neighbors Approach to Interference Bounded and Symmetric Topology Control in Ad Hoc Networks.",
            "Adaptive Optimization of IEEE 802.11 DCF Based on Bayesian Estimation of the Number of Competing Terminals.",
            "Energy and Spatial Reuse Efficient Network-Wide Real-Time Data Broadcasting in Mobile Ad Hoc Networks.",
            "Scalable and QoS-Aware Dynamic Slot Assignment and Piconet Partitioning to Enhance the Performance of Bluetooth Ad Hoc Networks.",
            "Improving Awareness in Mobile CSCW.",
            "A Cross-Layer (Layer 2 + 3) Handoff Management Protocol for Next-Generation Wireless Systems.",
            "Toward Secure Low Rate Wireless Personal Area Networks.",
            "Delay-Sensitive Packet Scheduling for a Wireless Access Link.",
            "MobiEyes: A Distributed Location Monitoring Service Using Moving Location Queries.",
            "DOA: DSR over AODV Routing for Mobile Ad Hoc Networks.",
            "Concealed Data Aggregation for Reverse Multicast Traffic in Sensor Networks: Encryption, Key Distribution, and Routing Adaptation.",
            "Optimal Transmit Power in Wireless Sensor Networks.",
            "A Distributed Channel Access Protocol for Ad Hoc Networks with Feedback Power Control.",
            "On the Construction of a Strongly Connected Broadcast Arborescence with Bounded Transmission Delay.",
            "A Comment on \"HEED: A Hybrid, Energy-Efficient, Distributed Clustering Approach for Ad Hoc Sensor Networks'.",
            "Dynamic Power Optimization Targeting User Delays in Interactive Systems.",
            "Mobile Device Security Using Transient Authentication.",
            "Distributed Flow Control and Medium Access in Multihop Ad Hoc Networks.",
            "Data Replication for Improving Data Accessibility in Ad Hoc Networks.",
            "Provably Secure On-Demand Source Routing in Mobile Ad Hoc Networks.",
            "Cost-Effective Caching for Mobility Support in IEEE 802.1X Frameworks.",
            "Tree-Based Data Broadcast in IEEE 802.15.4 and ZigBee Networks.",
            "Client-Centered, Energy-Efficient Wireless Communication on IEEE 802.11b Networks.",
            "Gap Processing Time Analysis of Stall Avoidance Schemes for High-Speed Downlink Packet Access with Parallel HARQ Mechanisms.",
            "A User-Centered Approach to Active Replica Management in Mobile Environments.",
            "Routing Correlated Data with Fusion Cost in Wireless Sensor Networks.",
            "Evaluating Next-Cell Predictors with Extensive Wi-Fi Mobility Data.",
            "Design and Performance Studies of an Adaptive Scheme for Serving Dynamic Web Content in a Mobile Computing Environment.",
            "A Theory of Network Localization.",
            "QoS Analysis in Overlay Bluetooth-WiFi Networks with Profile-Based Vertical Handover.",
            "DOMINO: Detecting MAC Layer Greedy Behavior in IEEE 802.11 Hotspots.",
            "An Analytical Model for Wireless Sensor Networks with Sleeping Nodes.",
            "A Novel Penalty Controllable Dynamic Voltage Scaling Scheme for Mobile Multimedia Applications.",
            "Update-Based Cache Access and Replacement in Wireless Data Access.",
            "Call-Level and Packet-Level Quality of Service and User Utility in Rate-Adaptive Cellular CDMA Networks: A Queuing Analysis.",
            "OMAR: Utilizing Multiuser Diversity in Wireless Ad Hoc Networks.",
            "Dynamic Resource Allocation in CDMA Systems with Deterministic Codes and Multirate Provisioning."
        ]
    },
    {
        "name": "TMC",
        "year": "2005",
        "info": "Volume 4, 2005",
        "count": 52,
        "papers": [
            "A Minimum Cost Heterogeneous Sensor Network with a Lifetime Constraint.",
            "An FDD Wideband CDMA MAC Protocol with Minimum-Power Allocation and GPS-Scheduling for Wireless Wide Area Multimedia Networks.",
            "Design and Performance Studies of an Adaptive Cache Retrieval Scheme in a Mobile Computing Environment.",
            "Enhanced Distance-Based Location Management of Mobile Communication Systems Using a Cell Coordinates Approach.",
            "Optimal Resource Allocation for Wireless Video over CDMA Networks.",
            "Wireless Cache Invalidation Schemes with Link Adaptation and Downlink Traffic.",
            "Worst and Best-Case Coverage in Sensor Networks.",
            "A Location-Based Routing Method for Mobile Ad Hoc Networks.",
            "A Quantitative Comparison of Ad Hoc Routing Protocols with and without Channel Adaptation.",
            "Call Admission Control in Wideband CDMA Cellular Networks by Using Fuzzy Logic.",
            "Data Fusion of Power and Time Measurements for Mobile Terminal Location.",
            "Distributed Token Circulation in Mobile Ad Hoc Networks.",
            "Fair Resource Allocation with Guaranteed Statistical QoS for Multimedia Traffic in Wideband CDMA Cellular Network.",
            "Hierarchy Schedule Sensing Protocol for CDMA Wireless Networks-Performance Study under Multipath, Multiuser Interference, and Collision-Capture Effect.",
            "Per-User Checkpointing for Mobility Database Failure Restoration.",
            "Real-Time Mobility Tracking Algorithms for Cellular Networks Based on Kalman Filtering.",
            "The Impact of Multihop Wireless Channel on TCP Performance.",
            "EIC Editorial.",
            "A MAC Protocol to Reduce Sensor Network Energy Consumption Using a Wakeup Radio.",
            "ARC: An Integrated Admission and Rate Control Framework for Competitive Wireless CDMA Data Networks Using Noncooperative Games.",
            "Efficient Broadcasting with Guaranteed Coverage in Mobile Ad Hoc Networks.",
            "Information Raining and Optimal Link-Layer Design for Mobile Hotspots.",
            "Node Localization Using Mobile Robots in Delay-Tolerant Sensor Networks.",
            "Soft Tamper-Proofing via Program Integrity Verification in Wireless Sensor Networks.",
            "The Critical Transmitting Range for Connectivity in Mobile Ad Hoc Networks.",
            "An Enhanced Inter-Access Point Protocol for Uniform Intra and Intersubnet Handoffs.",
            "AO2P: Ad Hoc On-Demand Position-Based Private Routing Protocol.",
            "Congestion Control Policies for IP-Based CDMA Radio Access Networks.",
            "Contention-Aware Admission Control for Ad Hoc Networks.",
            "EBA: An Enhancement of the IEEE 802.11 DCF via Distributed Reservation.",
            "On Supporting Power-Efficient Streaming Applications in Wireless Environments.",
            "On the Stationary Distribution of Speed and Location of Random Waypoint.",
            "A Concept of Communication Distance and Its Application to Six Situations in Mobile Environments.",
            "Dynamic Bandwidth Allocation for Multimedia Traffic with Rate Guarantee and Fair Access in WCDMA Systems.",
            "Evaluation of the Masked Node Problem in Ad Hoc Wireless LANs.",
            "Improving Protocol Robustness in Ad Hoc Networks through Cooperative Packet Caching and Shortest Multipath Routing.",
            "Optimal Base-Station Locations in Two-Tiered Wireless Sensor Networks.",
            "Optimal Offline and Online Registration Techniques for Location Management with Overlapping Registration Areas.",
            "Performance Study of Link Layer and MAC Layer Protocols to Support TCP in 3G CDMA Systems.",
            "Selfish MAC Layer Misbehavior in Wireless Networks.",
            "TCP-DCR: A Novel Protocol for Tolerating Wireless Channel Errors.",
            "Validation of an Improved Location-Based Handover Algorithm Using GSM Measurement Data.",
            "A Mobility Prediction Architecture Based on Contextual Knowledge and Spatial Conceptual Maps.",
            "A User Pattern Learning Strategy for Managing Users' Mobility in UMTS Networks.",
            "An Analysis of Error Inducing Parameters in Multihop Sensor Node Localization.",
            "An Efficient Fault-Tolerant Distributed Channel Allocation Algorithm for Cellular Networks.",
            "ATP: A Reliable Transport Protocol for Ad Hoc Networks.",
            "Design and Analysis of Time-Based Code Allocation Schemes in W-CDMA Systems.",
            "Distributed Fair Scheduling in a Wireless LAN.",
            "Dynamical Mobile Terminal Location Registration in Wireless PCS Networks.",
            "Location Management of Correlated Mobile Users in the UMTS.",
            "Subcarrier Allocation and Bit Loading Algorithms for OFDMA-Based Wireless Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2004",
        "info": "Volume 3, 2004",
        "count": 31,
        "papers": [
            "Editorial: State of the Transactions.",
            "Analysis of Adaptive Bandwidth Allocation in Wireless Networks with Multilevel Degradable Quality of Service.",
            "CLTC: A Cluster-Based Topology Control Framework for Ad Hoc Networks.",
            "DESP: A Distributed Economics-Based Subcontracting Protocol for Computation Distribution in Power-Aware Mobile Ad Hoc Networks.",
            "Hierarchical Routing Overhead in Mobile Ad Hoc Networks.",
            "On Using Peer-to-Peer Communication in Cellular Wireless Data Networks.",
            "QoS-Oriented Packet Scheduling for Wireless Multimedia CDMA Communications.",
            "Self-Coordinating Localized Fair Queueing in Wireless Ad Hoc Networks.",
            "Stationary Distributions for the Random Waypoint Mobility Model.",
            "A Distributed Transmission Power Control Protocol for Mobile Ad Hoc Networks.",
            "Bandwidth Estimation Schemes for TCP over Wireless Networks.",
            "Energy Efficient Broadcast Routing in Static Ad Hoc Wireless Networks.",
            "Parameter Estimation and Error Reduction for OFDM-Based WLANs.",
            "Pilot: Probabilistic Lightweight Group Communication System for Ad Hoc Networks.",
            "Relying on Safe Distance to Achieve Strong Partitionable Group Membership in Ad Hoc Networks.",
            "Guest Editorial: Special Section on Mission-Oriented Sensor Networks.",
            "Collaborative Sensor Networking Towards Real-Time Acoustical Beamforming in Free-Space and Limited Reverberance.",
            "Purposeful Mobility for Relaying and Surveillance in Mobile Ad Hoc Sensor Networks.",
            "The Effect of Mobility-Induced Location Errors on Geographic Routing in Mobile Ad Hoc and Sensor Networks: Analysis and Improvement Using Mobility Prediction.",
            "Extremal Properties of Three-Dimensional Sensor Networks with Applications.",
            "Dynamic Clustering for Acoustic Target Tracking in Wireless Sensor Networks.",
            "ASCENT: Adaptive Self-Configuring sEnsor Networks Topologies.",
            "System Lifetime Optimization for Heterogeneous Sensor Networks with a Hub-Spoke Topology.",
            "Predictive Models to Rebroadcast in Mobile Ad Hoc Networks.",
            "Multiple Access Protocol for Power-Controlled Wireless Access Nets.",
            "Methods for Scalable Self-Assembly of Ad Hoc Wireless Sensor Networks.",
            "Rate Performance Objectives of Multihop Wireless Networks.",
            "Medium Access Control in Ad Hoc Networks with MIMO Links: Optimization Considerations and Algorithms.",
            "HEED: A Hybrid, Energy-Efficient, Distributed Clustering Approach for Ad Hoc Sensor Networks.",
            "Courtesy Piggybacking: Supporting Differentiated Services in Multihop Mobile Ad Hoc Networks.",
            "Efficient Dissemination of Personalized Information Using Content-Based Multicast."
        ]
    },
    {
        "name": "TMC",
        "year": "2003",
        "info": "Volume 2, 2003",
        "count": 32,
        "papers": [
            "Editorial: New AE Introduction.",
            "Quantitative Analysis of a Hybrid Replication with Forwarding Strategy for Efficient and Uniform Location Management in Mobile Wireless Networks.",
            "Policy-Driven Personalized Multimedia Services for Mobile Users.",
            "The Critical Transmitting Range for Connectivity in Sparse Wireless Ad Hoc Networks.",
            "Efficient PDA Synchronization.",
            "Self-Organized Public-Key Management for Mobile Ad Hoc Networks.",
            "Performance Analysis of a Preemptive and Priority Reservation Handoff Scheme for Integrated Service-Based Wireless Mobile Networks.",
            "Optimal Location Area Design to Minimize Registration Signaling Traffic in Wireless Systems.",
            "Active Memory Processor: A Hardware Garbage Collector for Real-Time Java Embedded Devices.",
            "Channel Access-Based Self-Organized Clustering in Ad Hoc Networks.",
            "Derivation of Markov Models for Effectiveness Analysis of Adaptable Software Architectures for Mobile Computing.",
            "Mobile User Recovery in the Context of Internet Transactions.",
            "Radio Resource Management for Cellular CDMA Systems Supporting Heterogeneous Services.",
            "Routing Mechanisms for Mobile Ad Hoc Networks Based on the Energy Drain Rate.",
            "S-Parameters Characterization of Through, Blind, and Buried Via Holes.",
            "Editor's Note.",
            "A Random Graph Model for Optical Networks of Sensors.",
            "An Approach to Agent-Based Service Composition and Its Application to Mobile Business Processes.",
            "An Efficient Fault-Tolerant Approach for Mobile IP in Wireless Systems.",
            "Modeling and Analysis of WAP Performance over Wireless Links.",
            "Service-Level Availability Estimation of GPRS.",
            "Strong Minimum Energy Topology in Wireless Sensor Networks: NP-Completeness and Heuristics.",
            "The Node Distribution of the Random Waypoint Mobility Model for Wireless Ad Hoc Networks.",
            "Electromagnetic Compatibility Issues in Mobile Computing.",
            "Fast Multipole Method for Time Domain PEEC Analysis.",
            "Fast Multipole and Multifunction PEEC Methods.",
            "Modeling and Analysis of Power Distribution Networks for Gigabit Applications.",
            "Power Bus Signal Integrity Improvement and EMI Mitigation on Multilayer High-Speed Digital PCBs with Embedded Capacitance.",
            "Adaptive Information Dissemination: An Extended Wireless Data Broadcasting Scheme with Loan-Based Feedback Control.",
            "Geographic Random Forwarding (GeRaF) for Ad Hoc and Sensor Networks: Multihop Performance.",
            "Geographic Random Forwarding (GeRaF) for Ad Hoc and Sensor Networks: Energy and Latency Performance.",
            "On Route Lifetime in Multihop Mobile Ad Hoc Networks."
        ]
    },
    {
        "name": "TMC",
        "year": "2002",
        "info": "Volume 1, 2002",
        "count": 27,
        "papers": [
            "Welcome Message.",
            "Introduction to the IEEE Transactions on Mobile Computing.",
            "Optimization of Efficiency and Energy Consumption in p-Persistent CSMA-Based Wireless LANs.",
            "Two-Level Pointer Forwarding Strategy for Location Management in PCS Networks.",
            "Algorithms for Supporting Disconnected Write Operations for Wireless Web Access in Mobile Client-Server Environments.",
            "A Statistical Modeling Approach to Location Estimation.",
            "Optimizing Sensor Networks in the Energy-Latency-Density Design Space.",
            "Editorial: Introducing the New AEs.",
            "I-WAP: An Intelligent WAP Site Management System.",
            "Metropolitan Area Mobile Services to Support Virtual Groups.",
            "On Reducing Broadcast Redundancy in Ad Hoc Wireless Networks.",
            "Potential Fraudulent Usage in Mobile Telecommunications Networks.",
            "Precoded OFDM with Adaptive Vector Channel Allocation for Scalable Video Transmission over Frequency-Selective Fading Channels.",
            "Optimal Resource Management in Wireless Multimedia Wideband CDMA Systems.",
            "Editorial.",
            "A Novel Distributed Dynamic Location Management Scheme for Minimizing Signaling Costs in Mobile IP.",
            "Energy-Aware Wireless Networking with Directional Antennas: The Case of Session-Based Broadcasting and Multicasting.",
            "Supporting Service Differentiation for Real-Time and Best-Effort Traffic in Stateless Wireless Ad Hoc Networks (SWAN).",
            "A New Analytic Framework for Dynamic Mobility Management of PCS Networks.",
            "QoS Tuning and Resource Sharing for UMTS WCDMA Multiservice Mobile.",
            "User Mobility Pattern Scheme for Location Update and Paging in Wireless Systems.",
            "A Comprehensive Resource Management Framework for Next Generation Wireless Networks.",
            "An Efficient Optimistic Message Logging Scheme for Recoverable Mobile Computing Systems.",
            "Goodput Analysis and Link Adaptation for IEEE 802.11a Wireless LANs.",
            "Code Placement and Replacement Strategies for Wideband CDMA OVSF Code Tree Management.",
            "Optimal Component Configuration and Component Routing.",
            "A Model for Mobile Code Using Interacting Automata."
        ]
    }
]