[
    {
        "name": "TNSM",
        "year": "2022",
        "info": "Volume 19: 2022",
        "count": 51,
        "papers": [
            "2021 Reviewers for IEEE Transactions on Network and Service Management (TNSM).",
            "On Ransomware Family Attribution Using Pre-Attack Paranoia Activities.",
            "Survivable Virtual Network Mapping With Fiber Tree Establishment in Filterless Optical Networks.",
            "Toward Control and Coordination in Cognitive Autonomous Networks.",
            "AFSOS: An Auction Framework and Stackelberg Game Oriented Optimal Network's Resource Selection Technique in Cognitive Radio Networks.",
            "FLAG: Few-Shot Latent Dirichlet Generative Learning for Semantic-Aware Traffic Detection.",
            "Recommendation Model Based on Dynamic Interest Group Identification and Data Compensation.",
            "Theoretical Design of Geographical Route of Communications Cable Network Supplied by Power Grid to Minimize Disaster Damage.",
            "Foureye: Defensive Deception Against Advanced Persistent Threats via Hypergame Theory.",
            "TSAGen: Synthetic Time Series Generation for KPI Anomaly Detection.",
            "GAN-Based Pareto Optimization for Self-Healing of Radio Access Network Slices.",
            "On the Benefits of Joint Optimization of Reconfigurable CDN-ISP Infrastructure.",
            "Decentralized On-Chain Data Access via Smart Contracts in Ethereum Blockchain.",
            "NetChain: A Blockchain-Enabled Privacy-Preserving Multi-Domain Network Slice Orchestration Architecture.",
            "A Blockchain-Powered Data Market for Multi-User Cooperative Search.",
            "Blockchain-Enabled Resource Trading and Deep Reinforcement Learning-Based Autonomous RAN Slicing in 5G.",
            "A Survey on Blockchain-Based Telecommunication Services Marketplaces.",
            "Towards Heat-Recirculation-Aware Virtual Machine Placement in Data Centers.",
            "Self-Verifiable Attribute-Based Keyword Search Scheme for Distributed Data Storage in Fog Computing With Fast Decryption.",
            "Adaptive Computation Offloading Policy for Multi-Access Edge Computing in Heterogeneous Wireless Networks.",
            "Towards Sustainable Edge Computing Through Renewable Energy Resources and Online, Distributed and Predictive Scheduling.",
            "BDMaaS+: Business-Driven and Simulation-Based Optimization of IT Services in the Hybrid Cloud.",
            "Delay-Optimal Edge Caching With Imperfect Content Fetching via Stochastic Learning.",
            "SDFA: A Service-Driven Fragmentation-Aware Resource Allocation in Elastic Optical Networks.",
            "Measuring and Localising Congestion in Mobile Broadband Networks.",
            "Quality of Monitoring for Cellular Networks.",
            "Towards Automatic Network Slicing for the Internet of Space Things.",
            "A Scalable Monitoring Framework for Network Slicing in 5G and Beyond Mobile Networks.",
            "Interference-Aware NFV-Enabled Multicast Service in Resource-Constrained Wireless Mesh Networks.",
            "Proactive and AoI-Aware Failure Recovery for Stateful NFV-Enabled Zero-Touch 6G Networks: Model-Free DRL Approach.",
            "Optimization Model for Primary and Backup Resource Allocation With Workload-Dependent Failure Probability.",
            "AI-Based Network-Aware Service Function Chain Migration in 5G and Beyond Networks.",
            "Virtualizing Packet-Processing Network Functions Over Heterogeneous OpenFlow Switches.",
            "Chaining-Box: A Transparent Service Function Chaining Architecture Leveraging BPF.",
            "Topology Poisoning Attacks and Prevention in Hybrid Software-Defined Networks.",
            "Virtualized Network Function Forwarding Graph Placing in SDN and NFV-Enabled IoT Networks: A Graph Neural Network Assisted Deep Reinforcement Learning Method.",
            "Content Object Security in the Internet of Things: Challenges, Prospects, and Emerging Solutions.",
            "DAD: Domain Adversarial Defense System Against DDoS Attacks in Cloud.",
            "Privacy-Preserving Scheme With Account-Mapping and Noise-Adding for Energy Trading Based on Consortium Blockchain.",
            "Practical Intrusion Detection of Emerging Threats.",
            "Learning From Network Data Changes for Unsupervised Botnet Detection.",
            "On the Performance of GRASP-Based Feature Selection for CPS Intrusion Detection.",
            "Chronos: DDoS Attack Detection Using Time-Based Autoencoder.",
            "An Efficient Key Management and Multi-Layered Security Framework for SCADA Systems.",
            "A Cost-Sensitive Deep Learning-Based Approach for Network Traffic Classification.",
            "An Incremental Learning Method Based on Dynamic Ensemble RVM for Intrusion Detection.",
            "Multi-Perspective Content Delivery Networks Security Framework Using Optimized Unsupervised Anomaly Detection.",
            "Diversity-by-Design for Dependable and Secure Cyber-Physical Systems: A Survey.",
            "Dynamic Microservice Allocation for Virtual Reality Distribution With QoE Support.",
            "Bandwidth Allocation of Stream-Reservation Traffic in TSN.",
            "User-Based Quality of Service Aware Multi-Cell Radio Access Network Slicing."
        ]
    },
    {
        "name": "TNSM",
        "year": "2021",
        "info": "Volume 18: 2021",
        "count": 336,
        "papers": [
            "2020 Reviewers for IEEE Transactions on Network and Service Management (TNSM).",
            "Guest Editors Introduction: Special Issue on Advanced Management of Softwarized Networks.",
            "NFV Platforms: Taxonomy, Design Choices and Future Challenges.",
            "A Comprehensive Survey on the E2E 5G Network Slicing Model.",
            "Centralized and Federated Learning for Predictive VNF Autoscaling in Multi-Domain 5G Networks and Beyond.",
            "Uncertainty-Aware Resource Provisioning for Network Slicing.",
            "An Adaptive Forecasting Model for Slice Allocation in Softwarized Networks.",
            "Capacitated Shortest Path Tour Problem-Based Integer Linear Programming for Service Chaining and Function Placement in NFV Networks.",
            "DDQP: A Double Deep Q-Learning Approach to Online Fault-Tolerant SFC Placement.",
            "A Framework for eBPF-Based Network Functions in an Era of Microservices.",
            "Necklace: An Architecture for Distributed and Robust Service Function Chains With Guarantees.",
            "Petri Net-Based Reliability Assessment and Migration Optimization Strategy of SFC.",
            "Availability- and Traffic-Aware Placement of Parallelized SFC in Data Center Networks.",
            "FlexChain: Bridging Parallelism and Placement for Service Function Chains.",
            "Network Service Embedding Across Multiple Resource Dimensions.",
            "Service Chain Composition With Resource Failures in NFV Systems: A Game-Theoretic Perspective.",
            "Reliability-Oriented and Resource-Efficient Service Function Chain Construction and Backup.",
            "Comparative Performability Assessment of SFCs: The Case of Containerized IP Multimedia Subsystem.",
            "Provisioning Optimization for Determining and Embedding 5G End-to-End Information Centric Network Slice.",
            "Delay-Sensitive Multi-Source Multicast Resource Optimization in NFV-Enabled Networks: A Column Generation Approach.",
            "SDN Controller Placement With Availability Upgrade Under Delay and Geodiversity Constraints.",
            "Joint Switch-Controller Association and Control Devolution for SDN Systems: An Integrated Online Perspective of Control and Learning.",
            "DOLPHIN: Dynamically Optimized and Load Balanced Path for Inter-Domain SDN Communication.",
            "Improving SD-WAN Resilience: From Vertical Handoff to WAN-Aware MPTCP.",
            "OFaaS: OpenFlow Switch as a Service for Multi Tenant Slicing in SD-CDN.",
            "NDN Fabric: Where the Software-Defined Networking Meets the Content-Centric Model.",
            "P4Neighbor: Efficient Link Failure Recovery With Programmable Switches.",
            "P-SCOR: Integration of Constraint Programming Orchestration and Programmable Data Plane.",
            "Toward In-Network Event Detection and Filtering for Publish/Subscribe Communication Using Programmable Data Planes.",
            "Hybrid Flow Table Installation: Optimizing Remote Placements of Flow Tables on Servers to Enhance PDP Switches for In-Network Computing.",
            "Toward Programmable DOCSIS 4.0 Networks: Adaptive Modulation in OFDM Channels.",
            "Understanding the Performance of Flexible Functional Split in 5G vRAN Controllers: A Markov Chain-Based Model.",
            "RAN Engine: Service-Oriented RAN Through Containerized Micro-Services.",
            "Service Orchestration Over Wireless Network Slices: Testbed Setup and Integration.",
            "Mobility-Aware Seamless Handover With MPTCP in Software-Defined HetNets.",
            "Managing Chains of Application Functions Over Multi-Technology Edge Networks.",
            "Deploying SDN Control in Internet of UAVs: Q-Learning-Based Edge Scheduling.",
            "Optimized IoT Service Chain Implementation in Edge Cloud Platform: A Deep Learning Framework.",
            "OSCAR: On Optimizing Resource Utilization in Live Video Streaming.",
            "Mobility Aware and Dynamic Migration of MEC Services for the Internet of Vehicles.",
            "Dynamic Controller Assignment in Software Defined Internet of Vehicles Through Multi-Agent Deep Reinforcement Learning.",
            "Software Packet-Level Network Analytics at Cloud Scale.",
            "SRv6-PM: A Cloud-Native Architecture for Performance Monitoring of SRv6 Networks.",
            "In-Band Network Monitoring Technique to Support SDN-Based Wireless Networks.",
            "A Novel Autonomous Profiling Method for the Next-Generation NFV Orchestrators.",
            "Assessing Container Network Interface Plugins: Functionality, Performance, and Scalability.",
            "Joint Monitorless Load-Balancing and Autoscaling for Zero-Wait-Time in Data Centers.",
            "Software Physical/Virtual Rx Queue Mapping Toward High-Performance Containerized Networking.",
            "Cross-Network-Slice Authentication Scheme for the 5th Generation Mobile Communication System.",
            "Improving the Formal Verification of Reachability Policies in Virtualized Networks.",
            "MLSNet: A Policy Complying Multilevel Security Framework for Software Defined Networking.",
            "AEGIS: Detection and Mitigation of TCP SYN Flood on SDN Controller.",
            "Mitigating TCP Protocol Misuse With Programmable Data Planes.",
            "Guest Editorial: Special Issue on Data Analytics and Machine Learning for Network and Service Management - Part II.",
            "Tensor-Based Recurrent Neural Network and Multi-Modal Prediction With Its Applications in Traffic Network Management.",
            "Detection and Characterization of Network Anomalies in Large-Scale RTT Time Series.",
            "Adaptive Network Latency Prediction From Noisy Measurements.",
            "Host Behavior in Computer Network: One-Year Study.",
            "Online Anomaly Detection Leveraging Stream-Based Clustering and Real-Time Telemetry.",
            "An LSTM Framework for Software-Defined Measurement.",
            "Intelligent Routing Based on Reinforcement Learning for Software-Defined Networking.",
            "Burst Traffic Scheduling for Hybrid E/O Switching DCN: An Error Feedback Spiking Neural Network Approach.",
            "STAD: Spatio-Temporal Anomaly Detection Mechanism for Mobile Network Management.",
            "Characterization and Prediction of Mobile-App Traffic Using Markov Modeling.",
            "QoS Time Series Modeling and Forecasting for Web Services: A Comprehensive Survey.",
            "CEDULE+: Resource Management for Burstable Cloud Instances Using Predictive Analytics.",
            "Machine Learning-Based Scaling Management for Kubernetes Edge Clusters.",
            "Profit Maximization of Online Service Function Chain Orchestration in an Inter-Datacenter Elastic Optical Network.",
            "Deep-FDA: Using Functional Data Analysis and Neural Networks to Characterize Network Services Time Series.",
            "Mosaic: Advancing User Quality of Experience in 360-Degree Video Streaming With Machine Learning.",
            "Detecting Anomalies at a TLD Name Server Based on DNS Traffic Predictions.",
            "Hierarchical Anomaly-Based Detection of Distributed DNS Attacks on Enterprise Networks.",
            "Uncovering Lateral Movement Using Authentication Logs.",
            "Adaptive Protection of Scientific Backbone Networks Using Machine Learning.",
            "WIDS: An Anomaly Based Intrusion Detection System for Wi-Fi (IEEE 802.11) Protocol.",
            "Comparative Assessment of Process Mining for Supporting IoT Predictive Security.",
            "Gradient Boosting Feature Selection With Machine Learning Classifiers for Intrusion Detection on Power Grids.",
            "Guest Editors' Introduction: Special Issue on Latest Developments for Security Management of Networks and Services.",
            "A New Method for Flow-Based Network Intrusion Detection Using the Inverse Potts Model.",
            "A Unified Deep Learning Anomaly Detection and Classification Approach for Smart Grid Environments.",
            "Anomaly Detection for Insider Threats Using Unsupervised Ensembles.",
            "A Multi-Dimensional Deep Learning Framework for IoT Malware Classification and Family Attribution.",
            "DETONAR: Detection of Routing Attacks in RPL-Based IoT.",
            "In-Network Volumetric DDoS Victim Identification Using Programmable Commodity Switches.",
            "DNS Tunneling Detection by Cache-Property-Aware Features.",
            "FlowPic: A Generic Representation for Encrypted Traffic Classification and Applications Identification.",
            "α-MON: Traffic Anonymizer for Passive Monitoring.",
            "Edge Blockchain Assisted Lightweight Privacy-Preserving Data Aggregation for Smart Grid.",
            "Optimal Security Risk Management Mechanism for the 5G Cloudified Infrastructure.",
            "A New Mutual Authentication and Key Agreement Protocol for Mobile Client - Server Environment.",
            "Intrinsic Security and Self-Adaptive Cooperative Protection Enabling Cloud Native Network Slicing.",
            "On the Flow of Software Security Advisories.",
            "From TTP to IoC: Advanced Persistent Graphs for Threat Hunting.",
            "Blocklist Babel: On the Transparency and Dynamics of Open Source Blocklisting.",
            "Optimized, Automated, and Protective: An Operator's View on Future Networks.",
            "Enabling SDN Hypervisor Provisioning Through Accurate CPU Utilization Prediction.",
            "Efficient Topology Discovery for Software-Defined Networks.",
            "ARES: A Framework for Management of Aging and Rejuvenation in Softwarized Networks.",
            "A Software-Defined Networking Solution for Transparent Session and Service Continuity in Dynamic Multi-Access Edge Computing.",
            "Joint Traffic-Aware Consolidated Middleboxes Selection and Routing in Distributed SDNs.",
            "Resiliency-Aware Deployment of SDN in Smart Grid SCADA: A Formal Synthesis Model.",
            "A Scalable and Offloading-Based Traffic Classification Solution in NFV/SDN Network Architectures.",
            "Delay-Aware Control Plane Virtual Topology Design of Software Defined-Elastic Optical Network.",
            "A Network Intelligence Architecture for Efficient VNF Lifecycle Management.",
            "Reliable Placement of Service Function Chains and Virtual Monitoring Functions With Minimal Cost in Softwarized 5G Networks.",
            "Resource Optimization and Delay Guarantee Virtual Network Function Placement for Mapping SFC Requests in Cloud Networks.",
            "Holu: Power-Aware and Delay-Constrained VNF Placement and Chaining.",
            "APPM: Adaptive Parallel Processing Mechanism for Service Function Chains.",
            "Virtual Network Function Allocation to Maximize Continuous Available Time of Service Function Chains With Availability Schedule.",
            "Blockchain State Sharding With Space-Aware Representations.",
            "Helix: A Fair Blockchain Consensus Protocol Resistant to Ordering Manipulation.",
            "Churn in the Bitcoin Network.",
            "Cyber Security Threats to Bitcoin Exchanges: Adversary Exploitation and Laundering Techniques.",
            "Co-Maintained Database Based on Blockchain for IDSs: A Lifetime Learning Framework.",
            "Trust-Based Blockchain Authorization for IoT.",
            "Decentralized and Lightweight Approach to Detect Eclipse Attacks on Proof of Work Blockchains.",
            "Generative Adversarial Network-Based Transfer Reinforcement Learning for Routing With Prior Knowledge.",
            "ROAchain: Securing Route Origin Authorization With Blockchain for Inter-Domain Routing.",
            "QoSChain: Provisioning Inter-AS QoS in Software-Defined Networks With Blockchain.",
            "Investigating Orphan Transactions in the Bitcoin Network.",
            "EdgeDASH: Exploiting Network-Assisted Adaptive Video Streaming for Edge Caching.",
            "PA-Cache: Evolving Learning-Based Popularity- Aware Content Caching in Edge Networks.",
            "DRL-QOR: Deep Reinforcement Learning-Based QoS/QoE-Aware Adaptive Online Orchestration in NFV-Enabled Networks.",
            "On Migratory Behavior in Video Consumption.",
            "Discovering Usage Patterns of Mobile Video Service in the Cellular Networks.",
            "Multi-Stage Optimized Machine Learning Framework for Network Intrusion Detection.",
            "A Forecasting Approach to Improve Control and Management for 5G Networks.",
            "Adaptive and Reinforcement Learning Approaches for Online Network Monitoring and Analysis.",
            "SQLR: Short-Term Memory Q-Learning for Elastic Provisioning.",
            "LogClass: Anomalous Log Identification and Classification With Partial Labels.",
            "Machine Learning for NetFlow Anomaly Detection With Human-Readable Annotations.",
            "Robust Anomaly Detection Using Reconstructive Adversarial Network.",
            "CANnolo: An Anomaly Detection System Based on LSTM Autoencoders for Controller Area Network.",
            "Alarm Prediction in Cellular Base Stations Using Data-Driven Methods.",
            "Supervised and Semi-Supervised Learning for Failure Identification in Microwave Networks.",
            "Mobile Traffic Classification Through Physical Control Channel Fingerprinting: A Deep Learning Approach.",
            "Adversarial Network Traffic: Towards Evaluating the Robustness of Deep-Learning-Based Network Traffic Classification.",
            "Multi-Path Selection and Congestion Control for NDN: An Online Learning Approach.",
            "Online Virtual Machine Evacuation for Disaster Resilience in Inter-Data Center Networks.",
            "Scheduling Mix-Coflows in Datacenter Networks.",
            "Criso: An Incremental Scalable and Cost-Effective Network Architecture for Data Centers.",
            "A Price-Incentive Resource Auction Mechanism Balancing the Interests Between Users and Cloud Service Provider.",
            "Secure Multi-keyword Fuzzy Searches With Enhanced Service Quality in Cloud Computing.",
            "Business-Driven Support for Infrastructure as a Service Capacity Management Through System Dynamics Simulations.",
            "Optimizing Job Reliability Through Contention-Free, Distributed Checkpoint Scheduling.",
            "Dynamic Allocation of Computing and Communication Resources in Multi-Access Edge Computing for Mobile Users.",
            "Let's Share: A Game-Theoretic Framework for Resource Sharing in Mobile Edge Clouds.",
            "Budget-Aware Video Crowdsourcing at the Cloud-Enhanced Mobile Edge.",
            "Robust Service Provisioning With Service Function Chain Requirements in Mobile Edge Computing.",
            "Dynamic Offloading and Resource Scheduling for Mobile-Edge Computing With Energy Harvesting Devices.",
            "A Decentralized Framework for Serverless Edge Computing in the Internet of Things.",
            "Battery-Aware Green Cellular Networks Fed By Smart Grid and Renewable Energy.",
            "Distributed Controller-Switch Assignment in 5G Networks.",
            "Modeling MTC and HTC Radio Access in a Sliced 5G Base Station.",
            "Effects of Differentiated 5G Services on Computational and Radio Resource Allocation Performance.",
            "A Survey and Future Directions on Clustering: From WSNs to IoT and Modern Networking Paradigms.",
            "Preventive Start-Time Optimization to Determine Link Weights Against Probabilistic Link Failures.",
            "A Heuristic Approach to Detect MPLS L3 VPN Misconfiguration in Multi-Homed Multi-VRF Site-Redundant CE Environments.",
            "Methodology to Determine the Device-Level Periodicity for Anomaly Detection in EtherCAT-Based Industrial Control Network.",
            "SRPerf: A Performance Evaluation Framework for IPv6 Segment Routing.",
            "Bloom Filter With a False Positive Free Zone.",
            "Conditional Density Estimation of Service Metrics for Networked Services.",
            "VCom: Secure and Efficient Vehicle-to-Vehicle Message Communication Protocol.",
            "NPSCS: Non-Preemptive Stochastic Coflow Scheduling With Time-Indexed LP Relaxation.",
            "Unavailability-Aware Shared Virtual Backup Allocation for Middleboxes: A Queueing Approach.",
            "C4ISR Service Deployment Based on an Improved Quantum Evolutionary Algorithm.",
            "Producer Anonymity Based on Onion Routing in Named Data Networking.",
            "Efficient QoS-Aware Spatial Join Processing for Scalable NoSQL Storage Frameworks.",
            "Correction to \"SDCF: A Software-Defined Cyber Foraging Framework for Cloudlet Environment\".",
            "Guest Editors' Introduction: Special Section on Design and Management of Reliable Communication Networks.",
            "Model-Driven Availability Assessment of the NFV-MANO With Software Rejuvenation.",
            "Reliability-Aware VNF Placement Using a Probability-Based Approach.",
            "Empowering 5G Mobile Devices With Network Softwarization.",
            "Resilient and Latency-Aware Orchestration of Network Slices Using Multi-Connectivity in MEC-Enabled 5G Networks.",
            "SFC Self-Modeling and Active Diagnosis.",
            "Highly Available Service Access Through Proactive Events Execution in LTE NFV.",
            "Latency-Bounded Off-Site Virtual Node Protection in NFV.",
            "Resilient Control Plane Design for Virtual Software Defined Networks.",
            "Robust LFA Protection for Software-Defined Networks (RoLPS).",
            "Highly-Efficient and Adaptive Network Monitoring: When INT Meets Segment Routing.",
            "Disaster Protection in Inter-DataCenter Networks Leveraging Cooperative Storage.",
            "Squeezed Protection in Elastic Optical Networks Subject to Multiple Link Failures.",
            "Soft-Failure Detection, Localization, Identification, and Severity Prediction by Estimating QoT Model Input Parameters.",
            "Socially-Aware-Clustering-Enabled Federated Learning for Edge Networks.",
            "Risk-Aware Cloud-Edge Computing Framework for Delay-Sensitive Industrial IoTs.",
            "SINR-Based Analysis of IEEE 802.11p/bd Broadcast VANETs for Safety Services.",
            "Service-Based Resilience via Shared Protection in Mission-Critical Embedded Networks.",
            "A Machine-Learning-Based Action Recommender for Network Operation Centers.",
            "Supporting Sustainable Virtual Network Mutations With Mystique.",
            "Self-Healing Dilemmas in Distributed Systems: Fault Correction vs. Fault Tolerance.",
            "Network Protection Against Node Attacks Based on Probabilistic Availability Measures.",
            "Reachability-Based Robustness of Controllability in Sparse Communication Networks.",
            "Exploring Biological Robustness for Reliable Multi-UAV Networks.",
            "Performance Analysis of Optimization Algorithms for a Cross-Layer Shadowing Recover Scheme.",
            "Multi-Operator Connectivity Sharing for Reliable Networks: A Data-Driven Risk Analysis.",
            "Survivability and Disaster Recovery Modeling of Cellular Networks Using Matrix Exponential Distributions.",
            "Edge Strategies in Industry: Overview and Challenges.",
            "A Runtime-Enabled P4 Extension to the Open vSwitch Packet Processing Pipeline.",
            "P8: P4 With Predictable Packet Processing Performance.",
            "Virtual Queues for P4: A Poor Man's Programmable Traffic Manager.",
            "SPRM: Source Path Routing Model and Link Failure Handling in Software-Defined Networks.",
            "A Lightweight Scheme of Active-Port-Aware Monitoring in Software-Defined Networks.",
            "Flow-Aware Forwarding in SDN Datacenters Using a Knapsack-PSO-Based Solution.",
            "On-Demand Dynamic Controller Placement in Software Defined Satellite-Terrestrial Networking.",
            "Multi-Objective Control Plane Dimensioning in Hybrid SDN/Legacy Networks.",
            "Backup Allocation Model With Probabilistic Protection for Virtual Networks Against Multiple Facility Node Failures.",
            "Joint Resource Optimization and Delay-Aware Virtual Network Function Migration in Data Center Networks.",
            "Fair Scheduling and Rate Control for Service Function Chain in NFV Enabled Data Center.",
            "Robust Virtual Network Function Allocation in Service Function Chains With Uncertain Availability Schedule.",
            "Time-Sensitive Mobile User Association and SFC Placement in MEC-Enabled 5G Networks.",
            "Adaptive Placement and Routing for Service Function Chains With Service Deadlines.",
            "Application-Driven Provisioning of Service Function Chains Over Heterogeneous NFV Platforms.",
            "Service Chaining Placement Based on Satellite Mission Planning in Ground Station Networks.",
            "CoinPrune: Shrinking Bitcoin's Blockchain Retrospectively.",
            "Understanding Selfish Mining in Imperfect Bitcoin and Ethereum Networks With Extended Forks.",
            "Cyber Insurance Design for Validator Rotation in Sharded Blockchain Networks: A Hierarchical Game-Based Approach.",
            "Game-Theoretic Framework for Malicious Controller Detection in Software Defined Networks.",
            "On Achieving Trustworthy Service Function Chaining.",
            "Vulnerability-Aware Resilient Networks: Software Diversity-Based Network Adaptation.",
            "Identifying Networks Vulnerable to IP Spoofing.",
            "Adoption of Email Anti-Spoofing Schemes: A Large Scale Analysis.",
            "SOS: NDN Based Service-Oriented Game-Theoretic Efficient Security Scheme for IoT Networks.",
            "Security-Aware Planning of Packet-Over-Optical Networks in Consideration of OTN Encryption.",
            "On the Bilevel Optimization to Design Control Plane for SDONs in Consideration of Planned Physical-Layer Attacks.",
            "REPEL: A Strategic Approach for Defending 5G Control Plane From DDoS Signalling Attacks.",
            "SETA++: Real-Time Scalable Encrypted Traffic Analytics in Multi-Gbps Networks.",
            "A Decision Support System for Optimal Selection of Enterprise Information Security Preventative Actions.",
            "Privacy Risk is a Function of Information Type: Learnings for the Surveillance Capitalism Age.",
            "Trust-Related Attacks and Their Detection: A Trust Management Model for the Social IoT.",
            "Privacy Leakage and Protection of InputConnection Interface in Android.",
            "Unveiling the End-User Viewport Resolution From Encrypted Video Traces.",
            "Deployable Models for Approximating Web QoE Metrics From Encrypted Traffic.",
            "Multi-Agent Meta-Reinforcement Learning for Self-Powered and Sustainable Edge Computing Systems.",
            "Minimum-Cost Edge-Server Location Strategy in Mobile Crowdsensing.",
            "SE-VFC: Secure and Efficient Outsourcing Computing in Vehicular Fog Computing.",
            "Modeling and Verification of Service Allocation Policies for Multi-Access Edge Computing Using Probabilistic Model Checking.",
            "Deep Reinforcement Learning-Based Content Migration for Edge Content Delivery Networks With Vehicular Nodes.",
            "Caching Popular Transient IoT Contents in an SDN-Based Edge Infrastructure.",
            "DMRO: A Deep Meta Reinforcement Learning-Based Task Offloading Framework for Edge-Cloud Computing.",
            "Resource Pricing and Demand Allocation for Revenue Maximization in IaaS Clouds: A Market-Oriented Approach.",
            "Risk-Aware Energy Scheduling for Edge Computing With Microgrid: A Multi-Agent Deep Reinforcement Learning Approach.",
            "On Assessing the Performance of IEEE 802.11ad Beamforming Training.",
            "Enabling Dynamically Centralized RAN Architectures in 5G and Beyond.",
            "AI-Based Resource Provisioning of IoE Services in 6G: A Deep Reinforcement Learning Approach.",
            "A Service-Centric Q-Learning Algorithm for Mobility Robustness Optimization in LTE.",
            "FDLA: A Novel Frequency Diversity and Link Aggregation Solution for Handover in an Indoor Vehicular VLC Network.",
            "Data-Driven Energy Conservation in Cellular Networks: A Systems Approach.",
            "DND: Driver Node Detection for Control Message Diffusion in Smart Transportations.",
            "Multi-Agent Based Autonomic Network Management Architecture.",
            "The Art of Detecting Forwarding Detours.",
            "Cooperative Learning for Disaggregated Delay Modeling in Multidomain Networks.",
            "IPvest: Clustering the IP Traffic of Network Entities Hidden Behind a Single IP Address Using Machine Learning.",
            "Avoiding Flow Size Overestimation in Count-Min Sketch With Bloom Filter Constructions.",
            "Optimizing All-to-All Data Transmission in WANs.",
            "On the Cross-Layer Network Planning for Flexible Ethernet Over Elastic Optical Networks.",
            "On the Approximability of Related Machine Scheduling Under Arbitrary Precedence.",
            "Competition-Congestion-Aware Stable Worker-Task Matching in Mobile Crowd Sensing.",
            "Optimization Model for Multiple Backup Resource Allocation With Workload-Dependent Failure Probability.",
            "Measuring Network Conditions in Data Centers Using the Precision Time Protocol.",
            "SAFAR: Simulated Annealing-Based Flow Allocation Rules for Industrial Networks.",
            "NEMA: Automatic Integration of Large Network Management Databases.",
            "Understanding Data Usage Patterns of Geographically Diverse Mobile Users.",
            "Many-Objective Automatic Service Composition Based on Temporal Goal Decomposition.",
            "Self-Learning Multi-Objective Service Coordination Using Deep Reinforcement Learning.",
            "A Tensor-Based Approach for the QoS Evaluation in Service-Oriented Environments.",
            "LDNM: A General Web Service Classification Framework via Deep Fusion of Structured and Unstructured Features.",
            "CNAME Cloaking-Based Tracking on the Web: Characterization, Detection, and Protection.",
            "Content Availability at Network Failure in Information-Centric Networking.",
            "A Neighborhood Aware Caching and Interest Dissemination Scheme for Content Centric Networks.",
            "3CP: Coordinated Congestion Control Protocol for Named-Data Networking.",
            "Guest Editorial: Special Section on Embracing Artificial Intelligence for Network and Service Management.",
            "DeepEdge: A New QoE-Based Resource Allocation Framework Using Deep Reinforcement Learning for Future Heterogeneous Edge-IoT Applications.",
            "Predictive UAV Base Station Deployment and Service Offloading With Distributed Edge Learning.",
            "Joint Optimization With DNN Partitioning and Resource Allocation in Mobile Edge Computing.",
            "DQN Dynamic Pricing and Revenue Driven Service Federation Strategy.",
            "Real-Time Multiple-Workflow Scheduling in Cloud Environments.",
            "Adaptive Feature Selection and Construction for Day-Ahead Load Forecasting Use Deep Learning Method.",
            "AI-Based Communication-as-a-Service for Network Management in Society 5.0.",
            "Embracing Complexity: Agent-Based Modeling for HetNets Design and Optimization via Concurrent Reinforcement Learning Algorithms.",
            "Harnessing UAVs for Fair 5G Bandwidth Allocation in Vehicular Communication via Deep Reinforcement Learning.",
            "VNE-HRL: A Proactive Virtual Network Embedding Algorithm Based on Hierarchical Reinforcement Learning.",
            "Motion-Aware Optimizations for Downlink MU-MIMO in 802.11ax Networks.",
            "Deep Learning and Zero-Day Traffic Classification: Lessons Learned From a Commercial-Grade Dataset.",
            "Log Sequence Anomaly Detection Based on Local Information Extraction and Globally Sparse Transformer Model.",
            "Multi-Objective Deep Reinforcement Learning Assisted Service Function Chains Placement.",
            "A Packet Loss Monitoring System for In-Band Network Telemetry: Detection, Localization, Diagnosis and Recovery.",
            "Spillover Today? Predicting Traffic Overflows on Private Peering of Major Content Providers.",
            "Neural and Attentional Factorization Machine-Based Web API Recommendation for Mashup Development.",
            "Network Abnormal Traffic Detection Model Based on Semi-Supervised Deep Reinforcement Learning.",
            "Abnormal Behavior Detection Based on Traffic Pattern Categorization in Mobile Networks.",
            "XAI Meets Mobile Traffic Classification: Understanding and Improving Multimodal Deep Learning Architectures.",
            "Throughput Optimization and Delay Guarantee VNF Placement for Mapping SFC Requests in NFV-Enabled Networks.",
            "Joint Dynamical VNF Placement and SFC Routing in NFV-Enabled SDNs.",
            "Efficient VNF Placement for Poisson Arrived Traffic.",
            "Virtual Network Function Allocation in Service Function Chains Using Backups With Availability Schedule.",
            "On the Upgrade of Service Function Chains With Heterogeneous NFV Platforms.",
            "PPTMon: Real-Time and Fine-Grained Packet Processing Time Monitoring in Virtual Network Functions.",
            "Optimal Network Slicing for Service-Oriented Networks With Flexible Routing and Guaranteed E2E Latency.",
            "pHeavy: Predicting Heavy Flows in the Programmable Data Plane.",
            "Orchestrator for Synchronizing Network Events in SDNs.",
            "Application Aware Multiple Constraint Optimal Paths for Transport Network Using SDN.",
            "Main and Secondary Controller Assignment With Optimal Priority Policy Against Multiple Failures.",
            "SILedger: A Blockchain and ABE-based Access Control for Applications in SDN-IoT Networks.",
            "Efficient Inter-Cloud Authentication and Micropayment Protocol for IoT Edge Computing.",
            "Anonymous and Verifiable Reputation System for E-Commerce Platforms Based on Blockchain.",
            "Garou: An Efficient and Secure Off-Blockchain Multi-Party Payment Hub.",
            "FASE: Fine-Grained Accountable and Space-Efficient Access Control for Multimedia Content With In-Network Caching.",
            "Service Prioritization in Information Centric Networking With Heterogeneous Content Providers.",
            "Towards a Distributed Caching Service at the WiFi Edge Using Wi-Cache.",
            "Scaling and Offloading Optimization in Pre-CORD and Post-CORD Multi-Access Edge Computing.",
            "Code Caching-Assisted Computation Offloading and Resource Allocation for Multi-User Mobile Edge Computing.",
            "Multi-Agent DRL for Task Offloading and Resource Allocation in Multi-UAV Enabled IoT Edge Network.",
            "Anticipatory Allocation of Communication and Computational Resources at the Edge Using Spatio-Temporal Dynamics of Mobile Users.",
            "Keep Hot or Go Cold: A Randomized Online Migration Algorithm for Cost Optimization in STaaS Clouds.",
            "Resource Allocation in Data Centers Using Fast Reinforcement Learning Algorithms.",
            "Self-Imitation Learning-Based Inter-Cell Interference Coordination in Autonomous HetNets.",
            "MARC: On Modeling and Analysis of Software-Defined Radio Access Network Controllers.",
            "Joint Route Selection and Split Level Management for 5G C-RAN.",
            "Optimized Joint Allocation of Radio, Optical, and MEC Resources for the 5G and Beyond Fronthaul.",
            "Data-Driven RAN Slicing Mechanisms for 5G and Beyond.",
            "Automated Service Provisioning and Hierarchical SLA Management in 5G Systems.",
            "Outage Analysis and Reliability Enhancement of Hybrid VLC-RF Networks Using Cooperative Non-Orthogonal Multiple Access.",
            "TEL: Low-Latency Failover Traffic Engineering in Data Plane.",
            "Robust Optimization Model for Probabilistic Protection With Multiple Types of Resources.",
            "Optimal Estimation of Link Delays Based on End-to-End Active Measurements.",
            "Forecasting Quality of Service for Next-Generation Data-Driven WiFi6 Campus Networks.",
            "On the Implications of Routing Models on Network Optimization.",
            "DeepCC: Multi-Agent Deep Reinforcement Learning Congestion Control for Multi-Path TCP Based on Self-Attention.",
            "On the Economics of Network Interconnections and its Impact on Net Neutrality.",
            "Multi-Agent and Cooperative Deep Reinforcement Learning for Scalable Network Automation in Multi-Domain SD-EONs.",
            "The Impact of Networking Protocols on Massive M2M Communication in the Industrial IoT.",
            "A Machine Learning Framework for Handling Delayed/Lost Packets in Tactile Internet Remote Robotic Surgery.",
            "TSEngine: Enable Efficient Communication Overlay in Distributed Machine Learning in WANs.",
            "A Capacity-Elastic Cuckoo Filter Design for Dynamic Set Representation.",
            "Know Where You are: A Practical Privacy-Preserving Semi-Supervised Indoor Positioning via Edge-Crowdsensing.",
            "Corrections to \"A Neighborhood Aware Caching and Interest Dissemination Scheme for Content Centric Networks\"."
        ]
    },
    {
        "name": "TNSM",
        "year": "2020",
        "info": "Volume 17: 2020",
        "count": 194,
        "papers": [
            "2019 Reviewers for IEEE Transactions on Network and Service Management (TNSM).",
            "Guest Editorial: Special Section on Cybersecurity Techniques for Managing Networked Systems.",
            "BotChase: Graph-Based Bot Detection Using Machine Learning.",
            "Analyzing Data Granularity Levels for Insider Threat Detection Using Machine Learning.",
            "IoT-KEEPER: Detecting Malicious IoT Network Activity Using Online Traffic Analysis at the Edge.",
            "Managing IoT Cyber-Security Using Programmable Telemetry and Machine Learning.",
            "An Incrementally-Deployable P4-Enabled Architecture for Network-Wide Heavy-Hitter Detection.",
            "EvilScout: Detection and Mitigation of Evil Twin Attack in SDN Enabled WiFi.",
            "Per-Host DDoS Mitigation by Direct-Control Reinforcement Learning.",
            "Secure Data Encryption Based on Quantum Walks for 5G Internet of Things Scenario.",
            "A Novel Framework for Resource Discovery and Self-Configuration in Software Defined Wireless Mesh Networks.",
            "Connecting the Dots: User Privacy is not Preserved in ID-Removed Cellular Data.",
            "Counteracting Attacks From Malicious End Hosts in Software Defined Networks.",
            "CAPEST: Offloading Network Capacity and Available Bandwidth Estimation to Programmable Data Planes.",
            "Passive Observations of a Large DNS Service: 2.5 Years in the Life of Google.",
            "DISPERSE: A Decentralized Architecture for Content Replication Resilient to Node Failures.",
            "Energy Efficient Data Forwarding Scheme in Fog-Based Ubiquitous System With Deadline Constraints.",
            "Workload and Capacity Optimization for Cloud-Edge Computing Systems with Vertical and Horizontal Offloading.",
            "Charging on the Route: An Online Pricing Gateway Congestion Control for ICNs.",
            "A Scalable and Error-Tolerant Solution for Traffic Matrix Assessment in Hybrid IP/SDN Networks.",
            "Monitoring Enterprise DNS Queries for Detecting Data Exfiltration From Internal Hosts.",
            "QoC-Aware Control Traffic Engineering in Software Defined Networks.",
            "Dynamic and Application-Aware Provisioning of Chained Virtual Security Network Functions.",
            "SDN-Based Security Enforcement Framework for Data Sharing Systems of Smart Healthcare.",
            "On Table Resource Virtualization and Network Slicing in Programmable Data Plane.",
            "Secure Data Query Framework for Cloud and Fog Computing.",
            "Comparison of MongoDB and Cassandra Databases for Spectrum Monitoring As-a-Service.",
            "MNO-OTT Collaborative Video Streaming in 5G: The Zero-Rated QoE Approach for Quality and Resource Management.",
            "A Cooperative Green Content Caching Technique for Next Generation Communication Networks.",
            "Estimating and Synthesizing QoE Based on QoS Measurement for Improving Multimedia Services on Cellular Networks Using ANN Method.",
            "Virtual Machine Trading in Public Clouds.",
            "Efficient Event Scheduling of Network Update.",
            "A QoS-Aware Data Collection Protocol for LLNs in Fog-Enabled Internet of Things.",
            "An Economic Analysis of Cloud-Assisted Routing for Wider Area SDN.",
            "Placement and Chaining for Run-Time IoT Service Deployment in Edge-Cloud.",
            "Apt-RAN: A Flexible Split-Based 5G RAN to Minimize Energy Consumption and Handovers.",
            "Adaptive Load Management of Web Applications on Software Defined Infrastructure.",
            "Failure-Based Controller Placement in Software Defined Networks.",
            "In-Band Network Telemetry in Industrial Wireless Sensor Networks.",
            "Multi-Objective Optimization-Based Virtual Network Embedding Algorithm for Software-Defined Networking.",
            "Introducing an Unsupervised Automated Solution for Root Cause Diagnosis in Mobile Networks.",
            "Framework and Algorithms for Operator-Managed Content Caching.",
            "A DAG-Based Forwarding Paradigm for Large Scale Software Defined Networks.",
            "A Novel Markov Decision Process-Based Solution for Improved Quality Prioritized Video Delivery.",
            "Detecting Saturation Attacks Based on Self-Similarity of OpenFlow Traffic.",
            "Reliability Aware Service Placement Using a Viterbi-Based Algorithm.",
            "Online Learning and Placement Algorithms for Efficient Delivery of User Generated Contents in Telco-CDNs.",
            "DASON: Dependability Assessment Framework for Imperfect Distributed SDN Implementations.",
            "Toward Consistent SDNs: A Case for Network State Fuzzing.",
            "A Scalable Approach to SDN Control Plane Management: High Utilization Comes With Low Latency.",
            "Improving End-Users Utility in Software-Defined Wide Area Network Systems.",
            "Sel-INT: A Runtime-Programmable Selective In-Band Network Telemetry System.",
            "The Power of Composition: Abstracting a Multi-Device SDN Data Path Through a Single API.",
            "RESDN: A Novel Metric and Method for Energy Efficient Routing in Software Defined Networks.",
            "Monitor Placement for Link Latency Measurement in Hybrid SDNs.",
            "Network Service Scheduling With Resource Sharing and Preemption.",
            "A Scaling Mechanism for an Evolved Packet Core Based on Network Functions Virtualization.",
            "CoDeC: A Cost-Effective and Delay-Aware SFC Deployment.",
            "Network Function Offloading Through Classification of Elephant Flows.",
            "Joint Availability Guarantee and Resource Optimization of Virtual Network Function Placement in Data Center Networks.",
            "Reliability-Aware Service Function Chaining With Function Decomposition and Multipath Routing.",
            "Is OpenCL Driven Reconfigurable Hardware Suitable for Virtualising 5G Infrastructure?",
            "A Continuous-Decision Virtual Network Embedding Scheme Relying on Reinforcement Learning.",
            "Lucid: A Practical, Lightweight Deep Learning Solution for DDoS Attack Detection.",
            "Frequency-Minimal Utility-Maximal Moving Target Defense Against DDoS in SDN-Based Systems.",
            "Towards a Trust-Enhanced Blockchain P2P Topology for Enabling Fast and Reliable Broadcast.",
            "An Extended Framework of Privacy-Preserving Computation With Flexible Access Control.",
            "Privacy-Preserving Approach PBCN in Social Network With Differential Privacy.",
            "Multi-Tenant Provisioning for Quantum Key Distribution Networks With Heuristics and Reinforcement Learning: A Comparative Study.",
            "PRIMA: Subscriber-Driven Interference Mitigation for Cloud Services.",
            "Availability-Aware and Energy-Efficient Virtual Cluster Allocation Based on Multi-Objective Optimization in Cloud Datacenters.",
            "RoPE: An Architecture for Adaptive Data-Driven Routing Prediction at the Edge.",
            "Risk-Aware Edge Computation Offloading Using Bayesian Stackelberg Game.",
            "Evaluating the Four-Way Performance Trade-Off for Data Stream Classification in Edge Computing.",
            "Dynamic On-Demand Fog Formation Offering On-the-Fly IoT Service Deployment.",
            "Contract-Based Resource Sharing for Time Effective Task Scheduling in Fog-Cloud Environment.",
            "NEWCAST: Joint Resource Management and QoE-Driven Optimization for Mobile Video Streaming.",
            "Scalable Virtual Network Video-Optimizer for Adaptive Real-Time Video Transmission in 5G Networks.",
            "Analyzing Wikipedia Users' Perceived Quality of Experience: A Large-Scale Study.",
            "XLR (piXel Loss Rate): A Lightweight Indicator to Measure Video QoE in IP Networks.",
            "5MART: A 5G SMART Scheduling Framework for Optimizing QoS Through Reinforcement Learning.",
            "A Diverse Band-Aware Dynamic Spectrum Access Network Architecture for Delay-Tolerant Smart City Applications.",
            "A Sharing Framework for Energy and Computing Resources in Multi-Operator Mobile Networks.",
            "LightFDG: An Integrated Approach to Flow Detection and Grooming in Optical Wireless DCNs.",
            "FCTrees: A Front-Coded Family of Compressed Tree-Based FIB Structures for NDN Routers.",
            "FISE: A Forwarding Table Structure for Enterprise Networks.",
            "Enhanced Rough K-Means Based Flow Aggregation for QoS Mapping in Heterogeneous Network Environments.",
            "Gaussian Process Regression-Based Traffic Load Balancing for Multimedia Multipath Systems.",
            "Congestion Control in the Wild - Investigating Content Provider Fairness.",
            "Let There Be Light: Revealing Hidden MPLS Tunnels With TNT.",
            "Backup Network Design Against Multiple Link Failures to Avoid Link Capacity Overestimation.",
            "Virtual Insanity: Linear Subnet Discovery.",
            "A Multi-View Subspace Learning Approach to Internet Traffic Matrix Estimation.",
            "Unsupervised Online Anomaly Detection With Parameter Adaptation for KPI Abrupt Changes.",
            "Distributed Evolutionary Hyperparameter Optimization for Fuzzy Time Series.",
            "Auto-Scaling Network Service Chains Using Machine Learning and Negotiation Game.",
            "Energy-Efficient Resource Allocation in Cognitive Radio Networks Under Cooperative Multi-Agent Model-Free Reinforcement Learning Schemes.",
            "DeepGuard: Efficient Anomaly Detection in SDN With Fine-Grained Traffic Flow Monitoring.",
            "Fine-Grained Cloud Resource Provisioning for Virtual Network Function.",
            "IntFlow: Integrating Per-Packet and Per-Flowlet Switching Strategy for Load Balancing in Datacenter Networks.",
            "Dynamic VNF Forwarding Graph Extension Algorithms.",
            "A Robust and Resilient Load Balancing Framework for SoftRAN-Based HetNets With Hybrid Energy Supplies.",
            "Reliable Slicing of 5G Transport Networks With Bandwidth Squeezing and Multi-Path Provisioning.",
            "Design and Evaluation of Reconfigurable SDN LEO Constellations.",
            "GDM: A General Distributed Method for Cross-Domain Service Function Chain Embedding.",
            "A Reference Model and Prototype Implementation for SDN-Based Multi Layer Routing in Fog Environments.",
            "Accelerating Virtual Network Functions With Fast-Slow Path Architecture Using eXpress Data Path.",
            "On Virtual Network Embedding: Paths and Cycles.",
            "Joint Progressive Network and Datacenter Recovery After Large-Scale Disasters.",
            "Shed+: Optimal Dynamic Speculation to Meet Application Deadlines in Cloud.",
            "Evaluating the Upper Bound of Energy Cost Saving by Proactive Data Center Management.",
            "Optimization of Virtualization Cost, Processing Power and Network Load of 5G Software-Defined Data Centers.",
            "Joint Availability Enhancement and Traffic Optimization of Virtual Cluster Allocation in Cloud Datacenters.",
            "GMTA: A Geo-Aware Multi-Agent Task Allocation Approach for Scientific Workflows in Container-Based Cloud.",
            "TTLCache: Taming Latency in Erasure-Coded Storage Through TTL Caching.",
            "Allocation of Resources in SAaaS Clouds Managing Thing Mashups.",
            "Reliable and Efficient Multimedia Service Optimization for Edge Computing-Based 5G Networks: Game Theoretic Approaches.",
            "An Experimental Evaluation and Characterization of VoIP Over an LTE-A Network.",
            "Benchmarking Video Service Quality: Quantifying the Viewer Impact of Loss-Related Impairments.",
            "Attack Graph-Based Moving Target Defense in Software-Defined Networks.",
            "An Efficient Approach to Robust SDN Controller Placement for Security.",
            "Optimal Decision Making Approach for Cyber Security Defense Using Evolutionary Game.",
            "Botnet Fingerprinting: A Frequency Distributions Scheme for Lightweight Bot Detection.",
            "BALANCE: Link Flooding Attack Detection and Mitigation via Hybrid-SDN.",
            "BitProb: Probabilistic Bit Signatures for Accurate Application Identification.",
            "Decentralized Lightweight Group Key Management for Dynamic Access Control in IoT Environments.",
            "Fault-Resilient Distributed Detection and Estimation Over a SW-WSN Using LCMV Beamforming.",
            "Can Fine-Grained Functional Split Benefit to the Converged Optical-Wireless Access Networks in 5G and Beyond?",
            "E2E QoS Guarantee for the Tactile Internet via Joint NFV and Radio Resource Allocation.",
            "Robust Planning and Operation of Multi-Cell Homogeneous and Heterogeneous Networks.",
            "Slicing With Guaranteed Quality of Service in WiFi Networks.",
            "User-AP Association Management in Software-Defined WLANs.",
            "Cooperative Network Model for Joint Mobile Sink Scheduling and Dynamic Buffer Management Using Q-Learning.",
            "Usability Matters: A Human-Computer Interaction Study on Network Management Tools.",
            "Grouper: Accelerating Hyperparameter Searching in Deep Learning Clusters With Network Scheduling.",
            "Traffic Engineering With Three-Segments Routing.",
            "Rumor Diffusion Model Based on Representation Learning and Anti-Rumor.",
            "A Theoretical Framework for Network Monitoring Exploiting Segment Routing Counters.",
            "Traffic Engineering in Segment Routing Networks Using MILP.",
            "Sub-Linear Scalability of MQTT Clusters in Topic-Based Publish-Subscribe Applications.",
            "Guest Editorial: Special Section on Data Analytics and Machine Learning for Network and Service Management-Part I.",
            "Deep Reinforcement Adversarial Learning Against Botnet Evasion Attacks.",
            "Exploring Network-Wide Flow Data With Flowyager.",
            "ViCrypt to the Rescue: Real-Time, Machine-Learning-Driven Video-QoE Monitoring for Encrypted Streaming Traffic.",
            "Collaborative Flow Control in the DARPA Spectrum Collaboration Challenge.",
            "You Only Run Once: Spark Auto-Tuning From a Single Run.",
            "Diminishing Returns and Deep Learning for Adaptive CPU Resource Allocation of Containers.",
            "HitAnomaly: Hierarchical Transformers for Anomaly Detection in System Log.",
            "Few-Shot Learning and Self-Training for eNodeB Log Analysis for Service-Level Assurance in LTE Networks.",
            "Estimating Pole Capacity From Radio Network Performance Statistics by Supervised Learning.",
            "Mobility Management With Transferable Reinforcement Learning Trajectory Prediction.",
            "Machine Learning-Based Radio Coverage Prediction in Urban Environments.",
            "Machine Learning-Based Recommender Systems to Achieve Self-Coordination Between SON Functions.",
            "Critical Impact of Social Networks Infodemic on Defeating Coronavirus COVID-19 Pandemic: Twitter-Based Study and Research Directions.",
            "Spotting Political Social Bots in Twitter: A Use Case of the 2019 Spanish General Election.",
            "Data Fusion Oriented Graph Convolution Network Model for Rumor Detection.",
            "Multi-Domain Network Slicing With Latency Equalization.",
            "Network Slice Reconfiguration by Exploiting Deep Reinforcement Learning With Large Action Space.",
            "SliceNetVSwitch: Definition, Design and Implementation of 5G Multi-Tenant Network Slicing in Software Data Paths.",
            "Ensuring Reliability and Low Cost When Using a Parallel VNF Processing Approach to Embed Delay-Constrained Slices.",
            "Study of Virtual Network Function Placement in 5G Cloud Radio Access Network.",
            "Deploying Virtual Network Functions With Non-Uniform Models in Tree-Structured Networks.",
            "Deadline-Aware SFC Orchestration Under Demand Uncertainty.",
            "A Privacy-Preserving Reinforcement Learning Algorithm for Multi-Domain Virtual Network Embedding.",
            "A Dynamic and Collaborative Multi-Layer Virtual Network Embedding Algorithm in SDN Based on Reinforcement Learning.",
            "A Medium-Term Disruption Tolerant SDN for Wireless TCP/IP Networks.",
            "Online Sparse BLSTM Models for Resource Usage Prediction in Cloud Datacentres.",
            "Workflow-Aware Automatic Fault Diagnosis for Microservice-Based Applications With Statistics.",
            "Intelligent and Flexible Bandwidth Scheduling for Data Transfers in Dedicated High-Performance Networks.",
            "Predictive Cyber Foraging for Visual Cloud Computing in Large-Scale IoT Systems.",
            "Aloe: Fault-Tolerant Network Management and Orchestration Framework for IoT Applications.",
            "Efficient and Secure Multi-User Multi-Task Computation Offloading for Mobile-Edge Computing in Mobile IoT Networks.",
            "SDCF: A Software-Defined Cyber Foraging Framework for Cloudlet Environment.",
            "Throughput-Aware Partitioning and Placement of Applications in Fog Computing.",
            "Survey of Network Intrusion Detection Methods From the Perspective of the Knowledge Discovery in Databases Process.",
            "Experimental Review of Neural-Based Approaches for Network Intrusion Management.",
            "Lightweight Misbehavior Detection Management of Embedded IoT Devices in Medical Cyber Physical Systems.",
            "A Statistical Approach for Detection of Denial of Service Attacks in Computer Networks.",
            "Bringing Intelligence to Software Defined Networks: Mitigating DDoS Attacks.",
            "Privacy-Preserved Task Offloading in Mobile Blockchain With Deep Reinforcement Learning.",
            "Revealing Physical World Privacy Leakage by Cyberspace Cookie Logs.",
            "Characterization and Identification of Cloudified Mobile Network Performance Bottlenecks.",
            "Toward an Automated Data Offloading Framework for Multi-RAT 5G Wireless Networks.",
            "An Incentive Mechanism-Based Stackelberg Game for Scheduling of LoRa Spreading Factors.",
            "Virtual Radios, Real Services: Enabling RANaaS Through Radio Virtualisation.",
            "Efficient Handover Mechanism for Radio Access Network Slicing by Exploiting Distributed Learning.",
            "ARENA: A Data-Driven Radio Access Networks Analysis of Football Events.",
            "Monitoring Trail Design Based on Segment Routing.",
            "Predicting Network Flow Characteristics Using Deep Learning and Real-World Network Traffic.",
            "Anomaly-Aware Network Traffic Estimation via Outlier-Robust Tensor Completion.",
            "Cuckoo Filters and Bloom Filters: Comparison and Application to Packet Classification.",
            "Estimation of the Quality of Experience During Video Streaming From Facial Expression and Gaze Direction.",
            "NDMF: Neighborhood-Integrated Deep Matrix Factorization for Service QoS Prediction.",
            "Pragmatic Distance in IoT Devices."
        ]
    },
    {
        "name": "TNSM",
        "year": "2019",
        "info": "Volume 16: 2019",
        "count": 136,
        "papers": [
            "On Incentive-Driven VNF Service Chaining in Inter-Datacenter Elastic Optical Networks: A Hierarchical Game-Theoretic Mechanism.",
            "Resource Allocation Over EON-Based Infrastructures in a Network Virtualization Environment.",
            "Evolvable Virtual Network Function Placement Method: Mechanism and Performance Evaluation.",
            "Agile Network Access Control in the Container Age.",
            "Modeling and Forecasting of Time-Aware Dynamic QoS Attributes for Cloud Services.",
            "Load Balancing of Distributed Datastore in OpenDaylight Controller Cluster.",
            "User Preference Aware Task Coordination and Proactive Bandwidth Allocation in a FiWi-Based Human-Agent-Robot Teamwork Ecosystem.",
            "Single and Multi-Domain Adaptive Allocation Algorithms for VNF Forwarding Graph Embedding.",
            "On Progressive Network Recovery From Massive Failures Under Uncertainty.",
            "A Constrained Shortest Path Scheme for Virtual Network Service Management.",
            "FGAC-NDN: Fine-Grained Access Control for Named Data Networks.",
            "HQTimer: A Hybrid ${Q}$ -Learning-Based Timeout Mechanism in Software-Defined Networks.",
            "QoS-Aware Fog Resource Provisioning and Mobile Device Power Control in IoT Networks.",
            "Tiered Cloud Storage via Two-Stage, Latency-Aware Bidding.",
            "Challenges, Designs, and Performances of a Distributed Algorithm for Minimum-Latency of Data-Aggregation in Multi-Channel WSNs.",
            "Performance-Aware Energy Saving for Data Center Networks.",
            "Dynamic Resource Trading in Sliced Mobile Networks.",
            "Using an IoT Platform for Trustworthy D2D Communications in a Real Indoor Environment.",
            "Trust-Based Service Management for Mobile Cloud IoT Systems.",
            "Protecting Trajectory From Semantic Attack Considering ${k}$ -Anonymity, ${l}$ -Diversity, and ${t}$ -Closeness.",
            "Energy-Aware Resource Management in Heterogeneous Cellular Networks With Hybrid Energy Sources.",
            "Measuring Business Process Consistency Across Different Abstraction Levels.",
            "Fast IP Hopping Randomization to Secure Hop-by-Hop Access in SDN.",
            "A Data-Driven Approach to Client-Transparent Access Selection of Dual-Band WiFi.",
            "An Approach to Pre-Schedule Traffic in Time-Dependent Pricing Systems.",
            "Scalable Many-Field Packet Classification for Traffic Steering in SDN Switches.",
            "A Self-Adaptive Virtual Network Embedding Algorithm Based on Software-Defined Networks.",
            "Joint Energy Efficient and QoS-Aware Path Allocation and VNF Placement for Service Function Chaining.",
            "TCP's Initial Window - Deployment in the Wild and Its Impact on Performance.",
            "Efficient SVC Multicast Streaming for Video Conferencing With SDN Control.",
            "Cell ID Management in Multi-Vendor and Multi-RAT Heterogeneous Networks.",
            "Cooperative Data Sharing for Mobile Cloudlets Under Heterogeneous Environments.",
            "Mobile Encrypted Traffic Classification Using Deep Learning: Experimental Evaluation, Lessons Learned, and Challenges.",
            "Optimized Provisioning of Edge Computing Resources With Heterogeneous Workload in IoT Networks.",
            "A Fair Share for All: TCP-Inspired Adaptation Logic for QoE Fairness Among Heterogeneous HTTP Adaptive Video Streaming Clients.",
            "Pattern-Driven Resource Allocation in Optical Networks.",
            "Enabling Efficient and Consistent Network Update in Wireless Data Centers.",
            "Dispersing Content Over Networks in Information-Centric Networking.",
            "Measuring Web Latency and Rendering Performance: Method, Tools, and Longitudinal Dataset.",
            "An Integrated Event Summarization Approach for Complex System Management.",
            "Energy-Efficient WLANs With Resource and Re-Association Scheduling Optimization.",
            "A Novel Approach for Profile Optimization in DOCSIS 3.1 Networks Exploiting Traffic Information.",
            "Reconfiguration in Network Slicing - Optimizing the Profit and Performance.",
            "Gavel: A Fast and Easy-to-Use Plain Data Representation for Software-Defined Networks.",
            "HiAuth: Hidden Authentication for Protecting Software Defined Networks.",
            "Virtual Network Embedding Through Graph Eigenspace Alignment.",
            "Proactive and Hitless vSDN Reconfiguration to Balance Substrate TCAM Utilization: From Algorithm Design to System Prototype.",
            "IoT Services Allocation at the Edge via Named Data Networking: From Optimal Bounds to Practical Design.",
            "ProFlow: Proportional Per-Bidirectional-Flow Consistent Updates.",
            "Smart Roaming: How Operator Cooperation Can Increase Spectrum Usage Efficiency at Practically No Cost.",
            "Performance Evaluation of Epidemic Content Retrieval in DTNs With Restricted Mobility.",
            "5G-EmPOWER: A Software-Defined Networking Platform for 5G Radio Access Networks.",
            "Joint Optimization of Data-Center Selection and Video-Streaming Distribution for Crowdsourced Live Streaming in a Geo-Distributed Cloud Platform.",
            "Beyond the Click: A First Look at the Role of a Microblogging Platform in the Web Ecosystem.",
            "Risk-Based Criticality for Network Utilities Asset Management.",
            "Fuzzy Workload Orchestration for Edge Computing.",
            "Coflow Scheduling in the Multi-Resource Environment.",
            "Guest Editorial: Special Issue on Novel Techniques in Big Data Analytics for Management.",
            "A Survey on Big Data for Network Traffic Monitoring and Analysis.",
            "LENTA: Longitudinal Exploration for Network Traffic Analysis From Passive Data.",
            "Multivariate Multi-Order Markov Multi-Modal Prediction With Its Applications in Network Traffic Management.",
            "Transparent and Service-Agnostic Monitoring of Encrypted Web Traffic.",
            "Inferring Functional Connectivity From Time-Series of Events in Large Scale Network Deployments.",
            "Machine Learning-Based Routing and Wavelength Assignment in Software-Defined Optical Networks.",
            "Optimizing and Updating LoRa Communication Parameters: A Machine Learning Approach.",
            "Greener RAN Operation Through Machine Learning.",
            "Resource Sharing Efficiency in Network Slicing.",
            "A Hybrid Deep Learning-Based Model for Anomaly Detection in Cloud Datacenter Networks.",
            "DDoS Detection System: Using a Set of Classification Algorithms Controlled by Fuzzy Logic System in Apache Spark.",
            "Ismael: Using Machine Learning to Predict Acceptance of Virtual Clusters in Data Centers.",
            "Experimenting SDN and Cloud Orchestration in Virtualized Testing Facilities: Performance Results and Comparison.",
            "Virtual Functions Placement With Time Constraints in Fog Computing: A Matching Theory Perspective.",
            "Joint Two-Tier Network Function Parallelization on Multicore Platform.",
            "A Semantic-Based Policy Analysis Solution for the Deployment of NFV Services.",
            "A Hierarchical Distributed Control Plane for Path Computation Scalability in Large Scale Software-Defined Networks.",
            "Toward a Scalable, Robust, and QoS-Aware Virtual-Link Provisioning in SDN-Based ISP Networks.",
            "A Traffic Meter Based on a Multicolor Marker for Bandwidth Guarantee and Priority Differentiation in SDN Virtual Networks.",
            "Fast Decision Algorithms for Efficient Access Point Assignment in SDN-Controlled Wireless Access Networks.",
            "iTeleScope: Softwarized Network Middle-Box for Real-Time Video Telemetry and Classification.",
            "Using Session Modeling to Estimate HTTP-Based Video QoE Metrics From Encrypted Network Traffic.",
            "Reproducing Popularity Distribution of YouTube Videos.",
            "Client-Side QoE Management for SVC Video Streaming: An FSM Supported Design Approach.",
            "Human-Agent-Robot Task Coordination in FiWi-Based Tactile Internet Infrastructures Using Context- and Self-Awareness.",
            "FloWatcher-DPDK: Lightweight Line-Rate Flow-Level Monitoring in Software.",
            "On the Modeling of Multi-Point RTT Passive Measurements for Network Delay Monitoring.",
            "Automatic and Generic Periodicity Adaptation for KPI Anomaly Detection.",
            "Network Adaptations Under Cascading Failures for Mission-Oriented Networks.",
            "Rolling With Confidence: Managing the Complexity of DNSSEC Operations.",
            "Walking Without Friends: Publishing Anonymized Trajectory Dataset Without Leaking Social Relationships.",
            "Efficient Coupling Diffusion of Positive and Negative Information in Online Social Networks.",
            "Trust-Aware and Fast Resource Matchmaking for Personalized Collaboration Cloud Service.",
            "TCNS: Node Selection With Privacy Protection in Crowdsensing Based on Twice Consensuses of Blockchain.",
            "MiniForest: Distributed and Dynamic Multicasting in Datacenter Networks.",
            "Proximity-Aware IaaS in an Edge Computing Environment With User Dynamics.",
            "Guest Editorial: Special Issue on Latest Developments for the Management of Softwarized Networks.",
            "Placing Traffic-Changing and Partially-Ordered NFV Middleboxes via SDN.",
            "A Deep Reinforcement Learning Approach for VNF Forwarding Graph Embedding.",
            "Change in Continuity: Chaining Services With an Augmented IGP.",
            "ESSO: An Energy Smart Service Function Chain Orchestrator.",
            "A Fast Near-Optimal Approach for Energy-Aware SFC Deployment.",
            "Profile-Based Resource Allocation for Virtualized Network Functions.",
            "Network-Aware Availability Modeling of an End-to-End NFV-Enabled Service.",
            "A Service-Defined Approach for Orchestration of Heterogeneous Applications in Cloud/Edge Platforms.",
            "An NFV-Based Service Framework for IoT Applications in Edge Computing Environments.",
            "Latency and Reliability-Aware Workload Assignment in IoT Networks With Mobile Edge Clouds.",
            "A MEC-Based Extended Virtual Sensing for Automotive Services.",
            "SDN-Managed Provisioning of Named Computing Services in Edge Infrastructures.",
            "Enhancing Security Management at Software-Defined Exchange Points.",
            "Statistical Assessment of IP Multimedia Subsystem in a Softwarized Environment: A Queueing Networks Approach.",
            "XTRA: Towards Portable Transport Layer Functions.",
            "ABRAHAM: Machine Learning Backed Proactive Handover Algorithm Using SDN.",
            "A Survey of Fault Management in Network Virtualization Environments: Challenges and Solutions.",
            "Probabilistic Virtual Link Embedding Under Demand Uncertainty.",
            "Distributed Network Slicing in Large Scale IoT Based on Coalitional Multi-Game Theory.",
            "RuleTailor: Optimizing Flow Table Updates in OpenFlow Switches With Rule Transformations.",
            "Software Defined Network's Garbage Collection With Clean-Up Packets.",
            "TTLoC: Taming Tail Latency for Erasure-Coded Cloud Storage Systems.",
            "Data Location Management Protocol for Object Stores in a Fog Computing Infrastructure.",
            "Service Function Chain Composition, Placement, and Assignment in Data Centers.",
            "Availability Aware VNF Deployment in Datacenter Through Shared Redundancy and Multi-Tenancy.",
            "A Novel Ad-Hoc Mobile Edge Cloud Offering Security Services Through Intelligent Resource-Aware Offloading.",
            "Adaptive Prediction Models for Data Center Resources Utilization Estimation.",
            "Toward a Flexible Design of SDN Dynamic Control Plane: An Online Optimization Approach.",
            "SODALITE: SDN Wireless Backhauling for Dense 4G/5G Small Cell Networks.",
            "Virtual Network Embedding in Ring Optical Data Centers Using Markov Chain Probability Model.",
            "A Requirement-Oriented Design of NFV Topology by Formal Synthesis.",
            "Macro-Cell Assisted Task Offloading in MEC-Based Heterogeneous Networks With Wireless Backhaul.",
            "Location Semantics Identification via Users' Clickstreams in Mobile Social Networking.",
            "Transparency in the New gTLD Era: Evaluating the DNS Centralized Zone Data Service.",
            "A Proactive Context-Aware Service Replication Scheme for Adhoc IoT Scenarios.",
            "Enforcing Bitrate-Stability for Adaptive Streaming Traffic in Cellular Networks.",
            "Reliable BIER With Peer Caching.",
            "Delay-Constrained Teleoperation Task Scheduling and Assignment for Human+Machine Hybrid Activities Over FiWi Enhanced Networks.",
            "Multicast Optimization for CLOS Fabric in Media Data Centers.",
            "Mystique: A Fine-Grained and Transparent Congestion Control Enforcement Scheme.",
            "FlowTracer: An Effective Flow Trajectory Detection Solution Based on Probabilistic Packet Tagging in SDN-Enabled Networks."
        ]
    },
    {
        "name": "TNSM",
        "year": "2018",
        "info": "Volume 15: 2018",
        "count": 125,
        "papers": [
            "Guest Editorial: Special Section on Advances in Big Data Analytics for Management.",
            "AWESoME: Big Data for Automatic Web Service Management in SDN.",
            "Big Data Analysis-Based Secure Cluster Management for Optimized Control Plane in Software-Defined Networks.",
            "Spatial-Temporal Prediction Models for Active Ticket Managing in Data Centers.",
            "Mining Causality of Network Events in Log Data.",
            "Detecting Botclouds at Large Scale: A Decentralized and Robust Detection Method for Multi-Tenant Virtualized Environments.",
            "Anomaly Detection in Complex Real World Application Systems.",
            "Social Plane for Recommenders in Network Performance Expectation Management.",
            "Efficient Deep Neural Network Serving: Fast and Furious.",
            "Group Mobility Detection and User Connectivity Models for Evaluation of Mobile Network Functions.",
            "Automatic Generation of Workload Profiles Using Unsupervised Learning Pipelines.",
            "Data-Driven Cell Zooming for Large-Scale Mobile Networks.",
            "A Survey of the State-of-the-Art in Fair Multi-Resource Allocations for Data Centers.",
            "OpenSIP: Toward Software-Defined SIP Networking.",
            "Enhancing Metaheuristic-Based Online Embedding in Network Virtualization Environments.",
            "Adaptive Anomaly Detection in Performance Metric Streams.",
            "Troubleshooting Data Plane With Rule Verification in Software-Defined Networks.",
            "Data Connectivity and Smart Group Formation in Wi-Fi Direct Multi-Group Networks.",
            "Pricing the Volume-Based Data Services in Cellular Wireless Markets.",
            "Improving SDN Scalability With Protocol-Oblivious Source Routing: A System-Level Study.",
            "Semistatic Cell Differentiation and Integration With Dynamic BBU-RRH Mapping in Cloud Radio Access Network.",
            "Response Time and Availability Study of RAFT Consensus in Distributed SDN Control Plane.",
            "A Dynamic Trust Framework for Opportunistic Mobile Social Networks.",
            "Daphne: A Flexible and Hybrid Scheduling Framework in Multi-Tenant Clusters.",
            "An Effective Approach to Controller Placement in Software Defined Wide Area Networks.",
            "A Novel Optimal Mapping Algorithm With Less Computational Complexity for Virtual Network Embedding.",
            "Energy Cost Optimization in Dynamic Placement of Virtualized Network Function Chains.",
            "Efficient Action Computation for Compositional SDN Policies.",
            "Soft Partitioning Flow Tables for Virtual Networking in Multi-Tenant Software Defined Networks.",
            "An Automatic Configuration Algorithm for Reliable and Efficient Composite Services.",
            "Efficient Real-Time Content Distribution for Multiple Multicast Groups in SDN-Based WLANs.",
            "On the Understanding of Video Streaming Viewing Behaviors Across Different Content Providers.",
            "Energy Efficient Big Data Networks: Impact of Volume and Variety.",
            "Cost-Efficient NFV-Enabled Mobile Edge-Cloud for Low Latency Mobile Applications.",
            "Traffic Load Balancing Among Brokers at the IoT Application Layer.",
            "Migration-Based Dynamic and Practical Virtual Streaming Agent Placement for Mobile Adaptive Live Streaming.",
            "A Decentralized Replica Placement Algorithm for Edge Computing.",
            "Trouble Ticket Routing Models and Their Applications.",
            "Bandwidth Reservation Strategies for Scheduling Maximization in Dedicated Networks.",
            "Exploiting External Events for Resource Adaptation in Virtual Computer and Network Systems.",
            "Probabilistic Codebook-Based Fault Localization in Data Networks.",
            "Consistency-Aware Weather Disruption-Tolerant Routing in SDN-Based Wireless Mesh Networks.",
            "MAP-Me: Managing Anchor-Less Producer Mobility in Content-Centric Networks.",
            "Effects of C/U Plane Separation and Bearer Aggregation in Mobile Core Network.",
            "Joint Mobility Management and Multicast Rate Adaptation in Software-Defined Enterprise WLANs.",
            "Utilitarian Placement of Composite Services.",
            "On the Benefits of Keeping Path Identifiers Secret in Future Internet: A DDoS Perspective.",
            "Dynamic Interest Transmission Approach for Improving Link Failure Resiliency in Content Centric Network.",
            "A Novel Distribution Service Policy for Crowdsourced Live Streaming in Cloud Platform.",
            "Flow Management and Load Balancing in Dynamic Heterogeneous LANs.",
            "Does Anycast Hang Up on You (UDP and TCP)?",
            "A Novel Distributed Q-Learning Based Resource Reservation Framework for Facilitating D2D Content Access Requests in LTE-A Networks.",
            "Routing Cost Minimization and Throughput Maximization of NFV-Enabled Unicasting in Software-Defined Networks.",
            "Enhancing Information Resilience in Disruptive Information-Centric Networks.",
            "Towards Bayesian-Based Trust Management for Insider Attacks in Healthcare Software-Defined Networks.",
            "CPVNF: Cost-Efficient Proactive VNF Placement and Chaining for Value-Added Services in Content Delivery Networks.",
            "Mobile Edge Computing Resources Optimization: A Geo-Clustering Approach.",
            "Spatial Popularity and Similarity of Watching Videos in Large-Scale Urban Environment.",
            "Optimal-Coherent Network Inference (OCNI): Principles and Applications.",
            "A Practical Byzantine-Based Approach for Faulty Switch Tolerance in Software-Defined Networks.",
            "On Placement of Hypervisors and Controllers in Virtualized Software Defined Network.",
            "Efficient TCAM Rules Distribution Algorithms in Software-Defined Networking.",
            "Competitions Among Service Providers in Cloud Computing: A New Economic Model.",
            "An Inter-Domain Collaboration Scheme to Remedy DDoS Attacks in Computer Networks.",
            "BRAHMA+: A Framework for Resource Scaling of Streaming and ASAP Time-Varying Workflows.",
            "Bidirectional LiFi Attocell Access Point Slicing Scheme.",
            "Three-Tier Capacity and Traffic Allocation for Core, Edges, and Devices for Mobile Edge Computing.",
            "Principal Component-Based Approach for Profile Optimization Algorithms in DOCSIS 3.1.",
            "JASPER: Joint Optimization of Scaling, Placement, and Routing of Virtual Network Services.",
            "Flex5G: Flexible Functional Split in 5G Networks.",
            "Packet Fan-Out Extension for the pcap Library.",
            "Capacity-Aware and Delay-Guaranteed Resilient Controller Placement for Software-Defined WANs.",
            "Green NOMA With Multiple Interference Cancellation (MIC) Using Sector-Based Resource Allocation.",
            "Event Detection in Wireless Body Area Networks Using Kalman Filter and Power Divergence.",
            "Unified Middlebox Model Design and Deployment With Dynamic Resources.",
            "Traffic Classification Based on Zero-Length Packets.",
            "Lightweight Service Mashup Middleware With REST Style Architecture for IoT Applications.",
            "Phishing-Aware: A Neuro-Fuzzy Approach for Anti-Phishing on Fog Networks.",
            "Assessing the Maturity of SDN Controllers With Software Reliability Growth Models.",
            "A Framework for Optimizing the Deployment of Wireless Sensor Networks.",
            "Accurate Resampling of Top-k Monitoring Reports Using Unreported Residual Resource Consumption.",
            "Multi-Layer Virtual Network Embedding.",
            "Dynamic Attack-Resilient Routing in Software Defined Networks.",
            "Docker Layer Placement for On-Demand Provisioning of Services on Edge Clouds.",
            "Service Function Chain Orchestration Across Multiple Domains: A Full Mesh Aggregation Approach.",
            "Guest Editors' Introduction: Special Section on Novel Techniques for Managing Softwarized Networks.",
            "A Load-Balancing Mechanism for Distributed SDN Control Plane Using Response Time.",
            "ZeroSDN: A Highly Flexible and Modular Architecture for Full-Range Distribution of Event-Based Network Control.",
            "RASCAR: Recovery-Aware Switch-Controller Assignment and Routing in SDN.",
            "BWManager: Mitigating Denial of Service Attacks in Software-Defined Networks Through Bandwidth Prediction.",
            "Fast Network Configuration in Software Defined Networking.",
            "Reducing the Monitoring Footprint on Controllers in Software-Defined Networks.",
            "Self-Adaptive Decentralized Monitoring in Software-Defined Networks.",
            "z-TORCH: An Automated NFV Orchestration and Monitoring Solution.",
            "ClusPR: Balancing Multiple Objectives at Scale for NFV Resource Allocation.",
            "In Broker We Trust: A Double-Auction Approach for Resource Allocation in NFV Markets.",
            "Cost and Availability Aware Resource Allocation and Virtual Function Placement for CDNaaS Provision.",
            "Optimization Model for Designing Multiple Virtualized Campus Area Networks Coordinating With Wide Area Networks.",
            "NFV-Based Architecture for the Interworking Between WebRTC and IMS.",
            "SDN Architecture and Southbound APIs for IPv6 Segment Routing Enabled Wide Area Networks.",
            "Automated Inter-Domain Cut-Through Switching for the Future Internet.",
            "An Accurate and Efficient Modeling Framework for the Performance Evaluation of DPDK-Based Virtual Switches.",
            "An Efficient Route Management Framework for Load Balance and Overhead Reduction in SDN-Based Data Center Networks.",
            "An SDN-Based Traffic Matrix Estimation Framework.",
            "SDN Controller Placement With Delay-Overhead Balancing in Wireless Edge Networks.",
            "A Benders Decomposition Approach for Resilient Placement of Virtual Process Control Functions in Mobile Edge Clouds.",
            "RDNA: Residue-Defined Networking Architecture Enabling Ultra-Reliable Low-Latency Datacenters.",
            "Coordinated Service Composition and Embedding of 5G Location-Constrained Network Functions.",
            "How to Migrate From Operational LTE/LTE-A Networks to C-RAN With Minimal Investment?",
            "A Routing Framework for Offloading Traffic From Cellular Networks to SDN-Based Multi-Hop Device-to-Device Networks.",
            "Toward Optimal Resource Allocation of Virtualized Network Functions for Hierarchical Datacenters.",
            "SAFETY: Early Detection and Mitigation of TCP SYN Flood Utilizing Entropy in SDN.",
            "Scalable Traffic Management for Mobile Cloud Services in 5G Networks.",
            "Cost-Driven Scheduling for Deadline-Based Workflow Across Multiple Clouds.",
            "ACE: Availability-Aware CloudSim Extension.",
            "Atomicity and Non-Anonymity in Population-Like Games for the Energy Efficiency of Hybrid-Power HetNets.",
            "Running the Network Harder: Connection Provisioning Under Resource Crunch.",
            "Online Virtual Network Embedding Based on Virtual Links' Rate Requirements.",
            "Routing Perturbation for Traffic Matrix Evaluation in a Segment Routing Network.",
            "Towards 5G: A Reinforcement Learning-Based Scheduling Solution for Data Traffic Management.",
            "Flow-Aware Routing and Forwarding for SDN Scalability in Wireless Data Centers.",
            "Optimal Deployment of Configurable Business Processes in Cloud Federations.",
            "Improved Power of Two Choices for Fat-Tree Routing.",
            "Priority-Based Flow Control for Dynamic and Reliable Flow Management in SDN.",
            "ORCHESTRA: Enabling Inter-Technology Network Management in Heterogeneous Wireless Networks."
        ]
    },
    {
        "name": "TNSM",
        "year": "2017",
        "info": "Volume 14: 2017",
        "count": 86,
        "papers": [
            "2016 Reviewers for IEEE Transactions on Network and Service Management.",
            "Network Flow Query Language - Design, Implementation, Performance, and Applications.",
            "The Economics of CDNs and Their Impact on Service Fairness.",
            "Online and Scalable Unsupervised Network Anomaly Detection Method.",
            "Subscriber-Driven Interference Detection for Cloud-Based Web Services.",
            "Large-Scale Dynamic Controller Placement.",
            "Nodes Migration Scheduling of Access Networks.",
            "Multi-Provider Service Chain Embedding With Nestor.",
            "Topology-Aware Prediction of Virtual Network Function Resource Requirements.",
            "Response-Time-Optimized Service Deployment: MILP Formulations of Piece-Wise Linear Functions Approximating Bivariate Mixed-Integer Functions.",
            "Analytical Model for Elastic Scaling of Cloud-Based Firewalls.",
            "Distributed Load Balancing for the Resilient Publish/Subscribe Overlay in SeDAX.",
            "Service Curve Estimation-Based Characterization and Evaluation of Closed-Loop Flow Control.",
            "Backpressure on the Backbone: A Lightweight, Non-Intrusive Traffic Engineering Approach.",
            "PMNDN: Proxy Based Mobility Support Approach in Mobile NDN Environment.",
            "Optimizing Differentiated Latency in Multi-Tenant, Erasure-Coded Storage.",
            "Trust-Based Task Assignment With Multiobjective Optimization in Service-Oriented Ad Hoc Networks.",
            "Towards Effective Trust-Based Packet Filtering in Collaborative Network Environments.",
            "Knowledge Guided Hierarchical Multi-Label Classification Over Ticket Data.",
            "Generalized Recovery From Node Failure in Virtual Network Embedding.",
            "Optimally Selecting Standby Virtual Routers for Node Failures in a Virtual Network Environment.",
            "Cost Efficient Design of Fault Tolerant Geo-Distributed Data Centers.",
            "Control Path Management Framework for Enhancing Software-Defined Network (SDN) Reliability.",
            "Semantically Enhanced Mapping Algorithm for Affinity-Constrained Service Function Chain Requests.",
            "A New QoS-Aware Web Service Recommendation System Based on Contextual Feature Recognition at Server-Side.",
            "Optimizing Resource Allocation for Virtualized Network Functions in a Cloud Center Using Genetic Algorithms.",
            "An Efficient Survivable Design With Bandwidth Guarantees for Multi-Tenant Cloud Networks.",
            "Loop-Free Convergence With Unordered Updates.",
            "Practical Network Coding for the Update Problem in Cloud Storage Systems.",
            "Centrally Controlled Mass Data Offloading Using Vehicular Traffic.",
            "An Opportunistic Push Scheme for Online Social Networking Services in Heterogeneous Wireless Networks.",
            "User Association and Resource Allocation Optimization in LTE Cellular Networks.",
            "Quality of Service Oriented Access Point Selection Framework for Large Wi-Fi Networks.",
            "Joint Routing and Energy Management in UnderWater Acoustic Sensor Networks.",
            "A Distributed Monitoring Strategy for Detecting Version Number Attacks in RPL-Based Networks.",
            "SLICOTS: An SDN-Based Lightweight Countermeasure for TCP SYN Flooding Attacks.",
            "Mobile-Edge Computing Versus Centralized Cloud Computing Over a Converged FiWi Access Network.",
            "Capacitated Next Controller Placement in Software Defined Networks.",
            "SDN-Based Traffic Aware Placement of NFV Middleboxes.",
            "On Dynamic Service Function Chain Deployment and Readjustment.",
            "A Reliability-Aware Network Service Chain Provisioning With Delay Guarantees in NFV-Enabled Enterprise Datacenter Networks.",
            "A Novel Reactive Survivable Virtual Network Embedding Scheme Based on Game Theory.",
            "T-NOVA: An Open-Source MANO Stack for NFV Infrastructures.",
            "Analytical Model for SDN Signaling Traffic and Flow Table Occupancy and Its Application for Various Types of Traffic.",
            "SigMA: Signaling Framework for Decentralized Network Management Applications.",
            "Efficient Algorithms for Throughput Maximization in Software-Defined Networks With Consolidated Middleboxes.",
            "Vertex Entropy As a Critical Node Measure in Network Monitoring.",
            "PowerNetS: Coordinating Data Center Network With Servers and Cooling for Power Optimization.",
            "Simultaneous Cost and QoS Optimization for Cloud Resource Allocation.",
            "A Distributed Deployment Algorithm of Process Fragments With Uncertain Traffic Matrix.",
            "CDN-As-a-Service Provision Over a Telecom Operator's Cloud.",
            "Cognitively Adjusting Imprecise User Preferences for Service Selection.",
            "QoS-Aware Dynamic RRH Allocation in a Self-Optimized Cloud Radio Access Network With RRH Proximity Constraint.",
            "nROAR: Near Real-Time Opportunistic Spectrum Access and Management in Cloud-Based Database-Driven Cognitive Radio Networks.",
            "Leveraging SDN and WebRTC for Rogue Access Point Security.",
            "A Centralized Optimization Solution for Application Layer Multicast Tree.",
            "Guest Editors' Introduction: Special Issue on Advances in Management of Softwarized Networks.",
            "OFLoad: An OpenFlow-Based Dynamic Load Balancing Strategy for Datacenter Networks.",
            "Application-Aware Network Design for Hadoop MapReduce Optimization Using Software-Defined Networking.",
            "VirtPhy: Fully Programmable NFV Orchestration Architecture for Edge Data Centers.",
            "Online-Batch Joint Routing and Channel Allocation for Hybrid Data Center Networks.",
            "Flow Optimization in Data Centers With Clos Networks in Support of Cloud Applications.",
            "On the Interplay Between Network Function Mapping and Scheduling in VNF-Based Networks: A Column Generation Approach.",
            "On the Placement of VNF Managers in Large-Scale and Distributed NFV Systems.",
            "A Graph Partitioning Game Theoretical Approach for the VNF Service Chaining Problem.",
            "Service Mapping and Orchestration Over Multi-Tenant Cloud-Enabled RAN.",
            "Evaluation of Forwarding Efficiency in NFV-Nodes Toward Predictable Service Chain Performance.",
            "NFV-Bench: A Dependability Benchmark for Network Function Virtualization Systems.",
            "NFV-Throttle: An Overload Control Framework for Network Function Virtualization.",
            "Statelet-Based Efficient and Seamless NFV State Transfer.",
            "ParaCon: A Parallel Control Plane for Scaling Up Path Computation in SDN.",
            "Deterministic Quality of Service Guarantee for Dynamic Service Chaining in Software Defined Networking.",
            "DetServ: Network Models for Real-Time QoS Provisioning in SDN-Based Industrial Environments.",
            "Inter-Controller Traffic to Support Consistency in ONOS Clusters.",
            "Including Failure Correlation in Availability Modeling of a Software-Defined Backbone Network.",
            "Unified Programmability of Virtualized Network Functions and Software-Defined Wireless Networks.",
            "Towards a Cost Optimal Design for a 5G Mobile Core Network Based on SDN and NFV.",
            "A Dynamic QoS Negotiation Mechanism Between Wired and Wireless SDN Domains.",
            "Mitigating the Table-Overflow Attack in Software-Defined Networking.",
            "Deceiving Network Reconnaissance Using SDN-Based Virtual Topologies.",
            "An Efficient Framework for Data-Plane Verification With Geometric Windowing Queries.",
            "Content-Centric Networking Management Based on Software Defined Networks: Survey.",
            "An SDN/NFV Platform for Personal Cloud Services.",
            "NFV-Based Scalable Guaranteed-Bandwidth Multicast Service for Software Defined ISP Networks.",
            "A Split Architecture Approach to Terabyte-Scale Caching in a Protocol-Oblivious Forwarding Switch.",
            "Correction to \"Vertex Entropy as a Critical Node Measure in Network Monitoring\"."
        ]
    },
    {
        "name": "TNSM",
        "year": "2016",
        "info": "Volume 13: 2016",
        "count": 71,
        "papers": [
            "Adaptive Path Isolation for Elephant and Mice Flows by Exploiting Path Diversity in Datacenters.",
            "Wildcard Rules Caching and Cache Replacement Algorithms in Software-Defined Networking.",
            "OpenSec: Policy-Based Security Using Software-Defined Networking.",
            "\"I Can't Get No Satisfaction\": Helping Autonomous Systems Identify Their Unsatisfied Interdomain Interests.",
            "Experimental Evidence on Decision-Making in Availability Service Level Agreements.",
            "Mobile Data Offloading Through Caching in Residential 802.11 Wireless Networks.",
            "Cognitive Cellular Networks: A Q-Learning Framework for Self-Organizing Networks.",
            "Reliable and Efficient Data Acquisition in Wireless Sensor Networks in the Presence of Transfaulty Nodes.",
            "A Formal Model of QoS-Aware Web Service Orchestration Engine.",
            "Collaborative Web Service Quality Prediction via Exploiting Matrix Factorization and Network Map.",
            "Hybrid IP/SDN Networking: Open Implementation and Experiment Management Tools.",
            "Design Patterns and Extensibility of REST API for Networking Applications.",
            "Assessing the Implications of Cellular Network Performance on Mobile Content Access.",
            "Next to You: Monitoring Quality of Experience in Cellular Networks From the End-Devices.",
            "Self-Tuning Service Provisioning for Decentralized Cloud Applications.",
            "SDN-Based Virtual Machine Management for Cloud Data Centers.",
            "Software-Defined Management of Edge as a Service Networks.",
            "Scheduling Wireless Virtual Networks Functions.",
            "Multi-Path Link Embedding for Survivability in Virtual Networks.",
            "Using Empirical Estimates of Effective Bandwidth in Network-Aware Placement of Virtual Machines in Datacenters.",
            "A Formal Aspect-Oriented Method for Modeling and Analyzing Adaptive Resource Scheduling in Cloud Computing.",
            "Toward Beneficial Transformation of Enterprise Workloads to Hybrid Clouds.",
            "Cooperative Announcement-Based Caching for Video-on-Demand Streaming.",
            "Multicriteria Breadcrumbs Scoping: Multiple Constraint-Based Distribution Methods of In-Network Guidance Information in Content-Oriented Network.",
            "FakeMask: A Novel Privacy Preserving Approach for Smartphones.",
            "Situation-Aware IoT Service Coordination Using the Event-Driven SOA Paradigm.",
            "Guest Editors' Introduction: Special Issue on Management of Softwarized Networks.",
            "Control Plane Latency With SDN Network Hypervisors: The Cost of Virtualization.",
            "SDN Partitioning: A Centralized Control Plane for Distributed Routing Protocols.",
            "The Budgeted Maximum Coverage Problem in Partially Deployed Software Defined Networks.",
            "Flexible Traffic Splitting in OpenFlow Networks.",
            "Optimization of SDN Flow Operations in Multi-Failure Restoration Scenarios.",
            "Time4: Time for SDN.",
            "Consistent Network Management for Software-Defined Networking Based Multicast.",
            "Resource Slicing in Virtual Wireless Networks: A Survey.",
            "Efficient Virtual Network Optimization Across Multiple Domains Without Revealing Private Information.",
            "A Reliable Embedding Framework for Elastic Virtualized Services in the Cloud.",
            "Generating Virtual Network Embedding Problems With Guaranteed Solutions.",
            "Resource Allocation in NFV: A Comprehensive Survey.",
            "A Scalable Algorithm for the Placement of Service Function Chains.",
            "Toward a Fully Cloudified Mobile Network Infrastructure.",
            "Information Exchange Management as a Service for Network Function Virtualization Environments.",
            "Guest Editors' Introduction: Special Issue on Big Data Analytics for Management.",
            "A Pretreatment Workflow Scheduling Approach for Big Data Applications in Multicloud Environments.",
            "Supporting Autonomic Management of Clouds: Service Clustering With Random Forest.",
            "Virtualization in the Private Cloud: State of the Practice.",
            "Smart Experts for Network State Estimation.",
            "Network Volume Anomaly Detection and Identification in Large-Scale Networks Based on Online Time-Structured Traffic Tensor Tracking.",
            "A New Approach to Dimensionality Reduction for Anomaly Detection in Data Traffic.",
            "Network-Wide Anomaly Event Detection and Diagnosis With perfSONAR.",
            "Grasping Popular Applications in Cellular Networks With Big Data Analytics Platforms.",
            "SeLINA: A Self-Learning Insightful Network Analyzer.",
            "Customizable Function Chains: Managing Service Chain Variability in Hybrid NFV Networks.",
            "Orchestrating Virtualized Network Functions.",
            "SDN-Based Smart Gateways (Sm-GWs) for Multi-Operator Small Cell Network Management.",
            "Flexible, Efficient, and Scalable Software-Defined Over-the-Top Multicast for ISP Environments With DynSdm.",
            "An Enhanced Available Bandwidth Estimation Technique for an End-to-End Network Path.",
            "Predicting Inter-Data-Center Network Traffic Using Elephant Flow and Sublink Information.",
            "Measuring and Analyzing Third-Party Mobile Game App Stores in China.",
            "A Load-Balanced Call Admission Controller for IMS Cloud Computing.",
            "SDN APIs and Models for Two-Sided Resource Management in Broadband Access Networks.",
            "Efficient Client Assignment for Client-Server Systems.",
            "Cache Replacement Based on Distance to Origin Servers.",
            "Dynamic Router Performance Control Utilizing Support Vector Machines for Energy Consumption Reduction.",
            "Case Studies of SCADA Firewall Configurations and the Implications for Best Practices.",
            "Verification of Configuration Management Changes in Self-Organizing Networks.",
            "Surviving Multiple Failures in Multicast Virtual Networks With Virtual Machines Migration.",
            "Dedicated Protection for Survivable Virtual Network Embedding.",
            "Linking Virtual Machine Mobility to User Mobility.",
            "Reactive Pricing: An Adaptive Pricing Policy for Cloud Providers to Maximize Profit.",
            "Resolution Recommendation for Event Tickets in Service Management."
        ]
    },
    {
        "name": "TNSM",
        "year": "2015",
        "info": "Volume 12: 2015",
        "count": 45,
        "papers": [
            "Guest Editors' Introduction: Special Issue on Efficient Management of SDN/NFV-Based Systems - Part I.",
            "Heuristic Approaches to the Controller Placement Problem in Large Scale SDN Networks.",
            "Adaptive Resource Management and Control in Software Defined Networks.",
            "NetVM: High Performance and Flexible Networking Using Virtualization on Commodity Platforms.",
            "An SDN-Based CDN/ISP Collaboration Architecture for Managing High-Volume Flows.",
            "CPU Provisioning Algorithms for Service Differentiation in Cloud-Based Environments.",
            "VPEF: A Simple and Effective Incentive Mechanism in Community-Based Autonomous Networks.",
            "Joint Optimization for the Delivery of Multiple Video Channels in Telco-CDNs.",
            "Differentiated Performance Management in Virtualized Environments Using Nonlinear Control.",
            "Guest Editors' Introduction: Special issue on efficient management of SDN/NFV-based systems - Part II.",
            "A Hybrid Hierarchical Control Plane for Flow-Based Large-Scale Software-Defined Networks.",
            "Fine-Grained Energy-Efficient Consolidation in SDN Networks and Devices.",
            "Programming Abstractions for Software-Defined Wireless Networks.",
            "XCollOpts: A Novel Improvement of Network Virtualizations in Xen for I/O-Latency Sensitive Applications on Multicores.",
            "Analyzing Impact of Introducing CCN on Profit of ISPs.",
            "Multi-Provider Virtual Network Embedding With Limited Information Disclosure.",
            "Striking a Balance Between Traffic Engineering and Energy Efficiency in Virtual Machine Placement.",
            "Resource Contention Detection in Virtualized Environments.",
            "Concurrent Bandwidth Reservation Strategies for Big Data Transfers in High-Performance Networks.",
            "Towards Adaptive Network Nodes via Service Chain Construction.",
            "Controlling Race Conditions in OpenFlow to Accelerate Application Verification and Packet Forwarding.",
            "On-Demand Discovery of Software Service Dependencies in MANETs.",
            "TeaCP: A Toolkit for Evaluation and Analysis of Collection Protocols in Wireless Sensor Networks.",
            "WiFi Network Virtualization to Control the Connectivity of a Target Service.",
            "Managing Performance Interference in Cloud-Based Web Services.",
            "A Path Generation Approach to Embedding of Virtual Networks.",
            "Time-Aware VMFlow Placement, Routing, and Migration for Power Efficiency in Data Centers.",
            "Greenslater: On Satisfying Green SLAs in Distributed Clouds.",
            "Energy-Efficient Resource Allocation and Provisioning Framework for Cloud Data Centers.",
            "Impact of Packet Sampling on Link Dimensioning.",
            "Network Topology Inference With Partial Information.",
            "How Much to Coordinate? Optimizing In-Network Caching in Content-Centric Networks.",
            "An Analytical Model to Design and Manage a Green SDN/NFV CPE Node.",
            "Adaptive Network Defense Management for Countering Smart Attack and Selective Capture in Wireless Sensor Networks.",
            "Mitigating Mimicry Attacks Against the Session Initiation Protocol.",
            "A Secure Addressing Scheme for Large-Scale Managed MANETs.",
            "Detecting Malicious Data Injections in Event Detection Wireless Sensor Networks.",
            "Minimizing the Net Present Cost of Deploying and Operating Wireless Sensor Networks.",
            "Measurement and Prediction of Access Control Policy Evaluation Performance.",
            "DisCaRia - Distributed Case-Based Reasoning System for Fault Management.",
            "An Effective Web Service Ranking Method via Exploring User Behavior.",
            "Flow-Based Management For Energy Efficient Campus Networks.",
            "Routing Algorithms for Network Function Virtualization Enabled Multicast Topology on SDN.",
            "Statistical Approximation of Efficient Caching Mechanisms for One-Timers.",
            "ATFQ: A Fair and Efficient Packet Scheduling Method in Multi-Resource Environments."
        ]
    },
    {
        "name": "TNSM",
        "year": "2014",
        "info": "Volume 11: 2014",
        "count": 38,
        "papers": [
            "Integrated Resiliency Planning in Storage Clouds.",
            "Learning Automata-Based QoS Framework for Cloud IaaS.",
            "Consistency as a Service: Auditing Cloud Consistency.",
            "Multi-Granularity Memory Mirroring via Binary Translation in Cloud Environments.",
            "TransCom: A Virtual Disk-Based Cloud Computing Platform for Heterogeneous Services.",
            "Security as a Service Model for Cloud Environment.",
            "Information Flow Control for Secure Cloud Computing.",
            "Proactive Workload Management in Hybrid Cloud Computing.",
            "An Advanced MapReduce: Cloud MapReduce, Enhancements and Applications.",
            "A Flexible Architecture for Service Management in the Cloud.",
            "Achieving Sub-Second Downtimes in Large-Scale Virtual Machine Migrations with LISP.",
            "SeLeCT: Self-Learning Classifier for Internet Traffic.",
            "On-the-Fly Capture and Replay Mechanisms for Multi-Port Network Devices in Operational Networks.",
            "On the Backbone VLAN Identifier (BVID) Allocation in 802.1Qay Provider Backbone Bridged - Traffic Engineered Networks.",
            "An Economic Framework for Routing and Channel Allocation in Cognitive Wireless Mesh Networks.",
            "Design of a Probability Density Function Targeting Energy-Efficient Node Deployment in Wireless Sensor Networks.",
            "The Aesop Approach for Semantic-Based End-User Service Optimization.",
            "Leveraging MPLS Backup Paths for Distributed Energy-Aware Traffic Engineering.",
            "Performance-Cost Trade-Off Strategic Evaluation of Multipath TCP Communications.",
            "Energy Management in Cross-Domain Content Delivery Networks: A Theoretical Perspective.",
            "Efficient Model Checking of IT Change Operations.",
            "Problem Localization and Quantification Using Formal Evidential Reasoning for Virtual Networks.",
            "Integrated Monitoring Software for Application Service Managers.",
            "Operator-Friendly Traffic Engineering in IP/MPLS Core Networks.",
            "Priori Knowledge Guided Approach for Optimal Peer Selection in P2P VoD Systems.",
            "PHAT: A Preference and Honesty Aware Trust Model for Web Services.",
            "A Business Model for Multimedia Streaming in Mobile Clouds.",
            "OpenFlow in the Small: A Flexible and Efficient Network Acceleration Framework for Multi-Core Systems.",
            "Energy-Efficient Topology Management With Interference Cancellation in Cooperative Wireless Ad Hoc Networks.",
            "A Biology-Based Algorithm to Minimal Exposure Problem of Wireless Sensor Networks.",
            "Modeling the Impact of Service Level Agreements During Service Engagement.",
            "When YouTube Does not Work - Analysis of QoE-Relevant Degradation in Google CDN Traffic.",
            "PhishStorm: Detecting Phishing With Streaming Analytics.",
            "Pushing Server Bandwidth Consumption to the Limit: Modeling and Analysis of Peer-Assisted VoD.",
            "Optimal Resource Provisioning and the Impact of Energy-Aware Load Aggregation for Dynamic Temporal Workloads in Data Centers.",
            "A Virtualization Layer Approach to Survivability.",
            "A Distributed Architecture for the Monitoring of Clouds and CDNs: Applications to Amazon AWS.",
            "Context Aware Handover Management: Sustaining QoS and QoE in a Public IEEE 802.11e Hotspot."
        ]
    },
    {
        "name": "TNSM",
        "year": "2013",
        "info": "Volume 10: 2013",
        "count": 33,
        "papers": [
            "Guest Editors' Introduction: Special Issue on Quality-of-Service.",
            "Rake: Semantics Assisted Network-Based Tracing Framework.",
            "On Multiplexing Models for Independent Traffic Flows in Single- and Multi-Node Networks.",
            "Multi-Tiered, Burstiness-Aware Bandwidth Estimation and Scheduling for VBR Video Flows.",
            "QoS Guarantees and Service Differentiation for Dynamic Cloud Applications.",
            "Real-World Empirical Studies on Multi-Channel Reliability and Spectrum Usage for Home-Area Sensor Networks.",
            "Social Connections in User-Generated Content Video Systems: Analysis and Recommendation.",
            "Peer-Assisted Social Media Streaming with Social Reciprocity.",
            "Torrents on Twitter: Explore Long-Term Social Relationships in Peer-to-Peer Systems.",
            "SVNE: Survivable Virtual Network Embedding Algorithms for Network Virtualization.",
            "Pricing Utility-Based Virtual Networks.",
            "An Effective Network Traffic Classification Method with Unknown Flow Detection.",
            "Using Fuzzy Logic Control to Provide Intelligent Traffic Management Service for High-Speed Networks.",
            "Efficient Storage and Processing of High-Volume Network Monitoring Data.",
            "Optimizing Link Sleeping Reconfigurations in ISP Networks with Off-Peak Time Failure Protection.",
            "Redundancy Management of Multipath Routing for Intrusion Tolerance in Heterogeneous Wireless Sensor Networks.",
            "Optimal Cache Timeout for Identifier-to-Locator Mappings with Handovers.",
            "A Dynamic Composition and Stubless Invocation Approach for Information-Providing Services.",
            "Deadline-Based MapReduce Workload Management.",
            "Graph-Based Authentication Design for Color-Depth-Based 3D Video Transmission over Wireless Networks.",
            "Agent-Based Self-Adaptable Context-Aware Network Vulnerability Assessment.",
            "Real-Time Scheduling with Security Enhancement for Packet Switched Networks.",
            "Distributed Cache Management in Information-Centric Networks.",
            "In a Telco-CDN, Pushing Content Makes Sense.",
            "Cloud Analytics for Capacity Planning and Instant VM Provisioning.",
            "A Bin Packing Heuristic for On-Line Service Placement and Performance Control.",
            "A Prioritized Adaptive Scheme for Multimedia Services over IEEE 802.11 WLANs.",
            "Optimal Virtual Network Embedding: Node-Link Formulation.",
            "Pacer: A Progress Management System for Live Virtual Machine Migration in Cloud Computing.",
            "Effective Statistical Detection of Smart Confidentiality Attacks in Multi-Domain Networks.",
            "Autonomic Prioritization of Enterprise Transactions Based on Bid-Price Controls.",
            "Verifying the Concurrent Properties in BPEL Based Web Service Composition Process.",
            "Impact of Competition Between ISPs on the Net Neutrality Debate."
        ]
    },
    {
        "name": "TNSM",
        "year": "2012",
        "info": "Volume 9: 2012",
        "count": 38,
        "papers": [
            "Systematic Structural Testing of Firewall Policies.",
            "Performance Modeling and Analysis of Network Firewalls.",
            "Optimal IT Service Availability: Shorter Outages, or Fewer?",
            "Reasoning under Uncertainty for Overlay Fault Diagnosis.",
            "Measurement-Aware Monitor Placement and Routing: A Joint Optimization Approach for Network-Wide Measurements.",
            "Multilayer Dynamic Traffic Grooming with Constrained Differentiated Resilience in IP/MPLS-over-WDM Networks.",
            "Smart Association Control in Wireless Mobile Environment Using Max-Flow.",
            "An Economic Welfare Preserving Framework for Spot Pricing and Hedging of Spectrum Rights for Cognitive Radio.",
            "TAM: A Tiered Authentication of Multicast Protocol for Ad-Hoc Networks.",
            "A Framework for Automated Exploit Prevention from Known Vulnerabilities in Voice over IP Services.",
            "Autonomic Parameter Tuning of Anomaly-Based IDSs: an SSH Case Study.",
            "Characterization of ISP Traffic: Trends, User Habits, and Access Technology Impact.",
            "A Security Management Architecture for Supporting Routing Services on WANETs.",
            "Hierarchical Trust Management for Wireless Sensor Networks and its Applications to Trust-Based Routing and Intrusion Detection.",
            "An Automatic Detection and Diagnosis Framework for Mobile Communication Systems.",
            "ASIdE: Using Autocorrelation-Based Size Estimation for Scheduling Bursty Workloads.",
            "A Gossip Protocol for Dynamic Resource Management in Large Cloud Environments.",
            "Mobility Management in Wireless Mesh Networks Utilizing Location Routing and Pointer Forwarding.",
            "IP/MPLS-over-OTN-over-DWDM Multilayer Networks: An Integrated Three-Layer Capacity Optimization Model, a Heuristic, and a Study.",
            "An OSPF-Integrated Routing Strategy for QoS-Aware Energy Saving in IP Backbone Networks.",
            "A Measurement Study on Potential Inter-Domain Routing Diversity.",
            "The Impact of Jitter on Traffic Flow Optimization in Communication Networks.",
            "Handling Multiple Failures in IP Networks through Localized On-Demand Link State Routing.",
            "A Unified Approach to Routing Protection in IP Networks.",
            "Effective Acquaintance Management based on Bayesian Learning for Distributed Intrusion Detection Networks.",
            "LatLong: Diagnosing Wide-Area Latency Changes for CDNs.",
            "An Estimated Delay Based Association Policy for Web Browsing in a Multirate WLAN.",
            "Optimal Functionality Placement for Multiplay Service Provider Architectures.",
            "A Survey on Service-Oriented Network Virtualization Toward Convergence of Networking and Cloud Computing.",
            "Managing Data Retention Policies at Scale.",
            "Securing Recommendations in Grouped P2P E-Commerce Trust Model.",
            "Capturing the Quality and Business Value of IT Services Using a Business-Driven Model.",
            "Distributed Learning Algorithms for Inter-NSP SLA Negotiation Management.",
            "Practical Network-Wide Compression of IP Routing Tables.",
            "Fuzzy Conflict Analysis for QoS Policy Parameters in DiffServ Networks.",
            "Access Point Buffer Management for Power Saving in IEEE 802.11 WLANs.",
            "Self-Organizing Relays: Dimensioning, Self-Optimization, and Learning.",
            "Coordinating Secondary-User Behaviors for Inelastic Traffic Reward Maximization in Large-Scale \\osa Networks."
        ]
    },
    {
        "name": "TNSM",
        "year": "2011",
        "info": "Volume 8: 2011",
        "count": 31,
        "papers": [
            "Low-Overhead End-to-End Performance Measurement for Next Generation Networks.",
            "SLO Auditing Task Analysis, Decomposition, and Specification.",
            "Achieving Bounded Matching Delay and Maximized Throughput in Information Dissemination Management.",
            "A Prediction-Based Overload Control Algorithm for SIP Servers.",
            "On the Impact of Security Protocols on the Performance of SNMP.",
            "Locating Equivalent Servants over P2P Networks.",
            "Dirichlet-Based Trust Management for Effective Collaborative Intrusion Detection Networks.",
            "Scheduling Grid Tasks in Face of Uncertain Communication Demands.",
            "Improving Application Placement for Cluster-Based Web Applications.",
            "Monitoring the Impact of P2P Users on a Broadband Operator's Network over Time.",
            "Efficient Control of False Negative and False Positive Errors with Separate Adaptive Thresholds.",
            "Spectral Models for Bitrate Measurement from Packet Sampled Traffic.",
            "Efficient Network Modification to Improve QoS Stability at Failures.",
            "User-Centric Management of Wireless LANs.",
            "An Approach for Building Scalable Proxy Mobile IPv6 Domains.",
            "Differentiated Management Strategies for Multi-Hop Multi-Path Heterogeneous Connectivity in Mobile Environments.",
            "Providing End-to-End Secure Communications in Wireless Sensor Networks.",
            "Inter-Domain Path Provisioning with Security Features: Architecture and Signaling Performance.",
            "Self-Healing Optical Access Networks (SHOAN) Operated by Optical Switching Technologies.",
            "Combined Power and Performance Management of Virtualized Computing Environments Serving Session-Based Workloads.",
            "Prioritizing Information Technology Service Investments under Uncertainty.",
            "Resilient Inter-Carrier Traffic Engineering for Internet Peering Interconnections.",
            "Traffic Trend Estimation for Profit Oriented Capacity Adaptation in Service Overlay Networks.",
            "Traffic Management and Net Neutrality in Wireless Networks.",
            "Funnel: Choking Polluters in BitTorrent File Sharing Communities.",
            "Differentiated Congestion Management of Data Traffic for Data Center Ethernet.",
            "Phoenix: A Weight-Based Network Coordinate System Using Matrix Factorization.",
            "System Monitoring with Metric-Correlation Models.",
            "Large-Scale Available Bandwidth Measurements: Interference in Current Techniques.",
            "Large-Scale Network-Service Disruption: Dependencies and External Factors.",
            "From Theory to Practice: Efficiently Checking BGP Configurations for Guaranteed Convergence."
        ]
    },
    {
        "name": "TNSM",
        "year": "2010",
        "info": "Volume 7: 2010",
        "count": 23,
        "papers": [
            "The taming of the shrew: mitigating low-rate TCP-targeted attack.",
            "Introducing size-oriented dropping policies as QoS-supportive functions.",
            "Correlation, visualization, and usability analysis of routing policy configurations.",
            "A gossiping protocol for detecting global threshold crossings.",
            "Change scheduling based on business impact analysis of change-related risk.",
            "Service overlay network capacity adaptation for profit maximization.",
            "H-GAP: estimating histograms of local variables with accuracy objectives for distributed real-time monitoring.",
            "A techno-economic approach to telecommunications: the case of service migration.",
            "A probabilistic approach to minimize the conjunctive costs of node replacement and performance loss in the management of wireless sensor networks.",
            "Active monitoring and alarm management for fault localization in transparent all-optical networks.",
            "SYMIAN: Analysis and performance improvement of the IT incident management process.",
            "Distributed auto-configuration of neighboring cell graphs in radio access networks.",
            "Router group monitoring: making traffic trajectory error detection more efficient.",
            "Trust management in mobile ad hoc networks using a scalable maturity-based model.",
            "Balancing performance, robustness and flexibility in routing systems.",
            "Farewell Message.",
            "A Distributed Probabilistic Commitment Control Algorithm for Service-Oriented Systems.",
            "A Passive Solution to the Memory Resource Discovery Problem in Computational Clusters.",
            "Policy Based Security Analysis in Enterprise Networks: A Formal Approach.",
            "Machine Learning Techniques for Passive Network Inventory.",
            "A Hierarchical Identity Based Key Management Scheme in Tactical Mobile Ad Hoc Networks.",
            "Biologically Inspired Anomaly Detection and Security Control Frameworks for Complex Heterogeneous Networks.",
            "Balancing Request Denial Probability and Latency in an Agent-Based VPN Architecture."
        ]
    },
    {
        "name": "TNSM",
        "year": "2009",
        "info": "Volume 6: 2009",
        "count": 20,
        "papers": [
            "Relaxed multiple routing configurations: IP fast reroute for single and correlated failures.",
            "Policy conflict analysis for diffserv quality of service management.",
            "A methodology for analyzing availability weak points in SOA deployment frameworks.",
            "A distributed information repository for autonomic context-aware MANETs.",
            "Detecting suspended video streams through variance-time analysis.",
            "Joint optimization of intra- and inter-autonomous system traffic engineering.",
            "Self-adaptive handoff management for mobile streaming continuity.",
            "Robust monitoring of network-wide aggregates through gossiping.",
            "Histogram-based traffic anomaly detection.",
            "Definition and performance evaluation of a fault localization technique for an NGN IMS network.",
            "A lightweight policy system for body sensor networks.",
            "Improving file distribution performance by grouping in peer-to-peer networks.",
            "Locating network domain entry and exit point/path for DDoS attack traffic.",
            "Distributed adaptive diverse routing for voice-over-IP in service overlay networks.",
            "RFID system management: state-of-the art and open research issues.",
            "Research challenges in control engineering of computing systems.",
            "On the application of predictive control techniques for adaptive performance management of computing systems.",
            "Resource allocation and disturbance rejection in web servers using SLAs and virtualized servers.",
            "AppRAISE: application-level performance management in virtualized server environments.",
            "Feedback control for router management and TCP/IP network stability."
        ]
    },
    {
        "name": "TNSM",
        "year": "2008",
        "info": "Volume 5: 2008",
        "count": 20,
        "papers": [
            "Performance problem prediction in transaction-based e-business systems.",
            "Traffic analysis at short time-scales: an empirical case study from a 3G cellular network.",
            "Loop-free updates of forwarding tables.",
            "Efficient fault diagnosis using incremental alarm correlation and active investigation for internet and overlay networks.",
            "iREX: efficient automation architecture for the deployment of inter-domain QoS policy.",
            "Network anomaly diagnosis via statistical analysis and evidential reasoning.",
            "An online scheme for the isolation of BGP misconfiguration errors.",
            "SANchk: SQL-based SAN configuration checking.",
            "Adaptive tracking of network behavioral signals for real time forensic analysis of service quality degradation.",
            "Compass: optimizing the migration cost vs. application performance tradeoff.",
            "Reliability and Survivability Analysis for UMTS Networks: An Analytical Approach.",
            "Models and Algorithms for the Design of Service Overlay Networks.",
            "Queueing-Model-Based Adaptive Control of Multi-Tiered Web Applications.",
            "Visualization and Analysis of System Monitoring Data using Multi-resolution Context Information.",
            "Change Priority Determination in IT Service Management Based on Risk Exposure.",
            "Design and evaluation of a new multi-path incremental routing algorithm on software routers.",
            "Detecting VoIP calls hidden in web traffic.",
            "Dynamic pricing and resource allocation using revenue management for multiservice networks.",
            "A general framework for benchmarking firewall optimization techniques.",
            "IP flow accounting application for diameter."
        ]
    },
    {
        "name": "TNSM",
        "year": "2007",
        "info": "Volume 4: 2007",
        "count": 16,
        "papers": [
            "A-GAP: An Adaptive Protocol for Continuous Network Monitoring with Accuracy Objectives.",
            "A Configuration Complexity Model and Its Application to a Change Management System.",
            "Integration of Service-Level Monitoring with Fault Management for End-to-End Multi-Provider Ethernet Services.",
            "A Probabilistic Approach for Managing Mobile Ad-Hoc Networks.",
            "Traffic Engineering an Operational Network with the TOTEM Toolbox.",
            "Inter-AS Inbound Traffic Engineering via ASPP.",
            "Proximity-Aware Superpeer Overlay Topologies.",
            "Service Clouds: Distributed Infrastructure for Adaptive Communication Services.",
            "Autonomic and Decentralized Management of Wireless Access Networks.",
            "MOve: Design and Evaluation of a Malleable Overlay for Group-Based Applications.",
            "AVCast: New Approaches for Implementing Generic Availability-Dependent Reliability Predicates for Multicast Receivers.",
            "Avoiding Disruptions During Maintenance Operations on BGP Sessions.",
            "A Programmable Framework for the Deployment of Services and Protocols in Mobile Ad Hoc Networks.",
            "On Leveraging Policy-Based Management for Maximizing Business Profit.",
            "Optimal Network Rate Allocation under End-to-End Quality-of-Service Requirements.",
            "Service Middleware for Self-Managing Large-Scale Systems."
        ]
    },
    {
        "name": "TNSM",
        "year": "2006",
        "info": "Volume 3: 2006",
        "count": 9,
        "papers": [
            "A middleware design for large-scale clusters offering multiple services.",
            "On the stability of adaptive Service Level Agreements.",
            "Role-Based Access Control for XML enabled multi-protocol management gateways.",
            "An application-layer approach to seamless mobile multimedia communication.",
            "Techniques for integrating sensors into the enterprise network.",
            "Policy refinement for IP differentiated services Quality of Service management.",
            "Service provision for next generation mobile communication systems - the Telecommunication Service Exchange.",
            "Lightweight proactive queue management.",
            "Operational Fault Detection in cellular wireless base-stations."
        ]
    },
    {
        "name": "TNSM",
        "year": "2005",
        "info": "Volume 2: 2005",
        "count": 5,
        "papers": [
            "Delay Based Congestion Detection and Admission Control for Voice quality in enterprise or carrier controlled IP Networks.",
            "Determining link weight system under various objectives for OSPF networks using a Lagrangian relaxation-based approach.",
            "Objective and subjective evaluation of QOAS video streaming over broadband networks.",
            "Real-time packet loss prediction based on end-to-end delay variation.",
            "SLA brokering and bandwidth reservation negotiation schemes for QoS-aware internet."
        ]
    },
    {
        "name": "TNSM",
        "year": "2004",
        "info": "Volume 1: 2004",
        "count": 10,
        "papers": [
            "Modeling and Management of Firewall Policies.",
            "Failure-Oriented Path Restoration Algorithm for Survivable Networks.",
            "Scalability of Peer Configuration Management in Logically Ad Hoc Networks.",
            "IPv6-in-IPv4 Tunnel Discovery: Methods and Experimental Results.",
            "Generic On-Line Discovery of Quantitative Models.",
            "Mining activity data for dynamic dependency discovery in e-business systems.",
            "The CIM Metrics Model: Introducing flexible data collection and aggregation for performance management in CIM.",
            "Comparing the performance of SNMP and Web services-based management.",
            "Service level management: A dynamic discovery and optimization approach.",
            "Customer-oriented GMPLS service management and resilience differentiation."
        ]
    }
]