[
    {
        "name": "TOIT",
        "year": "2022",
        "info": "Volume 22, 2022",
        "count": 27,
        "papers": [
            "QoS-aware Mesh-based Multicast Routing Protocols in Edge Ad Hoc Networks: Concepts and Challenges.",
            "Secure Distributed Mobile Volunteer Computing with Android.",
            "Data Dissemination for Industry 4.0 Applications in Internet of Vehicles Based on Short-term Traffic Prediction.",
            "Energy-Efficient Computation Offloading for UAV-Assisted MEC: A Two-Stage Optimization Scheme.",
            "Semi-Direct Monocular Visual-Inertial Odometry Using Point and Line Features for IoV.",
            "Agile Support Vector Machine for Energy-efficient Resource Allocation in IoT-oriented Cloud using PSO.",
            "Data-Driven Prediction and Optimization of Energy Use for Transit Fleets of Electric and ICE Vehicles.",
            "A Deep Learning Approach for Voice Disorder Detection for Smart Connected Living Environments.",
            "IBRDM: An Intelligent Framework for Brain Tumor Classification Using Radiomics- and DWT-based Fusion of MRI Sequences.",
            "Malware Classification Based on Multilayer Perception and Word2Vec for IoT Security.",
            "Alexa, Who Am I Speaking To?: Understanding Users' Ability to Identify Third-Party Apps on Amazon Alexa.",
            "Multi-criteria Web Services Selection: Balancing the Quality of Design and Quality of Service.",
            "Layer-based Composite Reputation Bootstrapping.",
            "Automated Security Assessment Framework for Wearable BLE-enabled Health Monitoring Devices.",
            "Automated Discovery of Network Cameras in Heterogeneous Web Pages.",
            "Machine Learning in Mobile Crowd Sourcing: A Behavior-Based Recruitment Model.",
            "IP Geolocation through Reverse DNS.",
            "Virtual Reality Aided High-Quality 3D Reconstruction by Remote Drones.",
            "Cloud-based Network Virtualization in IoT with OpenStack.",
            "Incremental Group-Level Popularity Prediction in Online Social Networks.",
            "Neural Network Approximation of Graph Fourier Transform for Sparse Sampling of Networked Dynamics.",
            "Serving at the Edge: An Edge Computing Service Architecture Based on ICN.",
            "Proactive Defense for Internet-of-things: Moving Target Defense With Cyberdeception.",
            "Using Social Media Data to Analyse Issue Engagement During the 2017 German Federal Election.",
            "Adaptive Management of Volatile Edge Systems at Runtime With Satisfiability.",
            "PANOLA: A Personal Assistant for Supporting Users in Preserving Privacy.",
            "A Language-independent Network to Analyze the Impact of COVID-19 on the World via Sentiment Analysis."
        ]
    },
    {
        "name": "TOIT",
        "year": "2021",
        "info": "Volume 21, 2021",
        "count": 109,
        "papers": [
            "Fine-Grained Network Analysis for Modern Software Ecosystems.",
            "DAN-SNR: A Deep Attentive Network for Social-aware Next Point-of-interest Recommendation.",
            "Beyond Frequency: Utility Mining with Varied Item-specific Minimum Utility.",
            "Blockchain in eCommerce: A Special Issue of the ACM Transactions on Internet of ThingsBlockchain in eCommerce: A Special Issue of the ACM Transactions on Internet of Things.",
            "Integrity Verification Mechanism of Sensor Data Based on Bilinear Map Accumulator.",
            "The Cloud-edge-based Dynamic Reconfiguration to Service Workflow for Mobile Ecommerce Environments: A QoS Prediction Perspective.",
            "Concurrent Practical Byzantine Fault Tolerance for Integration of Blockchain and Supply Chain.",
            "Intelligent Mediator-based Enhanced Smart Contract for Privacy Protection.",
            "Incentive-Driven Computation Offloading in Blockchain-Enabled E-Commerce.",
            "Phishing Scams Detection in Ethereum Transaction Network.",
            "Account Guarantee Scheme: Making Anonymous Accounts Supervised in Blockchain.",
            "Achieving Secure Search over Encrypted Data for e-Commerce: A Blockchain Approach.",
            "A Supply-chain System Framework Based on Internet of Things Using Blockchain Technology.",
            "Multilateral Personal Portfolio Authentication System Based on Hyperledger Fabric.",
            "RTChain: A Reputation System with Transaction and Consensus Incentives for E-commerce Blockchain.",
            "Introduction to the Special Section on Human-centered Security, Privacy, and Trust in the Internet of Things.",
            "Social-Chain: Decentralized Trust Evaluation Based on Blockchain in Pervasive Social Networking.",
            "Joint Encryption and Compression-Based Watermarking Technique for Security of Digital Documents.",
            "Efficient Distributed Decryption Scheme for IoT Gateway-based Applications.",
            "A User-Centric Mechanism for Sequentially Releasing Graph Datasets under Blowfish Privacy.",
            "Privacy-preserving Federated Deep Learning for Wearable IoT-based Biomedical Monitoring.",
            "PROLISEAN: A New Security Protocol for Programmable Matter.",
            "Data Privacy Based on IoT Device Behavior Control Using Blockchain.",
            "DuroNet: A Dual-robust Enhanced Spatial-temporal Learning Network for Urban Crime Prediction.",
            "Privacy Care: A Tangible Interaction Framework for Privacy Management.",
            "Enabling User-centered Privacy Controls for Mobile Applications: COVID-19 Perspective.",
            "Operating Systems for Resource-adaptive Intelligent Software: Challenges and Opportunities.",
            "Introduction to the Special Section on Data Science for Cyber-Physical Systems.",
            "Big Data Analysis of Internet of Things System.",
            "Large-Scale Least Squares Twin SVMs.",
            "A Simulation-driven Methodology for IoT Data Mining Based on Edge Computing.",
            "Energy and SLA-driven MapReduce Job Scheduling Framework for Cloud-based Cyber-Physical Systems.",
            "An Effective Hyperparameter Optimization Algorithm for DNN to Predict Passengers at a Metro Station.",
            "A Hybrid Siamese Neural Network for Natural Language Inference in Cyber-Physical Systems.",
            "A Polishing Robot Force Control System Based on Time Series Data in Industrial Internet of Things.",
            "Leveraging Data Augmentation for Service QoS Prediction in Cyber-physical Systems.",
            "DataOps for Cyber-Physical Systems Governance: The Airport Passenger Flow Case.",
            "Product Quality Monitoring in Hydraulic Presses Using a Minimal Sample of Sensor and Actuator Data.",
            "Introduction to the Special Issue on Decentralized Blockchain Applications and Infrastructures for Next Generation Cyber-Physical Systems.",
            "Improving Vaccine Safety Using Blockchain.",
            "A Blockchain-based Iterative Double Auction Protocol Using Multiparty State Channels.",
            "Blockchain-based Data Sharing System for Sensing-as-a-Service in Smart Cities.",
            "Blockchain-enabled Tensor-based Conditional Deep Convolutional GAN for Cyber-physical-Social Systems.",
            "A Novel Memory-hard Password Hashing Scheme for Blockchain-based Cyber-physical Systems.",
            "Blockchain-Based Power Energy Trading Management.",
            "Proof-of-Prestige: A Useful Work Reward System for Unverifiable Tasks.",
            "Unsupervised Derivation of Keyword Summary for Short Texts.",
            "A Novel Multiobjective GDWCN-PSO Algorithm and Its Application to Medical Data Security.",
            "Adaptive Multi-Task Dual-Structured Learning with Its Application on Alzheimer's Disease Study.",
            "Epilepsy Diagnosis Using Multi-view & Multi-medoid Entropy-based Clustering with Privacy Protection.",
            "A Multi-Threshold Ant Colony System-based Sanitization Model in Shared Medical Environments.",
            "Federated Learning in a Medical Context: A Systematic Literature Review.",
            "δ-Risk: Toward Context-aware Multi-objective Privacy Management in Connected Environments.",
            "A Novel Cloud-Assisted Secure Deep Feature Classification Framework for Cancer Histopathology Images.",
            "Introduction to the Special Section on Security and Privacy of Medical Data for Smart Healthcare.",
            "Intelligent Control and Security of Fog Resources in Healthcare Systems via a Cognitive Fog Model.",
            "The Security of Medical Data on Internet Based on Differential Privacy Technology.",
            "FinPrivacy: A Privacy-preserving Mechanism for Fingerprint Identification.",
            "Privacy-preserving Time-series Medical Images Analysis Using a Hybrid Deep Learning Framework.",
            "Secure DNA Motif-Finding Method Based on Sampling Candidate Pruning.",
            "An Efficient Angle-based Universum Least Squares Twin Support Vector Machine for Classification.",
            "Design and Implementation of BCI-based Intelligent Upper Limb Rehabilitation Robot System.",
            "EPRT: An Efficient Privacy-Preserving Medical Service Recommendation and Trust Discovery Scheme for eHealth System.",
            "A Novel Image Inpainting Framework Using Regression.",
            "A Hybrid Feature Selection Algorithm Based on a Discrete Artificial Bee Colony for Parkinson's Diagnosis.",
            "Special Section on AI-Empowered Internet of Things for Smart Cities.",
            "Power Side-Channel Analysis of RNS GLV ECC Using Machine and Deep Learning Algorithms.",
            "ISDNet: AI-enabled Instance Segmentation of Aerial Scenes for Smart Cities.",
            "Robust Facial Image Super-Resolution by Kernel Locality-Constrained Coupled-Layer Regression.",
            "Predictive Analytics for Smart Parking: A Deep Learning Approach in Forecasting of IoT Data.",
            "Deep Attentive Multimodal Network Representation Learning for Social Media Images.",
            "Random Graph-based Multiple Instance Learning for Structured IoT Smart City Applications.",
            "Machine Learning Empowered IoT for Intelligent Vehicle Location in Smart Cities.",
            "Spatio-temporal Bayesian Learning for Mobile Edge Computing Resource Planning in Smart Cities.",
            "Sustainable Security for the Internet of Things Using Artificial Intelligence Architectures.",
            "Multimodal Brain Tumor Segmentation Based on an Intelligent UNET-LSTM Algorithm in Smart Hospitals.",
            "Dynamic Scheduling Algorithm in Cyber Mimic Defense Architecture of Volunteer Computing.",
            "Time-Efficient Ensemble Learning with Sample Exchange for Edge Computing.",
            "CROWD: Crow Search and Deep Learning based Feature Extractor for Classification of Parkinson's Disease.",
            "Rotating behind Privacy: An Improved Lightweight Authentication Scheme for Cloud-based IoT Environment.",
            "Waiting for Tactile: Robotic and Virtual Experiences in the Fog.",
            "A Blockchain-empowered Access Control Framework for Smart Devices in Green Internet of Things.",
            "A Comparative Study of AI-Based Intrusion Detection Techniques in Critical Infrastructures.",
            "A Secure Ticket-Based Authentication Mechanism for Proxy Mobile IPv6 Networks in Volunteer Computing.",
            "Big Data Processing on Volunteer Computing.",
            "Detecting Malicious Switches for a Secure Software-defined Tactile Internet.",
            "Pre-Trained Convolutional Neural Networks for Breast Cancer Detection Using Ultrasound Images.",
            "Joint QoS-aware and Cost-efficient Task Scheduling for Fog-cloud Resources in a Volunteer Computing System.",
            "An Incentive-based Mechanism for Volunteer Computing Using Blockchain.",
            "A Novel Real-time Anti-spam Framework.",
            "The Efficient Mining of Skyline Patterns from a Volunteer Computing Network.",
            "Screw Slot Quality Inspection System Based on Tactile Network.",
            "Introduction to the Special Section on Cognitive Robotics on 5G/6G Networks.",
            "Merging Grid Maps in Diverse Resolutions by the Context-based Descriptor.",
            "Cognitive Robotics on 5G Networks.",
            "Fast Search of Lightweight Block Cipher Primitives via Swarm-like Metaheuristics for Cyber Security.",
            "Chinese Emotional Dialogue Response Generation via Reinforcement Learning.",
            "Short-term Load Forecasting by Using Improved GEP and Abnormal Load Recognition.",
            "Game-Theoretic Strategic Coordination and Navigation of Multiple Wheeled Robots.",
            "Cognitive Wearable Robotics for Autism Perception Enhancement.",
            "Sentence Semantic Matching Based on 3D CNN for Human-Robot Language Interaction.",
            "AI-empowered IoT Security for Smart Cities.",
            "A Novel Approach for Efficient Packet Transmission in Volunteered Computing MANET.",
            "Machine Learning-based Mist Computing Enabled Internet of Battlefield Things.",
            "Intelligent Traffic Signal Control Based on Reinforcement Learning with State Reduction for Smart Cities.",
            "A Flow-based Multi-agent Data Exfiltration Detection Architecture for Ultra-low Latency Networks.",
            "AI-enabled IoT-Edge Data Analytics for Connected Living.",
            "Investigating the Spread of Coronavirus Disease via Edge-AI and Air Pollution Correlation.",
            "A Multi-graph Convolutional Network Framework for Tourist Flow Prediction."
        ]
    },
    {
        "name": "TOIT",
        "year": "2020",
        "info": "Volume 20, 2020",
        "count": 45,
        "papers": [
            "Internet Technology Outlook: From Communication to Storage and Cognitive Computing.",
            "Five Challenges in Cloud-enabled Intelligence and Control.",
            "Beyond Artificial Reality: Finding and Monitoring Live Events from Social Sensors.",
            "SSL-SVD: Semi-supervised Learning-based Sparse Trust Recommendation.",
            "Privacy-preserving Network Path Validation.",
            "A Smartphone-based Network Architecture for Post-disaster Operations Using WiFi Tethering.",
            "Mobile Pervasive Augmented Reality Systems - MPARS: The Role of User Preferences in the Perceived Quality of Experience in Outdoor Applications.",
            "Introduction to the Special Section on Computational Modeling and Understanding of Emotions in Conflictual Social Interactions.",
            "Sub-Population Specific Models of Couples' Conflict.",
            "A Multilingual Evaluation for Online Hate Speech Detection.",
            "MANDOLA: A Big-Data Processing and Visualization Platform for Monitoring and Detecting Online Hate Speech.",
            "Detecting Misogyny and Xenophobia in Spanish Tweets Using Language Technologies.",
            "Emo2Vec: Learning Emotional Embeddings via Multi-Emotion Category.",
            "Exploiting Proxy Sensing for Efficient Monitoring of Large-Scale Sensor Networks.",
            "A Cost-Efficient Container Orchestration Strategy in Kubernetes-Based Cloud Computing Infrastructures with Heterogeneous Resources.",
            "An Experimental Analysis of Security Vulnerabilities in Industrial IoT Devices.",
            "Cloud Deployment Tradeoffs for the Analysis of Spatially Distributed Internet of Things Systems.",
            "Understanding Ethereum via Graph Analysis.",
            "An Emotional Analysis of False Information in Social Media and News Articles.",
            "Introduction to the Special Issue on Evolution of IoT Networking Architectures.",
            "Efficient Latency Control in Fog Deployments via Hardware-Accelerated Popularity Estimation.",
            "To Transmit or Not to Transmit: Controlling Communications in the Mobile IoT Domain.",
            "Cracking Channel Hopping Sequences and Graph Routes in Industrial TSCH Networks.",
            "Optimal Receiver Placement for K-barrier Coverage in Passive Bistatic Radar Sensor Networks.",
            "Cloud-based Enabling Mechanisms for Container Deployment and Migration at the Network Edge.",
            "Fog in the Clouds: UAVs to Provide Edge Computing to IoT Devices.",
            "Optimally Self-Healing IoT Choreographies.",
            "Parameter Self-Adaptation for Industrial Wireless Sensor-Actuator Networks.",
            "IoT Architecture for Urban Data-Centric Services and Applications.",
            "Low-cost Security for Next-generation IoT Networks.",
            "Trustworthy and Transparent Third-party Authority.",
            "An Efficient Service Function Chaining Placement Algorithm in Mobile Edge Computing.",
            "Serendipity-based Points-of-Interest Navigation.",
            "Design and Implementation of a Compressed Certificate Status Protocol.",
            "Enabling Reference Verifiability for the World Wide Web with Webchain.",
            "Improving Collaborative Filtering with Social Influence over Heterogeneous Information Networks.",
            "A Reinforcement Learning Approach to Optimize Discount and Reputation Tradeoffs in E-commerce Systems.",
            "Routing in Large-scale Dynamic Networks: A Bloom Filter-based Dual-layer Scheme.",
            "Overexposure-Aware Influence Maximization.",
            "Evolving Influence Maximization in Evolving Networks.",
            "Ursa: Robust Performance for Nakamoto Consensus with Self-adaptive Throughput.",
            "Personalized Review Recommendation based on Users' Aspect Sentiment.",
            "SMig-RL: An Evolutionary Migration Framework for Cloud Services Based on Deep Reinforcement Learning.",
            "Descriptions from the Customers: Comparative Analysis of Review-based Product Description Generation Methods.",
            "An Intelligent Edge-centric Queries Allocation Scheme based on Ensemble Models."
        ]
    },
    {
        "name": "TOIT",
        "year": "2019",
        "info": "Volume 19, 2019",
        "count": 54,
        "papers": [
            "Fine-grained Emotion Role Detection Based on Retweet Information.",
            "Grouping Peers Based on Complementary Degree and Social Relationship using Genetic Algorithm.",
            "Making Constrained Things Reachable: A Secure IP-Agnostic NAT Traversal Approach for IoT.",
            "A Hybrid Approach for Improving the Design Quality of Web Service Interfaces.",
            "Incentive-Based Crowdsourcing of Hotspot Services.",
            "Guest Editors' Introduction for Special Issue on Service Management for the Internet of Things.",
            "Context-Driven and Real-Time Provisioning of Data-Centric IoT Services in the Cloud.",
            "An Autonomic Cognitive Pattern for Smart IoT-Based System Manageability: Application to Comorbidity Management.",
            "Latency-Aware Application Module Management for Fog Computing Environments.",
            "IoT Data Prefetching in Indoor Navigation SOAs.",
            "Guest Editors' Introduction to the Special Issue on Knowledge-Driven Business Process Management.",
            "Reasoning About Property Preservation in Adaptive Case Management.",
            "BPMS-RA: A Novel Reference Architecture for Business Process Management Systems.",
            "Achieving Business Process Improvement via Ubiquitous Decision-Aware Business Processes.",
            "Measuring Performance in Knowledge-intensive Processes.",
            "Local Concurrency Detection in Business Process Event Logs.",
            "Guest Editors' Introduction to the Special Issue on Fog, Edge, and Cloud Integration for Smart Environments.",
            "Fog Computing for the Internet of Things: A Survey.",
            "ContextAiDe: End-to-End Architecture for Mobile Crowd-sensing Applications.",
            "A Fog-Based Application for Human Activity Recognition Using Personal Smart Devices.",
            "Deep Reinforcement Scheduling for Mobile Crowdsensing in Fog Computing.",
            "Oops: Optimizing Operation-mode Selection for IoT Edge Devices.",
            "Adaptive Resource Allocation for Computation Offloading: A Control-Theoretic Approach.",
            "DM2-ECOP: An Efficient Computation Offloading Policy for Multi-user Multi-cloudlet Mobile Edge Computing Environment.",
            "Cloud, Fog, or Mist in IoT? That Is the Question.",
            "Practical Privacy-preserving High-order Bi-Lanczos in Integrated Edge-Fog-Cloud Architecture for Cyber-Physical-Social Systems.",
            "Fog-based Secure Communications for Low-power IoT Devices.",
            "Enabling Workload Engineering in Edge, Fog, and Cloud Computing through OpenStack-based Middleware.",
            "A Unified Model for the Mobile-Edge-Cloud Continuum.",
            "A Dynamic Service Migration Mechanism in Edge Cognitive Computing.",
            "On the Profitability of Bundling Sale Strategy for Online Service Markets With Network Effects.",
            "A Dynamic Data-throttling Approach to Minimize Workflow Imbalance.",
            "Social Network De-anonymization: More Adversarial Knowledge, More Users Re-identified?",
            "Integrating Multi-level Tag Recommendation with External Knowledge Bases for Automatic Question Answering.",
            "Constructing Novel Block Layouts for Webpage Analysis.",
            "Mitigating Tail Response Time of n-Tier Applications: The Impact of Asynchronous Invocations.",
            "Introduction to the Special Section on Advances in Internet-based Collaborative Technologies.",
            "Source-Aware Crisis-Relevant Tweet Identification and Key Information Summarization.",
            "Universal Social Network Bus: Toward the Federation of Heterogeneous Online Social Network Services.",
            "CloseUp - A Community-Driven Live Online Search Engine.",
            "Policy Adaptation in Hierarchical Attribute-based Access Control Systems.",
            "An Anonymous Delegatable Attribute-based Credential Scheme for a Collaborative E-health Environment.",
            "Threat Management in Data-centric IoT-Based Collaborative Systems.",
            "Multi-objective Optimisation of Online Distributed Software Update for DevOps in Clouds.",
            "Introduction to the Special Section on Trust and AI.",
            "Trust Prediction via Matrix Factorisation.",
            "Understanding the Influences of Past Experience on Trust in Human-agent Teamwork.",
            "The Influence of Trust Score on Cooperative Behavior.",
            "CAN-TM: Chain Augmented Naïve Bayes-based Trust Model for Reliable Cloud Service Selection.",
            "It Is an Equal Failing to Trust Everybody and to Trust Nobody: Stock Price Prediction Using Trust Filters and Enhanced User Sentiment on Twitter.",
            "An Incentive Mechanism for Crowdsourcing Systems with Network Effects.",
            "Betweenness Centrality Based Software Defined Routing: Observation from Practical Internet Datasets.",
            "A Pure Visual Approach for Automatically Extracting and Aligning Structured Web Data.",
            "Pay as Your Service Needs: An Application-Driven Pricing Approach for the Internet Economics."
        ]
    },
    {
        "name": "TOIT",
        "year": "2017",
        "info": "Volume 18, 2017/2018",
        "count": 57,
        "papers": [
            "Extending the Outreach: From Smart Cities to Connected Communities.",
            "Adaptive Message Routing and Replication in Mobile Opportunistic Networks for Connected Communities.",
            "A Multi-Dimensional Smart Community Discovery Scheme for IoT-Enriched Smart Homes.",
            "On the Need of Trustworthy Sensing and Crowdsourcing for Urban Accessibility in Smart City.",
            "Crowd-Sourced Data Collection for Urban Monitoring via Mobile Sensors.",
            "ODIN: Obfuscation-Based Privacy-Preserving Consensus Algorithm for Decentralized Information Fusion in Smart Device Networks.",
            "Quantify Resilience Enhancement of UTS through Exploiting Connected Community and Internet of Everything Emerging Technologies.",
            "Hadoop-Based Intelligent Care System (HICS): Analytical Approach for Big Data in IoT.",
            "Real-Time Traffic Event Detection From Social Media.",
            "Seamless Virtual Network for International Business Continuity in Presence of Intentional Blocks.",
            "Behind the Myths of Citizen Participation: Identifying Sustainability Factors of Hyper-Local Information Systems.",
            "TOIT Reviewers over 2015 and 2016.",
            "Introduction to the Special Issue on Emerging Software Technologies for Internet-Based Systems: Internetware and DevOps.",
            "i-Jacob: An Internetware-Oriented Approach to Optimizing Computation-Intensive Mobile Web Browsing.",
            "Adaptive Speculation for Efficient Internetware Application Execution in Clouds.",
            "CloudMF: Model-Driven Management of Multi-Cloud Applications.",
            "Architectural Principles for Cloud Software.",
            "Fuzzy Clustering of Crowdsourced Test Reports for Apps.",
            "CrowdService: Optimizing Mobile Crowdsourcing and Service Composition.",
            "Improving Verification Accuracy of CPS by Modeling and Calibrating Interaction Uncertainty.",
            "Multi-Objective Optimization of Deployment Topologies for Distributed Applications.",
            "Utility-Based Decision Making for Migrating Cloud-Based Applications.",
            "An Online Algorithm for Task Offloading in Heterogeneous Mobile Clouds.",
            "Privacy-Preserving Publishing of Multilevel Utility-Controlled Graph Datasets.",
            "Exploiting Content Spatial Distribution to Improve Detection of Intrusions.",
            "Guest Editors' Introduction.",
            "Genetic Algorithms for Solving Problems of Access Control Design and Reconfiguration in Computer Networks.",
            "Quantifying Privacy Leakage in Multi-Agent Planning.",
            "Decision Networks for Security Risk Assessment of Critical Infrastructures.",
            "SHARE: A Stackelberg Honey-Based Adversarial Reasoning Engine.",
            "Fine-Grained Access Control via Policy-Carrying Data.",
            "Collaborative Location Recommendation by Integrating Multi-dimensional Contextual Information.",
            "Toward Efficient Short-Video Sharing in the YouTube Social Network.",
            "Cross-Browser Differences Detection Based on an Empirical Metric for Web Page Visual Similarity.",
            "A Learning-Based Framework for Improving Querying on Web Interfaces of Curated Knowledge Bases.",
            "Are We There Yet? IPv6 in Australia and China.",
            "Duplicate Detection in Programming Question Answering Communities.",
            "Providing Geo-Elasticity in Geographically Distributed Clouds.",
            "Interest-Aware Content Discovery in Peer-to-Peer Social Networks.",
            "Special Issue: Computational Ethics and Accountability.",
            "Automatic Resolution of Normative Conflicts in Supportive Technology Based on User Values.",
            "Preserving Privacy as Social Responsibility in Online Social Networks.",
            "Measuring Moral Acceptability in E-deliberation: A Practical Application of Ethics by Participation.",
            "Enhanced Audit Strategies for Collaborative and Accountable Data Sharing in Social Networks.",
            "easIE: Easy-to-Use Information Extraction for Constructing CSR Databases From the Web.",
            "Accountable Protocols in Abductive Logic Programming.",
            "Special Issue on the Economics of Security and Privacy: Guest Editors' Introduction.",
            "On the Assessment of Systematic Risk in Networked Systems.",
            "Rotten Apples or Bad Harvest? What We Are Measuring When We Are Measuring Abuse.",
            "Revisiting the Risks of Bitcoin Currency Exchange Closure.",
            "Fine-Grained Control over Tracking to Support the Ad-Based Web Economy.",
            "Measuring Third-party Tracker Power across Web and Mobile.",
            "PrivacyCheck: Automatic Summarization of Privacy Policies Using Data Mining.",
            "Should Credit Card Issuers Reissue Cards in Response to a Data Breach?: Uncertainty and Transparency in Metrics for Data Security Policymaking.",
            "A Provenance-Aware Multi-dimensional Reputation System for Online Rating Systems.",
            "A Game Theoretic Model for the Formation of Navigable Small-World Networks - The Tradeoff between Distance and Reciprocity.",
            "TOIT Reviewers over 2017."
        ]
    },
    {
        "name": "TOIT",
        "year": "2017",
        "info": "Volume 17, 2017",
        "count": 40,
        "papers": [
            "Affect and Interaction in Agent-Based Systems and Social Media: Guest Editors' Introduction.",
            "Brains or Beauty: How to Engender Trust in User-Agent Interactions.",
            "Implementing and Evaluating a Laughing Virtual Character.",
            "Other-Condemning Moral Emotions: Anger, Contempt and Disgust.",
            "Toward Formal Modeling of Affective Agents in a BDI Architecture.",
            "Show Me You Care: Trait Empathy, Linguistic Style, and Mimicry on Facebook.",
            "Processing Affect in Social Media: A Comparison of Methods to Distinguish Emotions in Tweets.",
            "Using Centrality Measures to Predict Helpfulness-Based Reputation in Trust Networks.",
            "Improving the Efficiency of an Online Marketplace by Incorporating Forgiveness Mechanism.",
            "Privacy-Enhanced Television Audience Measurements.",
            "Introduction to the Special Issue on Advances in Social Computing.",
            "Detecting Influencers in Multiple Online Genres.",
            "Anonymous or Not? Understanding the Factors Affecting Personal Mobile Data Disclosure.",
            "Eliciting Structured Knowledge from Situated Crowd Markets.",
            "Formation and Reciprocation of Dyadic Trust.",
            "Measurement Theory-Based Trust Management Framework for Online Social Communities.",
            "Cyber-Physical Social Networks.",
            "Can We Predict a Riot? Disruptive Event Detection Using Twitter.",
            "Dual Structure Constrained Multimodal Feature Coding for Social Event Detection from Flickr Data.",
            "Progressive Random Indexing: Dimensionality Reduction Preserving Local Network Dependencies.",
            "Spinel: An Opportunistic Proxy for Connecting Sensors to the Internet of Things.",
            "Statistical Learning of Domain-Specific Quality-of-Service Features from User Reviews.",
            "Argumentation in Social Media.",
            "Debating Technology for Dialogical Argument: Sensemaking, Engagement, and Analytics.",
            "Using Argumentative Structure to Interpret Debates in Online Deliberative Democracy and eRulemaking.",
            "Stance and Sentiment in Tweets.",
            "An Argumentation Approach for Resolving Privacy Disputes in Online Social Networks.",
            "A Universal Model for Discourse-Level Argumentation Analysis.",
            "Experimental Assessment of Aggregation Principles in Argumentation-Enabled Collective Intelligence.",
            "Using Argumentation to Improve Classification in Natural Language Problems.",
            "Mitigating Data Sparsity Using Similarity Reinforcement-Enhanced Collaborative Filtering.",
            "Towards Inferring Communication Patterns in Online Social Networks.",
            "Guest Editorial: The Provenance of Online Data.",
            "Taming the Costs of Trustworthy Provenance through Policy Reduction.",
            "A Canonical Form for PROV Documents and Its Application to Equality, Signature, and Validation.",
            "Managing Provenance of Implicit Data Flows in Scientific Experiments.",
            "PROV2R: Practical Provenance Analysis of Unstructured Processes.",
            "Facilitating Adoption of Internet Technologies and Services with Externalities via Cost Subsidization.",
            "Bandwidth Measurements within the Cloud: Characterizing Regular Behaviors and Correlating Downtimes.",
            "Exploiting Contextual Information in Attacking Set-Generalized Transactions."
        ]
    },
    {
        "name": "TOIT",
        "year": "2016",
        "info": "Volume 16, 2016",
        "count": 29,
        "papers": [
            "The Uncertain Web: Concepts, Challenges, and Current Solutions.",
            "Towards Anomalous Diffusion Sources Detection in a Large Network.",
            "Quality-Based Online Data Reconciliation.",
            "Supervised Anomaly Detection in Uncertain Pseudoperiodic Data Streams.",
            "Using an Epidemiological Approach to Maximize Data Survival in the Internet of Things.",
            "Constructing Maintainable Semantic Relation Network from Ambiguous Concepts in Web Content.",
            "sCARE: Reputation Estimation for Uncertain Web Services.",
            "SoIoT: Toward A User-Centric IoT-Based Service Framework.",
            "Things of Interest Recommendation by Leveraging Heterogeneous Relations in the Internet of Things.",
            "Argumentation Mining: State of the Art and Emerging Trends.",
            "A Scalable Framework for Provisioning Large-Scale IoT Deployments.",
            "Unsupervised Extraction of Popular Product Attributes from E-Commerce Web Sites by Considering Customer Reviews.",
            "Multiobjective Optimization for Brokering of Multicloud Service Composition.",
            "Negotiating Premium Peering Prices: A Quantitative Model with Applications.",
            "Patterns in the Chaos - A Study of Performance Variation and Predictability in Public IaaS Clouds.",
            "MARSA: A Marketplace for Realtime Human Sensing Data.",
            "Mining and Quality Assessment of Mashup Model Patterns with the Crowd: A Feasibility Study.",
            "rSYBL: A Framework for Specifying and Controlling Cloud Services Elasticity.",
            "Irony Detection in Twitter: The Role of Affective Content.",
            "Model-Based Collaborative Personalized Recommendation on Signed Social Rating Networks.",
            "Dynamic and Efficient Private Keyword Search over Inverted Index-Based Encrypted Data.",
            "Internet of Things (IoT): Smart and Secure Service Delivery.",
            "Secure Data-Centric Access Control for Smart Grid Services Based on Publish/Subscribe Systems.",
            "Password-Authenticated Group Key Exchange: A Cross-Layer Design.",
            "Authentication Protocol for an IoT-Enabled LTE Network.",
            "Advanced Security Testbed Framework for Wearable IoT Devices.",
            "Intelligent Intrusion Detection in Low-Power IoTs.",
            "Crowdsourced Mobile Data Transfer with Delay Bound.",
            "Characterization of Wireless Multidevice Users."
        ]
    },
    {
        "name": "TOIT",
        "year": "2015",
        "info": "Volume 15, 2015",
        "count": 16,
        "papers": [
            "Special Issue on Foundations of Social Computing: Enabling Social Applications via Decentralized Social Data Management.",
            "Net Neutrality: Discrimination, Competition, and Innovation in the UK and US.",
            "Strategic Formation of Credit Networks.",
            "Aggregate Characterization of User Behavior in Twitter and Analysis of the Retweet Graph.",
            "P2P-Based, Multi-Attribute Resource Discovery under Real-World Resources and Queries.",
            "Interaction-Based Recommendations for Online Communities.",
            "Bottom-Up Fault Management in Service-Based Systems.",
            "The Effect of Data Caps upon ISP Service Tier Design and Users.",
            "Progressive Batch Medical Image Retrieval Processing in Mobile Wireless Networks.",
            "JCloudScale: Closing the Gap Between IaaS and PaaS.",
            "P-DONAS: A P2P-Based Domain Name System in Access Networks.",
            "Introduction to Theme Section on Trust in Social Networks and Systems.",
            "The Relevance of Categories for Trusting Information Sources.",
            "On Selecting Recommenders for Trust Evaluation in Online Social Networks.",
            "Chasing Offensive Conduct in Social Networks: A Reputation-Based Practical Approach for Frisber.",
            "Modelling the Role of Trust in Social Relationships."
        ]
    },
    {
        "name": "TOIT",
        "year": "2014",
        "info": "Volume 14, 2014",
        "count": 28,
        "papers": [
            "Event Recognition Challenges and Techniques: Guest Editors' Introduction.",
            "Approximate Semantic Matching of Events for the Internet of Things.",
            "PADUA: Parallel Architecture to Detect Unexplained Activities.",
            "Adaptive Speculative Processing of Out-of-Order Event Streams.",
            "Decentralized Fault-Tolerant Event Correlation.",
            "MCEP: A Mobility-Aware Complex Event Processing System.",
            "Efficient Stream Provenance via Operator Instrumentation.",
            "Special Issue on Pricing and Incentives in Networks and Systems: Guest Editors' Introduction.",
            "Distributed Content Curation on the Web.",
            "Influence of Search Neutrality on the Economics of Advertisement-Financed Content.",
            "Regulation of Off-Network Pricing in a Nonneutral Network.",
            "Economic Viability of Paris Metro Pricing for Digital Services.",
            "Adoption of Bundled Services with Network Externalities and Correlated Affinities.",
            "Understanding Quota Dynamics in Wireless Networks.",
            "Demand-Invariant Price Relationships and Market Outcomes in Competitive Private Commons.",
            "Approximation Algorithms for Secondary Spectrum Auctions.",
            "Revenue Guarantees in the Generalized Second Price Auction.",
            "Is the Price of Anarchy the Right Measure for Load-Balancing Games?",
            "Secure Team Composition to Thwart Insider Threats and Cyber-Espionage.",
            "Economic Model-Driven Cloud Service Composition.",
            "Recommendation and Weaving of Reusable Mashup Model Patterns for Assisted Development.",
            "Introduction to the Special Issue on Foundations of Social Computing.",
            "A Commitment-Based Infrastructure for Programming Socio-Technical Systems.",
            "On the Dynamics of Social Media Popularity: A YouTube Case Study.",
            "Ontology-Based Query Answering with Group Preferences.",
            "Revealing the City That We Cannot See.",
            "Integrating Social and Auxiliary Semantics for Multifaceted Topic Modeling in Twitter.",
            "SESAME: Mining User Digital Footprints for Fine-Grained Preference-Aware Social Media Search."
        ]
    },
    {
        "name": "TOIT",
        "year": "2013",
        "info": "Volume 13, 2013/2014",
        "count": 13,
        "papers": [
            "A Context-Based Approach to Reconciling Data Interpretation Conflicts in Web Services Composition.",
            "Investigating Users' Perspectives of Web Single Sign-On: Conceptual Gaps and Acceptance Model.",
            "A Multimedia Recommender System.",
            "A Graph Analytical Approach for Topic Detection.",
            "LAKE: A Server-Side Authenticated Key-Establishment with Low Computational Workload.",
            "User and ISP Rights of Device Attachment and Device Management.",
            "Dissecting Darknets: Measurement and Performance Analysis.",
            "Microcomputations as Micropayments in Web-based Services.",
            "Cheating in Online Games: A Social Network Perspective.",
            "Cost-Aware Cloud Bursting for Enterprise Applications.",
            "Personalizing Top-k Processing Online in a Peer-to-Peer Social Tagging Network.",
            "Web Service Compositions with Fuzzy Preferences: A Graded Dominance Relationship-Based Approach.",
            "Equipping IDEs with XML-Path Reasoning Capabilities."
        ]
    },
    {
        "name": "TOIT",
        "year": "2012",
        "info": "Volume 12, 2012/2013",
        "count": 14,
        "papers": [
            "One-time cookies: Preventing session hijacking attacks with stateless authentication tokens.",
            "Minersoft: Software retrieval in grid and cloud computing infrastructures.",
            "Theory and network applications of balanced kautz tree structures.",
            "Juno: A Middleware Platform for Supporting Delivery-Centric Applications.",
            "Using Priced Options to Solve the Exposure Problem in Sequential Auctions.",
            "Exploiting and Maintaining Materialized Views for XML Keyword Queries.",
            "Providing Users' Anonymity in Mobile Hybrid Networks.",
            "Modeling Decentralized Reputation-Based Trust for Initial Transactions in Digital Environments.",
            "A Proxy View of Quality of Domain Name Service, Poisoning Attacks and Survival Strategies.",
            "Vision for TOIT.",
            "TOIT Administrative Updates.",
            "When Amazon Meets Google: Product Visualization by Exploring Multiple Web Sources.",
            "SafeVchat: A System for Obscene Content Detection in Online Video Chat Services.",
            "Resolvers Revealed: Characterizing DNS Resolvers and their Clients."
        ]
    },
    {
        "name": "TOIT",
        "year": "2011",
        "info": "Volume 11, 2011/2012",
        "count": 17,
        "papers": [
            "Exploiting Service Usage Information for Optimizing Server Resource Management.",
            "Characterizing Intelligence Gathering and Control on an Edge Network.",
            "Anomaly Detection in Dynamic Systems Using Weak Estimators.",
            "Impact of XML Schema Evolution.",
            "Comparing ingress and egress detection to secure interdomain routing: An experimental analysis.",
            "Distributed application configuration, management, and visualization with plush.",
            "ACCENT: Cognitive cryptography plugged compression for SSL/TLS-based cloud computing services.",
            "User-perceived quality assessment of streaming media using reduced feature sets.",
            "Introduction to special issue on context-aware web services for the future internet.",
            "Context-aware services engineering: Models, transformations, and verification.",
            "Vulnerabilities and countermeasures in context-aware social rating services.",
            "Context-aware web search in ubiquitous sensor environments.",
            "A smart web service based on the context of things.",
            "Context-sensitive user interfaces for semantic services.",
            "Firewall policy change-impact analysis.",
            "Towards the taxonomy-oriented categorization of yellow pages queries.",
            "A framework for personalizing web search with concept-based user profiles."
        ]
    },
    {
        "name": "TOIT",
        "year": "2010",
        "info": "Volume 10, 2010/2011",
        "count": 16,
        "papers": [
            "A market-based bandwidth charging framework.",
            "Semantic integrity in large-scale online simulations.",
            "A programmable network address translator: Design, implementation, and performance.",
            "Privacy-preserving similarity-based text retrieval.",
            "Detecting visually similar Web pages: Application to phishing detection.",
            "BogusBiter: A transparent protection against phishing attacks.",
            "Teaching Johnny not to fall for phish.",
            "Using probabilistic confidence models for trust inference in Web-based social networks.",
            "Peeking Through the Cloud: Client Density Estimation via DNS Cache Probing.",
            "A Framework for Large-Scale Detection of Web Site Defacements.",
            "Forecasting Click-Through Rates Based on Sponsored Search Advertiser Bids and Intermediate Variable Regression.",
            "A Framework for Classification of Traffic Management Practices as Reasonable or Unreasonable.",
            "Achieving Data Consistency by Contextualization in Web-Based Collaborative Applications.",
            "Novelty and Diversity in Top-N Recommendation - Analysis and Evaluation.",
            "Properties and Evolution of Internet Traffic Networks from Anonymized Flow Data.",
            "Load Balancing and Range Queries in P2P Systems Using P-Ring."
        ]
    },
    {
        "name": "TOIT",
        "year": "2009",
        "info": "Volume 9, 2009",
        "count": 16,
        "papers": [
            "Resource overbooking and application profiling in a shared Internet hosting platform.",
            "Flexible provisioning of web service workflows.",
            "A model of process documentation to determine provenance in mash-ups.",
            "A peer-to-peer recommender system based on spontaneous affinities.",
            "Implications of Internet architecture on net neutrality.",
            "On the state of IP spoofing defense.",
            "Retrieving XML data from heterogeneous sources through vague querying.",
            "Analysis of single and networked auctions.",
            "An online blog reading system by topic clustering and personalized ranking.",
            "An ontology-driven approach for semantic information retrieval on the Web.",
            "Web service clustering using multidimensional angles as proximity measures.",
            "Using a fuzzy classification approach to assess e-commerce Web sites: An empirical investigation.",
            "Fast XML document filtering by sequencing twig patterns.",
            "Detection of corrupted schema mappings in XML data integration systems.",
            "Controlling entity state updates to maintain remote consistency within a distributed interactive application.",
            "Distribution fairness in Internet-scale networks."
        ]
    },
    {
        "name": "TOIT",
        "year": "2007",
        "info": "Volume 8, 2007/2008",
        "count": 21,
        "papers": [
            "Introduction to special issue on semantic Web services.",
            "A semantic approach to approximate service retrieval.",
            "Model-driven design and development of semantic Web service applications.",
            "A context-based mediation approach to compose semantic Web services.",
            "Web services discovery in secure collaboration environments.",
            "Introduction to special issue internet technologies for distance education.",
            "Nearcast: A locality-aware P2P live streaming approach for distance education.",
            "Personalizing access to learning networks.",
            "A multimedia broker to support accessible and mobile learning through learning objects adaptation.",
            "Technology supports for distributed and collaborative learning over the internet.",
            "Guest editorial: Service-oriented computing.",
            "A framework for service-oriented computing with C and C++ Web service components.",
            "Conformance checking of service behavior.",
            "QoS-Aware service management for component-based distributed applications.",
            "Pattern-based design of a service-oriented middleware for remote object federations.",
            "Security and identification indicators for browsers against spoofing and phishing attacks.",
            "Security analysis of Internet technology components enabling globally distributed workplaces - a framework.",
            "Design and implementation trade-offs for wide-area resource discovery.",
            "Semantics-based composition-oriented discovery of Web services.",
            "Resource space model, OWL and database: Mapping and integration.",
            "Improving Web search using image snippets."
        ]
    },
    {
        "name": "TOIT",
        "year": "2007",
        "info": "Volume 7, 2007",
        "count": 23,
        "papers": [
            "Internet content filtering using isotonic separation on content category ratings.",
            "Model-driven development of context-aware Web applications.",
            "Equipping smart devices with public key signatures.",
            "The Web as a graph: How far we are.",
            "Defeating DDoS attacks by fixing the incentive chain.",
            "Adapting Web information extraction knowledge via mining site-invariant and site-dependent features.",
            "Provisioning servers in the application tier for e-commerce systems.",
            "Requirements for scalable access control and security management architectures.",
            "Characterization of national Web domains.",
            "XQueC: A query-conscious compressed XML database.",
            "Supporting ad-hoc resource sharing on the Web: A peer-to-peer approach to hypermedia link services.",
            "Optimal design of english auctions with discrete bid levels.",
            "Guest editorial: The Internet and outsourcing.",
            "24-hour knowledge factory: Using Internet technology to leverage spatial and temporal separations.",
            "The Internet's role in offshored services: A case study of India.",
            "Impact of Internet-based distributed monitoring systems on offshore sourcing of services.",
            "Preserving data privacy in outsourcing data aggregation services.",
            "Introduction to intelligent techniques for Web personalization.",
            "Mining User preference using Spy voting for search engine personalization.",
            "Supporting intelligent Web search.",
            "Web site personalization based on link analysis and navigational patterns.",
            "Generating semantically enriched user profiles for Web personalization.",
            "Toward trustworthy recommender systems: An analysis of attack models and algorithm robustness."
        ]
    },
    {
        "name": "TOIT",
        "year": "2006",
        "info": "Volume 6, 2006",
        "count": 19,
        "papers": [
            "IDN server proxy architecture for Internationalized Domain Name resolution and experiences with providing Web services.",
            "Web servers under overload: How scheduling can help.",
            "Supporting complex queries on multiversion XML documents.",
            "Design and implementation of the Web-enabled NIST design repository.",
            "A stochastic model for the evolution of the Web allowing link deletion.",
            "Core algorithms in the CLEVER system.",
            "Stanford WebBase components and applications.",
            "Behavior-based modeling and its application to Email analysis.",
            "A compressor for effective archiving, retrieval, and updating of XML documents.",
            "A wide-area Distribution Network for free software.",
            "PageRank revisited.",
            "Performance and overhead of semantic cache management.",
            "Searching for experts on the Web: A review of contemporary expertise locator systems.",
            "A mobile computing middleware for location- and context-aware internet data services.",
            "Computing customized page ranks.",
            "Online information disclosure: Motivators and measurements.",
            "Automated gathering of Web information: An in-depth examination of agents interacting with search engines.",
            "A heuristic bidding strategy for buying multiple goods in multiple english auctions.",
            "Inferring binary trust relationships in Web-based social networks."
        ]
    },
    {
        "name": "TOIT",
        "year": "2005",
        "info": "Volume 5, 2005",
        "count": 21,
        "papers": [
            "An embedded domain-specific language for type-safe server-side web scripting.",
            "A multi-agent infrastructure for developing personalized web-based systems.",
            "Motion prediction for caching and prefetching in mouse-driven DVE navigation.",
            "Inside PageRank.",
            "Using certified policies to regulate E-commerce transactions.",
            "What makes the differences: benchmarking XML database implementations.",
            "Learning algorithms for single-instance electronic negotiations using the time-dependent behavioral tactic.",
            "Link analysis ranking: algorithms, theory, and experiments.",
            "Moderately hard, memory-bound functions.",
            "Supporting application development in the semantic web.",
            "A fragment-based approach for efficiently creating dynamic web content.",
            "Graphical query interfaces for semistructured data: the QURSED system.",
            "Model-driven design and deployment of service-enabled web applications.",
            "Optimal methods for coordinated enroute web caching for tree networks.",
            "Characterizing a national community web.",
            "Flash crowd mitigation via adaptive admission control based on application-level observations.",
            "Corrigenda.",
            "Effective Web browsing through content delivery adaptation.",
            "Characteristics of streaming media stored on the Web.",
            "Portlet syndication: Raising variability concerns.",
            "Taxonomy of XML schema languages using formal language theory."
        ]
    },
    {
        "name": "TOIT",
        "year": "2004",
        "info": "Volume 4, 2004",
        "count": 17,
        "papers": [
            "Fighting the spam wars: A remailer approach with restrictive aliasing.",
            "Optimizing result prefetching in web search engines with segmented indices.",
            "Fine-grained control of security capabilities.",
            "An open architecture for next-generation telecommunication services.",
            "Guest editorial: Machine learning for the Internet.",
            "Learning to find answers to questions on the Web.",
            "Selective Markov models for predicting Web page accesses.",
            "PageCluster: Mining conceptual link hierarchies from Web log files for adaptive Web site navigation.",
            "LinkSelector: A Web mining approach to hyperlink selection for Web portals.",
            "Defending against an Internet-based attack on the physical world.",
            "Answering queries using views: A KRDB perspective for the semantic Web.",
            "Recovery guarantees for Internet applications.",
            "Agent trade servers in financial exchange systems.",
            "Guest editorial: Machine learning for the Internet.",
            "Collaborative recommendation: A robustness analysis.",
            "Topical web crawlers: Evaluating adaptive algorithms.",
            "Market-based recommendation: Agents that compete for consumer attention."
        ]
    },
    {
        "name": "TOIT",
        "year": "2003",
        "info": "Volume 3, 2003",
        "count": 14,
        "papers": [
            "Web mining for web personalization.",
            "(How) can mobile agents do secure electronic transactions on untrusted hosts? A survey of the security issues and the current solutions.",
            "Design and development of data-intensive web sites: The araneus approach.",
            "The use of web structure and content to identify subjectively interesting web usage patterns.",
            "XDuce: A statically typed XML processing language.",
            "Privacy through pseudonymity in user-adaptive systems.",
            "Developing a bidding agent for multiple heterogeneous auctions.",
            "Southampton TAC: An adaptive autonomous trading agent.",
            "Location management for mobile commerce applications in wireless Internet environment.",
            "Estimating frequency of change.",
            "Quality of service in an information economy.",
            "Efficient scheduling of Internet banner advertisements.",
            "Measuring and characterizing end-to-end Internet service performance.",
            "Architecture and performance of server-directed transcoding."
        ]
    },
    {
        "name": "TOIT",
        "year": "2002",
        "info": "Volume 2, 2002",
        "count": 12,
        "papers": [
            "An optimal strategy for sellers in an online auction.",
            "A self-configuring and self-administering name system with dynamic address assignment.",
            "On filter effects in web caching hierarchies.",
            "The <bigwig> project.",
            "Principled design of the modern Web architecture.",
            "xlinkit: a consistency checking and smart link generation service.",
            "Evaluating the competitive effects of mergers of internet backbone providers.",
            "Self-similarity in the web.",
            "Engineering web cache consistency.",
            "Literature-based discovery on the World Wide Web.",
            "The platform for privacy preference as a social protocol: An examination within the U.S. policy context.",
            "Affinity-based management of main memory database clusters."
        ]
    },
    {
        "name": "TOIT",
        "year": "2001",
        "info": "Volume 1, 2001",
        "count": 7,
        "papers": [
            "Searching the Web.",
            "Characterizing the scalability of a large web-based shopping system.",
            "Rethinking the design of the Internet: the end-to-end arguments vs. the brave new world.",
            "XRel: a path-based approach to storage and retrieval of XML documents using relational databases.",
            "HTTP Cookies: Standards, privacy, and politics.",
            "The architecture of robust publishing systems.",
            "On balancing the load in a clustered web farm."
        ]
    }
]