[
    {
        "name": "TOSN",
        "year": "2022",
        "info": "Volume 18: 2022",
        "count": 15,
        "papers": [
            "GaitSense: Towards Ubiquitous Gait-Based Human Identification with Wi-Fi.",
            "Adaptive Monitor Placement for Near Real-time Node Failure Localisation in Wireless Sensor Networks.",
            "Taming the Errors in Cross-Technology Communication: A Probabilistic Approach.",
            "AsTAR: Sustainable Energy Harvesting for the Internet of Things through Adaptive Task Scheduling.",
            "DeepMTD: Moving Target Defense for Deep Visual Sensing against Adversarial Examples.",
            "Enabling Cross-technology Communication from LoRa to ZigBee via Payload Encoding in Sub-1 GHz Bands.",
            "Online Resource Provisioning for Wireless Data Collection.",
            "Pedometer-free Geomagnetic Fingerprinting with Casual Walking Speed.",
            "Edge-assisted Collaborative Image Recognition for Mobile Augmented Reality.",
            "Attack-aware Synchronization-free Data Timestamping in LoRaWAN.",
            "ApproxNet: Content and Contention-Aware Video Object Classification System for Embedded Clients.",
            "S×C4IoT: A Security-by-contract Framework for Dynamic Evolving IoT Devices.",
            "Shared Secret Key Generation by Exploiting Inaudible Acoustic Channels.",
            "Link Quality Estimation of Cross-Technology Communication: The Case with Physical-Level Emulation.",
            "Wireless Localization with Spatial-Temporal Robust Fingerprints."
        ]
    },
    {
        "name": "TOSN",
        "year": "2020",
        "info": "Volume 17: 2020/2021",
        "count": 43,
        "papers": [
            "Dynamic Buffer Sizing for Out-of-order Event Compensation for Time-sensitive Applications.",
            "TinyLink: A Holistic System for Rapid Development of IoT Applications.",
            "A Survey on Energy-Efficient Strategies in Static Wireless Sensor Networks.",
            "Reactive Jamming and Attack Mitigation over Cross-Technology Communication Links.",
            "POSE.R: Prediction-based Opportunistic Sensing for Resilient and Efficient Sensor Networks.",
            "SDCN: Sensory Data-Centric Networking for Building the Sensing Layer of IoT.",
            "MORE: Multi-node Mobile Charging Scheduling for Deadline Constraints.",
            "Dynamic Edge-coded Protocols for Low-power, Device-to-device Communication.",
            "Energy-efficient Dual-codebook-based Backscatter Communications for Wireless Powered Networks.",
            "Editorial from the Editor-in-Chief.",
            "Intercepting a Stealthy Network.",
            "A Data-driven System for City-wide Energy Footprinting and Apportionment.",
            "One Size Does Not Fit All: Multi-scale, Cascaded RNNs for Radar Classification.",
            "BOND: Exploring Hidden Bottleneck Nodes in Large-scale Wireless Sensor Networks.",
            "DeepHeart: A Deep Learning Approach for Accurate Heart Rate Estimation from PPG Signals.",
            "CoHop: Quantitative Correlation-based Channel Hopping for Low-power Wireless Networks.",
            "Task Planning Considering Location Familiarity in Spatial Crowdsourcing.",
            "Price Learning-based Incentive Mechanism for Mobile Crowd Sensing.",
            "Smartphone-Based Indoor Visual Navigation with Leader-Follower Mode.",
            "SenCS: Enabling Real-time Indoor Proximity Verification via Contextual Similarity.",
            "Low-Cost Outdoor Air Quality Monitoring and Sensor Calibration: A Survey and Critical Analysis.",
            "Intelligent Data Collaboration in Heterogeneous-device IoT Platforms.",
            "Scalable Estimator for Multi-task Gaussian Graphical Models Based in an IoT Network.",
            "Deep Reinforcement Learning for Tropical Air Free-cooled Data Center Control.",
            "Privacy-preserving Data Aggregation against Malicious Data Mining Attack for IoT-enabled Smart Grid.",
            "LeaD: Learn to Decode Vibration-based Communication for Intelligent Internet of Things.",
            "Queec: QoE-aware Edge Computing for IoT Devices under Dynamic Workloads.",
            "Robust Networking: Dynamic Topology Evolution Learning for Internet of Things.",
            "Edge Content Caching with Deep Spatiotemporal Residual Network for IoV in Smart City.",
            "eDeepSave: Saving DNN Inference using Early Exit During Handovers in Mobile Edge Environment.",
            "Clustering-based Efficient Privacy-preserving Face Recognition Scheme without Compromising Accuracy.",
            "Semi-supervised Intrusive Appliance Load Monitoring in Smart Energy Monitoring System.",
            "Energy-efficient Collaborative Sensing: Learning the Latent Correlations of Heterogeneous Sensors.",
            "GPFS: A Graph-based Human Pose Forecasting System for Smart Home with Online Learning.",
            "RLC: A Reinforcement Learning-Based Charging Algorithm for Mobile Devices.",
            "Scalable Privacy-preserving Geo-distance Evaluation for Precision Agriculture IoT Systems.",
            "A Mobile-assisted Edge Computing Framework for Emerging IoT Applications.",
            "Energy-collision-aware Minimum Latency Aggregation Scheduling for Energy-harvesting Sensor Networks.",
            "Driver Behavior-aware Parking Availability Crowdsensing System Using Truth Discovery.",
            "Joint Deployment Strategy of Battery-Free Sensor Networks with Coverage Guarantee.",
            "SateLoc: A Virtual Fingerprinting Approach to Outdoor LoRa Localization Using Satellite Images.",
            "Recorp: Receiver-oriented Policies for Industrial Wireless Networks.",
            "Design of Self-sustainable Wireless Sensor Networks with Energy Harvesting and Wireless Charging."
        ]
    },
    {
        "name": "TOSN",
        "year": "2020",
        "info": "Volume 16: 2020",
        "count": 42,
        "papers": [
            "Route or Flood? Reliable and Efficient Support for Downward Traffic in RPL.",
            "Driving Lane Detection on Smartphones using Deep Neural Networks.",
            "An Energy-efficient Distributed TDMA Scheduling Algorithm for ZigBee-like Cluster-tree WSNs.",
            "BaroSense: Using Barometer for Road Traffic Congestion Detection and Path Estimation with Crowdsourcing.",
            "Dynamic Task-based Intermittent Execution for Energy-harvesting Devices.",
            "A Game-Theoretic Analysis of Energy-Depleting Jamming Attacks with a Learning Counterstrategy.",
            "Mortar: An Open Testbed for Portable Building Analytics.",
            "Computation Offloading with Multiple Agents in Edge-Computing-Supported IoT.",
            "Smartphone-Based SpO2 Measurement by Exploiting Wavelengths Separation and Chromophore Compensation.",
            "An Urban Mobility Model with Buildings Involved: Bridging Theory to Practice.",
            "Multisensor Adaptive Control System for IoT-Empowered Smart Lighting with Oblivious Mobile Sensors.",
            "Smart Sensing, Communication, and Control in Perishable Food Supply Chain.",
            "In-Bed Body Motion Detection and Classification System.",
            "PC-RPL: Joint Control of Routing Topology and Transmission Power in Real Low-Power and Lossy Networks.",
            "Charge-Aware Duty Cycling Methods for Wireless Systems under Energy Harvesting Heterogeneity.",
            "OPCIO: Optimizing Power Consumption for Embedded Devices via GPIO Configuration.",
            "QA-Share: Toward an Efficient QoS-Aware Dispatching Approach for Urban Taxi-Sharing.",
            "ahoi: Inexpensive, Low-power Communication and Localization for Underwater Sensor Networks and μAUVs.",
            "Securing Cyber-Physical Social Interactions on Wrist-Worn Devices.",
            "H-DrunkWalk: Collaborative and Adaptive Navigation for Heterogeneous MAV Swarm.",
            "Time-efficient Missing Tag Identification in an Open RFID System.",
            "OPTICS: OPTimizing Irrigation Control at Scale.",
            "QoS-Aware VNF Placement and Service Chaining for IoT Applications in Multi-Tier Mobile Edge Networks.",
            "CoUAS: Enable Cooperation for Unmanned Aerial Systems.",
            "Latency-efficient Data Collection Scheduling in Battery-free Wireless Sensor Networks.",
            "A Prospect Theoretic Approach for Trust Management in IoT Networks Under Manipulation Attacks.",
            "iSleep: A Smartphone System for Unobtrusive Sleep Quality Monitoring.",
            "Joint Modelling of Cyber Activities and Physical Context to Improve Prediction of Visitor Behaviors.",
            "SCANet: Sensor-based Continuous Authentication with Two-stream Convolutional Neural Networks.",
            "Quality-aware Online Task Assignment in Mobile Crowdsourcing.",
            "A Query Processing Framework for Efficient Network Resource Utilization in Shared Sensor Networks.",
            "Distributed Reliable and Energy-Efficient Scheduling for LR-WPANs.",
            "RF-AMOC: Human-related RFID Tag Movement Identification in Access Management of Carries.",
            "DAML: Practical Secure Protocol for Data Aggregation Based on Machine Learning.",
            "Identifying Child Users via Touchscreen Interactions.",
            "ACES: Automatic Configuration of Energy Harvesting Sensors with Reinforcement Learning.",
            "dWatch: A Reliable and Low-Power Drowsiness Detection System for Drivers Based on Mobile Devices.",
            "Resilience Bounds of Network Clock Synchronization with Fault Correction.",
            "Incentive Mechanisms for Crowdsensing: Motivating Users to Preprocess Data for the Crowdsourcer.",
            "Pushing the Limits of Transmission Concurrency for Low Power Wireless Networks.",
            "Ultra-wideband Concurrent Ranging.",
            "Urban Scale Trade Area Characterization for Commercial Districts with Cellular Footprints."
        ]
    },
    {
        "name": "TOSN",
        "year": "2019",
        "info": "Volume 15: 2019",
        "count": 49,
        "papers": [
            "CloudNavi: Toward Ubiquitous Indoor Navigation Service with 3D Point Clouds.",
            "Dynamic Enhanced Field Division: An Advanced Localizing and Tracking Middleware.",
            "DISH: DIstributed SHuffling Against Selective Jamming Attack in IEEE 802.15.4e TSCH Networks.",
            "A Framework for the Inference of Sensing Measurements Based on Correlation.",
            "FIRST: A Framework for Optimizing Information Quality in Mobile Crowdsensing Systems.",
            "CapNet: Exploiting Wireless Sensor Networks for Data Center Power Capping.",
            "A General Framework for Spectrum Sensing Using Dedicated Spectrum Sensor Networks.",
            "Memento: An Emotion-driven Lifelogging System with Wearables.",
            "Privacy-Preserving Truth Discovery in Crowd Sensing Systems.",
            "W3W: Energy Management of Hybrid Energy Supplied Sensors for Internet of Things.",
            "Extending Battery System Operation via Adaptive Reconfiguration.",
            "Network Management of Multicluster RT-WiFi Networks.",
            "Optimal Rate Control for Energy-Harvesting Systems with Random Data and Energy Arrivals.",
            "Rulers on Our Arms: Waving to Measure Object Size through Contactless Sensing.",
            "Radiation Constrained Fair Charging for Wireless Power Transfer.",
            "Known and Unknown Facts of LoRa: Experiences from a Large-scale Measurement Study.",
            "LaPS: LiDAR-assisted Placement of Wireless Sensor Networks in Forests.",
            "Routing-Aware and Malicious Node Detection in a Concealed Data Aggregation for WSNs.",
            "Resource-efficient and Automated Image-based Indoor Localization.",
            "ECT: Exploiting Cross-Technology Transmission for Reducing Packet Delivery Delay in IoT Networks.",
            "Participant Incentive Mechanism Toward Quality-Oriented Sensing: Understanding and Application.",
            "A Novel Authenticated Key Agreement Protocol With Dynamic Credential for WSNs.",
            "Leveraging Fog Analytics for Context-Aware Sensing in Cooperative Wireless Sensor Networks.",
            "Low-Cost and Robust Geographic Opportunistic Routing in a Strip Topology Wireless Network.",
            "BLITZ: Low Latency and Energy-Efficient Communication for Event-Triggered Wireless Sensing Systems.",
            "CRONOS: A Post-hoc Data Driven Multi-Sensor Synchronization Approach.",
            "Power-Positive Networking: Wireless-Charging-Based Networking to Protect Energy against Battery DoS Attacks.",
            "A Survey on Bluetooth 5.0 and Mesh: New Milestones of IoT.",
            "Bi-dimensional Signal Compression Based on Linear Prediction Coding: Application to WSN.",
            "Collaborative Mobile Crowdsensing in Opportunistic D2D Networks: A Graph-based Approach.",
            "Exploiting Concurrency for Opportunistic Forwarding in Duty-Cycled IoT Networks.",
            "On Realistic Target Coverage by Autonomous Drones.",
            "Multicast Scaling of Capacity and Energy Efficiency in Heterogeneous Wireless Sensor Networks.",
            "Improved Ahead-of-time Compilation of Stack-based JVM Bytecode on Resource-constrained Devices.",
            "From Real to Complex: Enhancing Radio-based Activity Recognition Using Complex-Valued CSI.",
            "BuildSense: Accurate, Cost-aware, Fault-tolerant Monitoring with Minimal Sensor Infrastructure.",
            "Water Flow Driven Sensor Networks for Leakage and Contamination Monitoring in Distribution Pipelines.",
            "Towards Profit Optimization During Online Participant Selection in Compressive Mobile Crowdsensing.",
            "Robust Optimal Selection of Radio Type and Transmission Power for Internet of Things.",
            "One-Hop Out-of-Band Control Planes for Multi-Hop Wireless Sensor Networks.",
            "DICTUM: Distributed Irrigation aCtuation with Turf hUmidity Modeling.",
            "Efficient Indoor Localization Based on Geomagnetism.",
            "Dominating Sets Construction in RF-based Battery-free Sensor Networks with Full Coverage Guarantee.",
            "AirContour: Building Contour-based Model for In-Air Writing Gesture Recognition.",
            "BikeGPS: Localizing Shared Bikes in Street Canyons with Low-level GPS Cooperation.",
            "Blind Joint 2-D DOA/Symbols Estimation for 3-D Millimeter Wave Massive MIMO Communication Systems.",
            "Whisper: Fast Flooding for Low-Power Wireless Networks.",
            "Fast Charging Scheduling under the Nonlinear Superposition Model with Adjustable Phases.",
            "Broadcast Scheduling in Battery-Free Wireless Sensor Networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2018",
        "info": "Volume 14: 2018",
        "count": 31,
        "papers": [
            "Boundary Node Detection and Unfolding of Complex Non-Convex Ad Hoc Networks.",
            "Estimating Spatial Averages of Environmental Parameters Based on Mobile Crowdsensing.",
            "Dependable Interference-Aware Time-Slotted Channel Hopping for Wireless Sensor Networks.",
            "CrowdLoc: Cellular Fingerprinting for Crowds by Crowds.",
            "Determining Resilience Gains From Anomaly Detection for Event Integrity in Wireless Sensor Networks.",
            "MyoVibe: Enabling Inertial Sensor-Based Muscle Activation Detection In High-Mobility Exercise Environments.",
            "Opportunistic Spectrum Allocation for Interference Mitigation Amongst Coexisting Wireless Body Area Networks.",
            "Average Counting via Approximate Histograms.",
            "Networking Wireless Energy in Embedded Networks.",
            "Energy-Harvesting Wireless Sensor Networks (EH-WSNs): A Review.",
            "Harmonium: Ultra Wideband Pulse Generation with Bandstitched Recovery for Fast, Accurate, and Robust Indoor Localization.",
            "Exploiting Electrical Grid for Accurate and Secure Clock Synchronization.",
            "Natural Timestamps in Powerline Electromagnetic Radiation.",
            "Non-Bayesian Social Learning with Observation Reuse and Soft Switching.",
            "Differentiating Clear Channel Assessment Using Transmit Power Variation.",
            "Introduction to the Special Issue on BuildSys'17.",
            "Democratizing Authority in the Built Environment.",
            "Design and Analysis of a Query Processor for Brick.",
            "AutoCalib: Automatic Traffic Camera Calibration at Scale.",
            "Flux: A Platform for Dynamically Reconfigurable Mobile Crowd-Sensing.",
            "A Scalable Room Occupancy Prediction with Transferable Time Series Decomposition of CO2 Sensor Data.",
            "A Scalable System for Apportionment and Tracking of Energy Footprints in Commercial Buildings.",
            "Smart Home Occupant Identification via Sensor Fusion Across On-Object Devices.",
            "Optimal Discrete Net-Load Balancing in Smart Grids with High PV Penetration.",
            "Mechanisms and Policies for Controlling Distributed Solar Capacity.",
            "Inverted HVAC: Greenifying Older Buildings, One Room at a Time.",
            "SonicDoor: A Person Identification System Based on Modeling of Shape, Behavior, and Walking Patterns.",
            "Maintenance of Smart Buildings using Fault Trees.",
            "sTube+: An IoT Communication Sharing Architecture for Smart After-sales Maintenance in Buildings.",
            "A Framework for Privacy-Preserving Data Publishing with Enhanced Utility for Cyber-Physical Systems.",
            "Designing Green Communication Systems for Smart and Connected Communities via Dynamic Spectrum Access."
        ]
    },
    {
        "name": "TOSN",
        "year": "2017",
        "info": "Volume 13: 2017",
        "count": 34,
        "papers": [
            "A System for Response and Prevention of Security Incidents in Wireless Sensor Networks.",
            "Enabling Sensor Network to Smartphone Interaction Using Software Radios.",
            "Accelerating the Kamada-Kawai Algorithm for Boundary Detection in a Mobile Ad Hoc Network.",
            "Water Quality Monitoring Using Wireless Sensor Networks: Current Trends and Future Research Directions.",
            "Sensor Network Provenance Compression Using Dynamic Bayesian Networks.",
            "Gait-Key: A Gait-Based Shared Secret Key Generation Protocol for Wearable Devices.",
            "Encode When Necessary: Correlated Network Coding Under Unreliable Wireless Links.",
            "Performance Assessment and Feasibility Analysis of IEEE 802.15.4m Wireless Sensor Networks in TV Grayspaces.",
            "A Joint Data Compression and Encryption Approach for Wireless Energy Auditing Networks.",
            "Improving Performance of Synchronous Transmission-Based Protocols Using Capture Effect over Multichannels.",
            "Approximate Holistic Aggregation in Wireless Sensor Networks.",
            "IONavi: An Indoor-Outdoor Navigation Service via Mobile Crowdsensing.",
            "Intelligent Self-Adaptation Data Behavior Control Inspired by Speech Acts.",
            "Vital Sign and Sleep Monitoring Using Millimeter Wave.",
            "SEMON: Sensorless Event Monitoring in Self-Powered Wireless Nanosensor Networks.",
            "Realistic and Repeatable Emulation of Energy Harvesting Environments.",
            "REWIMO: A Real-Time and Reliable Low-Power Wireless Mobile Network.",
            "Reliability or Sustainability: Optimal Data Stream Estimation and Scheduling in Smart Water Networks.",
            "High-Level Design of Wireless Sensor Networks for Performance Optimization Under Security Hazards.",
            "Unsupervised Residential Power Usage Monitoring Using a Wireless Sensor Network.",
            "Fuzzy Bin-Based Classification for Detecting Children's Presence with 3D Depth Cameras.",
            "Energy-Efficient Collection of Sparse Data in Wireless Sensor Networks Using Sparse Random Matrices.",
            "Measurement Based As-You-Go Deployment of Two-Connected Wireless Relay Networks.",
            "Maximum Entropy-Based Auto Drift Correction Using High- and Low-Precision Sensors.",
            "QoS in Body Area Networks: A Survey.",
            "An Empirical Design Space Analysis of Doorway Tracking Systems for Real-World Environments.",
            "TARS: A Traffic-Adaptive Receiver-Synchronized MAC Protocol for Underwater Sensor Networks.",
            "Inferring Clothing Insulation Levels Using Mechanisms of Heat Transfer.",
            "Tracking Human Motions in Photographing: A Context-Aware Energy-Saving Scheme for Smart Phones.",
            "iSelf: Towards Cold-Start Emotion Labeling Using Transfer Learning with Smartphones.",
            "Link Modeling and Delay Analysis in Networks with Disruptive Links.",
            "A Distance-Based Data Aggregation Technique for Periodic Sensor Networks.",
            "Design Experiences in Minimalistic Flying Sensor Node Platform through SensorFly.",
            "Quality of Information in Mobile Crowdsensing: Survey and Research Challenges."
        ]
    },
    {
        "name": "TOSN",
        "year": "2016",
        "info": "Volume 12: 2016",
        "count": 37,
        "papers": [
            "TAS-MAC: A Traffic-Adaptive Synchronous MAC Protocol for Wireless Sensor Networks.",
            "Optimizing the Lifetime of Sensor Networks with Uncontrollable Mobile Sinks and QoS Constraints.",
            "Efficient Multichannel Communications in Wireless Sensor Networks.",
            "Near-Optimal Deterministic Steiner Tree Maintenance in Sensor Networks.",
            "Decentralized Network-Level Synchronization in Mobile Ad Hoc Networks.",
            "ATPC: Adaptive Transmission Power Control for Wireless Sensor Networks.",
            "Monitoring Bats in the Wild: On Using Erasure Codes for Energy-Efficient Wireless Sensor Networks.",
            "Node or Link? Fine-Grained Analysis of Packet-Loss Attacks in Wireless Sensor Networks.",
            "Accurate, Dynamic, and Distributed Localization of Phenomena for Mobile Sensor Networks.",
            "Game Theory Framework for MAC Parameter Optimization in Energy-Delay Constrained Sensor Networks.",
            "IdealVolting: Reliable Undervolting on Wireless Sensor Nodes.",
            "Energy-Efficient Time Synchronization in Wireless Sensor Networks via Temperature-Aware Compensation.",
            "Incentive Mechanisms for Participatory Sensing: Survey and Research Challenges.",
            "Maintaining Large-Scale Rechargeable Sensor Networks Perpetually via Multiple Mobile Charging Vehicles.",
            "Range-Free Mobile Actor Relocation in a Two-Tiered Wireless Sensor and Actor Network.",
            "Bounds on Multiple Sensor Fusion.",
            "Designing Interactive Multiswimmer Exergames: A Case Study.",
            "Carpooling Service for Large-Scale Taxicab Networks.",
            "Neighborhood View Consistency in Wireless Sensor Networks.",
            "A Comparative Study of Recent Wireless Sensor Network Simulators.",
            "Consensus-Aware Sociopsychological Trust Model for Wireless Sensor Networks.",
            "Connectivity-Based Space Filling Curve Construction Algorithms in High Genus 3D Surface WSNs.",
            "Neighbour-Disjoint Multipath for Low-Power and Lossy Networks.",
            "Energy Harvesting and Wireless Transfer in Sensor Network Applications: Concepts and Experiences.",
            "Energy-Efficient Aquatic Environment Monitoring Using Smartphone-Based Robots.",
            "Socially Optimal Coexistence of Wireless Body Area Networks Enabled by a Non-Cooperative Game.",
            "Secure Positioning in Wireless Sensor Networks through Enlargement Miscontrol Detection.",
            "LIPS: A Light Intensity-Based Positioning System for Indoor Environments.",
            "CATS: Cooperative Allocation of Tasks and Scheduling of Sampling Intervals for Maximizing Data Sharing in WSNs.",
            "BLOW-UP: Toward Distributed and Scalable Space Filling Curve Construction in 3D Volumetric WSNs.",
            "Following Targets for Mobile Tracking in Wireless Sensor Networks.",
            "Two-Hop Relay-Assisted Cooperative Communication in Wireless Body Area Networks: An Empirical Study.",
            "QoS for Long-Range Wireless Sensors Under Duty-Cycle Regulations with Shared Activity Time Usage.",
            "Reliable and Energy-Efficient Downward Packet Delivery in Asymmetric Transmission Power-Based Networks.",
            "3D-kCov-ComFor: An Energy-Efficient Framework for Composite Forwarding in Three-Dimensional Duty-Cycled k-Covered Wireless Sensor Networks.",
            "On a New SDP-SOCP Method for Acoustic Source Localization Problem.",
            "Temporal Lossless and Lossy Compression in Wireless Sensor Networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2014",
        "info": "Volume 11: 2014/2015",
        "count": 64,
        "papers": [
            "A Novel Algorithm for Distributed Localization in Wireless Sensor Networks.",
            "Efficient High-Rate Secret Key Extraction in Wireless Sensor Networks Using Collaboration.",
            "Placing Sensors for Area Coverage in a Complex Environment by a Team of Robots.",
            "Road-RFSense: A Practical RF Sensing-Based Road Traffic Estimation System for Developing Regions.",
            "Theory and Algorithm of Estimating Energy Consumption Breakdowns using ON/OFF State Sensing.",
            "Broadcast-Enhanced Key Predistribution Schemes.",
            "Advanced Principal Component-Based Compression Schemes for Wireless Sensor Networks.",
            "Data Pre-Forwarding for Opportunistic Data Collection in Wireless Sensor Networks.",
            "Distributed Optimal Lexicographic Max-Min Rate Allocation in Solar-Powered Wireless Sensor Networks.",
            "A Learning-Based Approach to Confident Event Detection in Heterogeneous Sensor Networks.",
            "Building Maximum Lifetime Shortest Path Data Aggregation Trees in Wireless Sensor Networks.",
            "Perpetual Data Collection with Energy-Harvesting Sensor Networks.",
            "Deterministic and Energy-Optimal Wireless Synchronization.",
            "Barrier Coverage by Sensors with Adjustable Ranges.",
            "On the Performance of Lossy Compression Schemes for Energy Constrained Sensor Networking.",
            "A Cross-Layer Optimization Approach for Lower Layers of the Protocol Stack in Sensor Networks.",
            "Distributed Separate Coding for Continuous Data Collection in Wireless Sensor Networks.",
            "A Low-Stretch-Guaranteed and Lightweight Geographic Routing Protocol for Large-Scale Wireless Sensor Networks.",
            "Smart Blueprints: How Simple Sensors Can Collaboratively Map Out Their Own Locations in the Home.",
            "A Low-Stretch-Guaranteed and Lightweight Geographic Routing Protocol for Large-Scale Wireless Sensor Networks.",
            "Energy-Balanced Scheduling for Target Tracking in Wireless Sensor Networks.",
            "Optimizing Relocatable Code for Efficient Software Update in Networked Embedded Systems.",
            "In-Network Distributed Solar Current Prediction.",
            "ECPC: Toward Preserving Downtime Data Persistence in Disruptive Wireless Sensor Networks.",
            "Bringing Modern Unit Testing Techniques to Sensornets.",
            "In-situ Soil Moisture Sensing: Measurement Scheduling and Estimation Using Sparse Sampling.",
            "Error Saturation Nonlinearities for Robust Incremental LMS over Wireless Sensor Networks.",
            "IODetector: A Generic Service for Indoor/Outdoor Detection.",
            "Mixing in Random Digraphs with Application to the Forward-Secure Key Evolution in Wireless Sensor Networks.",
            "A Sensor System for High-Fidelity Temperature Distribution Forecasting in Data Centers.",
            "Resilient Round Robin: A Lightweight Deterministic MAC Primitive.",
            "A Framework for Dynamic Composition of Communication Services.",
            "Power-Based Diagnosis of Node Silence in Remote High-End Sensing Systems.",
            "A Distributed Reconfiguration Approach for Quality-of-Service Provisioning in Dynamic Heterogeneous Wireless Sensor Networks.",
            "Error/Erasure-Resilient and Complexity-Constrained Zero-Delay Distributed Coding for Large-Scale Sensor Networks.",
            "Optimal Radius for Connectivity in Duty-Cycled Wireless Sensor Networks.",
            "Wireless Fingerprints Inside a Wireless Sensor Network.",
            "Not Every Bit Counts: Data-Centric Resource Allocation for Correlated Data Gathering in Machine-to-Machine Wireless Networks.",
            "DualMOP-RPL: Supporting Multiple Modes of Downward Routing in a Single RPL Network.",
            "Staying Alive: System Design for Self-Sufficient Sensor Networks.",
            "Sensor Placement and Measurement of Wind for Water Quality Studies in Urban Reservoirs.",
            "Toward Stable Network Performance in Wireless Sensor Networks: A Multilevel Perspective.",
            "GreenLocs: An Energy-Efficient Indoor Place Identification Framework.",
            "TOC: Localizing Wireless Rechargeable Sensors with Time of Charge.",
            "Hierarchical Data Aggregation Using Compressive Sensing (HDACS) in WSNs.",
            "Optimized Cooperative Dynamic Coverage in Mixed Sensor Networks.",
            "Integrated Intrusion Detection and Tolerance in Homogeneous Clustered Sensor Networks.",
            "Toward Optimal Monitoring of Flow-Based Systems Using Mobile Wireless Sensor Networks.",
            "Distributed Low-Latency Data Aggregation Scheduling in Wireless Sensor Networks.",
            "Geospatial Estimation-Based Auto Drift Correction in Wireless Sensor Networks.",
            "Accurate Range-Free Localization for Anisotropic Wireless Sensor Networks.",
            "Relay Selection with Channel Probing in Sleep-Wake Cycling Wireless Sensor Networks.",
            "Adaptive Hybrid Compression for Wireless Sensor Networks.",
            "Adapting Distributed LT codes to Y-Networks: An Abstraction of Collection Tree in Sensor Networks.",
            "SmartRoad: Smartphone-Based Crowd Sensing for Traffic Regulator Detection and Identification.",
            "Scheduling Survivability-Heterogeneous Sensor Networks for Critical Location Surveillance.",
            "Optimizing Energy Efficiency for Minimum Latency Broadcast in Low-Duty-Cycle Sensor Networks.",
            "Location-Free Detection of Network Boundaries.",
            "Terra: Flexibility and Safety in Wireless Sensor Networks.",
            "iDiary: From GPS Signals to a Text- Searchable Diary.",
            "Network Coding-Aware Compressive Data Gathering for Energy-Efficient Wireless Sensor Networks.",
            "Energy-Harvesting Active Networked Tags (EnHANTs): Prototyping and Experimentation.",
            "Generic Neighbor Discovery Accelerations in Mobile Applications.",
            "REACH2-Mote: A Range-Extending Passive Wake-Up Wireless Sensor Node."
        ]
    },
    {
        "name": "TOSN",
        "year": "2013",
        "info": "Volume 10: 2013/2014",
        "count": 68,
        "papers": [
            "AS-MAC: Utilizing the adaptive spreading code length for wireless sensor networks.",
            "On energy-efficient trap coverage in wireless sensor networks.",
            "Achieving full-view coverage in camera sensor networks.",
            "The GINSENG system for wireless monitoring and control: Design and deployment experiences.",
            "Compression in wireless sensor networks: A survey and comparative evaluation.",
            "Connectivity-based and anchor-free localization in large-scale 2D/3D sensor networks.",
            "A study towards applying thermal inertia for energy conservation in rooms.",
            "Joint k-coverage and data gathering in sparsely deployed sensor networks - Impact of purposeful mobility and heterogeneity.",
            "Gauss-seidel correction algorithm: A macroscopic model-derived routing algorithm for WSNs.",
            "An adaptive sensor sleeping solution based on sleeping multipath routing and duty-cycled MAC protocols.",
            "Design, development, and performance evaluation of a low-cost, low-power wake-up radio system for wireless sensor networks.",
            "Duty-cycle optimization for IEEE 802.15.4 wireless sensor networks.",
            "Controlled and self-organized routing for large-scale wireless sensor networks.",
            "STARR-DCS: Spatio-temporal adaptation of random replication for data-centric storage.",
            "Acoustical ranging techniques in embedded wireless sensor networked devices.",
            "CTP: An efficient, robust, and reliable collection tree protocol for wireless sensor networks.",
            "Improving wireless link simulation using multilevel markov models.",
            "Collaborative localization in visual sensor networks.",
            "Distributed data association in smart camera networks using belief propagation.",
            "Socio-economic vision graph generation and handover in distributed smart camera networks.",
            "Progressively refined wyner-ziv video coding for visual sensors.",
            "A predictive duty cycle adaptation framework using augmented sensing for wireless camera networks.",
            "Camera selection for tracking in distributed smart camera networks.",
            "Low-complexity scalable distributed multicamera tracking of humans.",
            "Online control of active camera networks for computer vision tasks.",
            "Calibrating a wide-area camera network with non-overlapping views using mobile devices.",
            "Multicamera video summarization and anomaly detection from activity motifs.",
            "Adaptive instantiation of the protocol interference model in wireless networked sensing and control.",
            "Optimal nonuniform deployment of sensors for distributed detection in wireless sensor networks.",
            "Maximum likelihood analysis of conflicting observations in social sensing.",
            "Troubleshooting interactive complexity bugs in wireless sensor networks using data mining techniques.",
            "Radio diversity for reliable communication in sensor networks.",
            "Coverage quality and smoothness criteria for online view selection in a multi-camera network.",
            "On detection and tracking of variant phenomena clouds.",
            "Failure detection in wireless sensor networks: A sequence-based dynamic approach.",
            "Analysis of a prioritized contention model for multimedia wireless sensor networks.",
            "Data-driven link quality prediction using link features.",
            "Towards Energy-Fairness in Asynchronous Duty-Cycling Sensor Networks.",
            "Leveraging Human Mobility for Communication in Body Area Networks.",
            "Detecting Faulty Nodes with Data Errors for Wireless Sensor Networks.",
            "Convex Partitioning of Large-Scale Sensor Networks in Complex Fields: Algorithms and Applications.",
            "Occupancy Modeling and Prediction for Building Energy Management.",
            "A Cooperative MIMO Framework for Wireless Sensor Networks.",
            "Constructing Schedules for Time-Critical Data Delivery in Wireless Sensor Networks.",
            "Dynamic Networked Coverage of Time-Varying Environments in the Presence of Fading Communication Channels.",
            "Temporal Adaptive Link Quality Prediction with Online Learning.",
            "Combinatorial Filters: Sensor Beams, Obstacles, and Possible Paths.",
            "Efficient Solutions Framework for Optimal Multitask Resource Assignments for Data Fusion in Wireless Sensor Networks.",
            "Defending against Frequency-Based Attacks on Distributed Data Storage in Wireless Networks.",
            "Surface-Reflection-Based Communication and Localization in Underwater Sensor Networks.",
            "Connected Coverage in Wireless Networks with Directional Antennas.",
            "MC2: Multimode User-Centric Design of Wireless Sensor Networks for Long-Term Monitoring.",
            "Topology-Related Metrics and Applications for the Design and Operation of Wireless Sensor Networks.",
            "DICE: Monitoring Global Invariants with Wireless Sensor Networks.",
            "Formation Detection with Wireless Sensor Networks.",
            "Maximizing the Lifetime of Query-Based Wireless Sensor Networks.",
            "Spatiotemporal Aquatic Field Reconstruction Using Cyber-Physical Robotic Sensor Systems.",
            "PDVLoc: A Personal Data Vault for Controlled Location Data Sharing.",
            "Maximizing Quality of Coverage under Connectivity Constraints in Solar-Powered Active Wireless Sensor Networks.",
            "Sensor Mission Assignment in Rechargeable Wireless Sensor Networks.",
            "A Quality-Aware Voice Streaming System for Wireless Sensor Networks.",
            "Flash-Optimized Temporal Indexing for Time-Series Data Storage on Sensor Platforms.",
            "Low-Cost Indoor Location Management for Robots Using IR Leds and an IR Camera.",
            "ftTRACK: Fault-Tolerant Target Tracking in Binary Sensor Networks.",
            "Efficient Cluster Mobility Support for TDMA-Based MAC Protocols in Wireless Sensor Networks.",
            "A Review of Wireless-Sensor-Network-Enabled Building Energy Management Systems.",
            "Opportunistic Routing in Low Duty-Cycle Wireless Sensor Networks.",
            "Sensor Placement with Multiple Objectives for Structural Health Monitoring."
        ]
    },
    {
        "name": "TOSN",
        "year": "2012",
        "info": "Volume 9: 2012/2013",
        "count": 54,
        "papers": [
            "Real-time information processing of environmental sensor network data using bayesian gaussian processes.",
            "Sampling and classifying interference patterns in a wireless sensor network.",
            "Analysis of capacity improvement by directional antennas in wireless sensor networks.",
            "Distributed state estimation in sensor networks with randomly occurring nonlinearities subject to time delays.",
            "A new data aggregation scheme via adaptive compression for wireless sensor networks.",
            "Traffic modeling and prediction using sensor networks: Who will go where and when?",
            "Self-healing in unattended wireless sensor networks.",
            "A longitudinal study of vibration-based water flow sensing.",
            "A practical theory of micro-solar power sensor networks.",
            "Minimum transmission power configuration in real-time sensor networks with overlapping channels.",
            "Energy-efficient data redistribution in sensor networks.",
            "Behavior-oriented data resource management in medical sensing systems.",
            "Modeling and stability analysis of hybrid multiple access in the IEEE 802.15.4 protocol.",
            "Optimizing sensor network reprogramming via in situ reconfigurable components.",
            "Surface-level path loss modeling for sensor networks in flat and irregular terrain.",
            "Object tracking in the presence of occlusions using multiple cameras: A sensor network approach.",
            "Fusion-based volcanic earthquake detection and timing in wireless sensor networks.",
            "Secure ad hoc trust initialization and key management in wireless body area networks.",
            "Packet-level attestation (PLA): A framework for in-network sensor data reliability.",
            "Mapping hidden water pipelines using a mobile sensor droplet.",
            "A low-bandwidth camera sensor platform with applications in smart camera networks.",
            "On mobile sensor assisted field coverage.",
            "Energy-efficient localization: GPS duty cycling with radio ranging.",
            "Robust localization against outliers in wireless sensor networks.",
            "SenseCode: Network coding for reliable sensor networks.",
            "Beyond triangle inequality: Sifting noisy and outlier distance measurements for localization.",
            "Tones for real: Managing multipath in underwater acoustic wakeup.",
            "System-level calibration for data fusion in wireless sensor networks.",
            "Enhancing RSSI-based tracking accuracy in wireless sensor networks.",
            "Localization with sparse acoustic sensor network using UAVs as information-seeking data mules.",
            "Energy-efficient data dissemination using beamforming in wireless sensor networks.",
            "Distributed and compact routing using spatial distributions in wireless sensor networks.",
            "Adaptive energy-efficient scheduling for hierarchical wireless sensor networks.",
            "Towards statistically strong source anonymity for sensor networks.",
            "Real-time routing in wireless sensor networks: A potential field approach.",
            "Property management in wireless sensor networks with overcomplete radon bases.",
            "Improved multicriteria spanners for Ad-Hoc networks under energy and distance metrics.",
            "Diagnostic tracing for wireless sensor networks.",
            "Performance evaluation of sensor networks by statistical modeling and euclidean model checking.",
            "Adaptive k-coverage contour evaluation and deployment in wireless sensor networks.",
            "A high-frequency sampling monitoring system for environmental and structural applications.",
            "DutyCon: A dynamic duty-cycle control approach to end-to-end delay guarantees in wireless sensor networks.",
            "Energy efficiency in wireless sensor networks: A game-theoretic approach based on coalition formation.",
            "A game theory distributed approach for energy optimization in WSNs.",
            "Coverage algorithms for visual sensor networks.",
            "Distributed lifetime-maximized target coverage game.",
            "Cell-based snapshot and continuous data collection in wireless sensor networks.",
            "On the quality and value of information in sensor networks.",
            "Trade-off between energy efficiency and report validity for mobile sensor networks.",
            "Sensor node source privacy and packet recovery under eavesdropping and node compromise attacks.",
            "Results on finite wireless sensor networks: Connectivity and coverage.",
            "Capacity- and energy-aware activation of sensor nodes for area phenomenon reproduction using wireless network transport.",
            "Thermal-aware sensor scheduling for distributed estimation.",
            "Managing software evolution in large-scale wireless sensor and actuator networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2011",
        "info": "Volume 8: 2011/2012",
        "count": 36,
        "papers": [
            "Path Planning of Data Mules in Sensor Networks.",
            "MCRT: Multichannel Real-Time Communications in Wireless Sensor Networks.",
            "Spatiotemporal Models for Data-Anomaly Detection in Dynamic Environmental Monitoring Campaigns.",
            "Hierarchical Spatial Gossip for Multiresolution Representations in Sensor Networks.",
            "Multiple-Target Tracking With Binary Proximity Sensors.",
            "PDA: Privacy-Preserving Data Aggregation for Information Collection.",
            "Data Collection in Wireless Sensor Networks with Mobile Elements: A Survey.",
            "Analysis of Deterministic Tracking of Multiple Objects Using a Binary Sensor Network.",
            "Dependable and Secure Sensor Data Storage with Dynamic Integrity Assurance.",
            "Data authenticity and availability in multihop wireless sensor networks.",
            "Self-localizing smart camera networks.",
            "Delay optimal event detection on ad hoc wireless sensor networks.",
            "Practical RSA signature scheme based on periodical rekeying for wireless sensor networks.",
            "Information-theoretic modeling of false data filtering schemes in wireless sensor networks.",
            "Quantization, channel compensation, and optimal energy allocation for estimation in sensor networks.",
            "Event prediction in a hybrid camera network.",
            "Utility-based bandwidth adaptation in mission-oriented wireless sensor networks.",
            "A dynamic programming approach to maximizing a statistical measure of the lifetime of sensor networks.",
            "Sensor network localization by eigenvector synchronization over the euclidean group.",
            "Containing bogus packet insertion attacks for broadcast authentication in sensor networks.",
            "Optimal multiobjective placement of distributed sensors against moving targets.",
            "More is more: The benefits of denser sensor deployment.",
            "Sensor network data fault detection with maximum a posteriori selection and bayesian modeling.",
            "Sensor activation and radius adaptation (SARA) in heterogeneous sensor networks.",
            "A case for hierarchical routing in low-power wireless embedded networks.",
            "Coverage estimation for crowded targets in visual sensor networks.",
            "Localized policy-based target tracking using wireless sensor networks.",
            "PIP: A multichannel, TDMA-based MAC for efficient and scalable bulk transfer in sensor networks.",
            "WILDSENSING: Design and deployment of a sustainable sensor network for wildlife monitoring.",
            "A-MAC: A versatile and efficient receiver-initiated link layer for low-power wireless.",
            "AutoWitness: Locating and tracking stolen property while tolerating GPS and radio outages.",
            "Achieving long-term operation with a capacitor-driven energy storage and sharing network.",
            "In-situ soil moisture sensing: Optimal sensor placement and field estimation.",
            "Radio link quality estimation in wireless sensor networks: A survey.",
            "Theory and algorithms for hop-count-based localization with random geometric graph models of dense sensor networks.",
            "A novel framework for energy-efficient data gathering with random coverage in wireless sensor networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2010",
        "info": "Volume 7: 2010/2011",
        "count": 36,
        "papers": [
            "RF doppler shift-based mobile sensor tracking and navigation.",
            "Real-time data aggregation in contention-based wireless sensor networks.",
            "Resilient localization for sensor networks in outdoor environments.",
            "Speed control and scheduling of data mules in sensor networks.",
            "Toward trusted wireless sensor networks.",
            "Reliable and efficient reprogramming in sensor networks.",
            "RaPTEX: Rapid prototyping tool for embedded communication systems.",
            "Modeling latency - lifetime trade-off for target detection in mobile sensor networks.",
            "Everywhere sparse approximately optimal minimum energy data gathering and aggregation in sensor networks.",
            "Analyzing MAC protocols for low data-rate applications.",
            "Key predistribution for homogeneous wireless sensor networks with group deployment of nodes.",
            "Leveraging redundancy in sampling-interpolation applications for sensor networks: A spectral approach.",
            "Coverage properties of clustered wireless sensor networks.",
            "Dimensioning and worst-case analysis of cluster-tree sensor networks.",
            "Not all wireless sensor networks are created equal: A comparative study on tunnels.",
            "Detection of reactive jamming in sensor networks.",
            "Statistical anomaly detection with sensor networks.",
            "Quality of monitoring of stochastic events by periodic and proportional-share scheduling of sensor coverage.",
            "Analyzing MAC protocols for low data-rate applications.",
            "RCRT: Rate-controlled reliable transport protocol for wireless sensor networks.",
            "Identification of low-level point radioactive sources using a sensor network.",
            "Obstacle discovery in distributed actuator and sensor networks.",
            "Approximation algorithms for computing minimum exposure paths in a sensor field.",
            "On the interaction of clocks, power, and synchronization in duty-cycled embedded sensor nodes.",
            "Localized spanner construction for ad hoc networks with variable transmission range.",
            "Analysis of power-aware buffering schemes in wireless sensor networks.",
            "Force-directed approaches to sensor localization.",
            "Optimizing physical-layer parameters for wireless sensor networks.",
            "A security framework for privacy-preserving data aggregation in wireless sensor networks.",
            "Efficient incremental code update for sensor networks.",
            "Robust sensor placements at informative and communication-efficient locations.",
            "Energy-efficient congestion detection and avoidance in sensor networks.",
            "Optimizing sensor movement planning for energy efficiency.",
            "A model framework for greedy routing in a sensor network with a stochastic power scheme.",
            "Critical sensor density for partial connectivity in large area wireless sensor networks.",
            "Sensor network localization using sensor perturbation."
        ]
    },
    {
        "name": "TOSN",
        "year": "2009",
        "info": "Volume 6: 2009/2010",
        "count": 36,
        "papers": [
            "Catching elephants with mice: Sparse sampling for monitoring sensor networks.",
            "Measuring and guaranteeing quality of barrier coverage for general belts with wireless sensors.",
            "Directed broadcast with overhearing for sensor networks.",
            "Key predistribution using combinatorial designs for grid-group deployment scheme in wireless sensor networks.",
            "On the energy efficiency of cooperative communications in wireless sensor networks.",
            "BikeNet: A mobile sensing system for cyclist experience mapping.",
            "Elliptical anomalies in wireless sensor networks.",
            "Distributed algorithm for node localization in wireless ad-hoc networks.",
            "ShortPK: A short-term public key scheme for broadcast authentication in sensor networks.",
            "A computational geometry method for localization using differences of distances.",
            "The impact of quasi-equally spaced sensor topologies on signal reconstruction.",
            "On link asymmetry and one-way estimation in wireless sensor networks.",
            "Using mobile phones to determine transportation modes.",
            "Query privacy in wireless sensor networks.",
            "Dealing with random and selective attacks in wireless sensor systems.",
            "An empirical study of low-power wireless.",
            "SensorScope: Application-specific sensor network for environmental monitoring.",
            "Fusion of threshold rules for target detection in wireless sensor networks.",
            "Heartbeat of a nest: Using imagers as biological sensors.",
            "On boundary recognition without location information in wireless sensor networks.",
            "Dynamic sleep time control in wireless sensor networks.",
            "Energy-efficient data gathering in wireless sensor networks with asynchronous sampling.",
            "Sensor faults: Detection methods and prevalence in real-world datasets.",
            "Energy-driven distribution of signal processing applications across wireless sensor networks.",
            "Dynamic multiroot, multiquery processing based on data sharing in sensor networks.",
            "Near-lifetime-optimal data collection in wireless sensor networks via spatio-temporal load balancing.",
            "A utility-based adaptive sensing and multihop communication protocol for wireless sensor networks.",
            "Reliable data delivery in large-scale low-power sensor networks.",
            "Secure and robust virtual coordinate system in wireless sensor networks.",
            "Collaborative location certification for sensor networks.",
            "Physiological value-based efficient usable security solutions for body sensor networks.",
            "Distributed energy-efficient target tracking with binary sensor networks.",
            "Asymptotic distortion exponents for the estimation of time-varying channels in multihop sensor networks.",
            "The Tenet architecture for tiered sensor networks.",
            "An as-rigid-as-possible approach to sensor network localization.",
            "Sensor-mission assignment in wireless sensor networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2009",
        "info": "Volume 5: 2009",
        "count": 36,
        "papers": [
            "Cooperative node localization using nonlinear data projection.",
            "A security and robustness performance analysis of localization algorithms to signal strength attacks.",
            "Sensor node lifetime analysis: Models and tools.",
            "Design and evaluation of a hybrid sensor network for cane toad monitoring.",
            "On the lifetime of wireless sensor networks.",
            "Energy-efficient link-layer jamming attacks against wireless sensor network MAC protocols.",
            "Localization and routing in sensor networks by local angle information.",
            "Variable radii connected sensor cover in sensor networks.",
            "Achieving long-term surveillance in VigilNet.",
            "Underground coal mine monitoring with wireless sensor networks.",
            "Distributed localization for anisotropic sensor networks.",
            "Segmenting a sensor field: Algorithms and applications in network design.",
            "Security model and framework for information aggregation in sensor networks.",
            "SGF: A state-free gradient-based forwarding protocol for wireless sensor networks.",
            "Trail: A distance-sensitive sensor network service for distributed object tracking.",
            "Energy-efficient multihop reprogramming for sensor networks.",
            "Path coverage by a sensor field: The nonhomogeneous case.",
            "Analytic evaluation of target detection in heterogeneous wireless sensor networks.",
            "Decentralized control of adaptive sampling in wireless sensor networks.",
            "Efficient and provably secure aggregation of encrypted data in wireless sensor networks.",
            "Acoustic sensor network design for position estimation.",
            "Design, implementation, and evaluation of EnviroMic: A storage-centric audio sensor network.",
            "Deployment-aware modeling of node compromise spread in wireless sensor networks using epidemic theory.",
            "Low-complexity coding and source-optimized clustering for large-scale sensor networks.",
            "Sensor network data fault types.",
            "Optimal placement of distributed sensors against moving targets.",
            "An interrelational grouping abstraction for heterogeneous sensors.",
            "Temporal privacy in wireless sensor networks: Theory and practice.",
            "CMAC: An energy-efficient MAC layer protocol using convergent packet forwarding for wireless sensor networks.",
            "Target tracking with binary proximity sensors.",
            "Connectivity-based localization of large-scale sensor networks with complex shape.",
            "Optimal base station placement in wireless sensor networks.",
            "Ultra-low power data storage for sensor networks.",
            "Robust and distributed stochastic localization in sensor networks: Theory and experimental results.",
            "Multihop/Direct Forwarding (MDF) for static wireless sensor networks.",
            "On meeting lifetime goals and providing constant application quality."
        ]
    },
    {
        "name": "TOSN",
        "year": "2008",
        "info": "Volume 4: 2008",
        "count": 26,
        "papers": [
            "Mitigating DoS attacks against broadcast authentication in wireless sensor networks.",
            "Energy-efficient on-demand reprogramming of large-scale sensor networks.",
            "Sensor localization in concave environments.",
            "Efficient gathering of correlated data in sensor networks.",
            "Cluster-based congestion control for sensor networks.",
            "Adaptive probability-based broadcast forwarding in energy-saving sensor networks.",
            "Synopsis diffusion for robust aggregation in sensor networks.",
            "Programming models for sensor networks: A survey.",
            "Aggregation methods for large-scale sensor networks.",
            "Detecting cuts in sensor networks.",
            "Group-based key predistribution for wireless sensor networks.",
            "Efficient geographic routing over lossy links in wireless sensor networks.",
            "Optimal sensor placement for agent localization.",
            "Partial network coding: Concept, performance, and application for continuous data collection in sensor networks.",
            "Reputation-based framework for high integrity sensor networks.",
            "The theory of trackability with applications to sensor networks.",
            "Near-optimal activation policies in rechargeable sensor networks under spatial correlations.",
            "Defending wireless sensor networks from radio interference through channel adaptation.",
            "Activity recognition via user-trace segmentation.",
            "A distributed and self-organizing scheduling algorithm for energy-efficient data aggregation in wireless sensor networks.",
            "Optimally balancing energy consumption versus latency in sensor network routing.",
            "Implementing public-key infrastructure for sensor networks.",
            "Least privilege and privilege deprivation: Toward tolerating mobile sink compromises in wireless sensor networks.",
            "The impact of spatial correlation on routing with compression in wireless sensor networks.",
            "Asynchronous in-network prediction: Efficient aggregation in sensor networks.",
            "MAX: Wide area human-centric search of the physical world."
        ]
    },
    {
        "name": "TOSN",
        "year": "2007",
        "info": "Volume 3: 2007",
        "count": 22,
        "papers": [
            "Energy-efficient wireless sensor network design and implementation for condition-based maintenance.",
            "Wave scheduling and routing in sensor networks.",
            "The Clustered AGgregation (CAG) technique leveraging spatial and temporal correlations in wireless sensor networks.",
            "Analysis of the contention access period of IEEE 802.15.4 MAC.",
            "Distributed protocols for ensuring both coverage and connectivity of a wireless sensor network.",
            "A combinatorial algorithmic approach to energy efficient information collection in wireless sensor networks.",
            "An analysis of unreliability and asymmetry in low-power wireless links.",
            "Tiny-sync: Tight time synchronization for wireless sensor networks.",
            "Bounds on coverage and target detection capabilities for models of networks of mobile sensors.",
            "A diffusion model for packet travel time in a random multihop medium.",
            "Minimum power configuration for wireless communication in sensor networks.",
            "Coverage breach problems in bandwidth-constrained sensor networks.",
            "Emstar: A software environment for developing and deploying heterogeneous sensor-actuator networks.",
            "Interleaved hop-by-hop authentication against false data injection attacks in sensor networks.",
            "Asynchronous random sleeping for sensor networks.",
            "Secure pairwise key establishment in large-scale sensor networks: An area partitioning and multigroup key predistribution approach.",
            "Collaborative broadcasting and compression in cluster-based wireless sensor networks.",
            "Overload traffic management for sensor networks.",
            "A canonical seed assignment model for key predistribution in wireless sensor networks.",
            "The self-protection problem in wireless sensor networks.",
            "Localization using boundary sensors: An analysis based on graph theory.",
            "Reconfiguration methods for mobile sensor networks."
        ]
    },
    {
        "name": "TOSN",
        "year": "2006",
        "info": "Volume 2: 2006",
        "count": 22,
        "papers": [
            "VigilNet: An integrated sensor network system for energy-efficient surveillance.",
            "Distributed weighted-multidimensional scaling for node localization in sensor networks.",
            "Survey and benchmark of block ciphers for wireless sensor networks.",
            "Redundancy and coverage detection in sensor networks.",
            "Localized topology control for heterogeneous wireless sensor networks.",
            "Power-efficient sensor placement and transmission structure for data gathering under distortion constraints.",
            "Decentralized energy-conserving and coverage-preserving protocols for wireless sensor networks.",
            "Semidefinite programming based algorithms for sensor network localization.",
            "Models and solutions for radio irregularity in wireless sensor networks.",
            "Optimal real-time sampling rate assignment for wireless sensor networks.",
            "Communication power optimization in a sensor network with a path-constrained mobile observer.",
            "Stochastic coverage in heterogeneous sensor networks.",
            "On conditions for constant throughput in wireless networks.",
            "Distributed metric calibration of ad hoc camera networks.",
            "Dynamic data fusion for future sensor networks.",
            "A simple improved distributed algorithm for minimum CDS in unit disk graphs.",
            "Segmenting object space by geometric reference structures.",
            "Modeling spatially correlated data in sensor networks.",
            "LEAP+: Efficient security mechanisms for large-scale distributed sensor networks.",
            "A prediction error-based hypothesis testing method for sensor data acquisition.",
            "Scalable logical coordinates framework for routing in wireless sensor networks.",
            "VLSI implementation of an energy-aware wake-up detector for an acoustic surveillance sensor network."
        ]
    },
    {
        "name": "TOSN",
        "year": "2005",
        "info": "Volume 1: 2005",
        "count": 12,
        "papers": [
            "Introduction.",
            "Navigation protocols in sensor networks.",
            "Integrated coverage and connectivity configuration for energy conservation in sensor networks.",
            "SeRLoc: Robust localization for wireless sensor networks.",
            "A framework for time indexing in sensor networks.",
            "A kernel-based learning approach to ad hoc sensor network localization.",
            "Countersniper system for urban warfare.",
            "Energy-conserving data cache placement in sensor networks.",
            "Improving key predistribution with deployment knowledge in static sensor networks.",
            "FAR: Face-aware routing for mobicast in large-scale sensor networks.",
            "On the upper bound of alpha-lifetime for large sensor networks.",
            "On the optimal distribution of sensors in a random field."
        ]
    }
]