[
    {
        "year": "2021",
        "name": "WASA 2021",
        "info": "Nanjing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2021-1",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 16th International Conference, WASA 2021, Nanjing, China, June 25-27, 2021, Proceedings, Part I.",
                "count": 48,
                "papers": [
                    "Layer Based Fast Data Collection in Battery-Free Wireless Sensor Networks.",
                    "OD-PPS: An On-Demand Path Planning Scheme for Maximizing Data Completeness in Multi-modal UWSNs.",
                    "Improving WiFi Fingerprint Positioning Through Smartphone Built-In Sensors Based Trajectory Estimation.",
                    "Wi-Tracker: Monitoring Breathing Airflow with Acoustic Signals.",
                    "Low-Cost Wi-Fi Fingerprinting Indoor Localization via Generative Deep Learning.",
                    "Winfrared: An Infrared-Like Rapid Passive Device-Free Tracking with Wi-Fi.",
                    "Fusing Directional and Omnidirectional Wi-Fi Antennas for Accurate Indoor Localization.",
                    "Rewarding and Efficient Data Sharing in EHR System with Coalition Blockchain Assistance.",
                    "Temporal Networks Based Industry Identification for Bitcoin Users.",
                    "Blockchain-Based Data Ownership Confirmation Scheme in Industrial Internet of Things.",
                    "Fault-Tolerant Consensus in Wireless Blockchain System.",
                    "An Efficient and Secure Power Data Trading Scheme Based on Blockchain.",
                    "Fully Discover the Balance of Lightning Network Payment Channels.",
                    "IoT-Based Non-intrusive Energy Wastage Monitoring in Modern Building Units.",
                    "A Robust IoT Device Identification Method with Unknown Traffic Detection.",
                    "Temporal Attention-Based Graph Convolution Network for Taxi Demand Prediction in Functional Areas.",
                    "MSCNN: Steganographer Detection Based on Multi-Scale Convolutional Neural Networks.",
                    "MFAGCN: Multi-Feature Based Attention Graph Convolutional Network for Traffic Prediction.",
                    "Judicial Case Determination Methods Based on Event Tuple.",
                    "A Construction for Constant Dimension Codes from the Known Codes.",
                    "CSI-Based Calibration Free Localization with Rotating Antenna for Coal Mine.",
                    "Gray Failures Detection for Shared Bicycles.",
                    "Effective Cross-Region Courier-Displacement for Instant Delivery via Reinforcement Learning.",
                    "A Hybrid Framework for Class-Imbalanced Classification.",
                    "Light Field Super-Resolution Based on Spatial and Angular Attention.",
                    "CamDist: Camera Based Distance Estimation with a Smartphone.",
                    "URTracker: Unauthorized Reader Detection and Localization Using COTS RFID.",
                    "SDC Error Detection by Exploring the Importance of Instruction Features.",
                    "Dual Attention Network Based on Knowledge Graph for News Recommendation.",
                    "Social-Based Link Reliability Prediction Model for CR-VANETs.",
                    "Parallel Computing of Spatio-Temporal Model Based on Deep Reinforcement Learning.",
                    "TS-Net: Device-Free Action Recognition with Cross-Modal Learning.",
                    "A Priority Task Offloading Scheme Based on Coherent Beamforming and Successive Interference Cancellation for Edge Computing.",
                    "Dynamic Edge Computation Offloading and Scheduling for Model Task in Energy Capture Network.",
                    "A Light-Weight Deployment Methodology for DNN Re-training in Resource-Constraint Scenarios.",
                    "Deep Reinforcement Learning Based Collaborative Mobile Edge Caching for Omnidirectional Video Streaming.",
                    "DNN Inference Acceleration with Partitioning and Early Exiting in Edge Computing.",
                    "Available Time Aware Offloading for Dependent Tasks with Cooperative Edge Servers.",
                    "ECCR: Edge-Cloud Collaborative Recovery for Low-Power Wide-Area Networks Interference Mitigation.",
                    "A Stay-Point-Based Charger Placement Scheme for Nondeterministic Mobile Nodes.",
                    "Practical Bandwidth Allocation for Video QoE Fairness.",
                    "Controller Placements for Optimizing Switch-to-Controller and Inter-controller Communication Latency in Software Defined Networks.",
                    "Fat Topic: Improving Latency in Content-Based Publish/Subscribe Systems on Apache Kafka.",
                    "Communication-efficient Federated Learning via Quantized Clipped SGD.",
                    "A Node Preference-Aware Delegated Proof of Stake Consensus Algorithm With Reward and Punishment Mechanism.",
                    "Minimizing Energy Consumption with Devices Placement and Scheduling in Internet of Things.",
                    "Optimized Adversarial Example Generating Algorithm Based on Probabilistic Graph.",
                    "CDVT: A Cluster-Based Distributed Video Transcoding Scheme for Mobile Stream Services."
                ]
            },
            {
                "sub_name_abbr": "conf/wasa/2021-2",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 16th International Conference, WASA 2021, Nanjing, China, June 25-27, 2021, Proceedings, Part II.",
                "count": 49,
                "papers": [
                    "Scheduling of Mobile Charger with Multiple Antennas.",
                    "Sequential Recommendation via Temporal Self-Attention and Multi-Preference Learning.",
                    "Multi-connection Based Scalable Video Streaming in UDNs: A Multi-armed Bandit Approach.",
                    "FIUD: A Framework to Identify Users of Devices.",
                    "SAPN: Spatial Attention Pyramid Network for Cross-Domain Person Re-Identification.",
                    "A Lattice-Based Ring Signature Scheme to Secure Automated Valet Parking.",
                    "AOPL: Attention Enhanced Oversampling and Parallel Deep Learning Model for Attack Detection in Imbalanced Network Traffic.",
                    "Greedy-Based Black-Box Adversarial Attack Scheme on Graph Structure.",
                    "SECCEG: A Secure and Efficient Cryptographic Co-processor Based on Embedded GPU System.",
                    "Understanding and Mitigating Security Risks of Network on Medical Cyber Physical System.",
                    "RF-Ubia: User Biometric Information Authentication Based on RFID.",
                    "NFDD: A Dynamic Malicious Document Detection Method Without Manual Feature Dictionary.",
                    "Bug Triage Model Considering Cooperative and Sequential Relationship.",
                    "Adaptive Chosen Plaintext Side-Channel Attacks for Higher-Order Masking Schemes.",
                    "Mind the Amplification: Cracking Content Delivery Networks via DDoS Attacks.",
                    "A Verifiable Federated Learning Scheme Based on Secure Multi-party Computation.",
                    "TX-RSA: A High Performance RSA Implementation Scheme on NVIDIA Tegra X2.",
                    "Short Term Voltage Stability Assessment with Incomplete Data Based on Deep Reinforcement Learning in the Internet of Energy.",
                    "RDMA Based Performance Optimization on Distributed Database Systems: A Case Study with GoldenX.",
                    "A LambdaMart-Based High-Accuracy Approach for Software Automatic Fault Localization.",
                    "ParkLSTM: Periodic Parking Behavior Prediction Based on LSTM with Multi-source Data for Contract Parking Spaces.",
                    "Cost-Sharing Mechanism Design for Social Cost Minimization in Ridesharing Systems.",
                    "Privacy Protection Framework for Credit Data in AI.",
                    "A Secret-Sharing-based Security Data Aggregation Scheme in Wireless Sensor Networks.",
                    "Fast Application Activity Recognition with Encrypted Traffic.",
                    "A Privacy-Preserving Peer-to-Peer Accommodation System Based on a Credit Network.",
                    "Private Frequent Itemset Mining in the Local Setting.",
                    "DAFV: A Unified and Real-Time Framework of Joint Detection and Attributes Recognition for Fast Vehicles.",
                    "Vehicular Path Planning for Balancing Traffic Congestion Cost and Fog Computing Reward: A Routing Game Approach.",
                    "Distributed Collaborative Anomaly Detection for Trusted Digital Twin Vehicular Edge Networks.",
                    "Optimal Resource Allocation in Time-Varying Vehicular Networks with Delay Constraints.",
                    "Deep Reinforcement Learning for Resource Allocation in Multi-platoon Vehicular Networks.",
                    "Revenue Maximization of Electric Vehicle Charging Services with Hierarchical Game.",
                    "Adaptive Uplink/Downlink Bandwidth Allocation for Dual Deadline Information Services in Vehicular Networks.",
                    "A Local Collaborative Distributed Reinforcement Learning Approach for Resource Allocation in V2X Networks.",
                    "DDCAttNet: Road Segmentation Network for Remote Sensing Images.",
                    "Fine-Grained Measurements of Repetitions on Performance of NB-IoT.",
                    "Deep Reinforcement Learning Based Intelligent Job Batching in Industrial Internet of Things.",
                    "ORMD: Online Learning Real-Time Malicious Node Detection for the IoT Network.",
                    "TFRA: Trajectory-Based Message Ferry Recognition Attack in UAV Network.",
                    "Scaling DCN Models for Indoor White Space Exploration.",
                    "Deep Learning-Based Power Control for Uplink Cognitive Radio Networks.",
                    "MPDC: A Multi-channel Pipelined Data Collection MAC for Duty-Cycled Linear Sensor Networks.",
                    "Efficient Concurrent Transmission Scheme for Wireless Ad Hoc Networks: A Joint Optimization Approach.",
                    "Reinforcement Learning Based Sensor Encryption and Power Control for Low-Latency WBANs.",
                    "Modeling the Instantaneous Saturation Throughput of UAV Swarm Networks.",
                    "Learning-Based Aerial Charging Scheduling for UAV-Based Data Collection.",
                    "Learning to Communicate for Mobile Sensing with Multi-agent Reinforcement Learning.",
                    "Enhancing Blackslist-Based Packet Filtration Using Blockchain in Wireless Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/wasa/2021-3",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 16th International Conference, WASA 2021, Nanjing, China, June 25-27, 2021, Proceedings, Part III.",
                "count": 62,
                "papers": [
                    "Event-Based American Sign Language Recognition Using Dynamic Vision Sensor.",
                    "Multi-step Domain Adaption Image Classification Network via Attention Mechanism and Multi-level Feature Alignment.",
                    "Automated Honey Document Generation Using Genetic Algorithm.",
                    "Image Encryption for Wireless Sensor Networks with Modified Logistic Map and New Hash Algorithm.",
                    "Design and Implementation of a Real-Time Distributed Precise Point Positioning Platform.",
                    "Deployment of UAV-BS for Congestion Alleviation in Cellular Networks.",
                    "Robust Estimator for NLOS Error Mitigation in TOA-Based Localization.",
                    "Effectiveness Analysis of UAV Offensive Strategy with Unknown Adverse Trajectory.",
                    "Delivery Optimization for Unmanned Aerial Vehicles Based on Minimum Cost Maximum Flow with Limited Battery Capacity.",
                    "Optimized Segment Routing Traffic Engineering with Multiple Segments.",
                    "Robust and Efficient Mechanism Design for Heterogeneous Task Crowdsensing.",
                    "Lightweight Threshold Private Set Intersection via Oblivious Transfer.",
                    "Person Re-identification Algorithm Based on Spatial Attention Network.",
                    "OFDMA-Based Asymmetric Full-Duplex Media Access Control for the Next Generation WLANs.",
                    "Equitable Valuation of Crowdsensing for Machine Learning via Game Theory.",
                    "AERM: An Attribute-Aware Economic Robust Spectrum Auction Mechanism.",
                    "Application of Matrix-NMS in Face Detection and Autonomous Driving.",
                    "Blockchain-Based Verifiable DSSE with Forward Security in Multi-server Environments.",
                    "GGCAD: A Novel Method of Adversarial Detection by Guided Grad-CAM.",
                    "Online Task Scheduling for DNN-Based Applications over Cloud, Edge and End Devices.",
                    "An SDN-Based Self-adaptive Resource Allocation Mechanism for Service Customization.",
                    "Privacy Risk Assessment for Text Data Based on Semantic Correlation Learning.",
                    "Multi-dimensional LSTM: A Model of Network Text Classification.",
                    "Incentive Cooperation with Computation Delay Concerns for Socially-Aware Parked Vehicle Edge Computing.",
                    "Complex Task Allocation in Spatial Crowdsourcing: A Task Graph Perspective.",
                    "Jointly Optimizing Throughput and Cost of IoV Based on Coherent Beamforming and Successive Interference Cancellation Technology.",
                    "Deep Reinforcement Learning Based Dynamic Content Placement and Bandwidth Allocation in Internet of Vehicles.",
                    "A Probabilistic Resilient Routing Scheme for Low-Earth-Orbit Satellite Constellations.",
                    "An Efficient Multi-link Concurrent Transmission MAC Protocol for Long-Delay Underwater Acoustic Sensor Networks.",
                    "An Advanced Cache Retransmission Mechanism for Wireless Mesh Network.",
                    "Efficient Budget-Distance-Aware Influence Maximization in Geo-Social Network.",
                    "Deep Learning-Based Task Offloading for Vehicular Edge Computing.",
                    "Hacks Hit the Phish: Phish Attack Detection Based on Hacks Search.",
                    "The Sensor-Cloud System and Node Reliability Analysis.",
                    "Reinforcement Learning Based Seamless Handover Algorithm in SDN-Enabled WLAN.",
                    "Attack Traffic Detection Based on LetNet-5 and GRU Hierarchical Deep Neural Network.",
                    "Real-Time and Consistent Route Update Based on Segment Routing for NFV-enabled Networks.",
                    "Privacy-Preserving Auction for Heterogeneous Task Assignment in Mobile Device Clouds.",
                    "Deep Reinforcement Learning for DAG-based Concurrent Requests Scheduling in Edge Networks.",
                    "Generative Adversarial Scheme Based GNSS Spoofing Detection for Digital Twin Vehicular Networks.",
                    "Spatial Sketch Configuration for Traffic Measurement in Software Defined Networks.",
                    "Estimating Clustering Coefficient of Multiplex Graphs with Local Differential Privacy.",
                    "New Rectangle Attack Against SKINNY Block Cipher.",
                    "Optimal Convergence Nodes Deployment in Hierarchical Wireless Sensor Networks: An SMA-Based Approach.",
                    "A Virtual-Potential-Field-Based Cooperative Opportunistic Routing Protocol for UAV Swarms.",
                    "Social-Interaction GAN: Pedestrian Trajectory Prediction.",
                    "An Intelligent Wallpaper Based on Ambient Light for Human Activity Sensing.",
                    "Adaptive Data Transmission and Task Scheduling for High-Definition Map Update.",
                    "Research on Path Planning for Relay Drones with Multiple Constraints.",
                    "A Reinforcement Model Based Prioritized Replay to Solve the Offloading Problem in Edge Computing.",
                    "Authentication System Based on Fuzzy Extractors.",
                    "Performance Analysis of V2V-Based Vehicular Platoon with Modified CACC Scheme.",
                    "Leveraging Fine-Grained Self-correlation in Detecting Collided LoRa Transmissions.",
                    "Blockchain Oracle-Based Privacy Preservation and Reliable Identification for Vehicles.",
                    "Objects Perceptibility Prediction Model Based on Machine Learning for V2I Communication Load Reduction.",
                    "KESAR: A High-Accuracy Prediction Algorithm and Solar-Aware Routing Strategy for Outdoor WSN.",
                    "Blockchain Empowered Federated Learning for Medical Data Sharing Model.",
                    "A Deep Learning Based Intelligent Transceiver Structure for Multiuser MIMO.",
                    "GreenAP: An Energy-Saving Protocol for Mobile Access Points.",
                    "A Robust Algorithm for Multi-tenant Server Consolidation.",
                    "PM2.5 and PM10 Concentration Estimation Based on the Top-of-Atmosphere Reflectance.",
                    "A Secure Sensing Data Collection Mechanism Based on Perturbed Compressed Sensing."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "WASA 2020",
        "info": "Qingdao, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2020-1",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 15th International Conference, WASA 2020, Qingdao, China, September 13-15, 2020, Proceedings, Part I.",
                "count": 67,
                "papers": [
                    "Reinforcement Learning Based Group Event Invitation Algorithm.",
                    "OSCD: An Online Charging Scheduling Algorithm to Optimize Cost and Smoothness.",
                    "Maximizing the Expected Influence in Face of the Non-progressive Adversary.",
                    "A Novel Anti-attack Revenue Optimization Algorithm in the Proof-of-Work Based Blockchain.",
                    "Can the Max-Min Fair Allocation Be Trustful in a Centralized Resource System?",
                    "A Novel Blockchain Network Structure Based on Logical Nodes.",
                    "Dynamic Distribution Routing Algorithm Based on Probability for Maritime Delay Tolerant Networks.",
                    "Learning-Aided Mobile Charging for Rechargeable Sensor Networks.",
                    "A Social Relationship Enabled Cooperative Jamming Scheme for Wireless Communications.",
                    "Multi-job Associated Task Scheduling Based on Task Duplication and Insertion for Cloud Computing.",
                    "Communication-Efficient and Privacy-Preserving Protocol for Computing Over-Threshold Set-Union.",
                    "Approximation Algorithm for the Offloading Problem in Edge Computing.",
                    "Quality of Service Optimization in Mobile Edge Computing Networks via Deep Reinforcement Learning.",
                    "Camera Style Guided Feature Generation for Person Re-identification.",
                    "Sync or Fork: Node-Level Synchronization Analysis of Blockchain.",
                    "Multi-user Cooperative Computation Offloading in Mobile Edge Computing.",
                    "SDTCNs: A Symmetric Double Temporal Convolutional Network for Chinese NER.",
                    "Verifiable Encrypted Search with Forward Secure Updates for Blockchain-Based System.",
                    "Capacity Analysis of Ambient Backscatter System with Bernoulli Distributed Excitation.",
                    "Multiset Synchronization with Counting Cuckoo Filters.",
                    "Privacy-Aware Online Task Offloading for Mobile-Edge Computing.",
                    "A Class Incremental Temporal-Spatial Model Based on Wireless Sensor Networks for Activity Recognition.",
                    "Sensor Deployment for Composite Event Monitoring in Battery-Free Sensor Networks.",
                    "Optimizing Motion Estimation with an ReRAM-Based PIM Architecture.",
                    "Trajectory-Based Data Delivery Algorithm in Maritime Vessel Networks Based on Bi-LSTM.",
                    "Cold Start and Learning Resource Recommendation Mechanism Based on Opportunistic Network in the Context of Campus Collaborative Learning.",
                    "Outsourced Multi-authority ABE with White-Box Traceability for Cloud-IoT.",
                    "Deep Learning Enabled Reliable Identity Verification and Spoofing Detection.",
                    "On-Line Learning-Based Allocationof Base Stations and Channels in Cognitive Radio Networks.",
                    "A Deep Spatial-Temporal Network for Vehicle Trajectory Prediction.",
                    "Beamforming for MISO Cognitive Radio Networks Based on Successive Convex Approximation.",
                    "K-Anonymous Privacy Preserving Scheme Based on Bilinear Pairings over Medical Data.",
                    "Incentive Mechanism for Socially-Aware Mobile Crowdsensing: A Bayesian Stackelberg Game.",
                    "Adaptive Task Scheduling via End-Edge-Cloud Cooperation in Vehicular Networks.",
                    "An Improved Parallel Network Traffic Anomaly Detection Method Based on Bagging and GRU.",
                    "Joint Server Selection and SFC Routing for Anycast in NFV-enabled SDNs.",
                    "Blockchain-Based Privacy-Preserving Dynamic Spectrum Sharing.",
                    "A Survey: Applications of Blockchains in the Internet of Vehicles.",
                    "A Secure Topology Control Mechanism for SDWSNs Using Identity-Based Cryptography.",
                    "A Blockchain-Based Decentralized Public Auditing Scheme for Cloud Storage.",
                    "A New Fully Homomorphic Signatures from Standard Lattices.",
                    "An Efficient Malicious User Detection Mechanism for Crowdsensing System.",
                    "Implementation of Video Transmission over Maritime Ad Hoc Network.",
                    "A Reliable Multi-task Allocation Based on Reverse Auction for Mobile Crowdsensing.",
                    "A Blockchain Based Privacy-Preserving Cloud Service Level Agreement Auditing Scheme.",
                    "CPBA: An Efficient Conditional Privacy-Preserving Batch Authentication Scheme for VANETs.",
                    "Consensus in Wireless Blockchain System.",
                    "Blockchain-Based Service Recommendation Supporting Data Sharing.",
                    "Multi-objective Disaster Backup in Inter-datacenter Using Reinforcement Learning.",
                    "Detecting Internet-Scale NATs for IoT Devices Based on Tri-Net.",
                    "Data Integrity Checking Supporting Reliable Data Migration in Cloud Storage.",
                    "A Blockchain-Based Privacy-Preserving Mechanism for Attribute Matching in Social Networks.",
                    "A Real-Time Recommendation Algorithm for Task Allocation in Mobile Crowd Sensing.",
                    "A Dual Scale Matching Model for Long-Term Association.",
                    "A Real-Time Vehicle Logo Detection Method Based on Improved YOLOv2.",
                    "SEM: APP Usage Prediction with Session-Based Embedding.",
                    "Intelligent Dynamic Spectrum Access for Uplink Underlay Cognitive Radio Networks Based on Q-Learning.",
                    "A Trajectory-Privacy Protection Method Based on Location Similarity of Query Destinations in Continuous LBS Queries.",
                    "Reliable Potential Friends Identification Based on Trust Circuit for Social Recommendation.",
                    "GaitID: Robust Wi-Fi Based Gait Recognition.",
                    "Optimal Node Placement for Magnetic Relay and MIMO Wireless Power Transfer Network.",
                    "EdgeCC: An Authentication Framework for the Fast Migration of Edge Services Under Mobile Clients.",
                    "Attention-Based Dynamic Preference Model for Next Point-of-Interest Recommendation.",
                    "From When to Where: A Multi-task Learning Approach for Next Point-of-Interest Recommendation.",
                    "An Adversarial Learning Model for Intrusion Detection in Real Complex Network Environments.",
                    "HotDAG: Hybrid Consensus via Sharding in the Permissionless Model.",
                    "Distributed Data Aggregation in Dynamic Sensor Networks."
                ]
            },
            {
                "sub_name_abbr": "conf/wasa/2020",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 15th International Conference, WASA 2020, Qingdao, China, September 13-15, 2020, Proceedings, Part II.",
                "count": 14,
                "papers": [
                    "Cluster-Based Basic Safety Message Dissemination in VANETs.",
                    "On-Road Vehicle Detection Algorithm Based on Mathematical Morphology.",
                    "Estimation of Short-Term Online Taxi Travel Time Based on Neural Network.",
                    "Research on Algorithms for Finding Top-K Nodes in Campus Collaborative Learning Community Under Mobile Social Network.",
                    "VES: A Component Version Extracting System for Large-Scale IoT Firmwares.",
                    "Virtual Location Generation for Location Privacy Protection in VANET.",
                    "Reliable Visible Light-Based Underground Localization Utilizing a New Mechanism: Reverse Transceiver Position.",
                    "Research on 5G Internet of Vehicles Facilities Based on Coherent Beamforming.",
                    "LPE-RCM: Lightweight Privacy-Preserving Edge-Based Road Condition Monitoring for VANETs.",
                    "Joint Switch Upgrade and VNF Placement for NFV-Based SDNs.",
                    "The Throughput Optimization for Multi-hop MIMO Networks Based on Joint IA and SIC.",
                    "A Novel Solution to Quality of Service Dilemma in Crowdsourcing Systems.",
                    "C-DAG: Community-Assisted DAG Mechanism with High Throughput and Eventual Consistency.",
                    "Non-pre-trained Mine Pedestrian Detection Based on Automatic Generation of Anchor Box."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "WASA 2019",
        "info": "Honolulu, HI, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2019",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 14th International Conference, WASA 2019, Honolulu, HI, USA, June 24-26, 2019, Proceedings.",
                "count": 54,
                "papers": [
                    "Decomposable Atomic Norm Minimization Channel Estimation for Millimeter Wave MIMO-OFDM Systems.",
                    "Model Based Adaptive Data Acquisition for Internet of Things.",
                    "Hybrid Low Frequency Electromagnetic Field and Solar Energy Harvesting Architecture for Self-Powered Wireless Sensor System.",
                    "Automated and Personalized Privacy Policy Extraction Under GDPR Consideration.",
                    "Cooperative BSM Dissemination in DSRC/WAVE Based Vehicular Networks.",
                    "TIDS: Trust Intrusion Detection System Based on Double Cluster Heads for WSNs.",
                    "An Efficient Revocable Attribute-Based Signcryption Scheme with Outsourced Designcryption in Cloud Computing.",
                    "Massive MIMO Cognitive Cooperative Relaying.",
                    "Minimum Control Cost of Weighted Linear Dynamic Networks.",
                    "Privacy Protection for Context-Aware Services: A Two-Layer Three-Party Game Model.",
                    "Who Leaks My Privacy: Towards Automatic and Association Detection with GDPR Compliance.",
                    "Trustroam: A Novel Blockchain-Based Cross-Domain Authentication Scheme for Wi-Fi Access.",
                    "Joint Optimization of Routing and Storage Node Deployment in Heterogeneous Wireless Sensor Networks Towards Reliable Data Storage.",
                    "Fusing RFID and Computer Vision for Occlusion-Aware Object Identifying and Tracking.",
                    "Spatiotemporal Feature Extraction for Pedestrian Re-identification.",
                    "Detecting Android Side Channel Probing Attacks Based on System States.",
                    "Online DAG Scheduling with On-Demand Function Configuration in Edge Computing.",
                    "Magnetic Beamforming Algorithm for Hybrid Relay and MIMO Wireless Power Transfer.",
                    "Self-attention Based Collaborative Neural Network for Recommendation.",
                    "An Efficient and Recoverable Data Sharing Mechanism for Edge Storage.",
                    "Trajectory Comparison in a Vehicular Network II: Eliminating the Redundancy.",
                    "Differentially Private Event Sequences over Infinite Streams with Relaxed Privacy Guarantee.",
                    "Performance Investigation of Polar Codes over Nakagami-M Fading and Real Wireless Channel Measurements.",
                    "Optimal Transportation Network Company Vehicle Dispatching via Deep Deterministic Policy Gradient.",
                    "Fairness-Aware Auction Mechanism for Sustainable Mobile Crowdsensing.",
                    "Evolutionary Game Based Gateway Selection Algorithm in Cyber-Physical System.",
                    "Wide and Recurrent Neural Networks for Detection of False Data Injection in Smart Grids.",
                    "ONE-Geo: Client-Independent IP Geolocation Based on Owner Name Extraction.",
                    "Decentralized Hierarchical Authorized Payment with Online Wallet for Blockchain.",
                    "A Location Predictive Model Based on 2D Angle Data for HAPS Using LSTM.",
                    "Cross-Layer Optimization on Charging Strategy for Wireless Sensor Networks Based on Successive Interference Cancellation.",
                    "An Integrated UAV Platform for Real-Time and Efficient Environmental Monitoring.",
                    "CXNet-m2: A Deep Model with Visual and Clinical Contexts for Image-Based Detection of Multiple Lesions.",
                    "OWLS: Opportunistic Wireless Link Scheduling with SINR Constraints.",
                    "Distributed Real-Time Data Aggregation Scheduling in Duty-Cycled Multi-hop Sensor Networks.",
                    "Building Trustful Crowdsensing Service on the Edge.",
                    "User Identity De-anonymization Based on Attributes.",
                    "Detecting Anomalies in Communication Packet Streams Based on Generative Adversarial Networks.",
                    "Multi-hop Wireless Recharging Sensor Networks Optimization with Successive Interference Cancellation.",
                    "Deep Neural Model for Point-of-Interest Recommendation Fused with Graph Embedding Representation.",
                    "A Hybrid Approach for Recognizing Web Crawlers.",
                    "Contextual Combinatorial Cascading Thompson Sampling.",
                    "Trajectory Comparison in a Vehicular Network I: Computing a Consensus Trajectory.",
                    "Utility Aware Task Offloading for Mobile Edge Computing.",
                    "Analysis of Best Network Routing Structure for IoT.",
                    "Parallel Multicast Information Propagation Based on Social Influence.",
                    "Research on Physical Layer Security Scheme Based on OAM - Modulation for Wireless Communications.",
                    "Optimal Routing of Tight Optimal Bidirectional Double-Loop Networks.",
                    "DDSEIR: A Dynamic Rumor Spreading Model in Online Social Networks.",
                    "Data Forwarding and Caching Strategy for RSU Aided V-NDN.",
                    "Lightweight IoT Malware Visualization Analysis via Two-Bits Networks.",
                    "Privacy Protection Sensing Data Aggregation for Crowd Sensing.",
                    "A New Outsourced Data Deletion Scheme with Public Verifiability.",
                    "DPSR: A Differentially Private Social Recommender System for Mobile Users."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "WASA 2018",
        "info": "Tianjin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2018",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 13th International Conference, WASA 2018, Tianjin, China, June 20-22, 2018, Proceedings.",
                "count": 82,
                "papers": [
                    "Hypergraph Based Radio Resource Management in 5G Fog Cell.",
                    "A Novel Energy Harvesting Aware IEEE 802.11 Power Saving Mechanism.",
                    "Interest-Aware Next POI Recommendation for Mobile Social Networks.",
                    "Approximate Minimum-Transmission Broadcasting in Duty-Cycled WSNs.",
                    "Robust Network-Based Binary-to-Vector Encoding for Scalable IoT Binary File Retrieval.",
                    "OSCO: An Open Security-Enhanced Compatible OpenFlow Platform.",
                    "Hop-Constrained Relay Node Placement in Wireless Sensor Networks.",
                    "Degrading Detection Performance of Wireless IDSs Through Poisoning Feature Selection.",
                    "A Cooperative Jamming Based Secure Uplink Transmission Scheme for Heterogeneous Networks Supporting D2D Communications.",
                    "Delay-Constrained Throughput Maximization in UAV-Assisted VANETs.",
                    "Smart Device Fingerprinting Based on Webpage Loading.",
                    "Trajectory Prediction for Ocean Vessels Base on K-order Multivariate Markov Chain.",
                    "Experimental Study on Deployment of Mobile Edge Computing to Improve Wireless Video Streaming Quality.",
                    "An Efficient Privacy-Preserving Data Aggregation Scheme for IoT.",
                    "Improving Security and Stability of AODV with Fuzzy Neural Network in VANET.",
                    "Exploiting Aerial Heterogeneous Network for Implementing Wireless Flight Recorder.",
                    "TOA Estimation Algorithm Based on Noncoherent Detection in IR-UWB System.",
                    "Max-Min Fairness Scheme in Wireless Powered Communication Networks with Multi-user Cooperation.",
                    "Cancer-Drug Interaction Network Construction and Drug Target Prediction Based on Multi-source Data.",
                    "Enabling Efficient and Fine-Grained DNA Similarity Search with Access Control over Encrypted Cloud Data.",
                    "Sampling Based \\delta δ -Approximate Data Aggregation in Sensor Equipped IoT Networks.",
                    "Poisoning Machine Learning Based Wireless IDSs via Stealing Learning Model.",
                    "Signal-Selective Time Difference of Arrival Estimation Based on Generalized Cyclic Correntropy in Impulsive Noise Environments.",
                    "iKey: An Intelligent Key System Based on Efficient Inclination Angle Sensing Techniques.",
                    "Massive MIMO Power Allocation in Millimeter Wave Networks.",
                    "A Detection-Resistant Covert Timing Channel Based on Geometric Huffman Coding.",
                    "Spark: A Smart Parking Lot Monitoring System.",
                    "A Hybrid Model Based on Multi-dimensional Features for Insider Threat Detection.",
                    "Throughput Analysis for Energy Harvesting Cognitive Radio Networks with Unslotted Users.",
                    "A Crowdsourcing-Based Wi-Fi Fingerprinting Mechanism Using Un-supervised Learning.",
                    "Secure and Efficient Outsourcing of Large-Scale Matrix Inverse Computation.",
                    "Household Electrical Load Scheduling Algorithms with Renewable Energy.",
                    "An Empirical Study of OAuth-Based SSO System on Web.",
                    "Turning Legacy IR Devices into Smart IoT Devices.",
                    "Solving Data Trading Dilemma with Asymmetric Incomplete Information Using Zero-Determinant Strategy.",
                    "Data Uploading Mechanism for Internet of Things with Energy Harvesting.",
                    "Enabling ZigBee Link Performance Robust Under Cross-Technology Interference.",
                    "Quadrant-Based Weighted Centroid Algorithm for Localization in Underground Mines.",
                    "Exploration of Human Activities Using Sensing Data via Deep Embedded Determination.",
                    "Reinforcement Learning for a Novel Mobile Charging Strategy in Wireless Rechargeable Sensor Networks.",
                    "A Multi-objective Algorithm for Joint Energy Replenishment and Data Collection in Wireless Rechargeable Sensor Networks.",
                    "Privacy-Preserving Personal Sensitive Data in Crowdsourcing.",
                    "A First Step Towards Combating Fake News over Online Social Media.",
                    "Predicting Smartphone App Usage with Recurrent Neural Networks.",
                    "A Self-organizing Base Station Sleeping Strategy in Small Cell Networks Using Local Stable Matching Games.",
                    "Dealing with Dynamic-Scale of Events: Matrix Recovery Based Compressive Data Gathering for Sensor Networks.",
                    "Proactive Caching for Transmission Performance in Cooperative Cognitive Radio Networks.",
                    "N-Guide: Achieving Efficient Named Data Transmission in Smart Buildings.",
                    "Privacy-Preserving Task Assignment in Skill-Aware Spatial Crowdsourcing.",
                    "HEVC Lossless Compression Coding Based on Hadamard Butterfly Transformation.",
                    "U-MEC: Energy-Efficient Mobile Edge Computing for IoT Applications in Ultra Dense Networks.",
                    "Localization of Thyroid Nodules in Ultrasonic Images.",
                    "Cost Reduction for Micro-Grid Powered Data Center Networks with Energy Storage Devices.",
                    "An Information Classification Collection Protocol for Large-Scale RFID System.",
                    "An Efficient Energy-Aware Probabilistic Routing Approach for Mobile Opportunistic Networks.",
                    "On Association Study of Scalp EEG Data Channels Under Different Circumstances.",
                    "A Privacy-Preserving Networked Hospitality Service with the Bitcoin Blockchain.",
                    "Trust-Distrust-Aware Point-of-Interest Recommendation in Location-Based Social Network.",
                    "Retrieving the Relative Kernel Dataset from Big Sensory Data for Continuous Query.",
                    "KrackCover: A Wireless Security Framework for Covering KRACK Attacks.",
                    "Node Deployment of High Altitude Platform Based Ocean Monitoring Sensor Networks.",
                    "LAMP: Lightweight and Accurate Malicious Access Points Localization via Channel Phase Information.",
                    "NASR: NonAuditory Speech Recognition with Motion Sensors in Head-Mounted Displays.",
                    "Energy Harvesting Based Opportunistic Routing for Mobile Wireless Nanosensor Networks.",
                    "Synergistic Based Social Incentive Mechanism in Mobile Crowdsensing.",
                    "SACP: A Signcryption-Based Authentication Scheme with Conditional Privacy Preservation for VANET.",
                    "DFTinker: Detecting and Fixing Double-Fetch Bugs in an Automated Way.",
                    "A Quality-Validation Task Assignment Mechanism in Mobile Crowdsensing Systems.",
                    "A Novel Capacity-Aware SIC-Based Protocol for Wireless Networks.",
                    "A Supervised Learning Approach to Link Prediction in Dynamic Networks.",
                    "Mining Mobile Users' Interests Through Cellular Network Browsing Profiles.",
                    "A Gradient-Boosting-Regression Based Physical Health Evaluation Model for Running Monitoring by Using a Wearable Smartband System.",
                    "The Research of Spam Web Page Detection Method Based on Web Page Differentiation and Concrete Cluster Centers.",
                    "Network Control for Large-Scale Container Clusters.",
                    "Joint Optimization of Flow Entry Aggregation and Routing Selection in Software Defined Wireless Access Networks.",
                    "Loc-Knock: Remotely Locating Survivors in Mine Disasters Using Acoustic Signals.",
                    "A Recognition Approach for Groups with Interactions.",
                    "Security Enhancement of Over-the-Air Update for Connected Vehicles.",
                    "Resilient SDN-Based Communication in Vehicular Network.",
                    "Authentication Protocol Using Error Correcting Codes and Cyclic Redundancy Check.",
                    "Understanding Data Breach: A Visualization Aspect.",
                    "A Novel Recommendation-Based Trust Inference Model for MANETs."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "WASA 2017",
        "info": "Guilin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2017",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 12th International Conference, WASA 2017, Guilin, China, June 19-21, 2017, Proceedings.",
                "count": 79,
                "papers": [
                    "Simultaneous Wireless Information and Power Transfer for Multi-hop Energy-Constrained Wireless Network.",
                    "Leveraging Scheduling to Minimize the Tardiness of Video Packets Transmission in Maritime Wideband Communication.",
                    "Optimal Power Scheduling for SIC-Based Uplink Wireless Networks with Guaranteed Real-Time Performance.",
                    "A Novel Collision Analysis for Multiple-Subcarrier Frequency-Domain Contention.",
                    "Wi-Dog: Monitoring School Violence with Commodity WiFi Devices.",
                    "Energy-Efficient Contact Detection Model in Mobile Opportunistic Networks.",
                    "Modeling of Random Dense CSMA Networks.",
                    "Throughput Maximization in Multi-User Cooperative Cognitive Radio Networks.",
                    "Load-Balancing Software-Defined Networking Through Hybrid Routing.",
                    "A New Greedy Algorithm for Constructing the Minimum Size Connected Dominating Sets in Wireless Networks.",
                    "Study on the Impulse Radio mmWave for 5G-Based Vehicle Position.",
                    "Detect SIP Flooding Attacks in VoLTE by Utilizing and Compressing Counting Bloom Filter.",
                    "On Enhancing Energy Efficiency via Elastic Cell-Zooming Algorithm in Three-Tier Heterogeneous Wireless Networks.",
                    "Cooperative Downlink Resource Allocation in 5G Wireless Backhaul Network.",
                    "Spectral Partitioning and Fuzzy C-Means Based Clustering Algorithm for Wireless Sensor Networks.",
                    "Regionalization Compressive Sensing for Optimizing Lifetime of Sensor Networks.",
                    "IEA: An Intermittent Energy Aware Platform for Ultra-Low Powered Energy Harvesting WSN.",
                    "Scheduling for MU-MIMO Wireless Industrial Sensor Networks.",
                    "Provably Secure Dual-Mode Publicly Verifiable Computation Protocol in Marine Wireless Sensor Networks.",
                    "A Genetic Algorithm Based Mechanism for Scheduling Mobile Sensors in Hybrid WSNs Applications.",
                    "SSD: Signal-Based Signature Distance Estimation and Localization for Sensor Networks.",
                    "An Adaptive MAC Protocol for Wireless Rechargeable Sensor Networks.",
                    "Fair Multi-influence Maximization in Competitive Social Networks.",
                    "Communities Mining and Recommendation for Large-Scale Mobile Social Networks.",
                    "Community Verification with Topic Modeling.",
                    "M2HAV: A Standardized ICN Naming Scheme for Wireless Devices in Internet of Things.",
                    "Multidimensional Trust-Based Anomaly Detection System in Internet of Things.",
                    "Social D2D Communications Based on Fog Computing for IoT Applications.",
                    "Defense Against Advanced Persistent Threats with Expert System for Internet of Things.",
                    "QoE Enhancement of Task Scheduling Algorithm for VANET Applications.",
                    "Ratee-Based Trust Management System for Internet of Vehicles.",
                    "Achieving Secure and Seamless IP Communications for Group-Oriented Software Defined Vehicular Networks.",
                    "An Efficient Distributed Randomized Data Replication Algorithm in VANETs.",
                    "Preserving Privacy in Social Networks Against Label Pair Attacks.",
                    "Preserving Local Differential Privacy in Online Social Networks.",
                    "Pricing Privacy Leakage in Location-Based Services.",
                    "MAIS: Multiple Activity Identification System Using Channel State Information of WiFi Signals.",
                    "Differentially Private Frequent Itemset Mining from Smart Devices in Local Setting.",
                    "3P Framework: Customizable Permission Architecture for Mobile Applications.",
                    "A Bitcoin Based Incentive Mechanism for Distributed P2P Applications.",
                    "An Attribute-Based Secure and Scalable Scheme for Data Communications in Smart Grids.",
                    "Space Power Synthesis-Based Cooperative Jamming for Unknown Channel State Information.",
                    "Breakdown by Rumors: Vulnerability of D2D Communications from Online Social Networks.",
                    "Security Enhancement via Dynamic Fountain Code for Wireless Multicast.",
                    "Accurate Indoor Localization with Multiple Feature Fusion.",
                    "A Power-Efficient Scheme for Outdoor Localization.",
                    "Design and Realization of an Indoor Positioning Algorithm Based on Differential Positioning Method.",
                    "A Study on the Second Order Statistics of \\kappa κ - \\mu μ Fading Channels.",
                    "Effective Influence Maximization Based on the Combination of Multiple Selectors.",
                    "A Simpler Method to Obtain a PTAS for Connected k-Path Vertex Cover in Unit Disk Graph.",
                    "Maximum-Weighted λ-Colorable Subgraph: Revisiting and Applications.",
                    "Wireless Image Relay: Prioritized QoE Scheduling with Simplified Space-Time Coding Mode Selection.",
                    "Software Defined Routing System.",
                    "Towards Efficient Multimedia Data Disseminating in Mobile Opportunistic Networks.",
                    "Job Scheduling Under Differential Pricing: Hardness and Approximation Algorithms.",
                    "Distributing Negative Messages in VANET Based on Meet-Table and Cloud Computing.",
                    "CacheRascal: Defending the Flush-Reload Side-Channel Attack in PaaS Clouds.",
                    "Measuring the Declared SDK Versions and Their Consistency with API Calls in Android Apps.",
                    "Employing Smartwatch for Enhanced Password Authentication.",
                    "AIS: An Inaudible Guider in Your Smartphone.",
                    "A Case Study of Usable Security: Usability Testing of Android Privacy Enhancing Keyboard.",
                    "Detecting Flooding DDoS Under Flash Crowds Based on Mondrian Forest.",
                    "A 3-Layer Method for Analysis of Cooperative Behaviors of Physical Devices in Cyber-Physical Systems.",
                    "A User Incentive-Based Scheme Against Dishonest Reporting in Privacy-Preserving Mobile Crowdsensing Systems.",
                    "You Can Charge over the Road: Optimizing Charging Tour in Urban Area.",
                    "A HCI Motion Recognition System Based on Channel State Information with Fine Granularity.",
                    "Broadband Communications for High Speed Trains via NDN Wireless Mesh Network.",
                    "Phishing Website Detection Based on Effective CSS Features of Web Pages.",
                    "A Neural Network Model Based Adaptive Flight Control System.",
                    "Supporting Producer Mobility via Named Data Networking in Space-Terrestrial Integrated Networks.",
                    "Development and Performance Evaluation of Filterbank Multicarrier Systems.",
                    "A Location Prediction-based Physical Layer Security Scheme for Suspicious Eavesdroppers.",
                    "Structural Holes Theory-Based Influence Maximization in Social Network.",
                    "Layout Optimization for a Long Distance Wireless Mesh Network: An Industrial Case Study.",
                    "Mobility Intention-Based Relationship Inference from Spatiotemporal Data.",
                    "TACD: A Three-Stage Auction Scheme for Cloudlet Deployment in Wireless Access Network.",
                    "Recognition of Electro-Magnetic Information Leakage of Computer Based on Multi-image Blind Deconvolution.",
                    "A Novel On-Line Association Algorithm in Multiple-AP Wireless LAN.",
                    "Near-Field Localization Algorithm Based on Sparse Reconstruction of the Fractional Lower Order Correlation Vector."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "WASA 2016",
        "info": "Bozeman, MT, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2016",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 11th International Conference, WASA 2016, Bozeman, MT, USA, August 8-10, 2016. Proceedings.",
                "count": 50,
                "papers": [
                    "Randomized Skip Graph-Based Authentication for Large-Scale RFID Systems.",
                    "Tefnut: An Accurate Smartphone Based Rain Detection System in Vehicles.",
                    "A New Paradigm for Shortest Link Scheduling in Wireless Networks: Theory and Applications.",
                    "CO2: Design Fault-Tolerant Relay Node Deployment Strategy for Throwbox-Based DTNs.",
                    "CNFD: A Novel Scheme to Detect Colluded Non-technical Loss Fraud in Smart Grid.",
                    "SUO: Social Reciprocity Based Cooperative Mobile Data Traffic Communication.",
                    "Piggybacking Lightweight Control Messages on Physical Layer for Multicarrier Wireless LANs.",
                    "Multi-focus Image Fusion via Region Mosaicing on Contrast Pyramids.",
                    "Distributed Constrained Optimization Over Cloud-Based Multi-agent Networks.",
                    "Tensor Filter: Collaborative Path Inference from GPS Snippets of Vehicles.",
                    "NFC Secure Payment and Verification Scheme for Mobile Payment.",
                    "Multi-path Reliable Routing with Pipeline Schedule in Wireless Sensor Networks.",
                    "A QoE-Aware Adaptive Spectrum Allocation Framework for Secondary Mobile Networks.",
                    "Joint Optimization of Downlink and D2D Transmissions for SVC Streaming in Cooperative Cellular Networks.",
                    "Identifying Discrepant Tags in RFID-enabled Supply Chains.",
                    "SHMDRS: A Smartphone-Based Human Motion Detection and Response System.",
                    "iRun: A Smartphone-Based System to Alert Runners to Warm Up Before Running.",
                    "iBeaconing: A Low-Cost, Wireless Student Protection System.",
                    "The Power Control Strategy for Mine Locomotive Wireless Network Based on Successive Interference Cancellation.",
                    "ESRS: An Efficient and Secure Relay Selection Algorithm for Mobile Social Networks.",
                    "Energy Detection of Gaussian Signals Subject to Impulsive Noise in Generalized Fading Channels.",
                    "Distance Bounding Protocol for RFID Systems.",
                    "Private Weighted Histogram Aggregation in Crowdsourcing.",
                    "Minimum Cost Spatial-Temporal Task Allocation in Mobile Crowdsensing.",
                    "Mining Myself in the Community: Privacy Preserved Crowd Sensing and Computing.",
                    "Exploiting Spectrum Availability and Quality in Routing for Multi-hop Cognitive Radio Networks.",
                    "Performance Analysis for High Dimensional Non-parametric Estimation in Complicated Indoor Localization.",
                    "Minimum-Delay Data Aggregation Schedule in Duty-Cycled Sensor Networks.",
                    "Optimal Jamming Attack Schedule Against Wireless State Estimation in Cyber-Physical Systems.",
                    "An Enhanced Structure-Based De-anonymization of Online Social Networks.",
                    "Self-learning Based Motion Recognition Using Sensors Embedded in a Smartphone for Mobile Healthcare.",
                    "CrowdBlueNet: Maximizing Crowd Data Collection Using Bluetooth Ad Hoc Networks.",
                    "An Energy Efficient Multi-hop Routing Protocol for Terahertz Wireless Nanosensor Networks.",
                    "Stackelberg Game Based Incentive Mechanism for Data Transmission in Mobile Opportunistic Networks.",
                    "Extensive Form Game Analysis Based on Context Privacy Preservation for Smart Phone Applications.",
                    "A Novel Delay Analysis for Polling Schemes with Power Management Under Heterogeneous Environments.",
                    "Temporal-Spatial Aggregated Urban Air Quality Inference with Heterogeneous Big Data.",
                    "Towards Scheduling to Minimize the Total Penalties of Tardiness of Delivered Data in Maritime CPSs (Invited Paper).",
                    "Spectrum-Aware Clustering with Proactive Handoff for Distributed Cognitive Radio Ad Hoc Networks.",
                    "A Social Relation Aware Hybrid Service Discovery Mechanism for Intermittently Connected Wireless Network.",
                    "The Improved Algorithm Based on DFS and BFS for Indoor Trajectory Reconstruction.",
                    "Feedback Reduction for Multiuser MIMO Broadcast Channel with Zero-Forcing Beamforming.",
                    "MPBSD: A Moving Target Defense Approach for Base Station Security in Wireless Sensor Networks.",
                    "Toward Exposing Timing-Based Probing Attacks in Web Applications.",
                    "Collaborative Outsourced Data Integrity Checking in Multi-Cloud Environment.",
                    "An Adaptive Beaconing Scheme Based on Traffic Environment Parameters Prediction in VANETs.",
                    "OSim: An OLAP-Based Similarity Search Service Solver for Dynamic Information Networks.",
                    "Planning Roadside Units for Information Dissemination in Urban VANET.",
                    "Channel Assignment with User Coverage Priority and Interference Optimization for Multicast Routing in Wireless Mesh Networks.",
                    "Performance Evaluation of Vehicular Ad Hoc Networks for Rapid Response Traffic Information Delivery."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "WASA 2015",
        "info": "Qufu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2015",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 10th International Conference, WASA 2015, Qufu, China, August 10-12, 2015, Proceedings.",
                "count": 83,
                "papers": [
                    "Privacy-Preserving Public Auditing Together with Efficient User Revocation in the Mobile Environments.",
                    "Multi-proxy Multi-signature Binding Positioning Protocol.",
                    "Efficient Network Structure of 5G Mobile Communications.",
                    "Optimal Channel Assignment Schemes in Underlay CRNs with Multi-PU and Multi-SU Transmission Pairs.",
                    "A Group Bandwidth Reservation Scheme for the Control Channel in IEEE 802.11p/1609 Networks.",
                    "k-Perimeter Coverage Evaluation and Deployment in Wireless Sensor Networks.",
                    "Modeling Flu Trends with Real-Time Geo-tagged Twitter Data Streams.",
                    "Radio Signal Based Device-Free Velocity Recognition.",
                    "Minimum-Cost Information Dissemination in Social Networks.",
                    "Finding Overlapping Communities with Random Walks on Line Graph and Attraction Intensity.",
                    "Computing an Optimal Path with the Minimum Number of Distinct Sensors.",
                    "ULRAS: Ultra-Lightweight RFID Authentication Scheme for Mobile Device.",
                    "Soft Reservation Based Prioritized Access: Towards Performance Enhancement for VoIP over WLANs.",
                    "Impact of a Deterministic Delay in the DCA Protocol.",
                    "EBRS: Event Based Reputation System for Defensing Multi-source Sybil Attacks in VANET.",
                    "iSound: A Smartphone Based Intelligent Sound Fusion System for the Hearing Impaired.",
                    "Estimation Based Adaptive ACB Scheme for M2M Communications.",
                    "Optimal Power Allocations for Two-Users Spectrum Sharing Cognitive Radio with Interference Limit.",
                    "Adaptive Resource Allocation for Anti-money Laundering Based on SMDP.",
                    "Infrastructure Deployment and Optimization for Cloud-Radio Access Networks.",
                    "A Cluster Head Rotation Cooperative MIMO Scheme for Wireless Sensor Networks.",
                    "A Distributed Game-Theoretic Power Control Mechanism for Device-to-Device Communications Underlaying Cellular Network.",
                    "A Low Overhead and Stable Clustering Scheme for Crossroads in VANETs.",
                    "Online Channel Assignment, Transmission Scheduling, and Transmission Mode Selection in Multi-channel Full-Duplex Wireless LANs.",
                    "Optimal Preference Detection Based on Golden Section and Genetic Algorithm for Affinity Propagation Clustering.",
                    "DRL: A New Mobility Model in Mobile Social Networks.",
                    "SGSA: Secure Group Setup and Anonymous Authentication in Platoon-Based Vehicular Cyber-Physical Systems.",
                    "A Bidder-Oriented Privacy-Preserving VCG Auction Scheme.",
                    "A Secure Multi-unit Sealed First-Price Auction Mechanism.",
                    "Flow-Level Performance of Device-to-Device Overlaid OFDM Cellular Networks.",
                    "Bernoulli Sampling Based (epsilon, delta)-Approximate Frequency Query in Mobile Ad Hoc Networks.",
                    "Secure and Verifiable Multi-owner Ranked-Keyword Search in Cloud Computing.",
                    "A Dynamic Differentiated QoS Based Call Admission Control Service Model for Core Node in Wireless Sensor Network Topology Control.",
                    "Secure and Privacy-Preserving Location Proof in Database-Driven Cognitive Radio Networks.",
                    "SDP: Separate Design Principle for Multichannel Scheduling in Priority-Aware Packet Collection.",
                    "On Computing Multi-Agent Itinerary Planning in Distributed Wireless Sensor Networks.",
                    "FFDP: A Full-Load File Delivery Protocol in Satellite Network Communication.",
                    "Energy-Aware Clustering and Routing Scheme in Wireless Sensor Network.",
                    "Serial Number Based Encryption and Its Application for Mobile Networks.",
                    "Fine-Grained Searchable Encryption over Encrypted Data in Multi-clouds.",
                    "Big-Little-Cell Based \"Handprint\" Positioning System.",
                    "Spectrum Sublet Game Among Secondary Users in Cognitive Radio Networks.",
                    "Delivering Content with Defined Priorities by Selective Agent and Relay Nodes in Content Centric Mobile Social Networks.",
                    "Rogue Access Point Detection in Vehicular Environments.",
                    "Information-Centric Resource Management for Air Pollution Monitoring with Multihop Cellular Network Architecture.",
                    "A Novel Location Privacy Mining Threat in Vehicular Internet Access Service.",
                    "iProtect: Detecting Physical Assault Using Smartphone.",
                    "Enhancing Wireless Security Against Reactive Jamming Attacks: A Game-Theoretical Framework.",
                    "A Quasi-Dynamic Inter-Satellite Link Reassignment Method for LEO Satellite Networks.",
                    "Domatic Partition in Homogeneous Wireless Sensor Networks.",
                    "High Performance DDDT-CWT Based Compressed Sensing Recovery of Images via Structured Sparsity.",
                    "Influential Spatial Facility Prediction over Dynamic Objects.",
                    "A Heuristic Stream Order Scheduling Algorithm for Intra-Superframe Power Management in WPANs.",
                    "Minimum-Latency Broadcast and Data Aggregation Scheduling in Secure Wireless Sensor Networks.",
                    "Data-Driven Privacy Analytics: A WeChat Case Study in Location-Based Social Networks.",
                    "A Double Pulse Control Strategy for Misinformation Propagation in Human Mobile Opportunistic Networks.",
                    "Efficient Line K-Coverage Algorithms in Mobile Sensor Network.",
                    "A Trust Evolution Mechanism for Mobile Social Networks Based on Wright-Fisher.",
                    "A Localized Channel Allocation Approach for Realtime Reliable and High Throughput Communication in Multi-channel Networks.",
                    "An Efficient and Secure Delegated Multi-authentication Protocol for Mobile Data Owners in Cloud.",
                    "Cooperative Spectrum and Infrastructure Leasing on TV Bands.",
                    "Information Security Enhancement with Actual Access Statuses of Users in the Multi-User System.",
                    "Joint Secure Beamforming and User Selection for Multi-user MISO Systems with Confidential Messages.",
                    "Network Reachability Analysis on Temporally Varying Interaction Networks.",
                    "Performance of Target Tracking in Radar Network System Under Deception Attack.",
                    "Resource Allocation in Cooperative Cognitive Maritime Wireless Mesh/Ad Hoc Networks: An Game Theory View.",
                    "Security and Privacy Issues of Fog Computing: A Survey.",
                    "Mobile Data Gathering with Time-Constraints in Wireless Sensor Networks.",
                    "A Poisson Distribution Based Topology Control Algorithm for Wireless Sensor Networks Under SINR Model.",
                    "PPSSER: Privacy-Preserving Based Scheduling Scheme for Emergency Response in Medical Social Networks.",
                    "Secrecy-Oriented Adaptive Clustering Scheme in Device-to-Device Communications.",
                    "Cooperative Beamforming and Artificial Noise Design for Secure Multi-pair Communications in Wireless Two-Way Relay Networks.",
                    "On the Stable Throughput in Wireless LANs.",
                    "Antenna Selection in Large-Scale Multiple Antenna Systems.",
                    "Energy-Balanced Backpressure Routing for Stochastic Energy Harvesting WSNs.",
                    "Motion Recognition by Using a Stacked Autoencoder-Based Deep Learning Algorithm with Smart Phones.",
                    "SDN-Based Routing for Efficient Message Propagation in VANET.",
                    "Critical Point Aware Data Acquisition Algorithm in Sensor Networks.",
                    "Constructing Virtual Backbone with Bounded Diameters in Cognitive Radio Networks.",
                    "A Simplified Attack-Defense Game Model for NSSA.",
                    "Hadoop-Based Analysis for Large-Scale Click-Through Patterns in 4G Network.",
                    "Detecting Targets Based on a Realistic Detection and Decision Model in Wireless Sensor Networks.",
                    "Ant Colony-Based Energy Control Routing Protocol for Mobile Ad Hoc Networks."
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "WASA 2014",
        "info": "Harbin, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2014",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 9th International Conference, WASA 2014, Harbin, China, June 23-25, 2014. Proceedings.",
                "count": 71,
                "papers": [
                    "Inter-service Time Guaranteed Scheduling in Wireless Networks.",
                    "Wear-Leveling Optimization of Android YAFFS2 File System for NAND Based Embedded Devices.",
                    "Web Map Service Log Analysis.",
                    "NC-STP: A High Performance Network Coding Based Space Transport Protocol.",
                    "Implementing the Matrix Inversion by Gauss-Jordan Method with CUDA.",
                    "Operator Scale Out Using Time Utility Function in Big Data Stream Processing.",
                    "A New Channel Allocation Scheme for Vehicle Communication Networks.",
                    "Throughput Prediction-Based Rate Adaptation for Real-Time Video Streaming over UAVs Networks.",
                    "Table-Driven Bus-Based Routing Protocol for Urban Vehicular Ad Hoc Networks.",
                    "Vehicular Ad Hoc Networks: Architectures, Research Issues, Challenges and Trends.",
                    "Empirical Study on Spatial and Temporal Features for Vehicular Wireless Communications.",
                    "Schedule Algorithms for File Transmission in Vehicular Ad Hoc Networks.",
                    "Joint Neighbor Discovery and Contention Relationship Inference in Wireless Networks.",
                    "An Improved Approximation Algorithm for the Shortest Link Scheduling Problem in Wireless Networks under SINR and Hypergraph Models.",
                    "MIMO-Aware Spectrum Access and Scheduling in Multi-hop Multi-channel Wireless Networks.",
                    "Minimized Gateway Placement in Hybrid Wireless Network.",
                    "Design and Analysis of a Downlink Multi-User MIMO MAC Protocol in WLANs.",
                    "RLNC in Practical Wireless Networks.",
                    "Accuracy Evaluation for Sensed Data.",
                    "Maximizing Probability of Data Packet Delivery within Deadline.",
                    "Model-Based Approximate Event Detection in Heterogeneous Wireless Sensor Networks.",
                    "Structural Health Monitoring Based on RealAdaBoost Algorithm in Wireless Sensor Networks.",
                    "Probabilistic Threshold Based Monitoring Using Sensor Networks.",
                    "Topology-Transparent STDMA Protocol with MIMO Link for Multicast and Unicast in Ad Hoc Networks.",
                    "Secure Device-to-Device Authentication in Mobile Multi-hop Networks.",
                    "A New Representation of Photoplethysmography Signal.",
                    "Energy Efficient Social-Based Routing for Delay Tolerant Networks.",
                    "Contract Theory for Incentive Mechanism Design in Cooperative Relaying Networks.",
                    "Object-Oriented Big Data Security Analytics: A Case Study on Home Network Traffic.",
                    "SPS: A Novel Semantics-Aware Scheme for Location Privacy in People-Centric Sensing Network.",
                    "A Novel Resource-Efficient Privacy Amplification Scheme: Towards Ground-Satellite Quantum Key Distribution Post-processing.",
                    "Protecting Location Privacy Based on Historical Users over Road Networks.",
                    "Towards More Secure Cardholder Verification in Payment Systems.",
                    "Fortifying Barrier-Coverage of Wireless Sensor Network with Mobile Sensor Nodes.",
                    "2-m-Domatic Partition in Homogeneous Wireless Sensor Networks.",
                    "Barrier Coverage Using Sensors with Offsets.",
                    "A Distance Ratio-Based Algorithm for Indoor Localization in Wireless Sensor Networks.",
                    "On Effectiveness of Clustering Principles in Maximizing Wireless Sensor Network Lifespan.",
                    "Predictive Nearest Neighbor Queries over Uncertain Spatial-Temporal Data.",
                    "The Tempo-spatial Properties of Information Dissemination to Time-Varying Destination Areas in Mobile Opportunistic Networks.",
                    "Beamforming Design for Cognitive Bidirectional Relay Networks with Imperfect CSI.",
                    "A Comparative Study on Full- and Half-Duplex Relaying Protocols with Practical Channel Estimates.",
                    "Identifying Missing and Spurious Interactions in Directed Networks.",
                    "Online Auction Based Relay Selection for Cooperative Communications in CR Networks.",
                    "Channel Selection for Rendezvous with High Link Stability in Cognitive Radio Network.",
                    "Game Theoretic Joint Beamforming and Power Allocation for Cognitive MIMO Systems with Imperfect Channel State Information.",
                    "Channel Allocation in Sociability-Assisted Cognitive Radio Networks Using Semi-definite Programming.",
                    "Game-Theoretic Joint Power Allocation and Feedback Rate Control for Cognitive MIMO Systems with Limited Feedback.",
                    "A Multi-model Based Range Query Processing Algorithm for the WSN.",
                    "Secure Authentication Scheme Using Dual Channels in Rogue Access Point Environments.",
                    "Approximate Self-Adaptive Data Collection in Wireless Sensor Networks.",
                    "R-Focus: A Rotating Platform for Human Detection and Verification Using Electronic and Visual Sensors.",
                    "QS-PS: A New Approach for Emergency Packet Delivery in WBAN.",
                    "Resource Allocation for Uplink-Downlink Cellular Network with Small Cells and Relays Enhanced.",
                    "A Priority-Based Access Control Model for Device-to-Device Communications Underlaying Cellular Network Using Network Calculus.",
                    "A Privacy Threat in 4th Generation Mobile Telephony and Its Countermeasure.",
                    "Enabling Smartphone Based HD Video Chats by Cooperative Transmissions in CRNs.",
                    "A Transparent Correlation-Based Scheme for Energy Efficient Context Sensing and Fusion under Android Systems.",
                    "Exploiting and Defending Trust Models in Cooperative Spectrum Sensing.",
                    "Towards Reliable and Real-Time Routing with Active Slot Augmentation in Low-Duty-Cycle WSNs.",
                    "IDUC: An Improved Distributed Unequal Clustering Protocol for Wireless Sensor Networks.",
                    "OFDP: A Distributed Algorithm for Finding Disjoint Paths with Minimum Total Energy Cost in Wireless Sensor Networks.",
                    "Information Theory Based Opportunistic Sensing in Radar Sensor Networks.",
                    "Isolate Safe Area Detection for Rescue in Wireless Sensor Networks.",
                    "Multi-Hierarchies: Accurately Computing Realtime Statistical Measures on Data Streams.",
                    "Iceberg Cube Query on Heterogeneous Information Networks.",
                    "An Energy Optimization Algorithm of Date Centers Base on Price Volatility.",
                    "Keyword Search on Graphs Based on Content and Structure.",
                    "Max-Weight Algorithm for Mobile Data Offloading through Wi-Fi Networks.",
                    "Capture Missing Values Based on Crowdsourcing.",
                    "Sectional and Conditional Functional Dependencies."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "WASA 2013",
        "info": "Zhangjiajie, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2013",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 8th International Conference, WASA 2013, Zhangjiajie, China, August 7-10, 2013. Proceedings.",
                "count": 43,
                "papers": [
                    "Improving Particle Filter with Better Proposal Distribution for Nonlinear Filtering Problems.",
                    "Performance Evaluation with Control Channel on the Coexistence Scenario of TD-LTE and LTE-FDD.",
                    "Buffer Occupation in Wireless Social Networks.",
                    "Efficient Identity-Based Encryption without Pairings and Key Escrow for Mobile Devices.",
                    "A Network Forensics System for Information Leak Events.",
                    "Maximum Independent Set of Links with a Monotone and Sublinear Power Assignment.",
                    "An Auction Mechanism for Resource Allocation in Mobile Cloud Computing Systems.",
                    "A Novel Delay-Resilient Remote Memory Attestation for Smart Grid.",
                    "A Source-Relay Selection Scheme with Power Allocation for Asymmetric Two-Way Relaying Networks in Underground Mines.",
                    "Performance Analysis of Broadcast in Multi-channel Multi-radio Wireless Mesh Networks.",
                    "SAFE: A Strategy-Proof Auction Mechanism for Multi-radio, Multi-channel Spectrum Allocation.",
                    "A Context-Aware MAC Protocol for VANETs.",
                    "A Balance Storage Nodes Assignment for Wireless Sensor Networks.",
                    "A Trustworthiness Evaluation Method for Wireless Sensor Nodes Based on D-S Evidence Theory.",
                    "UCOR: An Unequally Clustering-Based Hierarchical Opportunistic Routing Protocol for WSNs.",
                    "A Quadri-Stage Contention MAC Protocol with Opportunistic Network Coding Support for Underwater Acoustic Networks.",
                    "Fast Encryption of JPEG 2000 Images in Wireless Multimedia Sensor Networks.",
                    "Evaluating Selective ARQ and Slotted Handshake Based Access in Real World Underwater Networks.",
                    "ActiviTune: A Multi-stage System for Activity Recognition of Passive Entities from Ambient FM-Radio Signals.",
                    "From Decision Fusion to Localization in Radar Sensor Networks: A Game Theoretical View.",
                    "Characterizing the Impact of Non-uniform Deployment of APs on Network Performance under Partially Overlapped Channels.",
                    "Patient's Motion Recognition Based on SOM-Decision Tree.",
                    "Range-Free Mobile Node Localization Using Static Anchor.",
                    "Neighbor Discovery Algorithm Based on the Regulation of Duty-Cycle in Mobile Sensor Network.",
                    "Diversity between Human Behaviors and Metadata Analysis: A Measurement of Mobile App Recommendation.",
                    "An Urban Area-Oriented Traffic Information Query Strategy in VANETs.",
                    "Navigation for Indoor Mobile Robot Based on Wireless Sensor Network.",
                    "iMac: Strategy-Proof Incentive Mechanism for Mobile Crowdsourcing.",
                    "Social Welfare Maximization in Participatory Smartphone Sensing.",
                    "An Optimal Solution for Round Rotation Time Setting in LEACH.",
                    "UPC-MAC: A Power Control MAC Protocol for Underwater Sensor Networks.",
                    "FMAC for Coexisting Ad Hoc Cognitive Radio Networks.",
                    "Effective RSS Sampling for Forensic Wireless Localization.",
                    "An Optimal Leakage Detection Strategy for Underground Pipelines Using Magnetic Induction-Based Sensor Networks.",
                    "Compressive Data Retrieval with Tunable Accuracy in Vehicular Sensor Networks.",
                    "Enforcing Spectrum Access Rules in Cognitive Radio Networks through Cooperative Jamming.",
                    "Photo Forensics on Shanzhai Mobile Phone.",
                    "Local Information Storage Protocol for Urban Vehicular Networks.",
                    "Maximum Independent Set of Links with Power Control.",
                    "Sweep-Coverage with Energy-Restricted Mobile Wireless Sensor Nodes.",
                    "The Trading between Virtual Mobile Operator and Wireless Service Provider in the Two-Tier Femtocell Network.",
                    "Truthful Online Reverse Auction with Flexible Preemption for Access Permission Transaction in Macro-Femtocell Networks.",
                    "Social Communications Assisted Epidemic Disease Influence Minimization."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "WASA 2012",
        "info": "Yellow Mountains, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2012",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 7th International Conference, WASA 2012, Yellow Mountains, China, August 8-10, 2012. Proceedings.",
                "count": 65,
                "papers": [
                    "Throughput and Delay with Network Coding in Hybrid Mobile Ad Hoc Networks: A Global Perspective.",
                    "HERO - A Home Based Routing in Pocket Switched Networks.",
                    "Routing for Information Leakage Reduction in Multi-channel Multi-hop Ad-Hoc Social Networks.",
                    "AMPLE: A Novel Incentive Approach to Adaptive-Width Channel Allocation in Multi-hop, Non-cooperative Wireless Networks.",
                    "Characterizing Home Network Traffic: An Inside View.",
                    "SHIELD: A Strategy-Proof and Highly Efficient Channel Auction Mechanism for Multi-radio Wireless Networks.",
                    "A Nonparametric Bayesian Approach for Opportunistic Data Transfer in Cellular Networks.",
                    "Online Protocol Verification in Wireless Sensor Networks via Non-intrusive Behavior Profiling.",
                    "SPSA Based Packet Size Optimization Algorithm in Wireless Sensor Networks.",
                    "Lower Bounds on Data Collection Time in Sensor Networks.",
                    "Minimum Total Communication Power Connected Dominating Set in Wireless Networks.",
                    "Supporting Multi-level Quality of Services in Data Broadcast Systems.",
                    "Maximizing Network Topology Lifetime Using Mobile Node Rotation.",
                    "Joint Beamforming and Power Allocation Algorithm for Cognitive MIMO Systems via Game Theory.",
                    "Bit Allocation Scheme with Primary Base Station Cooperation in Cognitive Radio Network.",
                    "Optimal Spectrum Sharing for Contention-Based Cognitive Radio Wireless Networks.",
                    "Fast Group Communication Scheduling in Duty-Cycled Multihop Wireless Sensor Networks.",
                    "Reliable Cooperative Sensing in Cognitive Networks - (Invited Paper).",
                    "Heterogeneous Multicast Networks with Wireless Helping Networks.",
                    "Enclave: Promoting Unobtrusive and Secure Mobile Communications with a Ubiquitous Electronic World.",
                    "Truthful Multi-unit Double Auction for Spectrum Allocation in Wireless Communications.",
                    "Joint Mobility and Heterogeneity for Connected k-Coverage in Sparsely Deployed Wireless Sensor Nets.",
                    "LB-MAC: A Lifetime-Balanced MAC Protocol for Sensor Networks.",
                    "Enhancing Performance and Reliability of RFID Middleware Using Mobile Agents.",
                    "An Improved Stochastic Decoding Algorithm of LTE Turbo Codes.",
                    "Robust Distributed Estimators for Wireless Sensor Networks with One-Bit Quantized Data.",
                    "Robust Energy-Efficient Power Loading for MIMO System under Imperfect CSI.",
                    "Opportunistic Channel-Hopping Based Effective Rendezvous Establishment in Cognitive Radio Networks.",
                    "The Modeling and Analysis of Context and Cardinality Constraints Role-Based Authorization Mechanism.",
                    "A Multiple Access Game Based MAC Protocol for Fairness Provisioning and Throughput Enhancement.",
                    "Forced Spectrum Access Termination Probability Analysis under Restricted Channel Handoff.",
                    "Energy-Efficient Robust Coverage under Uncertainty in Wireless Sensor Networks.",
                    "Optimizing Cauchy Reed-Solomon Codes for P2P Storage Cloud.",
                    "Aerial Localization with Smartphone.",
                    "A Framework of Fire Monitoring System Based on Sensor Networks.",
                    "Synchronized Flow-Based Evacuation Route Planning.",
                    "Group Multicast Capacity in Large Scale Wireless Networks.",
                    "Efficient Information Exchange in Single-Hop Multi-Channel Radio Networks.",
                    "A Cache Based Multi-join Query Method with Two-Phase Processing in MANET.",
                    "Security Analysis of Opportunistic Networks Using Complex Network Properties.",
                    "Joint Optimization of Interface Assignment and Channel Allocation in Cognitive Radio Mesh Networks.",
                    "MPSL: A Mobile Phone-Based Physical-Social Location Verification System.",
                    "Location Proof via Passive RFID Tags.",
                    "A New Complementary Code Set with Zero Correlation Window.",
                    "Real-Time Data Aggregation for Contention-Based Sensor Networks in Cyber-Physical Systems.",
                    "On the Performance of TDD and LDD Based Clone Attack Detection in Mobile Ad Hoc Networks.",
                    "Active User Authentication for Mobile Devices.",
                    "Adaptive Power Controlled Routing for Underwater Sensor Networks.",
                    "Aqua-OS: An Operating System for Underwater Acoustic Networks.",
                    "Spectrum Efficiency of Nested Sparse Sampling.",
                    "HMPR: Forwarding Based on History Meeting Prediction Routing in Opportunistic Networks.",
                    "Bloom Filter-Based Ad Hoc Multicast Communication in Cyber-Physical Systems and Computational Materials.",
                    "On Wireless Network Infrastructure Optimization for Cyber-Physical Systems in Future Smart Buildings.",
                    "Building a Microscope for the Data Center.",
                    "Probabilistic Bandwidth Assignment in Wireless Sensor Networks.",
                    "Secondary User Monitoring in Unslotted Cognitive Radio Networks with Unknown Models.",
                    "Design and Spectrum Efficiency of a New Waveform.",
                    "Exploiting Spectrum Spatial Reusability for Routing in Multi-hop Wireless Networks.",
                    "Human Tracking for Daily Life Surveillance Based on a Wireless Sensor Network.",
                    "The Node Movement Models Based on Lagrange Motion for 3-D Underwater Acoustic Sensor Network.",
                    "Performance Analysis of Aloha for String Multi-hop Underwater Acoustic Sensor Networks.",
                    "Two Connected Dominating Set Algorithms for Wireless Sensor Networks.",
                    "A Cross-Layer Approach for Congestion Control in Real-Time Transmission in Wireless Sensor Networks.",
                    "A Theoretical Study on the Orientation Problem in Linear Wireless Sensor Networks.",
                    "Leveraging Cloud Computing for Privacy Preserving Aggregation in Multi-domain Wireless Networks."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "WASA 2011",
        "info": "Chengdu, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2011",
                "sub_name": "Wireless Algorithms, Systems, and Applications - 6th International Conference, WASA 2011, Chengdu, China, August 11-13, 2011. Proceedings.",
                "count": 39,
                "papers": [
                    "Experimental Analysis of Link Estimation Methods in Low Power Wireless Networks.",
                    "Distributed Receiver/Receiver Synchronization in Wireless Sensor Networks: New Solution and Joint Offset/Skew Estimators for Gaussian Delays.",
                    "Minimum-Cost Linear Coverage by Sensors with Adjustable Ranges.",
                    "Two Sides Approximation Algorithms for Channel Assignments in Wireless Network.",
                    "Efficient Maximum Weighted Sum-Rate Computation for Multiple Input Single Output Broadcast Channels.",
                    "On Topology of Sensor Networks Deployed for Tracking.",
                    "Multicast Capacity-Delay Tradeoff with Network Coding in MANETs.",
                    "Maximizing Capacity with Power Control under Physical Interference Model in Simplex Mode.",
                    "A Genetic Algorithm for Constructing a Reliable MCDS in Probabilistic Wireless Networks.",
                    "Wireless Coverage via Dynamic Programming.",
                    "Energy Efficient Data Aggregation in Solar Sensor Networks.",
                    "Improving Performance of Multi-Radio Frequency-Hopping Wireless Mesh Networks.",
                    "Minimum Delay Routing in Multihop Wireless Networks.",
                    "The Design of a Wireless Sensor Network for Seismic-Observation-Environment Surveillance.",
                    "Modelling and Performance Analysis of Queueing Systems for Self-similar Services in Wireless Cooperative Multi-relay Networks.",
                    "An Entropy Based Approach for Sense-through Foliage Target Detection Using UWB Radar.",
                    "Maelstrom: Receiver-Location Preserving in Wireless Sensor Networks.",
                    "Hybrid Random Network Coding.",
                    "Improved and Extended Sum-Capacity Computation for the Gaussian Vector Broadcast Channel via Dual Decomposition.",
                    "A Maximal Independent Set Based Giant Component Formation in Random Unit-Disk Graphs.",
                    "Enhancing Macrocell Downlink Performance through Femtocell User Cooperation.",
                    "A Survey of Routing Protocols and Simulations in Delay-Tolerant Networks.",
                    "Reputation Modeling for Wireless Sensor Networks.",
                    "A Novel Channel Assignment Scheme for Multi-radio Multi-channel Wireless Mesh Networks.",
                    "Load Balancing Access Point Association Schemes for IEEE 802.11 Wireless Networks.",
                    "Jamming-Resistant Communication in Multi-Channel Multi-hop Multi-path Wireless Networks.",
                    "Approaching Efficient Flooding Protocol Design in Low-Duty-Cycle Wireless Sensor Networks.",
                    "Golay Code Clustering for Mobility Behavior Similarity Classification in Pocket Switched Networks.",
                    "Optimal Precoding for Bi-directional MIMO Transmission with Network Coding.",
                    "An Enhanced Algorithm for the Transmission Mode Switching in TD-LTE Downlink Systems.",
                    "IRW: Low-Cost Localization with Error Control in Fading Environments.",
                    "Dual-Decomposition Approach for Distributed Optimization in Wireless Sensor Networks.",
                    "uSD Card: A Plug&Play Solution for Mobile Device to Access Wireless Sensor Networks.",
                    "Systematic Construction and Verification Methodology for LDPC Codes.",
                    "Benefit from Rateless Characteristic.",
                    "Design and Implement of the Intelligent Network Caring System.",
                    "A Zone-Diffusion Based Routing Protocol for LEO Satellite Networks.",
                    "A Study on Spatial-temporal Dynamics Properties of Indoor Wireless Channels.",
                    "Joint Subcarrier and Power Allocation for Multiuser OFDM Systems Using Distributed Auction Game."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "WASA 2010",
        "info": "Beijing, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2010",
                "sub_name": "Wireless Algorithms, Systems, and Applications, 5th International Conference, WASA 2010, Beijing, China, August 15-17, 2010. Proceedings.",
                "count": 47,
                "papers": [
                    "Arbitrary Obstacles Constrained Full Coverage in Wireless Sensor Networks.",
                    "Heuristic Algorithms for Constructing Connected Dominating Sets with Minimum Size and Bounded Diameter in Wireless Networks.",
                    "Energy-Efficient Algorithm for the Target Q-coverage Problem in Wireless Sensor Networks.",
                    "Approaching the Optimal Schedule for Data Aggregation in Wireless Sensor Networks.",
                    "Approximate Optimization for Proportional Fair AP Association in Multi-rate WLANs.",
                    "Minimum CDS in Multihop Wireless Networks with Disparate Communication Ranges.",
                    "Minimum Edge Interference in Wireless Sensor Networks.",
                    "Maximum Weighted Independent Set of Links under Physical Interference Model.",
                    "A QoS-Guaranteed Energy-Efficient Packet Scheduling Algorithm for WiMax Mobile Devices.",
                    "Minimum Energy Cost k-barrier Coverage in Wireless Sensor Networks.",
                    "On the Performance of Distributed N-Cooperation Power Allocation via Differential Game in Cognitive Radio System.",
                    "Energy-Efficient Restricted Greedy Routing for Three Dimensional Random Wireless Networks.",
                    "Adaptive Energy and Location Aware Routing in Wireless Sensor Network.",
                    "Utilizing Temporal Highway for Data Collection in Asynchronous Duty-Cycling Sensor Networks.",
                    "The Impact of Reader to Tag Collision on RFID Tag Identification.",
                    "A Desynchronization Tolerant RFID Private Authentication Protocol.",
                    "Study of Joint Routing and Wireless Charging Strategies in Sensor Networks.",
                    "Page Size Optimization for Code Dissemination in Wireless Sensor Networks.",
                    "Dynamic Routing Algorithm for Priority Guarantee in Low Duty-Cycled Wireless Sensor Networks.",
                    "Heterogeneity of Device Contact Process in Pocket Switched Networks.",
                    "Delay Minimization of Tree-Based Neighbor Discovery in Mobile Robot Networks.",
                    "Two-Stage Target Locating Algorithm in Three Dimensional WSNs under Typical Deployment Schemes.",
                    "Interference Analysis for FH-Based Multi-radio Wireless Mesh Networks.",
                    "Interference-Aware Gossiping Scheduling in Uncoordinated Duty-Cycled Multi-hop Wireless Networks.",
                    "A Game Theoretic Approach to Multi-radio Multi-channel Assignment in Wireless Networks.",
                    "PAPR Analysis for SOFDM and NC-SOFDM Systems in Cognitive Radio.",
                    "Application of Compressed Sensing for Secure Image Coding.",
                    "Efficient Wireless Broadcasting Using Onion Decoding.",
                    "A Spectrally Efficient Anti-Jamming Technique Based on Message Driven Frequency Hopping.",
                    "Secure RFID Application Data Management Using All-Or-Nothing Transform Encryption.",
                    "Prevention of Wormhole Attacks in Mobile Ad Hoc Networks by Intrusion Detection Nodes.",
                    "A Publicly Verifiable Encryption Scheme with Short Public/Private Keys.",
                    "Algorithm on Self-organization of Wireless or Connectionless Clustering.",
                    "A Strongly Partitioned Operating System Model for Data Link Networks.",
                    "Twin Hybrid ElGamal Encryption over Signed Quadratic Residue Groups.",
                    "Extra Slot Allocation for Fair Data Collection in the Slot-Based Grid Network.",
                    "An Efficient Multipath Existence Checking Scheme for Wireless Sensor Networks.",
                    "Data Collection Scheme for Two-Tier Vehicular Sensor Networks.",
                    "Energy Efficient Water Filling Ultra Wideband Waveform Shaping Based on Radius Basis Function Neural Networks.",
                    "An Introduction to Bayesian Techniques for Sensor Networks.",
                    "Fuzzy C-Means Clustering Based Robust and Blind Noncoherent Receivers for Underwater Sensor Networks.",
                    "Research on Enhanced Spectrum Efficiency for BWA Networks.",
                    "Improved Channel Estimation Based on Compressed Sensing for Pulse Ultrawideband Communication System.",
                    "Compressive Sensing Using Singular Value Decomposition.",
                    "The Wideband Spectrum Sensing Based on Compressed Sensing and Interference Temperature Estimation.",
                    "The Applications of Compressive Sensing to Radio Astronomy.",
                    "Compressive Sensing for Autoregressive Hidden Markov Model Signal."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "WASA 2009",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2009",
                "sub_name": "Wireless Algorithms, Systems, and Applications, 4th International Conference, WASA 2009, Boston, MA, USA, August 16-18, 2009. Proceedings.",
                "count": 57,
                "papers": [
                    "Long-Term Animal Observation by Wireless Sensor Networks with Sound Recognition.",
                    "Experimental Study on Mobile RFID Performance.",
                    "Experimental Study on Secure Data Collection in Vehicular Sensor Networks.",
                    "Experimental Study of Independent and Dominating Sets in Wireless Sensor Networks Using Graph Coloring Algorithms.",
                    "A Comparison of Block-Based and Clip-Based Cooperative Caching Techniques for Streaming Media in Wireless Home Networks.",
                    "Dynamic Power Management for Sensor Node in WSN Using Average Reward MDP.",
                    "Energy Consumption of Fair-Access in Sensor Networks with Linear and Selected Grid Topologies.",
                    "Lookahead Expansion Algorithm for Minimum Power Multicasting in Wireless Ad Hoc Networks.",
                    "RE2-CD: Robust and Energy Efficient Cut Detection in Wireless Sensor Networks.",
                    "Energy-Efficient Composite Event Detection in Wireless Sensor Networks.",
                    "epsilon-Net Approach to Sensor k-Coverage.",
                    "Biologically-Inspired Target Recognition in Radar Sensor Networks.",
                    "Stochastic k-Coverage in Wireless Sensor Networks.",
                    "Herd-Based Target Tracking Protocol in Wireless Sensor Networks.",
                    "Minimum Interference Planar Geometric Topology in Wireless Sensor Networks.",
                    "Topology Inference in Wireless Mesh Networks.",
                    "Maximum Independent Set of Links under Physical Interference Model.",
                    "CSR: Constrained Selfish Routing in Ad-Hoc Networks.",
                    "Multicast Extensions to the Location-Prediction Based Routing Protocol for Mobile Ad Hoc Networks.",
                    "AGSMR: Adaptive Geo-Source Multicast Routing for Wireless Sensor Networks.",
                    "On the Capacity of Hybrid Wireless Networks with Opportunistic Routing.",
                    "NQAR: Network Quality Aware Routing in Wireless Sensor Networks.",
                    "A Network Coding Approach to Reliable Broadcast in Wireless Mesh Networks.",
                    "Workload-Driven Compressed Skycube Queries in Wireless Applications.",
                    "Routing-Aware Query Optimization for Conserving Energy in Wireless Sensor Networks.",
                    "In-Network Historical Data Storage and Query Processing Based on Distributed Indexing Techniques in Wireless Sensor Networks.",
                    "Throughput Potential of Overlay Cognitive Wireless Mesh Networks.",
                    "Data Collection with Multiple Sinks in Wireless Sensor Networks.",
                    "Communication in Naturally Mobile Sensor Networks.",
                    "Void Avoidance in Three-Dimensional Mobile Underwater Sensor Networks.",
                    "Distributed Range-Free Localization Algorithm Based on Self-Organizing Maps.",
                    "Location Discovery in SpeckNets Using Relative Direction Information.",
                    "Providing Source-Location Privacy in Wireless Sensor Networks.",
                    "Fully Decentralized, Collaborative Multilateration Primitives for Uniquely Localizing WSNs.",
                    "Relative Span Weighted Localization of Uncooperative Nodes in Wireless Networks.",
                    "A Consistency-Based Secure Localization Scheme against Wormhole Attacks in WSNs.",
                    "Can You See Me? The Use of a Binary Visibility Metric in Distance Bounding.",
                    "A Secure Framework for Location Verification in Pervasive Computing.",
                    "Introduction to Mobile Trajectory Based Services: A New Direction in Mobile Location Based Services.",
                    "Spectrally Efficient Frequency Hopping System Design under Hostile Jamming.",
                    "A QoS Framework with Traffic Request in Wireless Mesh Network.",
                    "An Approximation Algorithm for Conflict-Aware Many-to-One Data Aggregation Scheduling in Wireless Sensor Networks.",
                    "On Approximation Algorithms for Interference-Aware Broadcast Scheduling in 2D and 3D Wireless Sensor Networks.",
                    "Dynamic Scheduling of Pigeons for Delay Constrained Applications.",
                    "Energy Efficient DNA-Based Scheduling Scheme for Wireless Sensor Networks.",
                    "Minimum-Latency Schedulings for Group Communications in Multi-channel Multihop Wireless Networks.",
                    "Traffic-Aware Channel Assignment in Wireless Sensor Networks.",
                    "Sniffer Channel Selection for Monitoring Wireless LANs.",
                    "Uplink Resource Management Design in Multi-access Wireless Networks.",
                    "Throughput Measurement-Based Access Point Selection for Multi-rate Wireless LANs.",
                    "Latency-Bounded Minimum Influential Node Selection in Social Networks.",
                    "Design and Implementation of Davis Social Links OSN Kernel.",
                    "Information Extraction as Link Prediction: Using Curated Citation Networks to Improve Gene Detection.",
                    "Social Network Privacy via Evolving Access Control.",
                    "Utopia Providing Trusted Social Network Relationships within an Un-trusted Environment.",
                    "Discovery and Protection of Sensitive Linkage Information for Online Social Networks Services.",
                    "Social-Stratification Probabilistic Routing Algorithm in Delay-Tolerant Network."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "WASA 2008",
        "info": "Dallas, TX, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2008",
                "sub_name": "Wireless Algorithms, Systems, and Applications, Third International Conference, WASA 2008, Dallas, TX, USA, October 26-28, 2008. Proceedings.",
                "count": 53,
                "papers": [
                    "Research Challenges in Complex Large Scale Networks and Cyber Physical Systems.",
                    "China's National Research Project on Wireless Sensor Networks.",
                    "A Utility-Based Routing Scheme in Ad Hoc Networks.",
                    "Delivery Guarantee of Greedy Routing in Three Dimensional Wireless Networks.",
                    "Landmarks Selection Algorithm for Virtual Coordinates Routing.",
                    "Energy Efficient Broadcast Routing in Ad Hoc Sensor Networks with Directional Antennas.",
                    "DTN Routing with Probabilistic Trajectory Prediction.",
                    "A Simple Yet Effective Diversifying Improvement of the Minimum Power Multicast Tree Algorithms in Wireless Ad Hoc Networks.",
                    "Analytical Study of the Expected Number of Hops in Wireless Ad Hoc Network.",
                    "HoP: Pigeon-Assisted Forwarding in Partitioned Wireless Networks.",
                    "Load-Based Metrics and Flooding in Wireless Mesh Networks.",
                    "New Approximation for Minimum-Weight Routing Backbone in Wireless Sensor Network.",
                    "Ant Colony Optimization-Based Location-Aware Routing for Wireless Sensor Networks.",
                    "Multi-path GEM for Routing in Wireless Sensor Networks.",
                    "Construction of Minimum Connected Dominating Set in 3-Dimensional Wireless Network.",
                    "Maintaining CDS in Mobile Ad Hoc Networks.",
                    "PTAS for Minimum Connected Dominating Set in Unit Ball Graph.",
                    "A Better Theoretical Bound to Approximate Connected Dominating Set in Unit Disk Graph.",
                    "Minimum Power Minimum D-Hop Dominating Sets in Wireless Sensor Networks.",
                    "Convex Combination Approximation for the Min-Cost WSN Point Coverage Problem.",
                    "p-Percent Coverage in Wireless Sensor Networks.",
                    "Prolonging Network Lifetime for Target Coverage in Sensor Networks.",
                    "An Environmental Monitoring System with Integrated Wired and Wireless Sensors.",
                    "An Energy-Efficient Object Tracking Algorithm in Sensor Networks.",
                    "Sensor Deployment for Composite Event Detection in Mobile WSNs.",
                    "Reliable and Fast Detection of Gradual Events in Wireless Sensor Networks.",
                    "Mobility Model and Relay Management for Disaster Area Wireless Networks.",
                    "Relay Nodes in Wireless Sensor Networks.",
                    "Transmission Scheduling for CBR Traffic in Multihop Wireless Networks.",
                    "Leader Election Algorithms for Multi-channel Wireless Networks.",
                    "Clock Offset Estimation in Wireless Sensor Networks Using Bootstrap Bias Correction.",
                    "Correlation Analysis for Spreading Codewords in Quasi-synchronous CDMA Communication.",
                    "Energy Consumption Reduction of a WSN Node Using 4-bit ADPCM.",
                    "Minimizing Transferred Data for Code Update on Wireless Sensor Network.",
                    "Opportunistic Cooperation with Receiver-Based Ratio Combining Strategy.",
                    "Message-Driven Frequency Hopping - Design and Analysis.",
                    "Toward a Real and Remote Wireless Sensor Network Testbed.",
                    "An Optimal Algorithm for Minimizing Cluster Overlap of ACE.",
                    "Supporting IPv6 Interaction with Wireless Sensor Networks Using NP++.",
                    "The Effect of Re-sampling on Incremental Nelder-Mead Simplex Algorithm: Distributed Regression in Wireless Sensor Networks.",
                    "C-kNN Query Processing in Object Tracking Sensor Networks.",
                    "Power-Efficient Data Exchanging Algorithm in Wireless Mesh Networks.",
                    "Composite Spatio-Temporal Co-occurrence Pattern Mining.",
                    "Belief Propagation in Wireless Sensor Networks - A Practical Approach.",
                    "A Random Key Management Scheme for Wireless Sensor Networks.",
                    "WORMEROS: A New Framework for Defending against Wormhole Attacks on Wireless Ad Hoc Networks.",
                    "Designing Secure Protocols for Wireless Sensor Networks.",
                    "Privacy-Preserving Communication Algorithms and Network Protocols.",
                    "Secure Multi-party Protocols for Privacy Preserving Data Mining.",
                    "Enhancing Software Product Line Maintenance with Source Code Mining.",
                    "Software Fault Localization Using N-gram Analysis.",
                    "Recyclable Connected Dominating Set for Large Scale Dynamic Wireless Networks.",
                    "Locate More Sensors with Fewer Anchors in Wireless Sensor Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "WASA 2006",
        "info": "Xi'an, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wasa/2006",
                "sub_name": "Wireless Algorithms, Systems, and Applications, First International Conference, WASA 2006, Xi'an, China, August 15-17, 2006, Proceedings.",
                "count": 65,
                "papers": [
                    "Application Oriented Networking (AON): Adding Intelligence to Next-Generation Internet Routers.",
                    "Multi-channel Wireless Networks: Capacity, Protocols, and Experimentation.",
                    "A Priority Management Scheme for High Rate Wireless Personal Area Network.",
                    "Connection Control by Virtual Admission in Wireless LAN Environment.",
                    "A Scalable Port Forwarding for P2P-Based Wi-Fi Applications.",
                    "An Adaptive Energy Saving Mechanism for the IEEE 802.15.4 LR-WPAN.",
                    "Traffic-Aware Power Control Algorithm for Low Rate WPAN.",
                    "A Generic Software Partitioning Algorithm for Pervasive Computing.",
                    "A New Methodology of QoS Evaluation and Service Selection for Ubiquitous Computing.",
                    "An Enhanced Energy Saving Scheme in Mobile Broadband Wireless Access Systems.",
                    "Energy Aware Multimedia Messaging Services Across Networks and Across Devices for Mobile Users.",
                    "Dynamic Bandwidth Allocation in IEEE 802.16.",
                    "A Memory Efficient Algorithm for Packet Classification.",
                    "Energy-Efficient Multi-query Optimization over Large-Scale Sensor Networks.",
                    "On the Design of Soft-Decision Fusion Rule for Coding Approach in Wireless Sensor Networks.",
                    "Reliable and Real-Time Data Gathering in Multi-hop Linear Wireless Sensor Networks.",
                    "Path Selection of Reliable Data Delivery in Wireless Sensor Networks.",
                    "An Efficient and Robust Routing Protocol for Data Aggregation.",
                    "An Area-Based Vertical Motion Estimation on Heterogeneous Wireless Networks.",
                    "A Density Control Algorithm for Surveillance Sensor Networks.",
                    "Adaptive Weighted Clustering for Large Scale Mobile Ad Hoc Networking Systems.",
                    "An Interference Free Cluster-Based TDMA Protocol for Wireless Sensor Networks.",
                    "Integrated Multi-layer Registration Combining SIP with Mobile IP Schemes.",
                    "ELS: Energy-Aware Some-for-Some Location Service for Ad Hoc Mobile Networks.",
                    "Throughput Capacity of UWB Ad-Hoc Networks with Infrastructure Support.",
                    "Performance of Tomlinson-Harashima Precoding over Spatially Correlated MIMO Channels.",
                    "Upper Bound on Operational Lifetime of Ultra Wide Band Sensor Network.",
                    "Single-Actor Selection Algorithms for Wireless Sensor and Actor Networks.",
                    "A Genetic Algorithm on Multi-sensor Networks Lifetime Optimization.",
                    "A Power Efficient MAC Protocol for IEEE 802.11 Multihop Ad Hoc Networks.",
                    "A Novel Energy-Aware TDMA Scheduling Algorithm for Wireless Sensor Networks.",
                    "A Distributed Code Assignment Algorithm with High Code Reusability for CDMA-Based Ad Hoc Networks.",
                    "A Medium Access Control Scheme for Providing Reliability in Wireless Ad Hoc Networks.",
                    "An Adaptive Latency-Energy Balance Approach of MAC Layer in Wireless Sensor Networks.",
                    "A Convex-Hull Based Algorithm to Connect the Maximal Independent Set in Unit-Disk Graphs.",
                    "A Pure Localized Algorithm for Finding Connected Dominating Set in MANETs by Classification of Neighbors.",
                    "Dependency-Based Dynamic Component Reconfiguration for Wireless Computing Systems.",
                    "Non-uniform Information Transmission for Minimum Distortion in Wireless Networks.",
                    "A UDP-Based State-Sharing Mechanism of SIP Transaction Stateful Proxy.",
                    "A Novel Analog Pre-distorter of TWTA Non-linearity in High Power Satellite Transmitters.",
                    "Secure Data Transmission on Multiple Paths in Mobile Ad Hoc Networks.",
                    "Accusation Resolution Using Security Metrology.",
                    "Ring Signature Based on ElGamal Signature.",
                    "Key Management in Sensor Networks.",
                    "Efficient Password-Based Authentication and Key Exchange Scheme Preserving User Privacy.",
                    "A Trust-Based Routing Framework in Energy-Constrained Wireless Sensor Networks.",
                    "Minimum Multicast Time Problem in Wireless Sensor Networks.",
                    "On Broadcast Authentication in Wireless Sensor Networks.",
                    "Tree-Based Multicast Meshes with Variable Density of Redundant Paths on Mobile Ad Hoc Networks.",
                    "Low-Latency Broadcast Scheduling in Ad Hoc Networks.",
                    "A Study on the CI-OFDM Communication System for the High Quality and High Speed Communication System.",
                    "Design and Analysis of Side Information Embedded PTS Scheme in the OFDM Communication System.",
                    "Performance Analysis of a Framed ALOHA System with Diversity Frequency Hopping.",
                    "Optimized Channel Utilization in Multi-carrier Wireless Mobile Networks.",
                    "An Energy-Aware Quality of Services Routing Protocol in Mobile Ad Hoc Networks.",
                    "Bandwidth Guaranteed Routing in Wireless Mesh Networks.",
                    "An Altitude Based Dynamic Routing Scheme for Ad Hoc Networks.",
                    "PREG: A Practical Power Control Algorithm Based on a Novel Proximity Graph for Heterogeneous Wireless Sensor Networks.",
                    "Algorithms for Delay Constrained and Energy Efficiently Routing in Wireless Sensor Network.",
                    "The Effective Radius Model for Multi-hop Wireless Networks.",
                    "Modeling and Analysis for an Enhanced Three-Tier Dynamic Location Management in 3G.",
                    "MTSP: Multi-hop Time Synchronization Protocol for IEEE 802.11 Wireless Ad Hoc Network.",
                    "Upperbounding End-to-End Throughput of Multihop Wireless Networks.",
                    "Dynamicity Aware Graph Relabeling Systems and the Constraint Based Synchronization: A Unifying Approach to Deal with Dynamic Networks.",
                    "Studying Rational User Behavior in WCDMA Network and Its Effect on Network Revenue."
                ]
            }
        ]
    }
]