[
    {
        "year": "2021",
        "name": "22nd WOWMOM 2021",
        "info": "Pisa, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2021",
                "sub_name": "22nd IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WoWMoM 2021, Pisa, Italy, June 7-11, 2021.",
                "count": 52,
                "papers": [
                    "A Game Theory-based Transportation System using Fog Computing for Passenger Assistance.",
                    "A Low Complexity Network-Coded ARQ protocol for Ultra-Reliable Low Latency Communication.",
                    "A Truthful Auction Mechanism for Resource Allocation in Mobile Edge Computing.",
                    "Context-Aware Fine-Grained Task Scheduling at Vehicular Edges: An Extreme Reinforcement Learning based Dynamic Approach.",
                    "DeepMTL: Deep Learning Based Multiple Transmitter Localization.",
                    "Delay Performance of UAV-Based Buffer-Aided Relay Networks under Bursty Traffic: Mobile or Static?",
                    "Extending the QUIC Protocol to Support Live Container Migration at the Edge.",
                    "Fairness in Network-Friendly Recommendations.",
                    "Feasibility of Multipath Construction in mmWave Backhaul.",
                    "How UAVs' Highly Dynamic 3D Movement Improves Network Security?",
                    "Hy-Fi: Aggregation of LiFi and WiFi using MIMO in IEEE 802.11.",
                    "Long-Term Wireless Sensor Network Deployments in Industry and Office Scenarios.",
                    "Modeling Simple HetNet Configurations with Mixed Traffic Loads.",
                    "Modelling Broadband Wireless Technology Coexistence in the Unlicensed Bands.",
                    "OSLo: Optical Sensor Localization through Mesh Networked Cameras.",
                    "Program Placement Optimization for Storage-constrained Mobile Edge Computing Systems: A Multi-armed Bandit Approach.",
                    "Relational Deep Reinforcement Learning for Routing in Wireless Networks.",
                    "Resilience Against Bad Mouthing Attacks in Mobile Crowdsensing Systems via Cyber Deception.",
                    "Service Placement and Bandwidth Allocation for MEC-enabled Mobile Cloud Gaming.",
                    "Serving HTC and Critical MTC in a RAN Slice.",
                    "TTrees: Automated Classification of Causes of Network Anomalies with Little Data.",
                    "VideoTrain: A Generative Adversarial Framework for Synthetic Video Traffic Generation.",
                    "PhD Forum: Data traffic classification using deep learning models.",
                    "PhD Forum: Delay Guarantees of a Mobile Wireless Sensor Network using Stochastic Network Calculus.",
                    "PhD Forum: Design and Study of Protocols for NR V2X Networks.",
                    "PhD Forum: Encrypted Traffic Analysis & Content Awareness of 360-Degree Video Streaming Optimization.",
                    "PhD Forum: LoRaWAN networks evaluation through extensive ns-3 simulations.",
                    "PhD Forum: Padding Overhead Reduction in Random Linear Coded Variable Size Media Streams.",
                    "WIP: An Onion-Based Routing Protocol Strengthening Anonymity.",
                    "WIP: An Open-Source Tool for Evaluating System-Level Performance of NB-IoT Non-Terrestrial Networks.",
                    "WIP: Analysis of Feasible Topologies for Backhaul Mesh Networks.",
                    "WIP: Collaborative Approaches to Mitigate Links of Variable Quality in LoRa Networks.",
                    "WIP: Demand-Driven Power Allocation in Wireless Networks with Deep Q-Learning.",
                    "WIP: Leveraging QUIC for a Receiver-driven BBR for Cellular Networks.",
                    "WIP: Preliminary Evaluation of Digital Twins on MEC Software Architecture.",
                    "WIP: Short-Term Flow-Based Bandwidth Forecasting using Machine Learning.",
                    "WIP: Sysnif: Constructing Workflow from Interleaved Logs in Intelligent IoT System.",
                    "A Preliminary Evaluation of QUIC for Mobile Serverless Edge Applications.",
                    "Comparison of Trip Matching Algorithms for Mobility Sharing Applications.",
                    "Multi-Agent Navigation of a Multi-Storey Parking Garage via Game Theory.",
                    "Similarity Measures for Location-Dependent MMIMO, 5G Base Stations On/Off Switching Using Radio Environment Map.",
                    "A System Simulator for 5G Non-Terrestrial Network Evaluations.",
                    "Effect of Antenna Orientation on the Air-to-Air Channel in Arbitrary 3D Space.",
                    "Interoperable Simulation Tools for Satellite Networks.",
                    "Multi-Platform Hardware In The Loop (HIL) Simulation for Decentralized Swarm Communication Using ROS and GAZEBO.",
                    "Performance Analysis of a Dual Terahertz/Ka Band Communication System for Satellite Mega-Constellations.",
                    "Tethered UAV with High Gain Antenna for BVLOS CNPC: A Practical Design for Widespread Use.",
                    "3D Position Optimization for the UAV-Assisted Relay Networks Enhancing by NOMA and MRC.",
                    "A Novel Method for Analyzing Weather Effect on Smart City Traffic.",
                    "Optimizing Task Allocation for Edge Micro-Clusters in Smart Cities.",
                    "RA-RL: Reputation-Aware Edge Device Selection Method based on Reinforcement Learning.",
                    "Secure Link Selection for Relay Networks with Buffer."
                ]
            }
        ]
    },
    {
        "year": "2020",
        "name": "21st WOWMOM 2020",
        "info": "Cork, Ireland",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2020",
                "sub_name": "21st IEEE International Symposium on \"A World of Wireless, Mobile and Multimedia Networks\", WoWMoM 2020, Cork, Ireland, August 31 - September 3, 2020.",
                "count": 66,
                "papers": [
                    "Exploring the Use of Control Packets in LoRa Medium Access: A Scalability Analysis.",
                    "Lightweight Timeslot Scheduling Through Periodicity Detection for Increased Scalability of LoRaWAN.",
                    "How to Make Firmware Updates over LoRaWAN Possible.",
                    "Short: Achieving Energy Efficiency in Dense LoRaWANs through TDMA.",
                    "Identifying Highly Influential Travellers for Spreading Disease on a Public Transport System.",
                    "Data Storage and Sharing for Mobile Devices in Multi-region Edge Networks.",
                    "A Walk Down Memory Lane: On Storage Capacity in Opportunistic Content Sharing Systems.",
                    "MaxDelivery: A New Approach to a DTN Buffer Management.",
                    "Security Issues in Distributed Storage Networks.",
                    "An Approach for Optimal Base Station Selection in 5G HetNets for Smart Factories.",
                    "Implementation of Tokenised Supply Chain Using Blockchain Technology.",
                    "Evaluation of Feasibility and Impact of Attacks Against the 6top Protocol in 6TiSCH Networks.",
                    "DETECTIF : Unified Detection & Correction of IoT Faults in Smart Homes.",
                    "Towards Learning-automation IoT Attack Detection through Reinforcement Learning.",
                    "HydraWave: Multi-group Multicast Hybrid Precoding and Low-Latency Scheduling for Ubiquitous Industry 4.0 mmWave Communications.",
                    "Dynamic Cell-Less Radio Access Network Meta-Scheduler for High System Capacity Increase.",
                    "CTC-CEM: Low-Latency Cross-Technology Channel Establishment with Multiple Nodes.",
                    "Joint Relaying and Spatial Sharing Multicast Scheduling for mmWave Networks.",
                    "Edge-Assisted Resource Management for Data-Centric IoT Applications in Shared Sensor Networks.",
                    "Smart Contract-based Hierarchical Auction Mechanism for Edge Computing in Blockchain-empowered IoT.",
                    "Dynamic Scheduling for IoT Analytics at the Edge.",
                    "Eye Movements as a Key in Cognitive Authentication Protocols.",
                    "A Reinforcement Learning Approach for Base Station On/Off Switching in Heterogeneous M-MIMO Networks.",
                    "Reliability Assessment of Bio-Inspired Ultra-Dense Networks Using Percolation Theory.",
                    "Application of Virtual Leaders in Long Vehicle Platoons Operating with Cooperative Adaptive Cruise Control Using IEEE 802.11p Transmission.",
                    "Power Consumption Variation for a Single Technology Wireless Transceivers.",
                    "A Testbed for Time-Slotted LoRa Communications.",
                    "Godash 2.0 - The Next Evolution of HAS Evaluation.",
                    "Supply-Chain Management System for Plastic Pipes Market Based on Open Blockchain Framework.",
                    "A QoE and Visual Attention Evaluation on the Influence of Audio in 360° Videos.",
                    "Enabling Human-Robot-Interaction for Remote Robotic Operation via Augmented Reality.",
                    "A Statistical Characterization of SINR Coverage and Network Throughput with Macro-Diversity.",
                    "Network Calculus Based Delay Analysis for Mixed Fronthaul and Backhaul 5G Networks.",
                    "Event-Based Vision: Understanding Network Traffic Characteristics.",
                    "Middle-mile Network Optimization in Rural Wireless Meshes.",
                    "DeepNDN: Opportunistic Data Replication and Caching in Support of Vehicular Named Data.",
                    "User-centric Optimization of Caching and Recommendations in Edge Cache Networks.",
                    "Achieving Optimal Cache Utility in Constrained Wireless Networks through Federated Learning.",
                    "Trilateration, Fingerprinting, and Centroid: Taking Indoor Positioning with Bluetooth LE to the Wild.",
                    "Short: LSTM-based GNSS Spoofing Detection Using Low-cost Spectrum Sensors.",
                    "Lightweight and Standalone IoT Based WiFi Sensing for Active Repositioning and Mobility.",
                    "Collective Subscriptions: A Novel Funding Tool for Crowdsourced Network Infrastructures.",
                    "Punched Cards over the Air: Cross-Technology Communication Between LTE-U/LAA and WiFi.",
                    "MAMBA: Adaptive and Bi-directional Data Transfer for Reliable Camera-display Communication.",
                    "Inventory Management through Mini-Drones: Architecture and Proof-of-Concept Implementation.",
                    "SDN-(UAV)ISE: Applying Software Defined Networking to Wireless Sensor Networks with Data Mules.",
                    "SkyCell: A Prototyping Platform for 5G Aerial Base Stations.",
                    "Wildfire Spread Modeling with Aerial Image Processing.",
                    "Design and Implementation of Full-Scale Industrial Control System Test Bed for Assessing Cyber-Security Defenses.",
                    "Intrusion Detection in Binary Process Data: Introducing the Hamming-distance to Matrix Profiles.",
                    "An Edge-Fog Computing Framework for Cloud of Things in Vehicle to Grid Environment.",
                    "Assessing Anomaly-Based Intrusion Detection Configurations for Industrial Control Systems.",
                    "Improving MAC Protocols for Wireless Industrial Networks via Packet Prioritization and Cooperation.",
                    "Starvation-avoidance CAN Scheduling for Shorter Worst-case Response Time with Priority Queues.",
                    "SCADA-agnostic Power Modelling for Distributed Renewable Energy Sources.",
                    "Blockchain-assisted Decentralized Virtual Prosumer Grouping for P2P Energy Trading.",
                    "DDoSNet: A Deep-Learning Model for Detecting Network Attacks.",
                    "A Big Data Fusion to Profile CPS Security Threats Against Operational Technology.",
                    "Performance Analysis of an IoT Platform with Virtual Reality and Social Media Integration.",
                    "BLUES: A Self-organizing BLE Mesh-network Paradigm for IoT Environments.",
                    "Topology Awareness for Smart 5G eMBB Network Slicing VNF Placement.",
                    "A Node Probability-based Reinforcement Learning Framework for Virtual Network Embedding.",
                    "Towards the Mobility Issues of 5G-NOMA Through User Dissociation and Re-association Control.",
                    "A Novel and Secure Service Function Chains Embedding Framework for NFV-Enabled Networks.",
                    "RFC 6550: On Minimizing the Control Plane Traffic of RPL-based Industrial Networks.",
                    "Improving Delay and Capacity of TS-LoRa with Flexible Guard Times."
                ]
            }
        ]
    },
    {
        "year": "2019",
        "name": "20th WOWMOM 2019",
        "info": "Washington, DC, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2019",
                "sub_name": "20th IEEE International Symposium on \"A World of Wireless, Mobile and Multimedia Networks\", WoWMoM 2019, Washington, DC, USA, June 10-12, 2019.",
                "count": 76,
                "papers": [
                    "The Diver System: Multimedia Communication and Localization Using Underwater Acoustic Networks.",
                    "Adaptive Passive Mobile Sensing Using Reinforcement Learning.",
                    "Estimating Downlink Throughput from End-user Measurements in Mobile Broadband Networks.",
                    "Ray Tracing Analysis for UAV-Assisted Integrated Access and Backhaul Millimeter Wave Networks.",
                    "Unsupervised Learning of Signal Strength Models for Device-Free Localization.",
                    "Soter: Trust Discovery Framework for Internet of Medical Things (IoMT).",
                    "Measuring and Modeling Car Park Usage: Lessons Learned from a Campus Field-Trial.",
                    "Keeping Data Alive: Communication Across Vehicular Micro Clouds.",
                    "An Online Method for Opportunistic Task Replications.",
                    "Autonomous Collision-Free Scheduling for LoRa-Based Industrial Internet of Things.",
                    "Computing Realistic and Adaptive Capacity of D2D Contacts.",
                    "Sizing Up User Traffic: Flow-based Mobile Data Offloading Over WiFi.",
                    "A Lightweight Block Validation Method for Resource-Constrained IoT Devices in Blockchain-Based Applications.",
                    "Risk-Aware Resource Control with Flexible 5G Access Technology Interfaces.",
                    "D2D-Enabled Collaborative Edge Caching and Processing with Adaptive Mobile Video Streaming.",
                    "Getting the Most Out of Your VNFs: Flexible Assignment of Service Priorities in 5G.",
                    "Adaptive Routing in Disruption Tolerant Networks.",
                    "Improving Water Consumption Estimates from a Bottle-Attachable Sensor Using Heuristic Fusion.",
                    "IoT and the Risk of Internet Exposure: Risk Assessment Using Shodan Queries.",
                    "MEFS: Mobile Edge File System for Edge-Assisted Mobile Apps.",
                    "Optimizing mmWave Spatial Reuse: Signal-To-Interference Aware Beamtraining.",
                    "Autonomic Service Placement in Fog Computing.",
                    "Privacy-Preserving and Undeniable Authentication for Mobile RFID Tags.",
                    "SafeFlow-x: An Efficient and Complete Strategy for Multiparty Trust Negotiation Over Distributed Networks.",
                    "Implementation of Software-Defined 6LoWPANs in Contiki OS.",
                    "Adaptive Swarm Control for Mobile Resource Placement in Wireless Ad-Hoc Networks.",
                    "Blockchain Based Authentication and Authorization Framework for Remote Collaboration Systems.",
                    "PhD Forum: Resource Allocation and Task Offloading in Cloud-Assisted Wireless Networks.",
                    "Computation Rate Maximization for Wireless Powered Mobile Edge Computing with NOMA.",
                    "Energy Efficiency Enhancement in 5G Mobile Wireless Networks.",
                    "Strategies for Network Slicing Negotiation in a Dynamic Resource Market.",
                    "Cross-Layer Assisted Forwarding Strategy for Opportunistic Communication.",
                    "Performance Assessment of Off-The-Shelf Mm Wave Radios for Drone Communications.",
                    "Wideband Temporal Spectrum Sensing Using Cepstral Features.",
                    "DEEM: Enabling Microservices via DEvice Edge Markets.",
                    "Energy Sharing Based Content Delivery in Mobile Social Networks.",
                    "Adaptive Low-Power Wireless Sensor Network Architecture for Smart Street Furniture-based Crowd and Environmental Measurements.",
                    "Expressive Data-Centric Multicast on RPL in Low-Power Networks.",
                    "Modeling Cycling Behavior to Improve Bicyclists' Safety at Intersections - A Networking Perspective.",
                    "Use of Machine Learning to Detect Causes of Unnecessary Active Scanning in WiFi Networks.",
                    "An Age Control Transport Protocol for Delivering Fresh Updates in the Internet-of-Things.",
                    "IoTTracker: An Enhanced Engine for Discovering Internet-of-Thing Devices.",
                    "The Road Towards Private Proximity Services.",
                    "Investigating Theoretical Performance and Demodulation Techniques for LoRa.",
                    "Ground Localization with a Drone and UWB Antennas: Experiments on the Field.",
                    "Non-Submodularity and Approximability: Influence Maximization in Online Social Networks.",
                    "How Mobility Patterns Drive Disease Spread: A Case Study Using Public Transit Passenger Card Travel Data.",
                    "Leveraging Transfer Learning in Multiple Human Activity Recognition Using WiFi Signal.",
                    "On the Performance of Data Distribution Methods for Wireless Industrial Networks.",
                    "A Data Dissemination Protocol for Vehicles with Temporary Cellular Network Inaccessibility.",
                    "LocalVLC: Augmenting Smart IoT Services with Practical Visible Light Communication.",
                    "Demo: Open Source Platform for IEEE 802.11p NICs Evaluation.",
                    "Performance Analysis of Two Machine-to-Machine Architecture Types in Vehicular Communications.",
                    "A Variable Length Address Assignment Scheme for 6LoWPAN.",
                    "Web-Based Framework for Accessing Native Opportunistic Networking Applications.",
                    "Blockchain Technology for Networked Swarms of Unmanned Aerial Vehicles (UAVs).",
                    "Energy-Efficient HTTP Adaptive Streaming with Hybrid TCP/UDP Over Heterogeneous Wireless Networks.",
                    "HIRO-NET: Self-Organized Robotic Mesh Networking for Internet Sharing in Disaster Scenarios.",
                    "VL-ROUTE: A Cross-Layer Routing Protocol for Visible Light Ad Hoc Network.",
                    "Minimizing Transmission and Processing Delay in a NFV-based Network.",
                    "Texting and Driving Recognition Exploiting Subsequent Turns Leveraging Smartphone Sensors.",
                    "Design Guidelines for Big Data Gathering in Industry 4.0 Environments.",
                    "Characterizing and Removing Oscillations in Mobile Phone Location Data.",
                    "Demo Abstract: Mobile Augmented Reality Leveraging Cloud Radio Access Networks.",
                    "mmWave in Vehicular Networks: Leveraging Traffic Signals for Beam Design.",
                    "Trusted D2D-Based IoT Resource Access Using Smart Contracts.",
                    "User Grouping and Optimal Random Beamforming in mmWave MIMO-NOMA Transmission Systems.",
                    "An Autonomous Swarm of Drones for Industrial Gas Sensing Applications.",
                    "Enabling Multi-Hop Forwarding in 6LoWPANs Through Software-Defined Networking.",
                    "A Software Defined Multi-Path Traffic Offloading System for Heterogeneous LTE-WiFi Networks.",
                    "Toward the Next Generation of Flow Compression.",
                    "Secure IoT Access at Scale Using Blockchains and Smart Contracts.",
                    "Probabilistic Knowledge-Graph based Workflow Recommender for Network Management Automation.",
                    "Autonomous CPS Mobility Securely Designed.",
                    "Performance Measurements of IEEE 802.15.4g Wireless Networks.",
                    "On-Demand Video-Streaming Quality of Experience Maximization in Mobile Edge Computing."
                ]
            }
        ]
    },
    {
        "year": "2018",
        "name": "19th WOWMOM 2018",
        "info": "Chania, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2018",
                "sub_name": "19th IEEE International Symposium on \"A World of Wireless, Mobile and Multimedia Networks\", WoWMoM 2018, Chania, Greece, June 12-15, 2018.",
                "count": 84,
                "papers": [
                    "High-Order PSK Signaling (HOPS) Techniques for Low-Power Spread Spectrum Communications.",
                    "Infrastructureless Pervasive Information Sharing with COTS Devices and Software.",
                    "Personalized Pricing for Efficient User-Centric Multi-Resource Control in 5G Wireless Networks.",
                    "Delay-Constrained Profit Maximization for Data Deposition in Mobile Opportunistic Device-to-Device Networks.",
                    "Vehicular communication: a survey.",
                    "Netview: A User-Centric Network Coverage Application.",
                    "Securing Road Traffic Congestion Detection by Incorporating V2I Communications.",
                    "Modeling of Data Dissemination in OppNets.",
                    "A2VF: Adaptive Allocation for Virtual Network Functions in Wireless Access Networks.",
                    "Annapurna: Building a Real-World Smartwatch-Based Automated Food Journal.",
                    "Two-Slot Based Model of the IEEE 802.11ah Restricted Access Window with Enabled Transmissions Crossing Slot Boundaries.",
                    "Optimization-in-the-Loop for Energy-Efficient 5G.",
                    "Resource Allocation to Maximize Fairness and Minimize Interference for Maximum Spectrum Reuse in 5G Cellular Networks.",
                    "A Resource Identity Management Strategy for Combined Fog-to-Cloud Systems.",
                    "QoE Degradation Attack in Dynamic Adaptive Streaming Over ICN.",
                    "Coexistence Gaps in Space via Interference Nulling for LTE-U/WiFi Coexistence.",
                    "Performance Analysis of C-V2I-Based Automotive Collision Avoidance.",
                    "QOE Performance Evaluation of Youtube Video Streaming in Mobile Broadband Networks.",
                    "Enabling Runtime Adaptation of Physical Layer Settings for Dependable UWB Communications.",
                    "Physical-Layer Protocols for Lightweight Wildlife Tags with Internet-of-Things Transceivers.",
                    "Optimal Number of Paths with Multipath Routing in Hybrid Networks.",
                    "Efficient Uplink from Vehicular Micro Cloud Solutions to Data Centers.",
                    "MM-wave Initial Access: A Context Information Overview.",
                    "Analysis and Improvement of the On-The-Fly Bandwidth Reservation Algorithm for 6TiSCH.",
                    "Medium Access and Transport Protocol Aspects in Practical 802.11 ad Networks.",
                    "A Demonstration of Privacy-Preserving Aggregate Queries for Optimal Location Selection.",
                    "Analysis of Spectral Properties for Efficient Coverage Under Probabilistic Flooding.",
                    "An SDN QoE Monitoring Framework for VoIP and Video Applications.",
                    "Performance Analysis of Epidemic Routing in Destination-Less OppNets.",
                    "Quality of Control-Aware Resource Allocation in 5G Wireless Access Networks.",
                    "Weighting Past on the Geo-Aware State Deployment Problem.",
                    "When Analog Meets Digital: Source-Encoded Physical-Layer Network Coding.",
                    "Towards a Security Assurance Framework for Connected Vehicles.",
                    "A Detection Mechanism for Internal Attacks on Pull-Based P2P Streaming Systems.",
                    "On the Impact of Local Computation Over Routing Performance in Green Wireless Networks.",
                    "Latency Minimization Through Optimal User Matchmaking in Multi-Party Online Applications.",
                    "Performance Analysis of a Device-to-Device Offloading Scheme for Vehicular Networks.",
                    "The Fifth IEEE Workshop on Smart Vehicles: Connectivity Technologies and its Applications (SmartVehicles'18).",
                    "Workshop on User-Centric Service Provisioning Over 5G Networks 2018 (USEPRO'18).",
                    "Show me the Cache: Optimizing Cache-Friendly Recommendations for Sequential Content Access.",
                    "Design and Evaluation of a Rate-Based Congestion Control Mechanism in CoAP for IoT Applications.",
                    "Fair Adaptive Data Rate Allocation and Power Control in LoRaWAN.",
                    "IEEE 802.11ah Restricted Access Window Surrogate Model for Real-Time Station Grouping.",
                    "Message from the Panel Chairs.",
                    "A Routing Protocol for LoRA Mesh Networks.",
                    "A New Objective Function for Hybrid Network in the Smart Grid.",
                    "TCP Congestion Response for Low Latency HTTP Live Streaming.",
                    "A SDN-based WiFi-VLC Coupled System for Optimised Service Provision in 5G Networks.",
                    "The Seventh IEEE Workshop on the Internet of Things: Smart Objects and Services (IoT-SoS 2108).",
                    "Realizing Wireless Communication Through Software-Defined HyperSurface Environments.",
                    "A QoE Performance Evaluation Framework for LTE Networks.",
                    "Evaluating the Health State of Urban Areas Using Multi-source Heterogeneous Data.",
                    "Energy-Efficient Data Acquisition in Mobile Crowdsensing Systems.",
                    "Indoor Occupancy Estimation via Location-Aware HMM: An IoT Approach.",
                    "IoT and Microservices Based Testbed for Connected Car Services.",
                    "MOOC: A Mobility Control Based Clustering Scheme for Area Coverage in FANETs.",
                    "A Modular Tool for Benchmarking loT Publish-Subscribe Middleware.",
                    "V2X Communications for Infrastructure-Assisted Automated Driving.",
                    "The Road to Privacy in IoT: Beyond Encryption and Signatures, Towards Unobservable Communication.",
                    "DEMO: Mobile Relay Architecture for Low-Power IoT Devices.",
                    "Analysis of Communication Demands of Networked Control Systems for Autonomous Platooning.",
                    "A Management Model for Low Powered Wireless Personal Area Networks.",
                    "Composable Distributed Mobile Applications and Services in Opportunistic Networks.",
                    "A Demonstration of Seamless Inter-Technology Mobility in Heterogeneous Networks.",
                    "Edge-MAP: Auction Markets for Edge Resource Provisioning.",
                    "Demo: A Delay-Tolerant Payment Scheme on the Ethereum Blockchain.",
                    "Performance Evaluation of a Proposed On-Demand Recharging Policy in Wireless Sensor Networks.",
                    "Lasagna: Programming Abstractions for End-to-End Slicing in Software-Defined WLANs.",
                    "Better Together: Collaborative Monitoring for Location-Based Services.",
                    "Forecasting Mobile Service Demands for Anticipatory MEC.",
                    "MANET-oriented SDN: Motivations, Challenges, and a Solution Prototype.",
                    "Practical Evaluation of Cooperative Communication for Ultra-Reliability and Low-Latency.",
                    "Assessing Redundancy Models for IoT Reliability.",
                    "Cluster-Based Replication: A Forwarding Strategy for Mobile Opportunistic Networks.",
                    "Proportional Fair Decentralized Scheduling for mmWave D2D Communications.",
                    "Dependable Internet of Things.",
                    "Environment-Aware Communications for Cooperative Collision Avoidance Applications.",
                    "Relevance-Aware Information Dissemination in Vehicular Networks.",
                    "ATP: A Fast Joining Technique for IEEE802.15. 4-TSCH Networks.",
                    "Smart IoT Data Collection.",
                    "A Microservices Architecture for Reactive and Proactive Fault Tolerance in IoT Systems.",
                    "The Impact of Social-Network Diffusion on Wireless Edge Resource Allocation.",
                    "Policy-Based Access Control for Constrained Healthcare Resources.",
                    "MAC Protocol for Supporting Multiple Roaming Users in Mult-Cell UWB Localization Networks."
                ]
            }
        ]
    },
    {
        "year": "2017",
        "name": "18th WOWMOM 2017",
        "info": "Macau, China",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2017",
                "sub_name": "18th IEEE International Symposium on A World of Wireless, Mobile and Multimedia Networks, WoWMoM 2017, Macau, China, June 12-15, 2017.",
                "count": 78,
                "papers": [
                    "A detailed look into power consumption of commodity 60 GHz devices.",
                    "Energy efficiency impact of transient node failures when using RPL.",
                    "Wireless power transfer under the spotlight: Charging terminals amid dense cellular networks.",
                    "Dynamic base station repositioning to improve spectral efficiency of drone small cells.",
                    "Fine-grained LTE radio link estimation for mobile phones.",
                    "Measurement study of IEEE 802.11ac Wi-Fi performance in high density indoor deployments: Are wider channels always better?",
                    "Multi-path D2D leads to satisfaction.",
                    "Implementation of wrap around mechanism for system level simulation of LTE cellular networks in NS3.",
                    "Design and experimental evaluation of a 2.4 GHz-AoA-enhanced beamsteering algorithm for IEEE 802.11ad mm-wave WLANs.",
                    "60 GHz range boost: Exploiting frequency selectivity in millimeter-wave networks.",
                    "Queue-aware opportunistic scheduling in multi-channel dynamic spectrum access networks.",
                    "Solar-enabled green base stations: Cost versus utility.",
                    "Understanding the present and future of cellular networks through crowdsourced traces.",
                    "On the feasibility of a user-operated mobile content distribution network.",
                    "Why your smartphone doesn't work in very crowded environments.",
                    "Efficient feedback mechanism and rate adaptation for LTE-based D2D communication.",
                    "An experimental study of secret key generation for passive Wi-Fi wearable devices.",
                    "Friendly-Jamming: An anti-eavesdropping scheme in wireless networks.",
                    "Mathematical model of LoRaWAN channel access.",
                    "On modeling of eavesdropping behavior in underwater acoustic sensor networks.",
                    "Towards intelligent flying base stations in future wireless network.",
                    "Multi-periodic contact patterns in predicting future contacts over mobile networks.",
                    "Wi-friend: Identifying potential real life friends nearby.",
                    "WearIA: Wearable device implicit authentication based on activity information.",
                    "Analyzing students' attention in class using wearable devices.",
                    "A load balancing scheme for sensing and analytics on a mobile edge computing network.",
                    "Estimate air quality based on mobile crowe sensing and big data.",
                    "Millimetric diagnosis: Machine learning based network analysis for mm-wave communication.",
                    "Optimal trade-off between accuracy and network cost of distributed learning in Mobile Edge Computing: An analytical approach.",
                    "Self-improving indoor localization by profiling outdoor movement on smartphones.",
                    "Silent whistle: Effective indoor positioning with assistance from acoustic sensing on smartphones.",
                    "CSI fingerprinting with SVM regression to achieve device-free passive localization.",
                    "A novel accurate synthetic aperture RFID localization method with high radial accuracy.",
                    "Wi-chase: A WiFi based human activity recognition system for sensorless environments.",
                    "On the usage of smart devices to augment the user interaction with multimedia applications.",
                    "Beacon-based proximity detection using compressive sensing for sparse deployment.",
                    "VehicleSense: A reliable sound-based transportation mode recognition system for smartphones.",
                    "VoDCast: Efficient SDN-based multicast for video on demand.",
                    "e-DASH: Modelling an energy-aware DASH player.",
                    "Adaptive configuration of time-domain eICIC to support multimedia communications in LTE-A heterogeneous networks.",
                    "Layer approach for HTTP-based low-delay adaptive streaming in mobile networks.",
                    "Subjective QoE assessment on video service: Laboratory controllable approach.",
                    "Cognitive radio using spectrum-sharing and power minimisation.",
                    "Optimal power allocations for multichannel energy harvesting cognitive radio.",
                    "Joint link-channel selection and power allocation in multi-radio Wireless Mesh Networks.",
                    "Fast spectrum sensing using a large number of receive antennas.",
                    "Efficient mode decision with enhanced sampling algorithm for HEVC.",
                    "Hotspot slicer: Slicing virtualized home Wi-Fi networks for air-time guarantee and traffic isolation.",
                    "mm-View: Obtaining real-time lower layer information of commercial off-the-shelf 60 GHz hardware.",
                    "Practical distributed channel assignment in home Wi-Fi networks.",
                    "City-Eyes: A multi-source data integration basec smart city analysis system.",
                    "Mitigation of inadvertent roaming in the Macao SAR.",
                    "RealSense: Real-time compressive spectrum sensing testbed over TV white space.",
                    "Accountable Internet of Things? Outline of the IoT databox model.",
                    "Understanding autonomous drone maneuverability for Internet of Things applications.",
                    "A lightweight privacy-preserving scheme for metering data collection in smart grid.",
                    "Distributed sensor data computing in smart city applications.",
                    "Benchmarking IoT middleware platforms.",
                    "Middleware for Internet of Things: A quantitative evaluation in small scale.",
                    "Implementing heterogeneous, autonomous, and resilient services in IoT: An experience report.",
                    "User association in 5G heterogeneous networks with mesh millimeter wave backhaul links.",
                    "Interference coordination for small cell networks with full-duplex base stations.",
                    "Exploiting distance information for transparent access point driven Wi-Fi handovers.",
                    "Millimeter-wave wireless backhauling for 5G small cells: Scalability of mesh over star topologies.",
                    "Performance analysis of distance-based inter-cell interference coordination in Small Cell Networks.",
                    "A simulative study of network association delays in IEEE 802.15.4e TSCH networks.",
                    "Asymmetry in energy-harvesting wireless sensor network operation modeled via Bayesian games.",
                    "Biased constrain hybrid Kalman filter for wireless indoor localization.",
                    "Locomotive: Optimizing mobile web traffic using selective compression.",
                    "Mirror: A computation-offloading framework for sophisticated mobile games.",
                    "Self-configuration mechanisms for SDN deployment in Wireless Mesh Networks.",
                    "Platooning as a service of autonomous vehicles.",
                    "Toward a social sensor based framework for intelligent transportation.",
                    "5G enabled cooperative collision avoidance: System design and field test.",
                    "A consistent heuristic for efficient path planning on mobility maps.",
                    "A fog-based distributed look-up service for intelligent transportation systems.",
                    "Can IEEE 802.11p and Wi-Fi coexist in the 5.9GHz ITS band ?",
                    "Sidelink-assisted handover for cellular network."
                ]
            }
        ]
    },
    {
        "year": "2016",
        "name": "17th WOWMOM 2016",
        "info": "Coimbra, Portugal",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2016",
                "sub_name": "17th IEEE International Symposium on A World of Wireless, Mobile and Multimedia Networks, WoWMoM 2016, Coimbra, Portugal, June 21-24, 2016.",
                "count": 100,
                "papers": [
                    "Message from the general chairs.",
                    "Message from the TPC co-chairs.",
                    "Message from the workshop co-chairs.",
                    "Workshop message: IoT-SoS 2016.",
                    "Workshop message: Smart Vehicles 2016.",
                    "Workshop message: 5GB2P 2016.",
                    "Workshop message: CORAL 2016.",
                    "Should I seed or should I not: On the remuneration of seeders in D2D offloading.",
                    "Have you asked your neighbors? A Hidden Market approach for device-to-device offloading.",
                    "Tie-breaking can maximize fairness without sacrificing throughput in D2D-assisted networks.",
                    "Reliable and bidirectional camera-display communications with smartphones.",
                    "Revisiting 802.11 power consumption modeling in smartphones.",
                    "Performance evaluation of an intention sharing MAC scheme in wireless LANs with hidden nodes.",
                    "Evaluation of the IEEE 802.11ah Restricted Access Window mechanism for dense IoT networks.",
                    "MAC design on real 802.11 devices: From exponential to Moderated Backoff.",
                    "How beneficial is the WiFi offloading? A detailed game-theoretical analysis in wireless oligopolies.",
                    "Buddies, not enemies: Fairness and performance in cellular offloading.",
                    "Storage on wheels: Offloading popular contents through a vehicular cloud.",
                    "Dynamic and cooperative mobile video streaming across heterogeneous cellular networks.",
                    "NEWCAST: Anticipating resource management and QoE provisioning for mobile video streaming.",
                    "SWAP: Protecting pull-based P2P video streaming systems from inference attacks.",
                    "Security threat assessment of simultaneous multiple Denial-of-Service attacks in IEEE 802.22 Cognitive Radio networks.",
                    "ResFi: A secure framework for self organized Radio Resource Management in residential WiFi networks.",
                    "Xcastor: Secure and scalable group communication in ad hoc networks.",
                    "Downlink transmit power setting in LTE HetNets with carrier aggregation.",
                    "Jamming and advanced modular-based blind rendezvous algorithms for Cognitive Radio Networks.",
                    "Bundling of DSL resources in home environments.",
                    "An architecture for sender-based addressing for selective sensor network wake-up receivers.",
                    "A Model-based Beacon Scheduling algorithm for IEEE 802.15.4e TSCH networks.",
                    "Experimental evaluation of interference impact on the energy consumption in Wireless Sensor Networks.",
                    "EcoSensor: Monitoring environmental pollution using mobile sensors.",
                    "Learning from experience: Efficient decentralized scheduling for 60GHz mesh networks.",
                    "Energy efficient line-of-sight millimeter wave small cell backhaul: 60, 70, 80 or 140 GHz?",
                    "Packet mass transit: Improving frame aggregation in 60 GHz networks.",
                    "Exploiting mobility prediction for mobility & popularity caching and DASH adaptation.",
                    "Device-free indoor localization and tracking through Human-Object Interactions.",
                    "Hybrid indoor localization using multiple Radio Interfaces.",
                    "Enabling crowdsourced live event coverage with adaptive collaborative upload strategies.",
                    "WiseHAUL: An SDN-empowered Wireless Small Cell Backhaul testbed.",
                    "How video streaming consumes power in 4G LTE networks.",
                    "Energy-efficient cluster-based protocol using an adaptive data aggregative window function (A-DAWF) for wireless sensor networks.",
                    "Wireless bandwidth management for multiple video clients through network-assisted DASH.",
                    "An EXperimental Hybrid wIrelesS platform for vehicular networks.",
                    "On the authentication of devices in the Internet of things.",
                    "LVS: A WiFi-based system to tackle Location Spoofing in location-based services.",
                    "Performance analysis of cooperative ARQ systems for wireless industrial networks.",
                    "The SIMulation project: Demonstrating mobile payments based on cloud services.",
                    "An autonomous diagnostic tool for the WirelessHART industrial standard.",
                    "Measuring and assessing mobile broadband networks with MONROE.",
                    "Cross-technology wireless experimentation: Improving 802.11 and 802.15.4e coexistence.",
                    "When is the right time to transmit in multi-hop White-Fi?",
                    "Enhanced Ultrawideband methods for 5G LOS sufficient positioning and mitigation.",
                    "Busy Tone based Prioritized Access for distributed wireless networks.",
                    "Asynchronous reputation systems in device-to-device ecosystems.",
                    "Resilient SDN based small cell backhaul networks using mmWave bands.",
                    "A SDN controller architecture for Small Cell Wireless Backhaul using a LTE Control Channel.",
                    "Towards content delivery optimization in future wireless networks.",
                    "Personal cloud interoperability.",
                    "An open, NFC enabler independent Mobile payment and identification method: NFC feature box.",
                    "Multi-copy data dissemination with probabilistic delay constraint in mobile opportunistic device-to-device networks.",
                    "A joint relay selection and buffer management scheme for delivery rate optimization in DTNs.",
                    "GSAF: Efficient and flexible geocasting for opportunistic networks.",
                    "Routing in Delay Tolerant Networks with fine-grained contact characterisation and dynamic message replication.",
                    "Zephyr: First-person wireless analytics from high-density in-stadium deployments.",
                    "Application recommendation at places for mobile users.",
                    "Population estimation from mobile network traffic metadata.",
                    "Feasibility and accuracy of hotword detection using vibration energy harvester.",
                    "QoE aware video content adaptation and delivery.",
                    "Markov analysis of video transmission based on differential encoded HARQ.",
                    "A novel parallelized motion estimation algorithm for GPU based video encoding.",
                    "Towards quantifying the cost of a secure IoT: Overhead and energy consumption of ECC signatures on an ARM-based device.",
                    "Cyber security of smart grids modeled through epidemic models in cellular automata.",
                    "A practical implementation of an adaptive Compressive Sensing encryption scheme.",
                    "QR code based mutual authentication protocol for Internet of Things.",
                    "Semantic-based context modeling for quality of service support in IoT platforms.",
                    "IoT interoperability for actuating applications through standardised M2M communications.",
                    "Throughput analysis of smart objects with delay constraints.",
                    "RescuePal: A smartphone-based system to discover people in emergency scenarios.",
                    "Traffic situation estimator for Adaptive Cruise Control.",
                    "A study on identification of laser-tracked vehicles using V2V-based velocity information.",
                    "Indoor localization of vehicles using Deep Learning.",
                    "Statistics of parked cars for urban vehicular networks.",
                    "Fair distributed Congestion Control with transmit power for vehicular networks.",
                    "Impact of decentralized congestion control on contention-based forwarding in VANETs.",
                    "Evolution of vehicular congestion control without degrading legacy vehicle performance.",
                    "Integrating connected vehicles in Internet of Things ecosystems: Challenges and solutions.",
                    "Introducing a harmonized and generic cross-platform interface between a Vehicle and the Cloud.",
                    "Cooperative ITS security framework: Standards and implementations progress in Europe.",
                    "Network coding: Connections between information theory and estimation theory.",
                    "Wideband self-interference cancellation for better spectrum use.",
                    "Beacons in dense Wi-Fi networks: How to befriend with neighbors in the 5G world?",
                    "Experimental validations of bandwidth compressed multicarrier signals.",
                    "Analyses of orthogonal and non-orthogonal steering vectors at millimeter wave systems.",
                    "Code mobility for on-demand computational offloading.",
                    "Spatial locality in pocket switched networks.",
                    "Virtualization at the network edge: A performance comparison.",
                    "Analysis and implementation of a wavelet based spectrum sensing method for low SNR scenarios.",
                    "Non-integer bit estimation for enhanced inter-picture prediction in H.265/HEVC.",
                    "Measurement-based study on the influence of localization errors on estimated shadow correlations.",
                    "A portable Wireless Sensor Network system for real-time environmental monitoring."
                ]
            }
        ]
    },
    {
        "year": "2015",
        "name": "16th WOWMOM 2015",
        "info": "Boston, MA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2015",
                "sub_name": "16th IEEE International Symposium on A World of Wireless, Mobile and Multimedia Networks, WoWMoM 2015, Boston, MA, USA, June 14-17, 2015.",
                "count": 102,
                "papers": [
                    "Keynote 1: Converged Internet and Broadcast media delivery.",
                    "Keynote 2: Smart-Sensing using Smart-Sensors.",
                    "Green video delivery in LTE-based heterogeneous cellular networks.",
                    "QoE-aware optimization for video delivery and storage.",
                    "Mobile HTTP-based streaming using flexible LTE base station control.",
                    "Network architecture supporting seamless flow mobility between LTE and WiFi networks.",
                    "A hybrid centralized-distributed mobility management architecture for Network Mobility.",
                    "Handover triggering in IEEE 802.11 networks.",
                    "Offload (only) the right jobs: Robust offloading using the Markov decision processes.",
                    "Towards optimal priority and deadline driven scheduling in dynamic wireless environments.",
                    "Minimum delay scheduling with multi-packet transmission in wireless networks.",
                    "Lifetime optimization with QoS of sensor networks with uncontrollable mobile sinks.",
                    "Analysis of deployment and movement policies in wireless sensor and robot networks.",
                    "Water flow Driven Sensor Networks for leakage and contamination monitoring.",
                    "Ripple: High-throughput, reliable and energy-efficient network flooding in wireless sensor networks.",
                    "Adaptive broadcast suppression for Trickle-based protocols.",
                    "Joint compressive data gathering and scheduling in wireless sensor networks under the physical interference model.",
                    "Content-centric routing in Wi-Fi direct multi-group networks.",
                    "EdgeBuffer: Caching and prefetching content at the edge in the MobilityFirst future Internet architecture.",
                    "TCCN: Tag-assisted Content Centric Networking for Internet of Things.",
                    "On 3-dimensional spectrum sharing for TV white and Gray Space networks.",
                    "Re-thinking compliance enforcement: Investigating random spectrum sampling techniques for temporal occupancy characterization.",
                    "Floating band D2D: Exploring and exploiting the potentials of adaptive D2D-enabled networks.",
                    "Scalability of Machine to Machine systems and the Internet of Things on LTE mobile networks.",
                    "Ambient Control: A mobile framework for dynamically remixing the Internet of Things.",
                    "Prefix coding of hierarchical categories for publish-subscribe in mobile wireless environments.",
                    "ReNLoc: An anchor-free localization algorithm for indirect ranging.",
                    "Cooperation among smartphones to improve indoor position information.",
                    "A passive WiFi source localization system based on fine-grained power-based trilateration.",
                    "Privacy-preserving routing in delay tolerant networks based on Bloom filters.",
                    "In the shadows we trust: A secure aggregation tolerant watermark for data streams.",
                    "The verifier bee: A path planner for drone-based secure location verification.",
                    "Comparing alternative approaches for mobile content delivery in information-centric networking.",
                    "A cell biology inspired data packet forwarding scheme in mobile ad-hoc networks.",
                    "Towards an evolvable cellular architecture.",
                    "Design of a lightweight control plane for supporting MAC and routing in industrial WSNs.",
                    "An analytic evaluation of the Trickle algorithm: Towards efficient, fair, fast and reliable data dissemination.",
                    "NetTomo: A tomographic approach towards network diagnosis.",
                    "WiFo: A diagnostic tool for IEEE 802.11 MAC.",
                    "On the map accuracy required for network simulations based on ray launching.",
                    "Social Cognitive Heuristics for adaptive data dissemination in Opportunistic Networks.",
                    "HiPCV: History based learning model for predicting contact volume in Opportunistic Networks.",
                    "Mobile network resource optimization under imperfect prediction.",
                    "Analysis of MAC-level throughput in LTE systems with link rate adaptation and HARQ protocols.",
                    "Service differentiation for improved cell capacity in LTE networks.",
                    "Sharing low-cost wireless infrastructures with telecommunications operators for backhauling 3G services in deprived rural areas.",
                    "Navigo: Interest forwarding by geolocations in vehicular Named Data Networking.",
                    "Lightweight clustering of spatio-temporal data in resource constrained mobile sensing.",
                    "Coop-DMAC: A Cooperative Directional MAC protocol for wireless networks.",
                    "Impact of country-scale Internet disconnection on structured and social P2P overlays.",
                    "Smartphone users mobile networks quality provision and VoLTE intend: Six-months field study.",
                    "Reliable videos broadcast with network coding and coordinated multiple Access Points.",
                    "U-TV: User-centric scalable DTV broadcast over heterogeneous wireless networks.",
                    "Multi-level sample importance ranking based progressive transmission strategy for time series body sensor data.",
                    "An analysis of opportunistic forwarding for correlated wireless channels.",
                    "Impact of network monitoring in IEEE 802.15.4e-based wireless sensor networks.",
                    "Magemite: Character inputting system based on magnetic sensor.",
                    "Towards a framework for cross layer incentive mechanisms for multihop video dissemination.",
                    "An integrated simulation environment for Wireless Sensor Networks.",
                    "Autonomous mobile agent based intrusion detection framework in wireless body area networks.",
                    "Transition-enabled event dissemination for pervasive mobile multiplayer games.",
                    "A demonstration for content delivery on Wi-Fi Direct enabled devices.",
                    "WARPsim: A code-transparent network simulator for WARP devices.",
                    "A software tool for coverage planning through different applications of optimal spatial interpolation.",
                    "APP and PHY in harmony: Demonstrating scalable video streaming supported by flexible physical layer control.",
                    "Anticipatory quality adaptation for mobile streaming: Fluent video by channel prediction.",
                    "Inferring content-centric traffic for opportunistic networking from geo-location Social Networks.",
                    "Inter-Session Network Coding in Delay Tolerant Mobile Social Networks: An empirical study.",
                    "Characterizing opportunistic communication with churn for crowd-counting.",
                    "The design of a generalised approach to the programming of systems of systems.",
                    "Computational ferrying: Challenges in deploying a Mobile High Performance Computer.",
                    "A Markov chain model for drop ratio on one-packet buffers DTNs.",
                    "Socially-aware content retrieval using random walks in Disruption Tolerant Networks.",
                    "Rendezvous in cognitive radio ad-hoc networks with asymmetric channel view.",
                    "Fusion based spectrum decision framework for cognitive radio users.",
                    "Unified approach for performance analysis of Cognitive Radio Spectrum Sensing over correlated multipath fading channels.",
                    "A multi-channel spectrum sensing scheme with filter bank realization for LTE signals.",
                    "Feasibility study on application of impulse-UWB for control channel in Cognitive Radio networks.",
                    "Underlay multi-hop cognitive networks with orthogonal access.",
                    "A weighted diversity combining technique for cyclostationarity detection based spectrum sensing in cognitive radio networks.",
                    "Spectrum sensing based on Maximum Eigenvalue approximation in cognitive radio networks.",
                    "An experimental study on the statistical properties of radio environment noise.",
                    "Sub-Nyquist rate wideband spectrum sensing over TV white space for M2M communications.",
                    "Rational coordination of crowdsourced resources for geo-temporal request satisfaction.",
                    "An IEEE 802.11ah programmable modem.",
                    "Performance analysis of IoT-enabling IEEE 802.11ah technology and its RAW mechanism with non-cross slot boundary holding schemes.",
                    "Cost-efficient universal approach for remote meter reading using web services and computer vision.",
                    "PhyNetLab: Architecture design of ultra-low power Wireless Sensor Network testbed.",
                    "Experiments with security and privacy in IoT networks.",
                    "Highly scalable fair contention resolution scheme based on idle time.",
                    "Performance evaluation of a mixed vehicular network with CAM-DCC and LIMERIC vehicles.",
                    "Opportunistic calibration of smartphone orientation in a vehicle.",
                    "V2X data dissemination delay for vehicular traffic density estimations.",
                    "Min-max fair car-parking slot assignment.",
                    "Taxi-cab cloud architecture to offload data traffic from cellular networks.",
                    "Throughout analysis of IEEE 802.11p-based multi-hop V2I communications.",
                    "A fail safe broadcast protocol for collaborative intelligent vehicles.",
                    "HEVC decoder optimization in low power configurable architecture for wireless devices.",
                    "LiTMaS: Live road traffic maps for smartphones.",
                    "An adaptation mechanism for robust OTT video transmission.",
                    "Multi-source mobile video streaming with proactive caching and D2D communication.",
                    "Streaming 4K/UHD video to the rest of us: Can bandwidth sharing help?"
                ]
            }
        ]
    },
    {
        "year": "2014",
        "name": "15th WOWMOM 2014",
        "info": "Sydney, Australia",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2014",
                "sub_name": "Proceeding of IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WoWMoM 2014, Sydney, Australia, June 19, 2014.",
                "count": 111,
                "papers": [
                    "Extending the JCR standard to work efficiently in mobile RCS environments.",
                    "Temporal Synchronization Scheme in live 3D video streaming over IEEE 802.11 wireless networks.",
                    "D-MHR: A distributed management scheme for hybrid networks to provide real-time industrial wireless automation.",
                    "Opportunistic beamforming for finite horizon multicast.",
                    "Cooperation among access points for enhanced quality of service in dense wireless environments.",
                    "Machine learning-based jamming detection for IEEE 802.11: Design and experimental evaluation.",
                    "RF interference to DVB-T reception from multiple LTE devices in adjacent bands.",
                    "A Pub/Sub extension to NDN for efficient data collection and dissemination in V2X networks.",
                    "An optimal model to partition the evolution of periodic tasks in wireless sensor networks.",
                    "On the local popularity impact on object replica placement over WMNs.",
                    "OpenDaylight: Towards a Model-Driven SDN Controller architecture.",
                    "ILPS: Indoor localization using physical maps and smartphone sensors.",
                    "Detection and resolution of ineffective function behavior in Self-Organizing Networks.",
                    "Padova Smart City: An urban Internet of Things experimentation.",
                    "Improving broadcast efficiency of irresponsible forwarding with random linear coding at source.",
                    "FIDES: A trust-based framework for secure user incentivization in participatory sensing.",
                    "Wireless information and power transfer for communication recovery in disaster areas.",
                    "Should operators switch-off their legacy infrastructure or re-purpose it for M2M?",
                    "eSMART: Energy-efficient Scalable Multimedia Broadcast for heterogeneous users.",
                    "Toward the Internet of Things application and management: A practical approach.",
                    "Agent-enabled anomaly detection in resource constrained wireless sensor networks.",
                    "Crowdsourced smartphone sensing for localization in metro trains.",
                    "On placement of multiple sinks in wireless sensor networks.",
                    "One-hop vs. multi-hop broadcast protocol for DSRC safety applications.",
                    "Corridor-based routing: Opening doors to PHY-layer advances for Wireless Multihop Networks.",
                    "Lightweight security protocol for Wireless Sensor Networks.",
                    "CA-Fi: Ubiquitous mobile wireless networking without 802.11 overhead and restrictions.",
                    "Improving beacon dissemination in VANETs - A cyber-physical system based design.",
                    "Opportunistic routing for live video streaming in vehicular ad hoc networks.",
                    "Toward realistic WiFi simulation with smartphone \"Physics\".",
                    "Disaster resilient communication for tunnels and bridges.",
                    "Opportunistic routing for multi-flow video dissemination over Flying Ad-Hoc Networks.",
                    "Channel impulse response estimation in IEEE 802.11p via data fusion and group orthogonal matching pursuit.",
                    "Security for medical sensor networks in mobile health systems.",
                    "Proactive routing overhead in Mobile Ad-hoc Networks.",
                    "ISA100.11a∗: The ISA100.11a extension for supporting energy-harvested I/O devices.",
                    "Proactive risk mitigation for communication network resilience in disaster scenarios.",
                    "Adaptive protocols for Nano-scale Sensor Networks over composition varying channels.",
                    "Trading public parking space.",
                    "TCP-aware scheduling in LTE networks.",
                    "Trickle-L2: Lightweight link quality estimation through Trickle in RPL networks.",
                    "CONNECT: Consociating opportunistic network neighbors for constructing a consistent and connected virtual backbone.",
                    "LTE-Advanced fair intelligent admission control LTE-FIAC.",
                    "Revisited: Bandwidth estimation methods for mobile networks.",
                    "SDN-based solutions for Moving Target Defense network protection.",
                    "Finding a small set of high degree nodes in time-varying graphs.",
                    "On local cache management strategies for Mobile Augmented Reality.",
                    "OSCAR: Object security architecture for the Internet of Things.",
                    "Large scale characterisation of YouTube requests in a cellular network.",
                    "EFFECT: An energy efficient framework for data compression in tree-based wireless sensor networks.",
                    "Autonomic control of network sensing quality with situational assessment.",
                    "Increasing opportunistic gain in small cells through base station-driven traffic spreading.",
                    "Temporal verification of mobile publish/subscribe machine-to-machine communications.",
                    "Playback continuity driven cross-layer design for HTTP streaming in LTE systems.",
                    "Channel dynamics matter: Forwarding node set selection in cognitive radio networks.",
                    "Proxy support for service discovery using mDNS/DNS-SD in low power networks.",
                    "Towards dynamic QoS-aware over-the-top video streaming.",
                    "An analytical model of network connectivity in Vehicular Ad Hoc Networks using spatial point processes.",
                    "Mitigating Blackhole attacks in a hybrid VDTN.",
                    "High availability for Non-stop network controller.",
                    "Temporal random walk as a lightweight communication infrastructure for opportunistic networks.",
                    "SpaceOS: Operating system services for smart computing environments.",
                    "Adaptive delay-tolerant scheduling for efficient cellular and WiFi usage.",
                    "Energy-aware adaptive security management for wireless sensor networks.",
                    "Understanding differences in MAC performance.",
                    "Multihop backpressure scheduling for IEEE 802.11s multiradio cognitive wireless mesh networks.",
                    "Securing the control channel of software-defined mobile networks.",
                    "E$PA: Energy, usage ($), and performance-aware LTE-WiFi adaptive activation scheme for smartphones.",
                    "Movement patterns for mobile networks in disaster scenarios.",
                    "Collaborative bandwidth sharing for resilient communication during a disaster.",
                    "Privacy in opportunistic network contact graphs.",
                    "A P2P based usage control enforcement scheme resilient to re-injection attacks.",
                    "Remote node reconfiguration in opportunistic data collection wireless sensor networks.",
                    "User experience on heterogenous Liquid Galaxy cluster display walls.",
                    "Finding 9-1-1 callers in tall buildings.",
                    "HEIR: Heterogeneous interference recognition for wireless sensor networks.",
                    "A distributed web-based naming system for smart buildings.",
                    "Evolve carrier ethernet architecture with SDN and segment routing.",
                    "ColStream: Collaborative streaming of on-demand videos for mobile devices.",
                    "Frequency hopping strategies for improving terahertz sensor network performance over composition varying channels.",
                    "How did you get here? PHY-layer path signatures.",
                    "Distributed link scheduling in wireless networks with interference cancellation capabilities.",
                    "Energy-aware routing algorithms in Software-Defined Networks.",
                    "Dynamic coding for TCP transmission reliability in multi-hop wireless networks.",
                    "Social-aware forwarding in opportunistic wireless networks: Content awareness or obliviousness?",
                    "Runtime service recovery for open information gateway.",
                    "Efficient proactive caching for supporting seamless mobility.",
                    "SPECTA: A formal specification language for content transfer algorithms.",
                    "A flexible, subjective logic-based framework for misbehavior detection in V2V networks.",
                    "A novel queue length aware distributed link scheduler for multi-transmit receive Wireless Mesh Networks.",
                    "Impact of beaconing policies on traffic density estimation accuracy in traffic information systems.",
                    "Social cooperation for information-centric multimedia streaming in highway VANETs.",
                    "Optimal controller placement in Software Defined Networks (SDN) using a non-zero-sum game.",
                    "Practical Interference alignment in the frequency domain for OFDM-based wireless access networks.",
                    "Component-based modelling for sustainable and scalable smart meter networks.",
                    "Personalizing the home network experience using cloud-based SDN.",
                    "Quality-oriented incentive mechanism for video delivery in opportunistic networks.",
                    "Pervasive content-centric wireless networking.",
                    "A dynamic security traversal mechanism for providing deterministic delay guarantee in SDN.",
                    "Staying within the budget: Efficient probing strategies in opportunistic networks.",
                    "Cognition-based networks: Applying cognitive science to multimedia wireless networking.",
                    "The effect of in-situ underwater acoustic speed on localization of submerged sensors.",
                    "HyCloud: A system for device-to-device content distribution controlled by the cloud.",
                    "A Markov analysis of automatic repeat request for video traffic transmission.",
                    "Cross layer routing for VANETs.",
                    "CARD: Context-Aware Resource Discovery for mobile Internet of Things scenarios.",
                    "Access Point selection game for mobile wireless users.",
                    "On scheduling live media streaming in the cloud - A study.",
                    "Multihop transmission and retransmission measurement of real-time video streaming over DSRC devices.",
                    "Advancing M2M communications management: A cloud-based system for cellular traffic analysis.",
                    "A distributed mechanism for dynamic resource trading in cooperative mobile video streaming."
                ]
            }
        ]
    },
    {
        "year": "2013",
        "name": "14th WOWMOM 2013",
        "info": "Madrid, Spain",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2013",
                "sub_name": "IEEE 14th International Symposium on \"A World of Wireless, Mobile and Multimedia Networks\", WoWMoM 2013, Madrid, Spain, June 4-7, 2013.",
                "count": 149,
                "papers": [
                    "Enhanced multi-domain access control for secure mobile collaboration through Linked Data cloud in manufacturing.",
                    "Performance evaluation of the IEEE 802.11aa multicast mechanisms for video streaming.",
                    "Welcome message from the D-SPAN 2013 chairs.",
                    "Exploiting smart antennas for spatial reuse and multiplexing in wireless mesh networks.",
                    "Cross Technology Interference Mitigation in Body-to-Body Area Networks.",
                    "Applying delay tolerant networking routing algorithms in maritime communications.",
                    "Towards a secure and privacy-preserving multi-service vehicular architecture.",
                    "Cost minimizing inter-sensing duration in Cognitive Radio Networks.",
                    "Virtualized multihop access networks for disaster recovery.",
                    "Personalised 3D navigation and understanding of Geo-referenced Scenes.",
                    "Autonomic cognitive-based data dissemination in Opportunistic Networks.",
                    "Evaluation of hybrid Scalable Video Coding for HTTP-based adaptive media streaming with high-definition content.",
                    "Social things - The SandS instantiation.",
                    "Toward a context-aware and automatic evaluation of elderly dependency in smart homes and cities.",
                    "Social-tie-based information dissemination in mobile opportunistic social networks.",
                    "An active low cost mesh networking indoor tracking system.",
                    "A novel characteristic correlation approach for aggregating data in wireless sensor networks.",
                    "Encoding and communication energy consumption trade-off in H.264/AVC based video sensor network.",
                    "An energy-efficient routing scheme using Backward Traffic Difference estimation in cognitive radio networks.",
                    "Simulation-based performance study of YouTube service in 3G LTE.",
                    "An analytical evaluation of a Map-based Sensor-data Delivery Protocol for VANETs.",
                    "Safe urban growth: An integrated ICT solution for unstandardized and distributed information handling.",
                    "Virtual Object access rights to enable multi-party use of sensors.",
                    "On the application of pipelining in aggregation convergecast scheduling.",
                    "Experience from testbeds and management platforms towards mesh networking with heterogeneous wireless access.",
                    "On the improvement of receiver-initiated MAC protocols for WSNs by applying scheduling.",
                    "The M2M promise, what could make it happen?",
                    "Welcome message from the IoT-SoS 2013 chairs.",
                    "Deploying applications with Community-Lab in wireless community networks.",
                    "Authorization framework for the Internet-of-Things.",
                    "Smart parking solutions for urban areas.",
                    "A topology control mechanism for cognitive smallcell networks under heterogeneous traffic.",
                    "Application of the LSPI reinforcement learning technique to a co-located network negotiation problem.",
                    "Interference-aware wireless mesh networks.",
                    "Support service for reciprocal computational resource sharing in wireless community networks.",
                    "Collision-free jamming for enhanced wireless secrecy.",
                    "Spectrum sharing and impact on spectrum handoff in multi-channel cognitive radio networks.",
                    "Understanding, modeling and taming mobile malware epidemics in a large-scale vehicular network.",
                    "Analysis of PHY/application cross-layer optimization for scalable video transmission in cellular networks.",
                    "SPRINT: Social prediction-based opportunistic routing.",
                    "Towards new routing solutions for wireless industrial networks.",
                    "Welcome message from the VidEv 2013 chairs.",
                    "Delay-conscious caching scheme for energy-efficient video streaming.",
                    "Time synchronization in the DHT-based P2P network Kad for real-time automation scenarios.",
                    "Kurento: a media server technology for convergent WWW/mobile real-time multimedia communications supporting WebRTC.",
                    "Discovering and predicting user routines by differential analysis of social network traces.",
                    "Assessing vehicular density estimation using vehicle-to-infrastructure communications.",
                    "Performance and energy efficiency of mobile data offloading with mobility prediction and prefetching.",
                    "Recouping opportunistic gain in dense base station layouts through energy-aware user cooperation.",
                    "ANN-based appliance recognition from low-frequency energy monitoring data.",
                    "Practical OFDMA in wireless networks with multiple transmitter-receiver pairs.",
                    "Opportunistic forwarding with hotspot entropy.",
                    "Decoupling context management and application logic: A new framework.",
                    "Finding more efficient multipoint relay set to reduce topology control traffic of OLSR.",
                    "Decision tree modeling for video routing in cognitive radio mesh networks.",
                    "Optimising QoS of VoIP over wireless LANs via synchronized time.",
                    "A self-organized message ferrying algorithm.",
                    "WiFiPi: Involuntary tracking of visitors at mass events.",
                    "Practical node policing in 802.11WLANs.",
                    "Design and analysis of virtualization framework for Wireless Sensor Networks.",
                    "Sustainable smart city IoT applications: Heat and electricity management & Eco-conscious cruise control for public transportation.",
                    "Multi-band spectrum selection framework based on partial observations.",
                    "BASICS: Scheduling base stations to mitigate interferences in cellular networks.",
                    "A cognitive-based solution for semantic knowledge and content dissemination in opportunistic networks.",
                    "Welcome message from the WoWMoM 2013 workshops chairs.",
                    "Traffic adaptive channel switching with time slice based predictors.",
                    "Lossless compression technique for the fronthaul of LTE/LTE-advanced cloud-RAN architectures.",
                    "Open services for IoT cloud applications in the future internet.",
                    "Spatial correlation model for heterogeneous cameras in wireless multimedia sensor networks.",
                    "Confidentiality and availability issues in Mobile Unattended Wireless Sensor Networks.",
                    "Receiver-driven routing for community mesh networks.",
                    "A successive coordinated power allocation water-filling algorithm for heterogeneous OFDMA cellular systems.",
                    "On the design of robust and adaptive IEEE 802.11 multicast services for video transmissions.",
                    "WIDAR: Bistatic WI-fi Detection And Ranging for off-the-shelf devices.",
                    "Welcome message from the SCUCA 2013 chairs.",
                    "Decentralized Traffic Aware Scheduling for multi-hop Low power Lossy Networks in the Internet of Things.",
                    "Exploiting platform heterogeneity in wireless sensor networks by shifting resource-intensive tasks to dedicated processing nodes.",
                    "Performance evaluation of single-chip spectrum sensing platform for portable spectrum measurements.",
                    "Efficient symbol-level transmission in error-prone wireless networks.",
                    "Optimal hibernation policies for energy efficient stateful operation in high-end wireless sensor nodes.",
                    "Link quality based forwarder selection strategies for reliable Network-Wide Broadcasts.",
                    "Malicious traffic analysis in wireless sensor networks using advanced signal processing techniques.",
                    "Evaluating user-centric multihomed flow management in multi-user scenarios.",
                    "Towards a web of sensors built with linked data and REST.",
                    "Welcome message from the WoWMoM 2013 General Chair.",
                    "On the limits of DTN monitoring.",
                    "RFRA: Random Forests Rate Adaptation for vehicular networks.",
                    "TheWorld is not flat: Wireless communications in 3D environments.",
                    "Offloading Floating Car Data.",
                    "A Cluster-Aware Soft Frequency Reuse scheme for inter-cell interference mitigation in LTE based femtocell networks.",
                    "Efficient PHY layer security in MIMO-OFDM: Spatiotemporal selective artificial noise.",
                    "A blueprint for switching between secure routing protocols in wireless multihop networks.",
                    "A perceptual study into the behaviour of autonomous agents within a virtual urban environment.",
                    "QoS-aware greening of interference-limited cellular networks.",
                    "A delay prediction based content and channel aware packet scheduler for real-time video over HSDPA.",
                    "Geo-location database based TV white space for interference mitigation in LTE femtocell networks.",
                    "Novel channel tracking and equalization methods in MU-MIMO-OFDM systems.",
                    "Software tool for assessing secondary system opportunities in spectrum whitespaces.",
                    "Welcome message from the HotMesh 2013 chairs.",
                    "Performance quality evaluation with VoIP traffic aggregation in Mobile Ad-Hoc Networks.",
                    "Energy-efficient wi-fi gateways for federated residential networks.",
                    "Malleability resilient (premium) Concealed Data Aggregation.",
                    "Characterization of wireless propagation in complex indoor scenarios.",
                    "Blind non-parametric statistics for multichannel detection based on statistical covariances.",
                    "Aggregation-aware routing in wireless multi-hop networks with frame aggregation.",
                    "Preventing wireless network configuration errors in patient monitoring using device fingerprints.",
                    "Analysis and simulation of the CLTD feedback from the Multiflow assisting cell.",
                    "An interoperable architecture for mobile smart services over the internet of energy.",
                    "A linear-time algorithm for optimal multi-channel access in Cognitive Radio Networks.",
                    "Large scale analysis of HTTP Adaptive Streaming in mobile networks.",
                    "A logistic regression approach to location classification in OFDMA-based FFR systems.",
                    "Mobility management in next generation mobile networks.",
                    "Enabling vehicular networking in the MobilityFirst future internet architecture.",
                    "i-POCA: Interference-aware partially overlapping channel assignment in 802.11-based meshes.",
                    "Improving WiFi networking with concurrent connections and multipath TCP.",
                    "ROAM: Supporting safety critical applications in MANETs with cross-layer middleware.",
                    "Energy aware software evolution for Wireless Sensor Networks.",
                    "SIP over Next Generation mobile ad hoc networks (MANETs).",
                    "White space detection and spectrum characterization in urban and rural India.",
                    "Impact of the control-channel transmission rate in a multi-channel wireless network.",
                    "A flexible multi-criteria scheme to detect primary user emulation attacks in CRAHNs.",
                    "Welcome message from the WoWMoM 2013 program chairs.",
                    "Secure and efficient handover protocols for WMNs.",
                    "A tunable framework for performance evaluation of spectrum sharing in LTE networks.",
                    "DroidOppPathFinder: A context and social-aware path recommender system based on opportunistic sensing.",
                    "Impact of TCP congestion control on bufferbloat in cellular networks.",
                    "Distributed RF sensing framework with radio environment emulation.",
                    "Exploiting context information for V2X dissemination in vehicular networks.",
                    "Architecture of a Self Configuration Framework for 802.11-based multi-radio Mesh Networks.",
                    "Robust and efficient data collection schemes for vehicular multimedia sensor Networks.",
                    "Experiences with performance tradeoffs in practical, continuous indoor localization.",
                    "Using geographical coordinates to attain efficient route signaling in ad hoc networks.",
                    "A packet encoding algorithm for network coding with multiple next hop neighbor consideration and its integration with delta routing.",
                    "A comparative simulation of opportunistic routing protocols using realistic mobility data obtained from mass events.",
                    "Assessing QoS trade-offs for real-time video.",
                    "Performance optimization of WSNs using external information.",
                    "Welcome message from the CORAL 2013 chairs.",
                    "Dissecting mobile video services: An energy consumption perspective.",
                    "Efficiency or fairness: Managing applications with different delay sensitivities in heterogeneous wireless networks.",
                    "Vehicle tracking using vehicular network beacons.",
                    "Performance study of Internet traffic on high speed railways.",
                    "A practical experience on radio backhaul for small cells.",
                    "Track me if you can: Transparent obfuscation for Location based Services.",
                    "Approximation algorithms for Interference Aware Broadcast in wireless networks.",
                    "Novel adaptive Channel State Information feedback for multiuser MIMO in wireless broadband communications.",
                    "Location privacy in vehicular networks.",
                    "Performance-aware congestion control in Wireless Sensor Networks using resource control.",
                    "Energy efficient dynamic MANET on-demand (E2DYMO) routing protocol.",
                    "MORFEO: Saving energy in wireless access infrastructures."
                ]
            }
        ]
    },
    {
        "year": "2012",
        "name": "13th WOWMOM 2012",
        "info": "San Francisco, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2012",
                "sub_name": "2012 IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WoWMoM 2012, San Francisco, CA, USA, June 25-28, 2012.",
                "count": 130,
                "papers": [
                    "Message from the general chair.",
                    "2012 IEEE international symposium on a world of wireless, mobile, and multimedia networks WoWMoM.",
                    "Message from the workshops chairs.",
                    "Message from the workshop chairs.",
                    "Welcome message from the CORAL 2012 chairs.",
                    "Message from the workshop chairs.",
                    "Welcome message from the HotMesh 2012 chairs.",
                    "Message from the workshop chairs.",
                    "Welcome message from the VTP 2012 Chairs.",
                    "Welcome message from the VidEv 2012 chairs.",
                    "An analysis of the information spreading delay in heterogeneous mobility DTNs.",
                    "An arrival-based framework for human mobility modeling.",
                    "Analysis of the Early Flow Discard (EFD) discipline in 802.11 wireless LANs.",
                    "CBFR: Bloom filter routing with gradual forgetting for tree-structured wireless sensor networks with mobile nodes.",
                    "CRAWLER: An experimentation platform for system monitoring and cross-layer-coordination.",
                    "Collision-free medium access based on traffic forecasting.",
                    "Cost-efficient sensor deployment in indoor space with obstacles.",
                    "Curve-based planar graph routing with guaranteed delivery in multihop wireless networks.",
                    "ECTX: A high-throughput path metric for multi-hop wireless routing exploiting MAC-layer cooperative retransmission.",
                    "Edge-prioritized channel- and traffic-aware uplink Carrier Aggregation in LTE-advanced systems.",
                    "Efficient channel selection using hierarchical clustering.",
                    "Enhancing QoS of voice over WLANs.",
                    "Enhancing the performance of safety applications in IEEE 802.11p/WAVE Vehicular Networks.",
                    "Experimental evaluation of measurement-based SINR interference models.",
                    "Experimental evaluation of TCP performance in multi-rate 802.11 WLANs.",
                    "Exploiting the capture effect to improve WLAN throughput.",
                    "FLEXOR: User friendly wireless sensor network development and deployment.",
                    "Hermes: A versatile platform for wireless embedded systems.",
                    "I know who you will meet this evening! Linking wireless devices using Wi-Fi probe requests.",
                    "Improving link prediction in intermittently connected wireless networks by considering link and proximity stabilities.",
                    "Improving packet reception rate for mobile sinks in wireless sensor networks.",
                    "Long-term indoor propagation models for radio resource management.",
                    "Network Aware Caching for Video on Demand systems.",
                    "Non-equilibrium information envelopes and the capacity-delay-error-tradeoff of source coding.",
                    "On the cost/delay tradeoff of wireless delay tolerant geographic routing.",
                    "PRICE: Privacy preserving incentives for cooperation enforcement.",
                    "Performance analysis of a hierarchical discovery protocol for WSNs with Mobile Elements.",
                    "Performance modeling of multicast with network coding in multi-channel multi-radio wireless mesh networks.",
                    "Predictive buffering for streaming video in 3G networks.",
                    "STOP: Socio-Temporal Opportunistic Patching of short range mobile malware.",
                    "To cloud or not to cloud: A mobile device perspective on energy consumption of applications.",
                    "Tree-based multi-channel convergecast in Wireless Sensor Networks.",
                    "A case for MANET-aware content centric networking of smartphones.",
                    "DBLA: Distributed block learning algorithm for channel selection in Cognitive Radio Networks.",
                    "Distributed optimization of Contention Windows in 802.11e MAC to provide QoS differentiation and maximize channel utilization.",
                    "Measurement-based interference modeling using channel occupancy in wireless mesh networks.",
                    "Range-free passive localization using static and mobile sensors.",
                    "Reliable data collection from mobile users with high data rates in wireless sensor networks.",
                    "Scalable architecture for multimedia multicast Internet applications.",
                    "An energy-efficient relay selection strategy based on optimal relay location for AF cooperative transmission.",
                    "Energy-efficientwireless resource sharing for federated residential networks.",
                    "Impact of multi-path routing on TCP performance.",
                    "Lego-like middleware for heterogeneous sensor and actuator networks.",
                    "Opportunistic user scheduling with normalized CQI in heterogeneous channel environments.",
                    "Power loading: Candidate for future WLANs?",
                    "User satisfaction-based resource allocation for GEO satellites.",
                    "User-profiled platform with advanced navigation support.",
                    "Demonstrating distributed transmit beamforming with software-defined radios.",
                    "E-SAVE: Saving energy by smart serves.",
                    "ETSI M2M release 1 demonstration.",
                    "Hierarchical routing management for improving multimedia transmissions and QoE.",
                    "Improved timing carrier synchronizer and error controller for wireless multimedia sensor networks.",
                    "Offloading cellular networks with Information-Centric Networking: The case of video streaming.",
                    "On developing interest-centric applications for ad hoc networks.",
                    "S-SPAN: Secure smart posters in Android using NFC.",
                    "The OpenMTC framework - M2M solutions for smart cities and the internet of things.",
                    "AP buffer sizing in IEEE 802.11 WLANs.",
                    "A pragmatic node based DTN performance modeling.",
                    "Exploiting an elastic 2-tiered cloud architecture for rich mobile applications.",
                    "Pairwise post deployment key management scheme for heterogeneous sensor networks.",
                    "Resource management and task allocation in energy harvesting sensor networks.",
                    "Addressing non-homogeneities in a ubiquitous P2P platform for context exchange.",
                    "Caching strategies in opportunistic networks.",
                    "Delay tolerant lazy release consistency for distributed shared memory in opportunistic networks.",
                    "Ferry access points and sticky transfers: Improving communication in ferry-assisted DTNs.",
                    "Message fragmentation for a chain of disrupted links.",
                    "Modelling the delay distribution of Binary Spray and Wait routing protocol.",
                    "Opportunistic routing based on daily routines.",
                    "Performance modeling of Delay Tolerant Network routing via Queueing Petri Nets.",
                    "What a juke! A collaborative music sharing system.",
                    "Adapting sensing and transmission times to improve throughput in cognitive radios ad hoc networks.",
                    "Connectivity analysis of group-based cognitive radio networks.",
                    "Directional spectrum sensing using tunable multi-D space-time discrete filters.",
                    "Double-layer dynamics of cognitive radio networks.",
                    "Dynamic spectrum supply chain model for cognitive radio networks.",
                    "Efficient sparse spectrum estimation for cognitive radios.",
                    "Efficient multi-channel signal detection algorithms for cognitive radio systems in TV white space.",
                    "Embedded SDR system design case study: An implementation perspective.",
                    "Experimental comparison of blind rendezvous algorithms for tactical networks.",
                    "Modeling and theoretical performance analysis for dynamic spatially distributed energy-based spectrum sensing in Cognitive Radios over shadowed fading channels in Public Safety Networks.",
                    "Performance of data services in cellular networks sharing spectrum with a single rotating radar.",
                    "Prediction based cognitive spectrum access.",
                    "Source localization in a cognitive radio environment consisting of frequency and spatial mobility.",
                    "Adaptive and context-aware privacy preservation schemes exploiting user interactions in pervasive environments.",
                    "Association attacks: Identifying association protocols.",
                    "Detecting receiver attacks in VRTI-based device free localization.",
                    "Efficient broadcast communication in the presence of inside attackers: A non-cooperative game.",
                    "Hiding contextual information in WSNs.",
                    "How to develop clairaudience - active eavesdropping in passive RFID systems.",
                    "Lightweight host and user authentication protocol for All-IP telecom networks.",
                    "Living with boisterous neighbors: Studying the interaction of adaptive jamming and anti-jamming.",
                    "PPS: Privacy-preserving statistics using RFID tags.",
                    "Traffic analysis attacks and countermeasures in wireless body area sensor networks.",
                    "Analysis and validation of the maximal reasonable link group size in static 802.11a Wireless Mesh Networks: A study towards channel assignment.",
                    "Authentication and authorisation mechanisms in support of secure access to WMN resources.",
                    "BestPeer - a load-aware multi-path peer selection for Wireless Mesh Networks.",
                    "Bowlmap: Network monitoring and debugging through measurement visualization.",
                    "Distributed Lyapunov drift-plus-penalty routing for WiFi mesh networks with adaptive penalty weight.",
                    "Empirical analysis of measured 802.11 Receive Signal Strength Values using various Atheros based Mini-PCI cards.",
                    "Evaluating the impact of frame aggregation on video-streaming over IEEE 802.11n multihop networks.",
                    "FSASD: A framework for establishing security associations for sequentially deployed WMN.",
                    "Performance study of the Better Approach to Mobile Adhoc Networking (B.A.T.M.A.N.) protocol in the context of asymmetric links.",
                    "A framework for Wireless Sensor Networks performance monitoring.",
                    "D-HIP: A distributed key exchange scheme for HIP-based Internet of Things.",
                    "Efficient information lookup for the Internet of Things.",
                    "Enabling Internet-of-Things services in the MobilityFirst Future Internet Architecture.",
                    "Integration between Internet of Things and Internet of services for an enhanced optimization of water and gas distribution.",
                    "Performance analysis of an LTE gateway for the IoT.",
                    "Secure communication for smart IoT objects: Protocol stacks, use cases and practical examples.",
                    "Sensor similarity search in the Web of Things.",
                    "Trust management for the internet of things and its application to service composition.",
                    "Aspects and trends in realistic VANET simulations.",
                    "Friend: A cyber-physical system for traffic flow related information aggregation and dissemination.",
                    "Interference-aware geocasting for VANET.",
                    "TDMA cluster-based MAC for VANETs (TC-MAC).",
                    "Efficient cross-layer resource allocation for H.264/SVC video transmission over downlink of an LTE system.",
                    "Hardware architecture for fast Intra mode and direction prediction in real-time MPEG-2 to H.264/AVC transcoder.",
                    "On the limit of fountain MDC codes for video Peer-To-Peer networks.",
                    "Rate-control for conversational video communication in heterogeneous networks.",
                    "Towards an energy-efficient attention-aware mobile video player with sensor and face detection support."
                ]
            }
        ]
    },
    {
        "year": "2011",
        "name": "12th WOWMOM 2011",
        "info": "Lucca, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2011",
                "sub_name": "12th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WOWMOM 2011, Lucca, Italy, 20-24 June, 2011.",
                "count": 144,
                "papers": [
                    "Welcome message from the general chairs.",
                    "Message from the TPC chairs.",
                    "Message from the workshops chairs.",
                    "Message from the workshop chair and vice-chair.",
                    "Bootstrapping opportunistic networks using social roles.",
                    "Adaptive data exchange model for opportunistic systems.",
                    "A model for the generation of social network graphs.",
                    "Stumbl: Using Facebook to collect rich datasets for opportunistic networking research.",
                    "Privacy-triggered communications in pervasive social networks.",
                    "Effect of non-cooperative nodes in mobile DTNs.",
                    "Data dissemination in opportunistic networks using cognitive heuristics.",
                    "On the symmetry of user mobility in wireless networks.",
                    "Reasoning about multicast in Opportunistic Networks.",
                    "A zero-dimensional mobility model for opportunistic networking.",
                    "The impact of location privacy on opportunistic networks.",
                    "A study of a time-graph friendship model.",
                    "Safebook: A distributed privacy preserving Online Social Network.",
                    "Implementation of CAMEO: A context-aware middleware for Opportunistic Mobile Social Networks.",
                    "A framework for multimodal sensing in heterogeneous and multimedia wireless sensor networks.",
                    "TUNEGreen: A distributed energy consumption monitor for wireless networks.",
                    "Web services transactions in 6LoWPAN networks [1].",
                    "Rehabilitation supervision using wireless sensor networks.",
                    "Protected delivery of multimedia contents over multicast IP networks: An open-source approach.",
                    "Passive keyless entry system for long term operation.",
                    "Message from the workshop chairs.",
                    "Energy-efficient provenance transmission in large-scale wireless sensor networks.",
                    "On sampling signal strength for localization using a directional antenna.",
                    "The best keying protocol for sensor networks.",
                    "A privacy mechanism for mobile commerce.",
                    "Introducing epidemic models for data survivability in Unattended Wireless Sensor Networks.",
                    "Privacy-by-design in ITS applications.",
                    "Optimal selection of sink nodes in wireless sensor networks in adversarial environments.",
                    "Detecting malicious nodes in RSS-based localization.",
                    "Distributed clone detection in wireless sensor networks: An optimization approach.",
                    "Communication and security in random intersection graphs models.",
                    "Key management in distributed online social networks.",
                    "Collaborative jamming and collaborative defense in Cognitive Radio Networks.",
                    "The 3rd IEEE international Workshop on Hot Topics in Mesh Networking HotMESH 2011.",
                    "Effect of Nakagami-m fading on the QoE performance of VoIP in wireless mesh networks.",
                    "An efficient routing protocol for point-to-point elastic traffic in wireless mesh networks.",
                    "Optimised scheduling for Wireless Mesh Networks using fixed cycle times.",
                    "Bittorrent traffic optimization in Wireless Mesh Networks with ALTO service.",
                    "A self-organising mesh networking solution based on enhanced RPL for smart metering communications.",
                    "Intelligent route discovery for ZigBee mesh networks.",
                    "Overview and optimization of flooding techniques in OLSR.",
                    "ADAM: Administration and deployment of adhoc mesh networks.",
                    "Cognitive WMNs: A distributed mechanism for leasing cellular bandwidth.",
                    "Experimental assessment of the coexistence of Wi-Fi, ZigBee, and Bluetooth devices.",
                    "Wireless networking for automated live video broadcasting: System architecture and research challenges.",
                    "Evaluation of component-aware dynamic voltage scaling for mobile devices and wireless sensor networks.",
                    "A SOA based context-aware order picking system for warehouses using Laser Range Finder and wearable computer.",
                    "Dynamic adaptive HTTP streaming of live content.",
                    "Eco-efficient feedback technologies: Which eco-feedback types prefer drivers most?",
                    "Enhanced surveillance platform with low-power wireless audio sensor networks.",
                    "Third International Workshop on Interdisciplinary Research on E-Health Services and Systems IREHSS 2011.",
                    "Location-aware patient record access: Patient identification using fingerprinting technique.",
                    "C-SMART: Efficient seamless cellular phone based patient monitoring system.",
                    "Wearable biomonitoring system for stress management: A preliminary study on robust ECG signal processing.",
                    "Extraction of video features for real-time detection of neonatal seizures.",
                    "Remote configuration and deployment of sensor drivers for a medical bluetooth sensor gateway.",
                    "Towards understanding the usage pattern of web-based electronic medical record systems.",
                    "Cardiac arrhythmia detection using dynamic time warping of ECG beats in e-healthcare systems.",
                    "Towards Collaborative Health Care System Model - COHESY.",
                    "From intra-cell resource allocation to inter-cell multi-operator spectrum sharing.",
                    "LTE and LTE-Advanced evaluation through innovative simulation tool.",
                    "New key management schemes for resource constrained wireless sensor networks.",
                    "A trust management model for Body Sensor Networks.",
                    "Experimental evaluations of security impact on IEEE 802.15.4 networks.",
                    "SVC tunneling for media-aware content delivery: Impact on video quality.",
                    "Optimized IPv6 Internet access from vehicles in multi-hop and heterogeneous environments.",
                    "A hierarchical discovery scheme for WSNs with Mobile Elements.",
                    "Enabling distributed building control with wireless sensor networks.",
                    "Novel overlay data transmission technique in Cognitive Radio Networks.",
                    "Communication protocols and simulation tool development for multimedia traffic optimization in LTE networks.",
                    "Opportunistic scheduling and rate adaptation for scalable broadcast video streaming.",
                    "Greening IEEE 802.11 channel access.",
                    "Rate-control for RTP-based multimedia applications.",
                    "Designing a Medium Access Control protocol for Body Area Networks.",
                    "Dynamic resources allocation in wireless mesh networks.",
                    "The next dimension of video experience: Sensory effects.",
                    "Human mobility model based on time-varying bipartite graph.",
                    "Backhaul network pre-clustering in cooperative cellular mobile access networks.",
                    "Cooperation and communication in Cognitive radio networks based on TV spectrum experiments.",
                    "Streaming data delivery in multi-hop cluster-based wireless sensor networks with mobile sinks.",
                    "Massive live video distribution using hybrid cellular and ad hoc networks.",
                    "Energy-efficient k-class coverage for collaborative classification in Wireless Audio Sensor Networks.",
                    "Modeling and predicting the dynamics of mobile virus spread affected by human behavior.",
                    "New insights from the analysis of free flow vehicular traffic in highways.",
                    "Distributed audio synchronization scheme using audio endpoint inWASNs.",
                    "A verified wireless safety critical hard real-time design.",
                    "Hop-by-hop reliable, parallel message propagation for intermittently-connected mesh networks.",
                    "Layered backpressure scheduling for delay reduction in ad hoc networks.",
                    "SmartRate: A new dynamic rate adaptation algorithm for 802.11 wireless networks.",
                    "Rate-adaptive probabilistic spectrum management for cognitive radio networks.",
                    "Exploiting multiple channels for rate separation in IEEE 802.11 multi-radio wireless mesh networks.",
                    "Multipath mitigation for indoor localization based on IEEE 802.11 time-of-flight measurements.",
                    "Playback interruption probability analysis for Roadside-to-Vehicle media streaming.",
                    "Power save analysis of cellular networks with continuous connectivity.",
                    "A localized planarization algorithm for realistic wireless networks.",
                    "Defeating NIDS evasion in Mobile IPv6 networks.",
                    "On the potentials of object group localization in the Internet of Things.",
                    "New findings on the complexity of cluster head selection algorithms.",
                    "Events privacy in WSNs: A new model and its application.",
                    "Energy-efficient fair channel access for IEEE 802.11 WLANs.",
                    "A content-aware rateless error protection scheme for live video streaming systems.",
                    "Predicting missing contacts in mobile social networks.",
                    "On transitional probabilistic routing in cognitive radio mesh networks.",
                    "Exploiting temporal complex network metrics in mobile malware containment.",
                    "Power saving trade-offs in Delay/Disruptive Tolerant Networks.",
                    "Reducing transmission losses in body area networks using variable TDMA scheduling.",
                    "Relieving the wireless infrastructure: When opportunistic networks meet guaranteed delays.",
                    "Adapting Wardrop equilibrium to facilitate optimal routing in wireless ad hoc networks.",
                    "Estimating human movement activities for opportunistic networking: A study of movement features.",
                    "PIM-WSN: Efficient multicast for IPv6 wireless sensor networks.",
                    "3R: Fine-grained encounter-based routing in Delay Tolerant Networks.",
                    "Bandwidth assignment for reliable fixed broadband wireless networks.",
                    "TREEFP: A TDMA-based Reliable and Energy Efficient Flooding Protocol for WSNs.",
                    "Enhancement of IEEE 802.15.4 MAC layer to combat correlated channel errors.",
                    "Intelligent transportation systems: When is safety information relevant?",
                    "Wireless memory: Eliminating communication redundancy in Wi-Fi networks.",
                    "1st International Workshop on Sustainable Internet and Internet for Sustainability (SustaInet 2011.",
                    "Energy-cost-aware scheduling of HPC workloads.",
                    "Power-aware network systems using adaptive optical path control for large-scale multi-layer service networks.",
                    "Cooperative and Non-Cooperative house energy optimization in a Smart Grid perspective.",
                    "Evaluating energy consumption in a Cloud infrastructure.",
                    "Minimizing the energy consumption of Carrier Grade Ethernet with Multiple Spanning Trees.",
                    "ESOL: Energy saving in the Internet based on Occurrence of Links in routing paths.",
                    "Energy management in IP traffic engineering with Shortest Path routing.",
                    "Server consolidation in Clouds through gossiping.",
                    "Routers vs switches, how much more power do they really consume? A datasheet analysis.",
                    "Power measurement campaign for evaluating the energy efficiency of current NICs.",
                    "ECOFEN: An End-to-end energy Cost mOdel and simulator For Evaluating power consumption in large-scale Networks.",
                    "Predictive models for energy saving in Wireless Sensor Networks.",
                    "Efficient routing in large sensor grids supporting mobile drains.",
                    "Priority scheduling for participatory Delay Tolerant Networks.",
                    "Cooperative vs. non-cooperative: Self-coexistence among selfish cognitive devices.",
                    "STAR: Storage aware routing protocol for generalized Delay Tolerant Networks.",
                    "TP-UrbanX - A new transport protocol for Cognitive Multi-Radio Mesh Networks.",
                    "Diversity decay in opportunistic content sharing systems.",
                    "Recycled ID assignment for relocation of hopping sensors.",
                    "Stream aggregation in heterogeneous range and rate mobile robot networks.",
                    "A framework for chase strategies in recent energy or time efficient route discovery protocols for MANETs.",
                    "Acoustic scheme to count bird songs with wireless sensor networks.",
                    "Lower and upper bounds for multicasting under distance dependent forwarding cost functions."
                ]
            }
        ]
    },
    {
        "year": "2010",
        "name": "11th WOWMOM 2010",
        "info": "Montreal, QC, Canada",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2010",
                "sub_name": "11th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WOWMOM 2010, Montreal, QC, Canada, 14-17 June, 2010.",
                "count": 110,
                "papers": [
                    "Resilient Peer-to-Peer live-streaming using motifs.",
                    "Cross-layer H.264 scalable video downstream delivery over WLANs.",
                    "Video quality prediction in the presence of MAC contention and wireless channel error.",
                    "Evaluation of quality of experience for video streaming over dynamic spectrum access systems.",
                    "On the maximum performance in opportunistic routing.",
                    "Polar coordinate routing for multiple paths in wireless networks.",
                    "DEHAR: A distributed energy harvesting aware routing algorithm for ad-hoc multi-hop wireless sensor networks.",
                    "Attribute-aware data aggregation using dynamic routing in wireless sensor networks.",
                    "LER-MAC: A Load-independent Energy-efficient and Rate-control Integrated Asynchronous Duty Cycle MAC for Wireless Sensor Networks.",
                    "XS-WSNet: Extreme scale wireless sensor network simulation.",
                    "Gradual adaptation of security for sensor networks.",
                    "General lower and best case upper bounds on energy optimal multicasting in wireless ad hoc and sensor networks.",
                    "P2P overlay topology control in MANETs.",
                    "Utility-based channel assignment and topology control in wireless mesh networks.",
                    "Fair scheduling for real-time multimedia support in IEEE 802.16 wireless access networks.",
                    "Reservation-based distributed scheduling in wireless networks.",
                    "Performance analysis of the IEEE 802.11 MAC protocol for DSRC with and without Retransmissions.",
                    "Least attained recent service for packet scheduling over wireless LANs.",
                    "Using a backlogged queue approach for adaptive MAC frame aggregation.",
                    "Achieving per-station fairness in IEEE 802.11 wireless LANs.",
                    "Investigating the impact of human activity on the performance of wireless networks - An experimental approach.",
                    "Crowd-sourced sensing and collaboration using twitter.",
                    "SHARC: Community-based partitioning for mobile ad hoc networks using neighborhood similarity.",
                    "A social transitivity-based data dissemination scheme for opportunistic networks.",
                    "Comparing simulation tools and experimental testbeds for wireless mesh networks.",
                    "A feedback-based adaptive online algorithm for Multi-Gateway load-balancing in wireless mesh networks.",
                    "Optimal link scheduling for real-time traffic in wireless mesh networks in both per-flow and per-path frameworks.",
                    "PCAR: A power controlled routing protocol for wireless ad hoc networks.",
                    "On the impact of uplink power control in network MIMO systems with MMSE and SIC receivers.",
                    "Estimation and prediction for tracking trajectories in cellular networks using the recursive prediction error method.",
                    "Automatic planning of UMTS release 4.0 networks using realistic traffic.",
                    "Empirical studies and queuing modeling of denial of service attacks against 802.11 WLANs.",
                    "Information utility in mission-oriented networks.",
                    "A multiaccess network of information.",
                    "Trade-off between exploration and reporting victim locations in USAR.",
                    "A distributed privacy-preserving scheme for location-based queries.",
                    "Autonomic diagnosis of anomalous network traffic.",
                    "Social similarity as a driver for selfish, cooperative and altruistic behavior.",
                    "An analysis of distributed and asynchronous wireless group communication mechanisms.",
                    "StreamSocial: A P2P streaming system with social incentives.",
                    "Streaming H.264 scalable video over data distribution service in a wireless environment.",
                    "Demonstration of seamless multimedia session transfer to support pervasive mobile computing.",
                    "Game theory for channel assignment of cognitive radios.",
                    "Proximity marketing solution tailored to user needs.",
                    "Implementation of the OBAMP overlay protocol for multicast delivery in OLSR wireless community networks.",
                    "Pervasive speech API demo.",
                    "Achievement notification in a real-world achievement system.",
                    "Assessment of the true risks to the protection of confidential information in the wireless home and office environment.",
                    "Generic network forensic data acquisition from household and small business wireless routers.",
                    "A secure peer-to-peer web framework.",
                    "Tradeoffs between security and communication performance in wireless mesh networks.",
                    "Detecting blackhole attacks in Disruption-Tolerant Networks through packet exchange recording.",
                    "Reactive on-board regulation of cognitive radios.",
                    "Towards securing mintroute in wireless sensor networks.",
                    "A vision of cooperation tools for VANETs.",
                    "Optimal joint routing and scheduling in wireless mesh networks with smart antennas.",
                    "The XO-Mesh path discovery mechanism sanity.",
                    "On access point association in wireless mesh networks.",
                    "Fast computation of schedules for dynamic traffic in wireless mesh networks.",
                    "Router selfishness in community wireless mesh networks: Cross-layer benefits and harms.",
                    "Misbehaving router detection in link-state routing for wireless mesh networks.",
                    "Path diversity gain with network coding and multipath transmission in wireless mesh networks.",
                    "Analyzing the effective throughput in multi-hop IEEE 802.1 in networks.",
                    "Rope ladder routing: Position-based multipath routing for wireless mesh networks.",
                    "Load-balanced routing and gateway selection in wireless mesh networks: Design, implementation and experimentation.",
                    "Virtual smartphone over IP.",
                    "Neighbor discovery in 60 GHz wireless personal area networks.",
                    "TTN: A time-to-network approach to data reporting in mobile ad hoc networks.",
                    "Enable multimedia mobility with IEEE 802.21.",
                    "Statistical modeling of harvestable kinetic energy for wearable medical sensors.",
                    "Design and implementation of a behavioral migraine management iPhone app for adolescents with migraine.",
                    "A method to compare new and traditional accelerometry data in physical activity monitoring.",
                    "WANDA B.: Weight and activity with blood pressure monitoring system for heart failure patients.",
                    "Next-generation E-health communication infrastructure using converged super-broadband optical and wireless access system.",
                    "Security and privacy for mobile electronic health monitoring and recording systems.",
                    "SAMSON: Secure access for medical smart cards over networks.",
                    "A context-aware framework for health care governance decision-making systems: A model based on the Brazilian Digital TV.",
                    "The CareNet residential gateway: A conceptual overview.",
                    "POSTECH's U-Health Smart Home for elderly monitoring and support.",
                    "Channel tracking algorithms for highly efficient wireless broadband communications in rural areas.",
                    "Wyner-Ziv video coding with error-prone wireless fading channels.",
                    "Modelling the broadband wireless channel in rural Australia.",
                    "Artificial ants for efficient data forwarding in wireless mesh networks.",
                    "An application layer non-repudiation wireless system: A cross-layer approach.",
                    "Channel assortment strategy for reliable communication in multi-hop cognitive radio networks.",
                    "Opportunistically supported ubiquitous localization: Machine learning enhancements.",
                    "Fountain codes for exploiting diversity in wireless sensor networks.",
                    "MAC layer design in cognitive radio networks.",
                    "Comparing network protocols via elimination of MAC/PHY effects.",
                    "Routing for minimum length schedule in multi-channel TDMA based wireless mesh networks.",
                    "On the side effects of packet detection sensitivity in IEEE 802.11 interference management.",
                    "Spectrum sharing between IEEE 802.16 and IEEE 802.11 based wireless networks.",
                    "OptiMOS: Optimal MOS-based scheduling of downlink voice flows in point-to-multipoint access networks.",
                    "Design and evaluation of a fast authentication scheme for WiFi-based wireless networks.",
                    "Using time-of-day and location-based mobility profiles to improve scanning during handovers.",
                    "Conditional shortest path routing in delay tolerant networks.",
                    "Efficient network selection in heterogeneous communication scenarios using arbitration.",
                    "Channel pool management for video streaming in WLAN.",
                    "A robust flooding algorithm in multi-radio multi-channel wireless mesh networks.",
                    "AGC-based RF Fingerprints in Wireless Sensor Networks for authentication.",
                    "Synchronization impact on the performance of Data-Timed Sending (DTS) based wireless sensor networks.",
                    "Connectivity guarantee during wireless sensor networks deployment.",
                    "Detection of the Evil ring attack in wireless sensor networks using cross verification.",
                    "A RTLS/DR based localization system architecture for indoor mobile robots.",
                    "Wireless sensor networks based localization for audio-source: A GCC-GA method.",
                    "A signal combining technique based on channel shortening for cooperative sensor networks.",
                    "Distributed storage in Disruption Tolerant Network.",
                    "Algorithm for data similarity measurements to reduce data redundancy in wireless sensor networks.",
                    "An estimator model for distributed estimation in heterogenous wireless sensor networks.",
                    "Experiments on autonomous mobile sensor control for target tracking."
                ]
            }
        ]
    },
    {
        "year": "2009",
        "name": "10th WOWMOM 2009",
        "info": "Kos Island, Greece",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2009",
                "sub_name": "10th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WOWMOM 2009, Kos Island, Greece, 15-19 June, 2009.",
                "count": 99,
                "papers": [
                    "A CDMA-based approach for highly efficient medium access control in mesh wireless networks.",
                    "Analytic study of Delay/Fault-Tolerant Mobile Sensor Networks (DFT-MSN's).",
                    "Interest-aware content distribution protocol for mobile disruption-tolerant networks.",
                    "On the design of k-covered wireless sensor networks: Self-versus triggered sensor scheduling.",
                    "ECTC: Energy effiCient topology control algorithm for wireless sensor networks.",
                    "A prevention approach to scrambling attacks in WiMAX networks.",
                    "High performance, low complexity cooperative caching for Wireless Sensor Networks.",
                    "Optimization of WiMax modulation scheme with a cross layer erasure code.",
                    "VAPS: Positioning with spatial constraints.",
                    "Mediacast for mobile communities: When the web and telecommunications converge.",
                    "RFID reader and tag multi-hop communication for port logistics.",
                    "A plant-and-play wireless sensor network system for gate monitoring.",
                    "Discovering spatiotemporal mobility profiles of cellphone users.",
                    "A framework for interference mitigation in multi-BSS 802.11 wireless LANs.",
                    "Delivering improved QoS and cell throughput in UMTS based HSDPA networks.",
                    "Efficient data collection in wireless sensor networks with path-constrained mobile sinks.",
                    "A novel analytical framework to model malware diffusion in heterogeneous wireless networks.",
                    "Simple and practical rate adaptation algorithms for wireless networks.",
                    "Routing with transmission buffer zones in MANETs.",
                    "Enhanced Ripple (E-Ripple) protocol for chain-based multihop wireless networks.",
                    "Admission control based on OFDMA channel transformations.",
                    "Joint routing and scheduling in WiMAX-based mesh networks: A column generation approach.",
                    "Habit: Leveraging human mobility and social network for efficient content dissemination in Delay Tolerant Networks.",
                    "Highly efficient multipoint relay selections in link state QoS routing protocol for multi-hop wireless networks.",
                    "Distributed user authentication in wireless LANs.",
                    "A lifetime-based routing protocol for connecting VANETs to the Internet.",
                    "A joint routing and scheduling scheme for wireless networks with multi-packet reception and directional antennas.",
                    "Link scheduling with end-to-end delay constraints in Wireless Mesh Networks.",
                    "A multiple-metric approach for routing in Wireless Mesh Networks.",
                    "A queuing modeling approach for Load-Aware Route Selection in heterogeneous mesh networks.",
                    "Weighted-NEAT: An efficient weighted node evaluation scheme with assistant trust mechanisms to secure wireless ad hoc networks.",
                    "Intelligent network synchronization for energy saving in low duty cycle MAC protocols.",
                    "CDMR: Cooperative diversity-based multi-copy relaying in mesh networks.",
                    "Energy efficient network selection and seamless handovers in Mixed Networks.",
                    "Mobility management for NGN WiMAX: Specification and implementation.",
                    "Multi-channel spectrum-agile MAC protocol with adaptive load control.",
                    "MAC FER-based codec adaptation for multimedia streaming over wireless networks.",
                    "An efficient reliable multicast protocol for 802.11-based wireless LANs.",
                    "Proactive radio resource management using optimal stopping theory.",
                    "Opportunistic scanning: Interruption-free network topology discovery for wireless mesh networks.",
                    "Structure and evolution of a large-scale Wireless Community Network.",
                    "Optimised content accessibility in dynamic environments.",
                    "Mobile commerce in rural South Africa - Proof of concept of mobile solutions for the next billion mobile consumers.",
                    "A lightweight localization architecture and application for opportunistic networks.",
                    "Demonstration of channel assignment in a wireless metropolitan MESH network.",
                    "Induced fading for opportunistic communication in static sensor networks.",
                    "Demonstration of automatic address and radio parameters assignment in MANET using DHCP protocol extensions.",
                    "Business opportunities and considerations on wireless mesh networks.",
                    "Transition from circuit-switched to packet-switched 3G mobile multimedia telephony.",
                    "Mobile and Interactive Social Television - A virtual TV room.",
                    "Optimized mobile push distribution for multimedia files.",
                    "Introducing innovative services with a dense broadcast network.",
                    "The CHIANTI architecture for robust mobile Internet access.",
                    "Consumer experience study of mobile and Interactive Social Television.",
                    "Development of a simulation Environment for Vehicular communications, implementation of FEC coding chain in Xilinx FPGA based on IEEE 802.11p standard.",
                    "A framework for adaptive opportunistic forwarding in wireless networks.",
                    "Multimodal ubiquitous localization: a GPS/WiFi/GSM-based lightweight solution.",
                    "Dynamic spectrum reallocation via autonomic management.",
                    "A generic enabler framework for contextualized advertising within interactive multimedia services.",
                    "Interference avoidance among IEEE 802.22 networks: A Game Theoretic Approach.",
                    "Asynchronous computing and communication architecture toward energy efficient wireless sensor networks.",
                    "Design and cof self-organized data aggregation using evolutionary game theory in delay tolerant networks.",
                    "When opportunity proceeds from autonomy: A tour-based architecture for disconnected mobile sensors.",
                    "HYMAD: Hybrid DTN-MANET routing for dense and highly dynamic wireless networks.",
                    "Distributed estimation of global parameters in delay-tolerant networks.",
                    "Safebook: Feasibility of transitive cooperation for privacy on a decentralized social network.",
                    "Enabling opportunistic communications in a Social Communications Broker Architecture.",
                    "Realization of QoS provisioning in autonomic CDMA networks under common utility-based framework.",
                    "Privacy in context-based and epidemic forwarding.",
                    "OPPORTUNITY: Towards opportunistic activity and context recognition systems.",
                    "Improving partial cover of Random Walks in large-scale Wireless Sensor Networks.",
                    "ViMobiO: Virtual Mobility Overlay for static sensor network testbeds.",
                    "Seamless video handoff in session mobility over the IMS network.",
                    "Positioning accuracy enhancement using localization error modeling.",
                    "An extensible environment discovery and negotiation method for self-configuring networks.",
                    "Site-specific validation of ITU indoor path loss model at 2.4 GHz.",
                    "Experimental analysis of a WiMAX-satellite network for emergency management in sea areas.",
                    "Minimizing energy consumption by power-efficient radio configuration in fixed broadband wireless networks.",
                    "Impact of packet aggregation on TCP performance in Wireless Mesh Networks.",
                    "Selecting vertical handover candidates in IEEE 802.11 mesh networks.",
                    "Interference aware route optimization with predicted network conditions.",
                    "Multi-constrained path computation algorithms for Traffic Engineering over Wireless Mesh Networks.",
                    "An authentication scheme for QoS-aware multi-operator maintained wireless mesh networks.",
                    "Autonomous load balancing anycast routing protocol for wireless mesh networks.",
                    "Bio-inspired link quality estimation for wireless mesh networks.",
                    "Autoconfiguration procedures for multiradio wireless mesh networks based on DHCP protocol.",
                    "Configurable routing in mesh networks.",
                    "A CARMEN mesh experience: deployment and results.",
                    "Towards an energy saving MAC for wireless body sensor networks.",
                    "Securing wireless communication with implanted medical devices using reciprocal carrier-phase quantization.",
                    "Finite element study for intra and postarthroplastic evaluation of ligament balancing in standing position using instrumented tibial baseplate.",
                    "Virtual reality implementation as a useful software tool for e-health applications.",
                    "Comparison of two different classifiers for mental tasks-based Brain-Computer Interface: MLP Neural Networks vs. Fuzzy Logic.",
                    "Mechanical modeling of bend sensors exploited to measure human joint movements.",
                    "Distributed decision for medical alerts using wireless sensors.",
                    "Using relay network to increase life time in wireless body area sensor networks.",
                    "Managing change: Experiences from a new e-Health initiative for patients with diabetes and cardiovascular disease.",
                    "An efficient wireless communication protocol for secured transmission of content-sensitive multimedia data.",
                    "Using end-to-middle security to protect against evil twin access points."
                ]
            }
        ]
    },
    {
        "year": "2008",
        "name": "9th WOWMOM 2008",
        "info": "Newport Beach, CA, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2008",
                "sub_name": "9th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networks, WOWMOM 2008, Newport Beach, CA, USA, 23-26 June, 2008.",
                "count": 118,
                "papers": [
                    "Message from the general chairs.",
                    "Message from the technical program chairs.",
                    "Recent progress in moving cognitive radio and services to deployment.",
                    "Intelligent communication in the Netherlands: Accommodation of large-scale, mass-market 4G applications.",
                    "Mixed reliability video streaming in wireless networks.",
                    "Delay-constrained high throughput protocol for multi-path transmission over wireless multimedia sensor networks.",
                    "A new priority based congestion control protocol for Wireless Multimedia Sensor Networks.",
                    "Performance measurement over Mobile WiMAX/IEEE 802.16e network.",
                    "Professional and end-user-driven service creation in the SPICE platform.",
                    "Recommender systems for mobile content: Current challenges and ways forward.",
                    "Performance analysis of HIP-based mobility and triggering.",
                    "Localized minimum spanning tree based multicast routing with energy-efficient guaranteed delivery in ad hoc and sensor networks.",
                    "A comparative study of data transport protocols in wireless sensor networks.",
                    "Non-uniform sensor deployment in mobile wireless sensor networks.",
                    "Mobility management in IP-based Wireless Sensor Networks.",
                    "MANET management: Industry challenges & potential solutions.",
                    "FEW-PNets - A framework for emulation of wireless personal networks.",
                    "Context-aware and personalized event filtering for low-overhead continuous remote health monitoring.",
                    "Hierarchical QAM BICM MIMO systems with iterative decoding and applications to media broadcast.",
                    "Data outage across 3G & 2G wireless networks.",
                    "Mobile TFRC: a congestion control for WLANs.",
                    "Power and performance characteristics of USB flash drives.",
                    "Link quality prediction for wireless devices with multiple radios.",
                    "WiMap: Fast handover for 802.11 mobile devices.",
                    "A method for minimizing unnecessary handovers in heterogeneous wireless networks.",
                    "Performance analysis of reliable transport schemes joint with the optimal frequency and optimal packet length in underwater sensor networks.",
                    "Mobile localization in outdoor environments.",
                    "Relative localization with 2-hop neighborhood.",
                    "Wireless reliability: Rethinking 802.11 packet loss.",
                    "Heterogeneous modulation for trading-off energy balancing with bandwidth efficiency in hierarchical sensor networks.",
                    "SLP-based service management with QoS server selection in mobile ad-hoc networks.",
                    "A novel Middleware for the Mobility Management Over the Internet.",
                    "The NIST Data Flow System II: A standardized interface for distributed multimedia applications.",
                    "Geographical location based RFID tracking system.",
                    "BEWARE: Background traffic-aware rate adaptation for IEEE 802.11.",
                    "Design, implementation, and performance analysis of DiscoSec - Service pack for securing WLANs.",
                    "Interference in wireless multihop networks: A model and its experimental evaluation.",
                    "Optimizing the cost of migration from wireless tdm networks to next generation packet networks.",
                    "A joint design of admission control and transmission rate adaptation for VoIP over wireless network.",
                    "Localized minimum-latency broadcasting in multi-radio multi-rate wireless mesh networks.",
                    "Experimental study on wireless multicast scalability using Merged Hybrid ARQ with staggered adaptive FEC.",
                    "Localization-oriented coverage based on Bayesian estimation in camera sensor networks.",
                    "Localization in time and space for wireless sensor networks: A Mobile Beacon approach.",
                    "On-demand fingerprint selection for 802.11-based positioning systems.",
                    "Cluster filtered KNN: A WLAN-based indoor positioning scheme.",
                    "Integrated routing and MAC scheduling for single-channel wireless mesh networks.",
                    "Link-quality measurement enhancement for routing in wireless mesh networks.",
                    "Secure group communication in wireless mesh networks.",
                    "Probabilistically reliable on-demand multicast in wireless mesh networks.",
                    "An efficient analytical model for QoS engineering in mobile cellular networks.",
                    "Power-delay tradeoff over wireless networks.",
                    "Mobile system energy conservation for adaptive multimedia applications.",
                    "EMO: A statistical encounter-based mobility model for simulating delay tolerant networks.",
                    "Reducing handover latency in future IP-based wireless networks: proxy mobile IPv6 with simultaneous bindings.",
                    "BASH: A backhaul-aided seamless handoff scheme for Wireless Mesh Networks.",
                    "Position-based unicast routing for city scenarios.",
                    "A novel physical carrier sensing scheme for enhancing spatial reuse in multihop wireless networks.",
                    "CREAM-MAC: An efficient Cognitive Radio-enAbled Multi-Channel MAC protocol for wireless networks.",
                    "A Novel MAC scheme for solving the QoS parameter adjustment problem in IEEE 802.11e EDCA.",
                    "DGRAM: A Delay Guaranteed Routing and MAC protocol for wireless sensor networks.",
                    "A cooperative approach for topology control in Wireless Sensor Networks: Experimental and simulation analysis.",
                    "Using sink mobility to increase wireless sensor networks lifetime.",
                    "A combinatorial algorithm for the Maximum Lifetime Data Gathering And Aggregation problem in sensor networks.",
                    "Reputation-based service selection in a peer-to-peer mobile environment.",
                    "Costs and benefits of reputation management systems.",
                    "Correlating real-time monitoring data for mobile network management.",
                    "Stability analysis for communication of voice terminals with packet reservation multiple access protocol.",
                    "Optimizations for charged service provision in Mobile Ad Hoc Networks.",
                    "Channel-aware packet scheduling for MANETs.",
                    "Path selection for mobile stations in IEEE 802.16 multihop relay networks.",
                    "Scheduling aware network flow models for multi-hop wireless networks.",
                    "A case for Predictive DiffServ on mobile networks.",
                    "Prototyping a chest-worn string-based wearable input device.",
                    "Optimizing user QoE through overlay routing, bandwidth management and dynamic transcoding.",
                    "Scalable architecture for context-aware activity-detecting mobile recommendation systems.",
                    "Demonstration of unobservable voice over IP.",
                    "Enhancing reliability of sensor networks by fine tuning their event observation behavior.",
                    "A multi-user ad-hoc resource manager for smart spaces.",
                    "Towards autonomous data ferry route design through reinforcement learning.",
                    "An optimal joint scheduling and drop policy for Delay Tolerant Networks.",
                    "Context and resource awareness in opportunistic network data dissemination.",
                    "Scalable service migration in general topologies.",
                    "Message fragmentation in opportunistic DTNs.",
                    "Writing on the clean slate: Implementing a socially-aware protocol in Haggle.",
                    "Spatiotemporal routing algorithm in opportunistic networks.",
                    "Opportunistic medical monitoring using bluetooth P2P networks.",
                    "On a synergetic architecture for cognitive adaptive behavior of future communication systems.",
                    "A platform for pervasive combinatorial trading with opportunistic self-aggregation.",
                    "di-jest: Autonomic neighbour management for worm resilience in p2p systems.",
                    "WhereAmI: A realworld testbed for location services.",
                    "Location management for mobile devices.",
                    "The EXC toolkit for real-world experiments with wireless multihop networks.",
                    "A software tool to relate technical performance to user experience in a mobile context.",
                    "An embedded platform for reliable applications over heterogeneous wireless networks.",
                    "Experimental evaluation of an Adaptive Staggered Sleep Protocol for wireless sensor networks.",
                    "A reconfigurable framework for experimental analysis of single and multi hop WLANs.",
                    "BOWL: Design and implementation of a (connectionless) broadcasting system over wireless LAN.",
                    "C/I gains in a single frequency network using TD-CDMA over a unicast network.",
                    "Adaptive QoS-aware resource allocation scheme for multimedia broadcasting over geostationary satellite networks.",
                    "Revenue-based Call Admission Control for MPEG-4 wireless videoconference traffic.",
                    "Cooperative media streaming using adaptive network compression.",
                    "Rate-distortion optimized network coding for cooperative video stream repair in wireless peer-to-peer networks.",
                    "Objective measurement of transcoded video quality in mobile applications.",
                    "Low complexity real-time video transcoders for mobile video applications.",
                    "Motion vector processing using bidirectional frame difference in motion compensated frame interpolation.",
                    "Adaptive encryption for the realization of real-time transmission of sensitive medical video streams.",
                    "Peer-to-peer videoconferencing with H.264 software codec for mobiles.",
                    "System optimization for peer-to-peer multi hop video broadcasting in wireless ad hoc networks.",
                    "Dynamic video delivery in contact centers.",
                    "EndSec: An end-to-end message security protocol for mobile telecommunication networks.",
                    "Camouflaging mobility for itinerary privacy in mobile ad-hoc networks.",
                    "A self-healing key distribution scheme based on vector space secret sharing and one way hash chains.",
                    "A reliable topology for efficient key distribution in ad-hoc networks.",
                    "On the scalability of an efficient \"Nonscalable\" key distribution scheme.",
                    "Wireless networks security: Proof of chopchop attack.",
                    "Secure data recollection for redundantly deployed wireless sensor networks.",
                    "Multicarrier authentication at the physical layer.",
                    "Improving the resiliency of Ariadne."
                ]
            }
        ]
    },
    {
        "year": "2007",
        "name": "8th WOWMOM 2007",
        "info": "Helsinki, Finland",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2007",
                "sub_name": "2007 International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM 2007), 18-21 June 2007, Helsinki, Finland, Proceedings.",
                "count": 122,
                "papers": [
                    "An Inter-domain Routing Protocol for Multi-homed Wireless Mesh Networks.",
                    "HiBOp: a History Based Routing Protocol for Opportunistic Networks.",
                    "A Pragmatic Analysis of User Mobility Patterns in Macrocellular Wireless Networks.",
                    "Aggregation Supportive Authentication in Wireless Sensor Networks: A Watermark Based Approach.",
                    "Energy Efficient Area Monitoring Using Information Coverage in Wireless Sensor Networks.",
                    "Generating Random Graphs for Wireless Actuator Networks.",
                    "Dynamic Filter Merging for Publish/Subscribe.",
                    "Scalability Analysis of Rate Adaptation Techniques in Congested IEEE 802.11 Networks: An ORBIT Testbed Comparative Study.",
                    "Joint Network-wide Opportunistic Scheduling and Power Control in Multi-cell Networks.",
                    "Integrated Access Point Placement and Channel Assignment for Wireless LANs in an Indoor Office Environment.",
                    "An Optimal Flow Assignment Framework for Heterogeneous Network Access.",
                    "Embedding Source Signature in Multicast Wireless Video Streams.",
                    "A Fast and Efficient Codec for Multimedia Applications in Wireless Thin-Client Computing.",
                    "Maximizing Broadcast and Multicast Traffic Load through Link-Rate Diversity in Wireless Mesh Networks.",
                    "Assessing the Completeness of Wireless-side Tracing Mechanisms.",
                    "Multi-level application-based traffic characterization in a large-scale wireless network.",
                    "Future Wireless Communication Infrastructure with Application to Emergency Scenarios.",
                    "Optimizing Update Threshold for Distance-based Location Tracking Strategies in Moving Object Environments.",
                    "On Achieving High Performance Wireless Mesh Networks With Data Fusion.",
                    "Reliable Performance Evaluation of Rekeying Algorithms in Secure Multicast.",
                    "Achievable Bandwidth Estimation for Stations in Multi-Rate IEEE 802.11 WLAN Cells.",
                    "Localized Minimum-Latency Broadcasting in Multi-rate Wireless Mesh Networks.",
                    "Two Phase Scheduling Algorithm for Maximizing the Number of Satisfied Users in Multi-Rate Wireless Systems.",
                    "Preventing the performance anomaly of IEEE 802.11 networks with a distributed channel-aware scheduler.",
                    "On Efficient Key Redistribution in Wireless Sensor Networks.",
                    "Use Cases of Implicit Authentication and Key Establishment with Sender and Receiver ID Binding.",
                    "Wireless Group Security Using MAC Layer Multicast.",
                    "Key Distribution for Group-based Sensor Deployment Using a Novel Interconnection Graph.",
                    "A Power Control Scheme for Efficient Radio Bearer Selection in MBMS.",
                    "Downlink Resource Allocation in Multi-Carrier Systems: Frequency-Selective vs. Equal Power Allocation.",
                    "Energy-Efficient and Reliable Medium Access in Sensor Networks.",
                    "Distributed Protocols for Scheduling and Rate Control to Achieve Max-Min Fairness in Wireless Mesh Networks.",
                    "MrCA: Multi-round Collision Avoidance for Contention-Based Medium Access Control.",
                    "802.11e EDCA Protocol Parameterization: A Modeling and Optimization Study.",
                    "CSMA-Based MAC Protocol For Cognitive Radio Networks.",
                    "Effect of Flat Fading in 802.11 MAC for Cross Layer Evaluation Using Channel Emulator.",
                    "A Contact-based Hybrid Routing Strategy for Mobile Wireless Networks: Protocol Design and Applications.",
                    "An Economic Approach to Hierarchical Routing in Resource Rationed Ad Hoc Networks.",
                    "HEAT: Scalable Routing in Wireless Mesh Networks Using Temperature Fields.",
                    "Conditional transmissions, a strategy for highly dynamic vehicular ad hoc networks.",
                    "The NIProxy: a Flexible Proxy Server Supporting Client Bandwidth Management and Multimedia Service Provision.",
                    "Adaptive Contention Resolution for VoIP Services in the IEEE 802.16 Networks.",
                    "Human Perception of Lip Synchronization in Mobile Environment.",
                    "A mechanism to enforce TCP Fairness in 802.11 wireless LANs and its performance evaluation in a real test-bed.",
                    "Packet Transmission Order Based TCP Loss Recovery Algorithm: Extending Self Clocking Property to Resolve ACK Starvation.",
                    "An Adaptive Data-transfer Protocol for Sensor Networks with Data Mules.",
                    "Mobile Search: The Need for Content Feed and Metadata Standards.",
                    "The Application of Space-based Systems in Connecting Web Services and Mobile User Interfaces.",
                    "Attention-Aware Cultural Heritage Applications on Mobile Phones.",
                    "Broadcasting Images in Wireless Networks.",
                    "Spice: A Service Platform for Future Mobile IMS Services.",
                    "VOISERV: Creation and Delivery of Converged Services through Voice for Emerging Economies.",
                    "Home DNS: Experiences with Seamless Remote Access to Home Services.",
                    "A Distributed IP Multimedia Subsystem (IMS).",
                    "Accurate Traffic Classification.",
                    "An RFID and Wireless Sensor Network-based Implementation of Workflow Optimization.",
                    "Platform for Emulating Networked Control Systems in Laboratory Environments.",
                    "An Investigation into thie Energy Eficiency of Pure and Slotted Aloha Based REID Anti-Collision Protocols.",
                    "An Experimental Evaluation of Mobile Node based versus Infrastructure based Handoff Schemes.",
                    "Engineering a Search and Rescue Application with a Wireless Sensor Network - based Localization Mechanism.",
                    "A Novel Architecture for Provisioning Basic Services in Heterogeneous Pervasive Environments.",
                    "Optimal video coding for bit-rate switching applications: a game-theoretic approach.",
                    "Improvement of AODV Routing in Dense networks.",
                    "On Game Theoretic Rate-Maximizing Packet Scheduling in Non-Cooperative Wireless Networks.",
                    "Distributed Service Location and Session Management for Ad-hoc Networks.",
                    "A Framework for Service Provision in Intermittently Connected Mobile Ad hoc Networks.",
                    "Optimal Transmission Range with Delay Constraints for Homogeneous MANETs.",
                    "Optimal Shaping for Transmission over Wireless Fading Channels.",
                    "Energy Efficient Cluster ID based Routing in Wireless Sensor Networks - Analysis in Nakagami-m fading Channel Model.",
                    "Real-Time Demonstration of Mobile Broadcasting Services via MBMS.",
                    "Real-time Network Simulation of 3GPP Long Term Evolution.",
                    "A Framework for Personalized Utility-Aware IP-Based Multimedia Consumption.",
                    "Prioritized Video Streaming in Wireless Mesh Networks.",
                    "Advanced Multimedia Services for Fast Moving Users on Trains.",
                    "A Service-oriented Infrastructure for Mutual Assistance Community.",
                    "Adaptation as a New Requirement for Software Engineering.",
                    "A Framework for Mobile Agent Platform performance Evaluation.",
                    "Supporting the Secure Deployment of OSGi Bundles.",
                    "Adaptive MANET Routing for Low Overhead.",
                    "DTN-based Content Storage and Retrieval.",
                    "Basic Abstractions for an Autonomic Network Architecture.",
                    "Flex-WiFi: a mixed infrastructure and ad-hoc IEEE 802.11 network for data traffic in a home environment.",
                    "Utility-based Message Replication for Intermittently Connected Heterogeneous Networks.",
                    "GeOpps: Geographical Opportunistic Routing for Vehicular Networks.",
                    "Probabilistic Routing Protocol for Intermittently Connected Mobile Ad hoc Network (PROPICMAN).",
                    "Defining and Exploiting Network Topologies in Human Networks.",
                    "Impact of Social Mobility on Routing Protocols for Opportunistic Networks.",
                    "Performance Analysis of Probabilistic Flooding Using Random Graphs.",
                    "Barter-based cooperation in delay-tolerant personal wireless networks.",
                    "Vulnerabilities in Epidemic Forwarding.",
                    "Broadcast Link Quality Measurements in 802.11 Networks.",
                    "Transmit Antenna Selection Based on Link-layer Channel Probing.",
                    "Indoor experiments of self-organization and localization protocols for hybrid networks.",
                    "Experimental Activity on Cooperative Mobile Positioning in Indoor Environments.",
                    "An experimental study on Layer 2 roaming for 802.11 based WLANs.",
                    "Measured WEB Performance in GPRS, EDGE, UMTS and HSDPA with and without Caching.",
                    "A study on deaf people supporting systems using cellular phone with Bluetooth in disasters.",
                    "Creating Offline MANET IDS Network Traces.",
                    "Policy Management and Autonomic Mechanisms for Seamless Mobility Networks and Applications.",
                    "An Autonomic Framework for Self-Optimizing Next Generation Mobile Networks.",
                    "Automated Real Time Performance Management for Mobile Networks.",
                    "Decentralized Configuration of Neighboring Cells for Radio Access Networks.",
                    "Dynamic Interface and Address Grouping.",
                    "An Automatic Procedure for Neighbor Cell List Definition in Cellular Networks.",
                    "End to End Principle in Access Point Selection.",
                    "Signaling-based radio optimization in WCDMA networks.",
                    "A New Approach of UMTS-WLAN Load Balancing; Algorithm and its Dynamic Optimization.",
                    "Experiments and considerations on Reaction-Diffusion based Pattern Generation in a Wireless Sensor Network.",
                    "Experiences with Implementing a Distributed and Self-Organizing Scheduling Algorithm for Energy-Efficient Data Gathering on a Real-Life Sensor Network Platform.",
                    "A Communication Mechanism using Traveling Wave Phenomena for Wireless Sensor Networks.",
                    "Cost over Progress Based Energy Efficient Routing over Virtual Coordinates in Wireless Sensor Networks.",
                    "Implementing Energetically Sustainable Routing Algorithms for Autonomous WSNs.",
                    "A Secure and Privacy-Protecting Aggregation Scheme for Sensor Networks.",
                    "Pairwise Broadcast Clock Synchronization for Wireless Sensor Networks.",
                    "A Simple Algorithm for Clock Synchronization in Wireless Sensor Networks.",
                    "eSimu: a Fast and Accurate Energy Consumption Simulator for Real Embedded System.",
                    "From Simulation to Real Deployments in WSN and Back.",
                    "A Game Theoretic Model of a Protocol for Data Possession Verification.",
                    "Secure Distributed AAA with Domain and User Reputation.",
                    "Agent-based Distributed Group Key Establishment in Wireless Sensor Networks.",
                    "Group-Based Private Authentication.",
                    "Usable Access Control inside Home Networks."
                ]
            }
        ]
    },
    {
        "year": "2006",
        "name": "7th WOWMOM 2006",
        "info": "Niagara-Falls, Buffalo, NY, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2006",
                "sub_name": "2006 International Symposium on a World of Wireless, Mobile and Multimedia Networks (WoWMoM 2006), 26-29 June 2006, Buffalo, New York, USA, Proceedings.",
                "count": 111,
                "papers": [
                    "Message from the General Chairs.",
                    "Message from the TPC Chairs.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "Reviewers.",
                    "Message from the Workshop Chair.",
                    "Message from the Workshop Organizers - ACC 2006.",
                    "ACC 2006 Workshop Organization.",
                    "Message from the Workshop Organizer - EXPONWIRELESS 2006.",
                    "EXPONWIRELESS 2006 Workshop Organization.",
                    "Message from the Workshop Organizers - MDC 2006.",
                    "MDC 2006 Workshop Organization.",
                    "MDC Reviewers.",
                    "Message from the Workshop Organizers - TSPUC 2006.",
                    "TSPUC 2006 Workshop Organization.",
                    "Multiple-Access Insights from Bounds on Sensor Localization.",
                    "An Energy-Efficient Data-Dissemination Protocol inWireless Sensor Networks.",
                    "Entrapping Adversaries for Source Protection in Sensor Networks.",
                    "Group-Based Medium Access for Next-GenerationWireless LANs.",
                    "AISLE: Autonomic Interface SeLEction for Wireless Users.",
                    "MCMSDA: A Multi-Channel Multi-Sector Directional Antenna Wireless LAN.",
                    "Cross-Layer Resource-Consumption Optimization for Mobile Multicast in Wireless Networks.",
                    "Evaluating Different One to Many Packet Delivery Schemes for UMTS.",
                    "An Efficient Geographic Multicast Protocol for Mobile Ad Hoc Networks.",
                    "Mobile Element Based Differentiated Message Delivery in Wireless Sensor Networks.",
                    "Inter-Regional Messenger Scheduling in Delay Tolerant Mobile Networks.",
                    "Network Coding for Wireless Mesh Networks: A Case Study.",
                    "Energy Conservation in Sensor Networks through Selective Node Activation.",
                    "Energy-Efficient Forwarding Schemes for Wireless Sensor Networks.",
                    "A Distributed Minimum Energy Multicast Algorithm in MANETs.",
                    "A Flow Control Framework for Improving Throughput and Energy Efficiency in CSMA/CA based Wireless Multihop Networks.",
                    "Po^2V Network Layer Position Verification in Multi-HopWireless Networks.",
                    "Adapting AODV for IEEE 802.15.4 Mesh Sensor Networks: Theoretical Discussion and Performance Evaluation in a Real Environment.",
                    "A New MAC Scheme for Very High-Speed WLANs.",
                    "Practical Schemes for Smooth MAC Layer Handoff in 802.11Wireless Networks.",
                    "MAC-Layer Scheduling in Cognitive Radio based Multi-Hop Wireless Networks.",
                    "Middleware Support for Context-Awareness in 4G Environments.",
                    "A Comprehensive and Efficient Handoff Procedure for IPv6 Mobility Support.",
                    "Simulative Analysis of Access Selection Algorithms for Multi-Access Networks.",
                    "Minimum Cost Wireless Broadband Overlay Network Planning.",
                    "Modeling Node Compromise Spread in Wireless Sensor Networks Using Epidemic Theory.",
                    "Optimal Transmission Range for Cluster-Based Wireless Sensor Networks With Mixed Communication Modes.",
                    "On-Demand Reliable Medium Access in Sensor Networks.",
                    "Wireless Sensor Networks: To Cluster or Not To Cluster?.",
                    "Rate Scheduling of Multimedia Streams over ParallelWireless Data Channels with Heterogeneous Reliability.",
                    "Opportunistic Scheduling of Delay Sensitive Traffic in OFDMA-BasedWireless.",
                    "Selective Channel Feedback Mechanisms for Wireless Multichannel Scheduling.",
                    "Management and Diagnosis Architecture for a Large-Scale Public WLAN.",
                    "Squeezing 100+ VoIP calls out of 802.11b WLANs.",
                    "Gauging VoIP Call Quality from 802.11 WLAN Resource Usage.",
                    "3D Image-Based Rendering Technique for Mobile Handheld Devices.",
                    "Multimedia Correlation Analysis in Unstructured Peer-to-Peer Networks.",
                    "TCP over Rate-Adaptive WLAN - An Analytical Model and its Simulative Verification.",
                    "Performance Evaluation of a File Repair Procedure Based on a Combination of MBMS and Unicast Bearers.",
                    "Performance Analysis and Enhancement of the Next Generation Cellular Networks.",
                    "Cross-Layer Resource-Consumption Optimization for Mobile Multicast in Wireless Networks.",
                    "A New Wireless Channel Fade Duration Model for Exploiting Multi-User Diversity Gain and Its Applications.",
                    "Fast Downloading of Large Files over Fading Wireless Channels.",
                    "Selective Cooperation Based on Link Distance Estimations in Wireless Ad-Hoc Networks.",
                    "LIHP: A Low Latency Layer-3 Handoff Scheme for 802.11Wireless Networks.",
                    "A Station-Based Adaptation Algorithm to Improve Robustness of IEEE 802.11.",
                    "Resource Control for the EDCA Mechanism in Multi-Rate IEEE 802.11e Networks.",
                    "Enabling Engineering Document in Mobile Computing Environment.",
                    "Power Control in Multihop CSMA.",
                    "Can I Add a Secure VoIP Call?.",
                    "HRPD-A Downlink Voice/IP and Data Throughput and Delay Analysis.",
                    "A Real-Time Smoothing Scheme of MPEG-4 Video for CDMA Systems.",
                    "An Energy-Efficient DSR Routing Protocol Based on Mobility Prediction.",
                    "A MAC Layer Protocol for Priority-based Reliable Multicast in Wireless Ad Hoc Networks.",
                    "An Efficient Key Revocation Protocol for Wireless Sensor Networks.",
                    "Analysis of Contention-Based Multi-Channel Wireless MAC for Point-to-Multipoint Networks.",
                    "Engineering of Replica Voting Protocols for Energy-Efficiency in Data Delivery.",
                    "Preserving Traffic Privacy in Wireless Mesh Networks.",
                    "An Adaptive Rate Control Algorithm for Real-time Streaming of 3D Image-Based Rendering over Heterogeneous Wireless Networks.",
                    "SymbioticSphere: A Biologically-Inspired Autonomic Architecture for Self-Adaptive and Self-Healing Server Farms.",
                    "Using Policies to Drive Autonomic Management.",
                    "A Framework for the Deployment of Self-Managing and Self-Configuring Components in Autonomic Environments.",
                    "Traffic-Adaptive Packet Filtering of Denial of Service Attacks.",
                    "Designing and Modeling Smart Environments (Invited Paper).",
                    "Evaluating Context Information Predictability for Autonomic Communication.",
                    "Towards the Knowledge-Driven Benchmarking of Autonomic Communications.",
                    "Self-Sizing of Clustered Databases.",
                    "An Experimental Testbed and Methodology for Characterizing IEEE 802.11 Network Cards.",
                    "Measurements from an 802.11b Mobile Ad Hoc Network.",
                    "802.11b/g Link Level Measurements for an Outdoor Wireless Campus Network.",
                    "Means and Methods for Collecting and Analyzing QoE Measurements in Wireless Networks.",
                    "Modeling Roaming in Large-scaleWireless Networks Using Real Measurements.",
                    "Experimental Evaluation of the Source Specific Multicast Model in Mobile Environments.",
                    "Fast Handoff in Mobile Virtual Private Networks.",
                    "INSIGHT: Internet-Sensor Integration for Habitat Monitoring.",
                    "Evaluation of a Stastical Technique to Mitigate Malicious Control Packets in Ad Hoc Networks.",
                    "An RSSI-based Scheme for Sybil Attack Detection in Wireless Sensor Networks.",
                    "The Geodesic Broadcast Scheme for Wireless Ad Hoc Networks.",
                    "Securing Weakly-Dominating Virtual Backbones in Mobile Ad Hoc Networks.",
                    "On The Traffic Behavior of Distributed Wireless Mesh Networks.",
                    "Virtual Sensors: Abstracting Data from Physical Sensors.",
                    "P2P Common API for Structured Overlay Networks: A Cross-Layer Extension.",
                    "Making Distributed Transactions Resilient to Intermittent Network Connections.",
                    "Tree Slotted Aloha: a New Protocol for Tag Identification in RFID Networks.",
                    "A Flexible Middleware for Service Provision Over Heterogeneous Pervasive Networks.",
                    "ROVERS: Pervasive Computing Platform for Heterogeneous Sensor-Actuator Networks.",
                    "GridStix: Supporting Flood Prediction using Embedded Hardware and Next Generation Grid Middleware.",
                    "Building Reliable Mobile Applications with Space-Elastic Adaptation.",
                    "SPRINGS: A Scalable Platform for Highly Mobile Agents in Distributed Computing Environments.",
                    "Measurement Study of the Mobile Agent JADE Platform.",
                    "The Green Card Protocol: An Identification Protocol for Decentralized Systems.",
                    "A Strong Ramp Secret Sharing Scheme Using Matrix Projection.",
                    "Towards Blocking Outgoing Malicious Impostor Emails.",
                    "Credentials and Beliefs in Remote Trusted Platforms Attestation.",
                    "PHONEY: Mimicking User Response to Detect Phishing Attacks.",
                    "Privacy Preserving Trust Authorization Framework Using XACML."
                ]
            }
        ]
    },
    {
        "year": "2005",
        "name": "6th WOWMOM 2005",
        "info": "Taormina - Giardini Naxos, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2005",
                "sub_name": "2005 International Conference on a World of Wireless, Mobile and Multimedia Networks (WOWMOM 2005), 13-16 June 2005, Taormina, Italy, Proceedings.",
                "count": 103,
                "papers": [
                    "Message from the General Chairs.",
                    "Message from the Program Chairs.",
                    "Organizing Committee.",
                    "Program Committee.",
                    "Reviewers.",
                    "ACC 2005 Workshop.",
                    "TSPUC 2005 Workshop.",
                    "Interference-Limited MAC Protocol for MANETs with Directional Antennas.",
                    "An Integrated Neighbor Discovery and MAC Protocol for Ad Hoc Networks Using Directional Antennas.",
                    "Exploiting Path Diversity in the Link Layer in Wireless Ad Hoc Networks.",
                    "A Scenario-Based Performance Evaluation of Multicast Routing Protocols for Ad Hoc Networks.",
                    "Evaluation of Peer-to-Peer Network Content Discovery Techniques over Mobile Ad Hoc Networks.",
                    "Stable, Congestion-Controlled Application-Layer Multicasting in Pedestrian Ad-Hoc Networks.",
                    "Application Rate Adaptation for Mobile Streaming.",
                    "An Agent-Based Architecture for Handover Initiation and Decision in 4G Networks.",
                    "DIMSUMNet: New Directions in Wireless Networking Using Coordinated Dynamic Spectrum Access.",
                    "Performance Analysis of the IEEE 802.11 MAC and Physical Layer Protocol.",
                    "Saturation Throughput Analysis of a System of Interfering IEEE 802.11 WLANs.",
                    "What is Wrong in Multimedia Messaging?.",
                    "Service Discovery in Mobile Ad Hoc Networks: A Field Theoretic Approach.",
                    "An Agile Approach to Distributed Information Dissemination in Mobile Ad Hoc Networks.",
                    "Lightweight Replication Middleware for Data and Service Components in Dense MANETs.",
                    "Energy-Efficient Replica Voting Mechanisms for Secure Real-Time Embedded Systems.",
                    "Design and Evaluation of iMesh: An Infrastructure-Mode Wireless Mesh Network.",
                    "High Throughput Routing in Hybrid Cellular and Ad-Hoc Networks.",
                    "On the Clustering Properties of Exponential Random Networks.",
                    "Adaptive Routing for Intermittently Connected Mobile Ad Hoc Networks.",
                    "Modeling and Analysis of Robust Header Compression Performance.",
                    "A Joint Coding at Neighbor Network Layers.",
                    "Cross-Layer Design of Dynamic Resource Allocation with Diverse QoS Guarantees for MIMO-OFDM Wireless Networks.",
                    "A Generalized Algorithm for the Generation of Correlated Rayleigh Fading Envelopes.",
                    "Temporal Fairness Provisioning in Multi-Rate Contention-Based 802.11e WLANs.",
                    "The Wireless Hierarchical Token Bucket: A Channel Aware Scheduler for 802.11 Networks.",
                    "Revisit of RTS/CTS Exchange in High-Speed IEEE 802.11 Networks.",
                    "Adaptive Resource Management for Multimedia Applications in Wireless Networks.",
                    "Personalized Service Composition for Ubiquitous Multimedia Delivery.",
                    "Supporting Semantic-Based Multimedia Data Access in Ad Hoc Networks.",
                    "A System Structure for Adaptive Mobile Applications.",
                    "A High-Throughput MAC Strategy for Next-Generation WLANs.",
                    "PARMA: A PHY/MAC Aware Routing Metric for Ad-Hoc Wireless Networks with Multi-Rate Radios.",
                    "Ad-Hoc Extensions to the 802.15.3 MAC Protocol.",
                    "Packet Delay Distribution of the IEEE 802.11 Distributed Coordination Function.",
                    "Energy-Aware Routing in Wireless Ad-Hoc Networks.",
                    "On Maximizing Lifetime of a Sensor Cluster.",
                    "On Topology Control of Wireless Peer-to-Peer File Sharing Networks: Energy Efficiency, Fairness and Incentive.",
                    "Game Theoretic Power Aware Wireless Data Access.",
                    "Fast IP Handoff Support for VoIP and Multimedia Applications in 802.11 WLANs.",
                    "Exploiting MAC Flexibility in WiMAX for Media Streaming.",
                    "Dynamic QoS Negotiation and Adaptation for Networked Virtual Reality Services.",
                    "Hello Protocols for Ad-Hoc Networks: Overhead and Accuracy Tradeoffs.",
                    "A Generic Algorithm to Improve the Performance of Proactive Ad Hoc Mechanisms.",
                    "Comparisons of Inter-Domain Routing Schemes for Heterogeneous Ad Hoc Networks.",
                    "Real-Time Intrusion Detection for Ad Hoc Networks.",
                    "A Friis-Based Calibrated Model for WiFi Terminals Positioning.",
                    "Precise Distributed Localization Algorithms for Wireless Networks.",
                    "A Hidden Environment Model for Constructing Indoor Radio Maps.",
                    "Mobile Terminal Location Discovery Schemes for a 'Beyond 3G' Inter-Worked Network.",
                    "Flexible Power Modeling for Wireless Systems: Power Modeling and Optimization of two Bluetooth Implementations.",
                    "Power Control is not Required for Wireless Networks in the Linear Regime.",
                    "Integrated Power Control and Rate Allocation for Radio Resource Management in Uplink Wideband CDMA Systems.",
                    "A Power Allocation Algorithm for Throughput Maximization in Mobile Networks.",
                    "Java-Based Proactive Buffering for Multimedia Streaming Continuity in the Wireless Internet.",
                    "Unicast, Multicast and Hybrid Architectures for Error Resilient Video Streaming.",
                    "VARS: A Vehicle Ad-Hoc Network Reputation System.",
                    "Service Discovery in Mobile Ad Hoc Networks.",
                    "Adaptive Scheduling of MPEG Video Frames during Real-Time Wireless Video Streaming.",
                    "Bridging the Gap between Multimedia Applications and Heterogeneous Networks Using a Market-Based Middleware.",
                    "FR-MAC: A Frame Relay MAC for Capacity and Throughput Enhancements in Multi-Rate Wireless LANs.",
                    "Handoff Prediction by Mobility Characteristics in Wireless Broadband Networks.",
                    "nk-Nearest Neighbor Algorithm for Estimation of Symbolic User Location in Pervasive Computing Environments.",
                    "ALCA: A New Scheme for Power Control on 802.11 Ad Hoc Networks.",
                    "Context-Aware Service Discovery in Heterogeneous Networks.",
                    "Towards an Asynchronous Dissemination and a Safe Deployment of Lightweight Programs in Mobile Networks.",
                    "Provisioning Radio Access Networks for Effective QoS Management: Capacity Gains of Service Differentiation in UTRAN.",
                    "Message Ferrying for Constrained Scenarios.",
                    "Providing Throughput Guarantees in WLANs Using ACKS.",
                    "Message from the Workshop Co-Chairs.",
                    "ACC 2005 Workshop Organization.",
                    "Autonomic and Load-Adaptive Optimization of Beacon Exchange Rate for Proactive Configuration in Ubiquitous MANETs.",
                    "A Self-Managed Scheme for Free Citywide Wi-Fi.",
                    "Reducing Inter-Cluster TDMA Interference by Adaptive MAC Allocation in Sensor Networks.",
                    "An Efficient and Reliable Routing Protocol for Wireless Sensor Networks.",
                    "QoS and Routing in the Cognitive Packet Network.",
                    "Autonomic Resource Management for Extensible Control Planes.",
                    "A Framework for Dynamic Service Composition.",
                    "Intuitive Human Governance of Autonomic Pervasive Computing Environments.",
                    "An Autonomic Approach to Denial of Service Defence.",
                    "Robust Distributed Systems Achieving Self-Management through Inference.",
                    "Reputation Management for Collaborative Content Distribution.",
                    "Adaptive Runtime Verification for Autonomic Communication Infrastructures.",
                    "Message from the Workshop Co-Chairs.",
                    "TSPUC 2005 Workshop Organization.",
                    "The Mobility Service Packs of the European Space Agency (Invited talk).",
                    "Policy Conflict Analysis Using Tableaux for On Demanc VPN Framework.",
                    "The Wireless Opaque Channel to Contrast Information Leakage.",
                    "An Efficient Group Key Agreement Protocol for Ad Hoc Networks.",
                    "Hybrid Key Establishment for Multiphase Self-Organized Sensor Networks.",
                    "On Using Peer Profiles to Create Self-Organizing P2P Networks.",
                    "Small Worlds and the Security of Ubiquitous Computing.",
                    "A Statistical Matching Approach to Detect Privacy Violation for Trust-Based Collaborations.",
                    "Incremental Trust: Building Trust from Past Experience.",
                    "How Trusted Computers can Enhance for Privacy Preserving Mobile Applications.",
                    "Location Privacy through Secret Sharing Techniques."
                ]
            }
        ]
    },
    {
        "year": "2002",
        "name": "5th WOWMOM 2002",
        "info": "Atlanta, Georgia, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2002",
                "sub_name": "The Fifth International Workshop on Wireless Mobile Multimedia, WOWMOM 2002, Atlanta, Georgia, 28 September 2002, Proceedings.",
                "count": 15,
                "papers": [
                    "Providing stochastic delay guarantees through channel characteristics based resource reservation in wireless network.",
                    "Differentiated services in wireless data networks.",
                    "Proxy-based TCP-friendly streaming over mobile networks.",
                    "A scheduling algorithm for transporting variable rate coded voice in bluetooth networks.",
                    "A label-switching packet forwarding architecture for multi-hop wireless LANs.",
                    "TCP behavior across multihop wireless networks and the wired internet.",
                    "Coping with communication gray zones in IEEE 802.11b based ad hoc networks.",
                    "A cooperative cache architecture in support of caching multimedia objects in MANETs.",
                    "EMWIN: : emulating a mobile wireless network using a wired network.",
                    "Power-aware video decoding using real-time event handlers.",
                    "Power-aware data management for small devices.",
                    "Supporting diverse mobile applications with client profiles.",
                    "Multicast in 3G networks: : employment of existing IP multicast protocols in UMTS.",
                    "Multicasting vs. unicasting in mobile communication systems.",
                    "Satellite grouping and routing protocol for LEO/MEO satellite IP networks."
                ]
            }
        ]
    },
    {
        "year": "2001",
        "name": "4th WOWMOM 2001",
        "info": "Rome, Italy",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2001",
                "sub_name": "The 4th International Workshop on Wireless Mobile Multimedia, WOWMOM 2001, Rome, Italy, July 21, 2001, Proceedings.",
                "count": 11,
                "papers": [
                    "A framework for the admission control of QoS multicast traffic in mobile ad hoc networks.",
                    "TranScaling: a video coding and multicasting framework for wireless IP multimedia services.",
                    "Voice transmission in an IEEE 802.11 WLAN based access network.",
                    "A software approach to channel-state dependent scheduling for wireless LANs.",
                    "P-MIP: paging in mobile IP.",
                    "A framework for performance evaluation and optimization of an emerging multimedia DS-CDMA network.",
                    "Delay performance of data traffic in a cellular wireless ATM network.",
                    "Service curve assurances versus uplink throughput in CDMA networks.",
                    "Tracking Highly Mobile Endpoints.",
                    "Mobility support in unified communication networks.",
                    "ATM connection handover in LEO satellite networks."
                ]
            }
        ]
    },
    {
        "year": "2000",
        "name": "3rd WOWMOM 2000",
        "info": "Boston, Massachusetts, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/2000",
                "sub_name": "Proceedings of the Third ACM International Workshop on Wireless Mobile Multimedia, WOWMOM 2000, Boston, Massachusetts, USA, August 11, 2000.",
                "count": 13,
                "papers": [
                    "W2F2Q: packet fair queuing in wireless packet networks.",
                    "A wireless fair scheduling algorithm for error-prone wireless channels.",
                    "A novel distributed call admission control for wireless mobile multimedia networks.",
                    "Real-time prioritized call admission control in a base station scheduler.",
                    "An integrated mobility and traffic model for resource allocation in wireless networks.",
                    "Mobility modeling of rush hour traffic for location area design in cellular networks.",
                    "Multicast support for mobile-IP with the hierarchical local registration approach.",
                    "Performance evaluation of ATM/AAL2 as switching technology in 3G mobile access networks.",
                    "Managing the storage and battery resources in an image capture device (digital camera) using dynamic transcoding.",
                    "Performance modelling of speculative prefetching for compound requests in low bandwidth networks.",
                    "A modified CDMA/PRMA medium access control protocol for integrated services in LEO satellite systems.",
                    "Delay jitter performance of video traffic in a cellular wireless ATM network.",
                    "Can mobile Internet be all pervasive (panel session - title only)."
                ]
            }
        ]
    },
    {
        "year": "1999",
        "name": "2nd WOWMOM 1999",
        "info": "Seattle, Washington, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/1999",
                "sub_name": "Proceedings of Second ACM International Workshop on Wireless Mobile Multimedia, WOWMOM '99, Seattle, Washington, USA, August 20, 1999.",
                "count": 14,
                "papers": [
                    "Windows NT Software Design and Implementation for a Wireless LAN Base Station.",
                    "Performance Evaluation of a MAC Protocol for Wireless ATM Networks Supporting the ATM Service Categories.",
                    "Performance of a Wireless Ad Hoc Network Supporting ATM.",
                    "RDMAR: A Bandwidth-Efficient Routing Protocol for Mobile Ad Hoc Networks.",
                    "Scheduling Real-Time Traffic with Deadlines over a Wireless Channel.",
                    "Multiclass Priority Fair Queuing for Hybrid Wired/Wireless Quality of Service Support.",
                    "Bandwidth Adaption Algorithms with Multi-Objectives for Adaptive Multimedia Services in Wireless/Mobile Networks.",
                    "Delay Analysis of Selective Repeat ARQ for a Markovian Source Over a Wireless Channel.",
                    "Experimental Evaluation of Throughput Performance of IRTCP Under Noisy Channels.",
                    "Mobility Support Using SIP.",
                    "A Fast Handoff Scheme for Wireless Networks.",
                    "Factoring a Mobile Client's Effective Processing Speeed into the Image Transcoding Decision.",
                    "Multimedia Web Services for Mobile Clients Using Quality Aware Transcoding.",
                    "Towards Coarse-Grained Mobile QoS."
                ]
            }
        ]
    },
    {
        "year": "1998",
        "name": "1st WOWMOM 1998",
        "info": "Dallas, Texas, USA",
        "venues": [
            {
                "sub_name_abbr": "conf/wowmom/1998",
                "sub_name": "Proceedings of First ACM International Workshop on Wireless Mobile Multimedia, WOWMOM '98, Dallas, TX, USA, October 30, 1998.",
                "count": 13,
                "papers": [
                    "The Case for Services over Cascaded Networks.",
                    "An Architecture for QoS Guarantees and Routing in Wireless/Mobile Networks.",
                    "Introducing Quality-of-Service and Traffic Classes into Wireless Mobile Networks.",
                    "Active Basestations & Nodes for a Mobile Environment.",
                    "Investigation of a Prefetch Model for Low Bandwidth Networks.",
                    "Agent Technology for the UMTS VHE Concept.",
                    "Design and Performance Evaluation of a Distributed Contention Control(DCC) Mechanism for IEEE 802.11 Wireless Local Area Networks.",
                    "Protocol Enhancements in Wireless Multimedia and Multiple-Access Networks.",
                    "Performance Evaluation of ABR Flow-Control Protocols in a Wireless ATM Network.",
                    "Provision of Real-Time Services over ATM using AAL Type 2.",
                    "A Systems Approach to Prediction, Compensation and Adaptation in Wireless Networks.",
                    "A Framework for Call Admission Control in Next Generation Wireless Networks.",
                    "Call Admission Control or Adaptive Multimedia in Wireless/Mobile Networks."
                ]
            }
        ]
    }
]